Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/ref/contrib/contenttypes.po
Languages: ru

source: If you're serializing data (for example, when generating :class:`~django.test.TransactionTestCase.fixtures`) from a model that implements generic relations, you should probably be using a natural key to uniquely identify related :class:`~django.contrib.contenttypes.models.ContentType` objects. See :ref:`natural keys<topics-serialization-natural-keys>` and :option:`dumpdata --natural-foreign` for more information.
ru: При сериализации данных модели (например, при создании :class:`~django.test.TransactionTestCase.fixtures`) , которая имеет обобщенные связи, вам вероятно необходимо будет воспользоваться натуральным ключом, чтобы корректно определить связи с объектами :class:`~django.contrib.contenttypes.models.ContentType`. Смотрите :ref:`натуральные ключи <topics-serialization-natural-keys>` и :option:`dumpdata --natural-foreign` для дополнительной информации.

source: This will enable an API similar to the one used for a normal :class:`~django.db.models.ForeignKey`; each ``TaggedItem`` will have a ``content_object`` field that returns the object it's related to, and you can also assign to that field or use it when creating a ``TaggedItem``::
ru: После создания связи мы можем использовать API, похожий на тот, что используется в обычном :class:`~django.db.models.ForeignKey`; каждый ``TaggedItem`` содержит поле ``content_object``, которое возвращает связанный с ним объект. Мы можем присвоить этому полю произвольный объект, или указать этот объект при создании ``TaggedItem``::

source: If the related object is deleted, the ``content_type`` and ``object_id`` fields remain set to their original values and the ``GenericForeignKey`` returns ``None``::
ru: Если связанный объект удален, поля ``content_type`` и ``object_id`` получат начальные значения и ``GenericForeignKey`` вернет ``None``::

source: Due to the way :class:`~django.contrib.contenttypes.fields.GenericForeignKey` is implemented, you cannot use such fields directly with filters (``filter()`` and ``exclude()``, for example) via the database API. Because a :class:`~django.contrib.contenttypes.fields.GenericForeignKey` isn't a normal field object, these examples will *not* work::
ru: Из-за особенностей реализации :class:`~django.contrib.contenttypes.fields.GenericForeignKey`, вы не можете использовать такое поле с фильтрами (``filter()`` и ``exclude()``, н-р) в запросах API базы данных. Поскольку :class:`~django.contrib.contenttypes.fields.GenericForeignKey` это не совсем "обычное" поле,примеры ниже *не будут работать*::

source: Likewise, :class:`~django.contrib.contenttypes.fields.GenericForeignKey`\s does not appear in :class:`~django.forms.ModelForm`\s.
ru: Также :class:`~django.contrib.contenttypes.fields.GenericForeignKey`\s не отображется в :class:`~django.forms.ModelForm`\s.

source: Reverse generic relations
ru: Обратная обобщенная связь(reverse generic relations)

source: The relation on the related object back to this object doesn't exist by default. Setting ``related_query_name`` creates a relation from the related object back to this one. This allows querying and filtering from the related object.
ru: По умолчанию обратная связь не создается. Чтобы создать такую связь, укажите параметр ``related_query_name`` поля. Это позволять получить связанные объекты и использовать поле для фильтрации результатов запроса.

source: If you know which models you'll be using most often, you can also add a "reverse" generic relationship to enable an additional API. For example::
ru: Если модель, с которой предстоит работать наиболее часто, известна заранее, вы можете добавить "обратную" обобщенную связь между моделями и использовать дополнительные возможности API. Н-р::

source: ``Bookmark`` instances will each have a ``tags`` attribute, which can be used to retrieve their associated ``TaggedItems``::
ru: Каждый экземпляр ``Bookmark`` имеет атрибут ``tags``, который можно использовать чтобы получить доступ к связанному с ним ``TaggedItems``::

source: Defining :class:`~django.contrib.contenttypes.fields.GenericRelation` with ``related_query_name`` set allows querying from the related object::
ru: Создав :class:`~django.contrib.contenttypes.fields.GenericRelation` с ``related_query_name``, можно использовать связь в запросах::

source: This enables filtering, ordering, and other query operations on ``Bookmark`` from ``TaggedItem``::
ru: Это позволяет фильтровать, сортировать и выполнять запросы по ``Bookmark`` из ``TaggedItem``::

source: Of course, if you don't add the reverse relationship, you can do the same types of lookups manually::
ru: Ну и конечно, если вы не захотите добавить обратную связь, вы можете получить доступ к объекту и "обходным путем"::

source: Just as :class:`~django.contrib.contenttypes.fields.GenericForeignKey` accepts the names of the content-type and object-ID fields as arguments, so too does :class:`~django.contrib.contenttypes.fields.GenericRelation`; if the model which has the generic foreign key is using non-default names for those fields, you must pass the names of the fields when setting up a :class:`.GenericRelation` to it. For example, if the ``TaggedItem`` model referred to above used fields named ``content_type_fk`` and ``object_primary_key`` to create its generic foreign key, then a :class:`.GenericRelation` back to it would need to be defined like so::
ru: Также как :class:`~django.contrib.contenttypes.fields.GenericForeignKey`, :class:`~django.contrib.contenttypes.fields.GenericRelation` принимает аргументами имена полей content-type и object-ID . Если модель, имеющая обобщенный внешний ключ *не* использует имена по-умолчанию для этих полей, а любые другие, -- вы должны передать эти имена полей в :class:`.GenericRelation` при его инициализации. Н-р, если бы мы использовали в модели ``TaggedItem`` поля с именами ``content_type_fk`` и ``object_primary_key`` при создании внешнего ключа, то поле :class:`.GenericRelation` следовало бы определить таким образом::

source: Note also, that if you delete an object that has a :class:`~django.contrib.contenttypes.fields.GenericRelation`, any objects which have a :class:`~django.contrib.contenttypes.fields.GenericForeignKey` pointing at it will be deleted as well. In the example above, this means that if a ``Bookmark`` object were deleted, any ``TaggedItem`` objects pointing at it would be deleted at the same time.
ru: Также обратите внимание, что в случае удаления объекта, имеющего поле :class:`~django.contrib.contenttypes.fields.GenericRelation`, все объекты у которых :class:`~django.contrib.contenttypes.fields.GenericForeignKey` указывает на этот удаляемый объект, тоже будут удалены. Для примера выше это значит, что если удалить объект ``Bookmark``, то любые ``TaggedItem``, связанные с ним, будут удалены вместе с ним.

source: Unlike :class:`~django.db.models.ForeignKey`, :class:`~django.contrib.contenttypes.fields.GenericForeignKey` does not accept an :attr:`~django.db.models.ForeignKey.on_delete` argument to customize this behavior; if desired, you can avoid the cascade-deletion simply by not using :class:`~django.contrib.contenttypes.fields.GenericRelation`, and alternate behavior can be provided via the :data:`~django.db.models.signals.pre_delete` signal.
ru: В отличии от обычного :class:`~django.db.models.ForeignKey`, тип :class:`~django.contrib.contenttypes.fields.GenericForeignKey` не принимает аргумент :attr:`~django.db.models.ForeignKey.on_delete` для расширения поведения модели; если это необходимо, вы можете избежать каскадного удаления связанных объектов просто не используя :class:`~django.contrib.contenttypes.fields.GenericRelation`, и указать необходимое поведение с помощью сигнала :data:`~django.db.models.signals.pre_delete`.

source: Generic relations and aggregation
ru: Обобщенные связи и агрегация

source: :doc:`Django's database aggregation API </topics/db/aggregation>` works with a :class:`~django.contrib.contenttypes.fields.GenericRelation`. For example, you can find out how many tags all the bookmarks have::
ru: :doc:`API агрегации Django для баз данных </topics/db/aggregation>` работает с :class:`~django.contrib.contenttypes.fields.GenericRelation`. Например, вы можете получить количество тегов для всех закладок::

source: Generic relation in forms
ru: Обобщенные связи в формах

source: The :mod:`django.contrib.contenttypes.forms` module provides:
ru: Модуль :mod:`django.contrib.contenttypes.forms` предлагает нам следующее:

source: A formset factory, :func:`generic_inlineformset_factory`, for use with :class:`~django.contrib.contenttypes.fields.GenericForeignKey`.
ru: Набор форм, :func:`generic_inlineformset_factory`, для использования с :class:`~django.contrib.contenttypes.fields.GenericForeignKey`

source: Returns a ``GenericInlineFormSet`` using :func:`~django.forms.models.modelformset_factory`.
ru: Возвращает ``GenericInlineFormSet``, используя :func:`~django.forms.models.modelformset_factory`.

source: You must provide ``ct_field`` and ``fk_field`` if they are different from the defaults, ``content_type`` and ``object_id`` respectively. Other parameters are similar to those documented in :func:`~django.forms.models.modelformset_factory` and :func:`~django.forms.models.inlineformset_factory`.
ru: Вы должны предоставить имена для ``ct_field`` и ``object_id`` если они отличаются от значений по умолчанию, - ``content_type`` и ``object_id``. Прочие параметры аналогичны тем, что описаны в :func:`~django.forms.models.modelformset_factory` и :func:`~django.forms.models.inlineformset_factory`.

source: The ``for_concrete_model`` argument corresponds to the :class:`~django.contrib.contenttypes.fields.GenericForeignKey.for_concrete_model` argument on ``GenericForeignKey``.
ru: Аргумент ``for_concrete_model`` соответствует параметру :class:`~django.contrib.contenttypes.fields.GenericForeignKey.for_concrete_model` для ``GenericForeignKey``.

source: Generic relations in admin
ru: Обобщенные связи в админке

source: The :mod:`django.contrib.contenttypes.admin` module provides :class:`~django.contrib.contenttypes.admin.GenericTabularInline` and :class:`~django.contrib.contenttypes.admin.GenericStackedInline` (subclasses of :class:`~django.contrib.contenttypes.admin.GenericInlineModelAdmin`)
ru: Модуль :mod:`django.contrib.contenttypes.admin` предоставляет :class:`~django.contrib.contenttypes.admin.GenericTabularInline` и :class:`~django.contrib.contenttypes.admin.GenericStackedInline` (дочерние классы :class:`~django.contrib.contenttypes.admin.GenericInlineModelAdmin`)

source: These classes and functions enable the use of generic relations in forms and the admin. See the :doc:`model formset </topics/forms/modelforms>` and :ref:`admin <using-generic-relations-as-an-inline>` documentation for more information.
ru: Эти классы и функции позволяют использовать обобщенные отношения объектов при создании форм и в админке Django. За дополнительной информацией обратитесь к :doc:`модель набора форм </topics/forms/modelforms>` и :ref:`admin <using-generic-relations-as-an-inline>` .

source: The :class:`~django.contrib.contenttypes.admin.GenericInlineModelAdmin` class inherits all properties from an :class:`~django.contrib.admin.InlineModelAdmin` class. However, it adds a couple of its own for working with the generic relation:
ru: Класс :class:`~django.contrib.contenttypes.admin.GenericInlineModelAdmin` наследует все свойства класса :class:`~django.contrib.admin.InlineModelAdmin`. Но также имеет ряд собственных атрибутов для работы с обобщенными связями:

source: The name of the :class:`~django.contrib.contenttypes.models.ContentType` foreign key field on the model. Defaults to ``content_type``.
ru: Имя поля внешнего ключа :class:`~django.contrib.contenttypes.models.ContentType` модели. По умолчанию ``content_type``.

source: The name of the integer field that represents the ID of the related object. Defaults to ``object_id``.
ru: Имя целочисленного поля, которое хранит идентификатор конкретного объекта связанной модели. По умолчанию ``object_id``.

source: Subclasses of :class:`GenericInlineModelAdmin` with stacked and tabular layouts, respectively.
ru: Подклассы :class:`GenericInlineModelAdmin` позволяющие настраивать отображение данных в сложенном(stacked) или табличном(tabular) виде, соответственно.
