Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/ref/contrib/contenttypes.po
Languages: ru

source: The contenttypes framework
ru: Фреймворк contenttypes

source: Django includes a :mod:`~django.contrib.contenttypes` application that can track all of the models installed in your Django-powered project, providing a high-level, generic interface for working with your models.
ru: В Django входит приложение :mod:`~django.contrib.contenttypes`, которое позволяет отслеживать все модели вашего Django проекта. Это приложение предоставляет высокоуровневый, обобщенный интерфейс для работы с вашими моделями.

source: Overview
ru: Обзор

source: At the heart of the contenttypes application is the :class:`~django.contrib.contenttypes.models.ContentType` model, which lives at ``django.contrib.contenttypes.models.ContentType``. Instances of :class:`~django.contrib.contenttypes.models.ContentType` represent and store information about the models installed in your project, and new instances of :class:`~django.contrib.contenttypes.models.ContentType` are automatically created whenever new models are installed.
ru: В основе приложения contenttypes лежит модель :class:`~django.contrib.contenttypes.models.ContentType`, которая находится в ``django.contrib.contenttypes.models.ContentType``. Экземпляр :class:`~django.contrib.contenttypes.models.ContentType` представляет и хранит информацию о моделях, использующихся в вашем проекте, и новые экземпляры модели :class:`~django.contrib.contenttypes.models.ContentType` создаются автоматически при добавлении новых моделей в проект.

source: Instances of :class:`~django.contrib.contenttypes.models.ContentType` have methods for returning the model classes they represent and for querying objects from those models. :class:`~django.contrib.contenttypes.models.ContentType` also has a :ref:`custom manager <custom-managers>` that adds methods for working with :class:`~django.contrib.contenttypes.models.ContentType` and for obtaining instances of :class:`~django.contrib.contenttypes.models.ContentType` for a particular model.
ru: У экземпляров :class:`~django.contrib.contenttypes.models.ContentType` есть методы, позволяющие получить класс модели, который они представляют или получить объект для этого класса модели. У модели :class:`~django.contrib.contenttypes.models.ContentType` имеется также :ref:`собственный менеджер(custom manager) <custom-managers>`, который предоставляет методы для работы с классом :class:`~django.contrib.contenttypes.models.ContentType` и для получения экземпляров :class:`~django.contrib.contenttypes.models.ContentType` для конкретной модели.

source: Relations between your models and :class:`~django.contrib.contenttypes.models.ContentType` can also be used to enable "generic" relationships between an instance of one of your models and instances of any model you have installed.
ru: Взаимосвязь между :class:`~django.contrib.contenttypes.models.ContentType` и вашими моделями можно использовать для создания "обобщенных" ("generic" ) отношений между экземпляром вашей модели и экземпляром любой другой модели в проекте.

source: Installing the contenttypes framework
ru: Установка и подключение contenttypes

source: The contenttypes framework is included in the default :setting:`INSTALLED_APPS` list created by ``django-admin startproject``, but if you've removed it or if you manually set up your :setting:`INSTALLED_APPS` list, you can enable it by adding ``'django.contrib.contenttypes'`` to your :setting:`INSTALLED_APPS` setting.
ru: Фреймворк contenttypes включен по умолчанию и находится в списке :setting:`INSTALLED_APPS` файла настроек, созданного вызовом команды ``django-admin startproject``. Если вам необходимо отключить фреймворк или добавить его вручную, просто удалите (или добавьте) в список :setting:`INSTALLED_APPS` приложение ``'django.contrib.contenttypes'``.

source: It's generally a good idea to have the contenttypes framework installed; several of Django's other bundled applications require it:
ru: Рекомендуется всегда подключать contenttypes фреймворк в проекте, поскольку его наличие требуется для работы ряда других встроенных приложений Django.

source: The admin application uses it to log the history of each object added or changed through the admin interface.
ru: Встроенное приложение администрирования Django использует contenttypes для ведения логов по добавлению или изменению объектов через админку.

source: Django's :mod:`authentication framework <django.contrib.auth>` uses it to tie user permissions to specific models.
ru: :mod:`Фреймворк аутентификации <django.contrib.auth>` Django использует его для привязки прав пользователя (user permissions) к определенным моделям.

source: The ``ContentType`` model
ru: Модель ``ContentType``

source: Each instance of :class:`~django.contrib.contenttypes.models.ContentType` has two fields which, taken together, uniquely describe an installed model:
ru: Каждый экземпляр :class:`~django.contrib.contenttypes.models.ContentType` содержит два поля, которые вместе уникальным образом описывают каждую модель в приложении:

source: The name of the application the model is part of. This is taken from the :attr:`app_label` attribute of the model, and includes only the *last* part of the application's Python import path; ``django.contrib.contenttypes``, for example, becomes an :attr:`app_label` of ``contenttypes``.
ru: Имя приложения в которое входит данная модель. Данные берутся из атрибута :attr:`app_label` модели и включают в себя только *последнюю* часть пути, который используется для импорта модели. Н-р, в случае "django.contrib.contenttypes" используется значение атрибута :attr:`app_label` для "contenttypes".

source: The name of the model class.
ru: Имя модели класса

source: Additionally, the following property is available:
ru: Также доступны следующие свойства:

source: The human-readable name of the content type. This is taken from the :attr:`verbose_name <django.db.models.Field.verbose_name>` attribute of the model.
ru: "Читабельное" имя модели. Берется из атрибута :attr:`verbose_name <django.db.models.Field.verbose_name>` модели.

source: Let's look at an example to see how this works. If you already have the :mod:`~django.contrib.contenttypes` application installed, and then add :mod:`the sites application <django.contrib.sites>` to your :setting:`INSTALLED_APPS` setting and run ``manage.py migrate`` to install it, the model :class:`django.contrib.sites.models.Site` will be installed into your database. Along with it a new instance of :class:`~django.contrib.contenttypes.models.ContentType` will be created with the following values:
ru: Покажем на примере как это все работает. Если приложение :mod:`~django.contrib.contenttypes` уже установлено, то добавьте :mod:`приложение sites <django.contrib.sites>` в :setting:`INSTALLED_APPS` файла настроек и выполните команду ``manage.py migrate`` для создания таблиц и завершения установки модели :class:`django.contrib.sites.models.Site`. Параллельно с этим будет создан новый экземпляр :class:`~django.contrib.contenttypes.models.ContentType` со следующими значениями:

source: :attr:`~django.contrib.contenttypes.models.ContentType.app_label` will be set to ``'sites'`` (the last part of the Python path ``django.contrib.sites``).
ru: Атрибут :attr:`~django.contrib.contenttypes.models.ContentType.app_label` со значением ``'sites'`` (последняя часть ``django.contrib.sites``).

source: :attr:`~django.contrib.contenttypes.models.ContentType.model` will be set to ``'site'``.
ru: Атрибут :attr:`~django.contrib.contenttypes.models.ContentType.model` со значением ``'site'``.

source: Methods on ``ContentType`` instances
ru: Методы экземпляра ``ContentType``

source: Each :class:`~django.contrib.contenttypes.models.ContentType` instance has methods that allow you to get from a :class:`~django.contrib.contenttypes.models.ContentType` instance to the model it represents, or to retrieve objects from that model:
ru: Каждый экземпляр :class:`~django.contrib.contenttypes.models.ContentType` имеет методы, которые позволяют получить доступ к модели, представленной этим экземпляром :class:`~django.contrib.contenttypes.models.ContentType` , или получить объекты этой модели:

source: Takes a set of valid :ref:`lookup arguments <field-lookups-intro>` for the model the :class:`~django.contrib.contenttypes.models.ContentType` represents, and does :meth:`a get() lookup <django.db.models.query.QuerySet.get>` on that model, returning the corresponding object.
ru: Принимает набор корректных :ref:`фильтров полей(lookup arguments) <field-lookups-intro>` для модели, представленной данным :class:`~django.contrib.contenttypes.models.ContentType` и выполняет метод :meth:`get() <django.db.models.query.QuerySet.get>` этой модели, возвращая соответствующий объект.

source: Returns the model class represented by this :class:`~django.contrib.contenttypes.models.ContentType` instance.
ru: Возвращает класс модели, представленной данным экземпляром :class:`~django.contrib.contenttypes.models.ContentType`.

source: For example, we could look up the :class:`~django.contrib.contenttypes.models.ContentType` for the :class:`~django.contrib.auth.models.User` model::
ru: Н-р, мы можем получить экземпляр :class:`~django.contrib.contenttypes.models.ContentType` для модели :class:`~django.contrib.auth.models.User` следующим образом:

source: And then use it to query for a particular :class:`~django.contrib.auth.models.User`, or to get access to the ``User`` model class::
ru: А затем использовать полученный результат, чтобы получить модель :class:`~django.contrib.auth.models.User`, или для непосредственного доступа к классу модели ``User``::

source: Together, :meth:`~django.contrib.contenttypes.models.ContentType.get_object_for_this_type` and :meth:`~django.contrib.contenttypes.models.ContentType.model_class` enable two extremely important use cases:
ru: Комбинация этих двух методов :meth:`~django.contrib.contenttypes.models.ContentType.get_object_for_this_type` и :meth:`~django.contrib.contenttypes.models.ContentType.model_class`, дает нам два крайне важных и полезных варианта их использования:

source: Using these methods, you can write high-level generic code that performs queries on any installed model -- instead of importing and using a single specific model class, you can pass an ``app_label`` and ``model`` into a :class:`~django.contrib.contenttypes.models.ContentType` lookup at runtime, and then work with the model class or retrieve objects from it.
ru: Воспользовавшись этими методами, вы можете писать высокоуровневый , обобщенный(generic) код, и выполнять запрос к любой установленной в приложении модели. Вместо того, чтобы импортировать конкретные модели "по одиночке", вы можете передать нужные параметры ``app_label`` и ``model`` в класс :class:`~django.contrib.contenttypes.models.ContentType` во время выполнения, и затем работать с полученной моделью класса или получить конкретные объекты этой модели.

source: You can relate another model to :class:`~django.contrib.contenttypes.models.ContentType` as a way of tying instances of it to particular model classes, and use these methods to get access to those model classes.
ru: Вы можете использовать :class:`~django.contrib.contenttypes.models.ContentType` чтобы связать экземпляр вашей модели с любыми произвольными классами моделей проекта, и использовать указанные методы для доступа к этим моделям.

source: Several of Django's bundled applications make use of the latter technique. For example, :class:`the permissions system <django.contrib.auth.models.Permission>` in Django's authentication framework uses a :class:`~django.contrib.auth.models.Permission` model with a foreign key to :class:`~django.contrib.contenttypes.models.ContentType`; this lets :class:`~django.contrib.auth.models.Permission` represent concepts like "can add blog entry" or "can delete news story".
ru: Некоторые из встроенных приложений Django используют последний подход. Н-р, в :class:`системе полномочий( permissions system) <django.contrib.auth.models.Permission>`, в фреймворке аутентификации Django, в модели :class:`~django.contrib.auth.models.Permission` используется внешний ключ(foreign key) к :class:`~django.contrib.contenttypes.models.ContentType`; это позволяет создать обобщенную связь с различными моделями и реализовать концепцию ограничений, такую как "пользователь может добавить запись в блог" или "пользователь может удалить сообщение из новостей".

source: The ``ContentTypeManager``
ru: ``ContentTypeManager``

source: :class:`~django.contrib.contenttypes.models.ContentType` also has a custom manager, :class:`~django.contrib.contenttypes.models.ContentTypeManager`, which adds the following methods:
ru: Класс :class:`~django.contrib.contenttypes.models.ContentType` обладает собственным менеджером, :class:`~django.contrib.contenttypes.models.ContentTypeManager`, который включает в себя следующие методы:

source: Clears an internal cache used by :class:`~django.contrib.contenttypes.models.ContentType` to keep track of models for which it has created :class:`~django.contrib.contenttypes.models.ContentType` instances. You probably won't ever need to call this method yourself; Django will call it automatically when it's needed.
ru: Очищает внутренний кэш, используемый :class:`~django.contrib.contenttypes.models.ContentType` для отслеживания моделей, для которых были созданы экземпляры :class:`~django.contrib.contenttypes.models.ContentType`. Вероятно, вам никогда не придется вызывать этот метод напрямую, поскольку Django вызывает его автоматически, при необходимости.

source: Lookup a :class:`~django.contrib.contenttypes.models.ContentType` by ID. Since this method uses the same shared cache as :meth:`~django.contrib.contenttypes.models.ContentTypeManager.get_for_model`, it's preferred to use this method over the usual ``ContentType.objects.get(pk=id)``
ru: Получить экземпляр :class:`~django.contrib.contenttypes.models.ContentType` по идентификатору(ID). Поскольку метод использует тот же разделяемый кэш, что и метод :meth:`~django.contrib.contenttypes.models.ContentTypeManager.get_for_model`, предпочтительней пользоваться именно им, а не привычным запросом ``ContentType.objects.get(pk=id)``.

source: Takes either a model class or an instance of a model, and returns the :class:`~django.contrib.contenttypes.models.ContentType` instance representing that model. ``for_concrete_model=False`` allows fetching the :class:`~django.contrib.contenttypes.models.ContentType` of a proxy model.
ru: Принимает в качестве аргумента либо класс модели, либо экземпляр модели, и возвращает экземпляр :class:`~django.contrib.contenttypes.models.ContentType`, представляющего данную модель. ``for_concrete_model=False`` позволяет получить :class:`~django.contrib.contenttypes.models.ContentType` для прокси-модели.

source: Takes a variadic number of model classes, and returns a dictionary mapping the model classes to the :class:`~django.contrib.contenttypes.models.ContentType` instances representing them. ``for_concrete_models=False`` allows fetching the :class:`~django.contrib.contenttypes.models.ContentType` of proxy models.
ru: Принимает в качестве аргумента произвольное число классов модели и возвращает словарь с отображением класса модели на экземпляр :class:`~django.contrib.contenttypes.models.ContentType`, представляющего данную модель. ``for_concrete_model=False`` позволяет получить :class:`~django.contrib.contenttypes.models.ContentType` для прокси-модели.

source: Returns the :class:`~django.contrib.contenttypes.models.ContentType` instance uniquely identified by the given application label and model name. The primary purpose of this method is to allow :class:`~django.contrib.contenttypes.models.ContentType` objects to be referenced via a :ref:`natural key<topics-serialization-natural-keys>` during deserialization.
ru: Возвращает экземпляр :class:`~django.contrib.contenttypes.models.ContentType`, определенный уникальным образом для переданных аргументов: имя приложения(application label) и имя модели(model name). Главное назначение этого метода, дать возможность ссылаться на объекты :class:`~django.contrib.contenttypes.models.ContentType` посредством :ref:`натуральных ключей(natural key)<topics-serialization-natural-keys>` в процессе десериализации.

source: The :meth:`~ContentTypeManager.get_for_model()` method is especially useful when you know you need to work with a :class:`ContentType <django.contrib.contenttypes.models.ContentType>` but don't want to go to the trouble of obtaining the model's metadata to perform a manual lookup::
ru: Метод :meth:`~ContentTypeManager.get_for_model()` особенно полезен, когда вам необходимо работать с :class:`ContentType <django.contrib.contenttypes.models.ContentType>`, но вы не хотите "заморачиваться" с получением метаданных модели для поиска вручную::

source: Generic relations
ru: Обобщенные связи(generic relations)

source: Adding a foreign key from one of your own models to :class:`~django.contrib.contenttypes.models.ContentType` allows your model to effectively tie itself to another model class, as in the example of the :class:`~django.contrib.auth.models.Permission` model above. But it's possible to go one step further and use :class:`~django.contrib.contenttypes.models.ContentType` to enable truly generic (sometimes called "polymorphic") relationships between models.
ru: Вы можете создать в вашей модели внешний ключ на :class:`~django.contrib.contenttypes.models.ContentType`, что позволит связать вашу модель с любой другой моделью, как это было описано выше на примере :class:`~django.contrib.auth.models.Permission`. Но можно пойти еще дальше и использовать :class:`~django.contrib.contenttypes.models.ContentType` для реализации абсолютно обобщенных (иногда говорят "полиморфных") отношений между моделями.

source: A simple example is a tagging system, which might look like this::
ru: Вот простой пример: реализуем систему тэгов(ярлычков), которая могла бы выглядеть так ::

source: A normal :class:`~django.db.models.ForeignKey` can only "point to" one other model, which means that if the ``TaggedItem`` model used a :class:`~django.db.models.ForeignKey` it would have to choose one and only one model to store tags for. The contenttypes application provides a special field type (``GenericForeignKey``) which works around this and allows the relationship to be with any model:
ru: Обычное поле :class:`~django.db.models.ForeignKey` может "указывать" только на одну модель, что означает, - если в модели ``TaggedItem`` есть поле :class:`~django.db.models.ForeignKey`, его можно "связать" с одной и только одной моделью, для которой и будут сохраняться тэги. Приложение contenttypes предоставляет нам поле специального типа (``GenericForeignKey``), которое решает обозначенную выше проблему и позволяет создать связь с любой моделью:

source: There are three parts to setting up a :class:`~django.contrib.contenttypes.fields.GenericForeignKey`:
ru: Существуют три правила по созданию и настройке :class:`~django.contrib.contenttypes.fields.GenericForeignKey`:

source: Give your model a :class:`~django.db.models.ForeignKey` to :class:`~django.contrib.contenttypes.models.ContentType`. The usual name for this field is "content_type".
ru: Создайте в вашей модели поле типа :class:`~django.db.models.ForeignKey`, указав в качестве внешней модели :class:`~django.contrib.contenttypes.models.ContentType`. Обычно такому полю дают имя "content_type".

source: Give your model a field that can store primary key values from the models you'll be relating to. For most models, this means a :class:`~django.db.models.PositiveIntegerField`. The usual name for this field is "object_id".
ru: Создайте в вашей модели поле, которое будет хранить значения первичных ключей экземпляров модели, с которой вы создаете связь. Для большинства моделей, это поле типа :class:`~django.db.models.PositiveIntegerField`. Обычно такому полю дают имя "object_id".

source: Give your model a :class:`~django.contrib.contenttypes.fields.GenericForeignKey`, and pass it the names of the two fields described above. If these fields are named "content_type" and "object_id", you can omit this -- those are the default field names :class:`~django.contrib.contenttypes.fields.GenericForeignKey` will look for.
ru: Создайте в вашей модели поле типа :class:`~django.contrib.contenttypes.fields.GenericForeignKey`, и передайте ему в качестве аргументов, имена полей созданных ранее. Если эти поля названы "content_type" и "object_id", вы можете не передавать их, -- эти имена используются в :class:`~django.contrib.contenttypes.fields.GenericForeignKey` по умолчанию.

source: If ``False``, the field will be able to reference proxy models. Default is ``True``. This mirrors the ``for_concrete_model`` argument to :meth:`~django.contrib.contenttypes.models.ContentTypeManager.get_for_model`.
ru: При ``False``, поле может ссылаться на прокси-модель. Отображает аргумент ``for_concrete_model`` метода :meth:`~django.contrib.contenttypes.models.ContentTypeManager.get_for_model`. По умолчанию равно ``True``.

source: Primary key type compatibility
ru: Тип первичного ключа

source: The "object_id" field doesn't have to be the same type as the primary key fields on the related models, but their primary key values must be coercible to the same type as the "object_id" field by its :meth:`~django.db.models.Field.get_db_prep_value` method.
ru: Поле "object_id" не обязательно должно быть того же типа, что и у первичного ключа в привязанной модели, но должно соблюдаться условие, что значения первичного ключа могут быть приведены к тому же типу, что и у поля "object_id " методом :meth:`~django.db.models.Field.get_db_prep_value`.

source: For example, if you want to allow generic relations to models with either :class:`~django.db.models.IntegerField` or :class:`~django.db.models.CharField` primary key fields, you can use :class:`~django.db.models.CharField` for the "object_id" field on your model since integers can be coerced to strings by :meth:`~django.db.models.Field.get_db_prep_value`.
ru: Н-р, если вы хотите создать обобщенные отношения с моделями, использующими в качестве первичных ключей типы :class:`~django.db.models.IntegerField` или :class:`~django.db.models.CharField`, вы можете использовать тип :class:`~django.db.models.CharField` для вашего поля "object_id", поскольку целочисленные значения могут быть корректно приведены к строковым методом :meth:`~django.db.models.Field.get_db_prep_value`.

source: For maximum flexibility you can use a :class:`~django.db.models.TextField` which doesn't have a maximum length defined, however this may incur significant performance penalties depending on your database backend.
ru: Для максимальной гибкости можно использовать тип :class:`~django.db.models.TextField`, который не накладывает ограничения на длину строки, но такое решение может негативно отразиться на производительности, в зависимости от используемой базы данных.

source: There is no one-size-fits-all solution for which field type is best. You should evaluate the models you expect to be pointing to and determine which solution will be most effective for your use case.
ru: Не существует универсального решения для выбора наилучшего типа поля. Вы должны изучить модели с которыми собираетесь работать, и на основании этого принять решение о выборе типа для поля, руководствуясь принципами эффективности.

source: Serializing references to ``ContentType`` objects
ru: Сериализация связей с ``ContentType``
