Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/ref/contrib/flatpages.po
Languages: ru

source: The flatpages app
ru: Приложение для создания статических страниц

source: A flatpage can use a custom template or a default, systemwide flatpage template. It can be associated with one, or multiple, sites.
ru: Статическая страница могжет использовать собственный шаблон, или шаблон по умолчанию, общий для всех статических страниц. Они могут быть связаны с одним или несколькими сайтами.

source: The content field may optionally be left blank if you prefer to put your content in a custom template.
ru: Содержимое может быть пустым, если вы предпочитаете указать его в шаблоне.

source: Installation
ru: Установка

source: To install the flatpages app, follow these steps:
ru: Чтобы установить приложение статических страниц, выполните следующие действия:

source: Install the :mod:`sites framework <django.contrib.sites>` by adding ``'django.contrib.sites'`` to your :setting:`INSTALLED_APPS` setting, if it's not already in there.
ru: Установите :mod:`фреймворк для сайтов <django.contrib.sites>`, добавив ``'django.contrib.sites'`` в настройку :setting:`INSTALLED_APPS`, если он еще не добавлен.

source: Also make sure you've correctly set :setting:`SITE_ID` to the ID of the site the settings file represents. This will usually be ``1`` (i.e. ``SITE_ID = 1``, but if you're using the sites framework to manage multiple sites, it could be the ID of a different site.
ru: Также убедитесь, что настройки содержат правильный :setting:`SITE_ID`. Обычно это ``1`` (то есть ``SITE_ID = 1``, но если вы используете фреймверк для управления несколькими сайтами, ID может быть другим.

source: Add ``'django.contrib.flatpages'`` to your :setting:`INSTALLED_APPS` setting.
ru: Добавьте ``'django.contrib.flatpages'`` в настройку :setting:`INSTALLED_APPS`.

source: Then either:
ru: Затем или:

source: Add an entry in your URLconf. For example::
ru: Добавьте запись в URLconf. Например::

source: or:
ru: или:

source: Run the command :djadmin:`manage.py migrate <migrate>`.
ru: Запустите команду :djadmin:`manage.py migrate <migrate>`.

source: How it works
ru: Как это работает

source: Using the URLconf
ru: Использование URLconf

source: There are several ways to include the flat pages in your URLconf. You can dedicate a particular path to flat pages::
ru: Есть несколько способов добавить статические страницы в ваш URLconf. Вы можете добавить их к конкретному путю::

source: You can also set it up as a "catchall" pattern. In this case, it is important to place the pattern at the end of the other urlpatterns::
ru: Или же использовать URL-шаблон, который будет перехватывать все запросы. В этом случае важно добавить его в самом конце::

source: If you set :setting:`APPEND_SLASH` to ``False``, you must remove the slash in the catchall pattern or flatpages without a trailing slash will not be matched.
ru: Если вы указали ``False`` в :setting:`APPEND_SLASH`, вам следует убрать косую черту в конце URL-шаблона.

source: Another common setup is to use flat pages for a limited set of known pages and to hard code the urls, so you can reference them with the :ttag:`url` template tag::
ru: Еще один способ -- явно указать все страницы. В этом случае вы сможете ссылаться на них через шаблонный тег :ttag:`url`::

source: Using the middleware
ru: Использование промежуточного слоя("middleware")

source: The :class:`~django.contrib.flatpages.middleware.FlatpageFallbackMiddleware` can do all of the work.
ru: :class:`~django.contrib.flatpages.middleware.FlatpageFallbackMiddleware` обеспечивает работу статических страниц.

source: Each time any Django application raises a 404 error, this middleware checks the flatpages database for the requested URL as a last resort. Specifically, it checks for a flatpage with the given URL with a site ID that corresponds to the :setting:`SITE_ID` setting.
ru: Каждый раз, когда приложение Django вызывает 404 ошибку, это промежуточный слой проверяет базу данных статических страниц на наличие запрашиваемого URL. Точнее выполняется поиск простой страницы с текущим URL и ID сайта из настройки :setting:`SITE_ID`.

source: If it finds a match, it follows this algorithm:
ru: Если страница найдена:

source: If the flatpage has a custom template, it loads that template. Otherwise, it loads the template :file:`flatpages/default.html`.
ru: Загружается собственный шаблон для страницы, если такой указан, иначе загружается :file:`flatpages/default.html`.

source: It passes that template a single context variable, ``flatpage``, which is the flatpage object. It uses :class:`~django.template.RequestContext` in rendering the template.
ru: В шаблон передается одна переменная, ``flatpage``, которая содержит объект страницы. При рендеринге шаблона используется :class:`~django.template.RequestContext`.

source: The middleware will only add a trailing slash and redirect (by looking at the :setting:`APPEND_SLASH` setting) if the resulting URL refers to a valid flatpage. Redirects are permanent (301 status code).
ru: Промежуточный слой только добавляет слэш и перенаправляет (проверяя настройку :setting:`APPEND_SLASH`), если полученный URL указывает на статическую страницу. Перенаправление постоянные (301 код ответа).

source: If it doesn't find a match, the request continues to be processed as usual.
ru: Если страница не найдена, запрос обрабатывается как обычно.

source: The middleware only gets activated for 404s -- not for 500s or responses of any other status code.
ru: Промежуточный слой активируется только при 404 ответе, 500 и прочие игнорируются.

source: Flatpages will not apply view middleware
ru: К простым страницам не применяется ``process_view`` промежуточных слоев

source: Because the ``FlatpageFallbackMiddleware`` is applied only after URL resolution has failed and produced a 404, the response it returns will not apply any :ref:`view middleware <view-middleware>` methods. Only requests which are successfully routed to a view via normal URL resolution apply view middleware.
ru: Так как ``FlatpageFallbackMiddleware`` применяется после того, как поиск URL-а провалился и мы получили 404, ответ не будет обрабатываться :ref:`методом process_view промежуточных слоев <view-middleware>`. Только при успешной обработке URL-а и вызове представления вызываются эти методы.

source: For more on middleware, read the :doc:`middleware docs </topics/http/middleware>`.
ru: Подробнее смотрите в разделе о :doc:`промежуточных слоях </topics/http/middleware>`.

source: Ensure that your 404 template works
ru: Убедитесь, что ваш 404 шаблон работает

source: Note that the :class:`~django.contrib.flatpages.middleware.FlatpageFallbackMiddleware` only steps in once another view has successfully produced a 404 response. If another view or middleware class attempts to produce a 404 but ends up raising an exception instead, the response will become an HTTP 500 ("Internal Server Error") and the :class:`~django.contrib.flatpages.middleware.FlatpageFallbackMiddleware` will not attempt to serve a flat page.
ru: Обратите внимание, :class:`~django.contrib.flatpages.middleware.FlatpageFallbackMiddleware` выполняет, только если другое представление вернуло 404 ответ. Если другое представление или промежуточный слой попытается вернуть 404 и получит исключение, ответ будет HTTP 500 ("Internal Server Error") и :class:`~django.contrib.flatpages.middleware.FlatpageFallbackMiddleware` не будет выполнен.

source: How to add, change and delete flatpages
ru: Как добавить, изменить и удалить статические страницы

source: Via the admin interface
ru: Через интерфейс администратора

source: If you've activated the automatic Django admin interface, you should see a "Flatpages" section on the admin index page. Edit flatpages as you edit any other object in the system.
ru: Если вы активировали интерфейс администратора Django, вы увидите раздел "Flatpages" в админке. Редактируйте статические страницы как и другие объекты в базе данных.

source: The ``FlatPage`` model has an ``enable_comments`` field that isn't used by ``contrib.flatpages``, but that could be useful for your project or third-party apps. It doesn't appear in the admin interface, but you can add it by registering a custom ``ModelAdmin`` for ``FlatPage``::
ru: Модель ``FlatPage`` содержит поле ``enable_comments``, которое не используется ``contrib.flatpages``, но может быть полезно для вашего проекта или приложений. Это поле не доступно через интерфейс администратора, но вы можете добавить его, зарегистрировав собственный ``ModelAdmin`` для ``FlatPage``::

source: Via the Python API
ru: Через Python API

source: Check for duplicate flatpage URLs.
ru: Проверка уникальности URL статической страницы.

source: If you add or modify flatpages via your own code, you will likely want to check for duplicate flatpage URLs within the same site. The flatpage form used in the admin performs this validation check, and can be imported from ``django.contrib.flatpages.forms.FlatpageForm`` and used in your own views.
ru: Если вы добавляете или изменяете статические страницы, скорее всего вам необходимо проверять, что URL страницы уникален для сайта. Форма, которая используется в админке, выполняет такую проверку, и может быть импортирована из ``django.contrib.flatpages.forms.FlatpageForm`` для использование в ваших представлениях.

source: Flatpage templates
ru: Шаблоны статических страниц
