Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/ref/contrib/humanize.po
Languages: ru

source: A set of Django template filters useful for adding a "human touch" to data.
ru: Набор шаблонных фильтров Django, которые помогают отображать данные в читабельном виде.

source: To activate these filters, add ``'django.contrib.humanize'`` to your :setting:`INSTALLED_APPS` setting. Once you've done that, use ``{% load humanize %}`` in a template, and you'll have access to the following filters.
ru: Чтобы использовать эти фильтры, добавьте ``'django.contrib.humanize'`` в настройку :setting:`INSTALLED_APPS`. Затем добавьте в шаблоне ``{% load humanize %}``. Теперь вам доступны следующие фильтры.

source: For numbers 1-9, returns the number spelled out. Otherwise, returns the number. This follows Associated Press style.
ru: Для чисел 1-9 возвращает их тестовое название. Иначе возвращает число. Соответствует стилю Associated Press.

source: Examples:
ru: Например:

source: ``1`` becomes ``one``.
ru: ``1`` станет ``one``.

source: ``2`` becomes ``two``.
ru: ``2`` станет ``two``.

source: ``10`` becomes ``10``.
ru: ``10`` станет ``10``.

source: You can pass in either an integer or a string representation of an integer.
ru: Можно передать число или строку, представляющую число.

source: Converts an integer or float (or a string representation of either) to a string containing commas every three digits.
ru: Конвертирует число или дробное (или строку, которая их представляет) в строку, разделенную запятой через каждые три цифры.

source: ``4500`` becomes ``4,500``.
ru: ``4500`` станет ``4,500``.

source: ``4500.2`` becomes ``4,500.2``.
ru: ``4500.2`` станет ``4,500.2``.

source: ``45000`` becomes ``45,000``.
ru: ``45000`` станет ``45,000``.

source: ``450000`` becomes ``450,000``.
ru: ``450000`` станет ``450,000``.

source: ``4500000`` becomes ``4,500,000``.
ru: ``4500000`` станет ``4,500,000``.

source: :doc:`/topics/i18n/formatting` will be respected if enabled, e.g. with the ``'de'`` language:
ru: Используется :doc:`/topics/i18n/formatting`, если он доступен и включена локализация. Например, для языка ``'de'``:

source: ``45000`` becomes ``'45.000'``.
ru: ``45000`` станет ``'45.000'``.

source: ``450000`` becomes ``'450.000'``.
ru: ``450000`` станет ``'450.000'``.

source: Converts a large integer (or a string representation of an integer) to a friendly text representation. Works best for numbers over 1 million.
ru: Конвертирует большое число (или строку, которая его представляет) в читабельное тестовое представление. Лучше всего работает для чисел больше 1 миллиона.

source: ``1000000`` becomes ``1.0 million``.
ru: ``1000000`` станет ``1.0 million``.

source: ``1200000`` becomes ``1.2 million``.
ru: ``1200000`` станет ``1.2 million``.

source: ``1200000000`` becomes ``1.2 billion``.
ru: ``1200000000`` станет ``1.2 billion``.

source: Values up to 10^100 (Googol) are supported.
ru: Поддерживаются число до 10^100 (Googol).

source: ``1000000`` becomes ``'1,0 Million'``.
ru: ``1000000`` станет ``'1,0 Million'``.

source: ``1200000`` becomes ``'1,2 Million'``.
ru: ``1200000`` станет ``'1,2 Million'``.

source: ``1200000000`` becomes ``'1,2 Milliarden'``.
ru: ``1200000000`` станет ``'1,2 Milliarden'``.

source: For dates that are the current day or within one day, return "today", "tomorrow" or "yesterday", as appropriate. Otherwise, format the date using the passed in format string.
ru: Для даты равной текущей, или плюс/минус один день, возвращает "today", "tomorrow" или "yesterday" соответственно. Иначе форматирует дату, используя переданный формат.

source: **Argument:** Date formatting string as described in the :tfilter:`date` tag.
ru: **Аргумент:** формат даты, описанный в описании тега :tfilter:`date`.

source: Examples (when 'today' is 17 Feb 2007):
ru: Пример (если текущая дата 17 февраля 2007):

source: ``16 Feb 2007`` becomes ``yesterday``.
ru: ``16 Feb 2007`` станет ``yesterday``.

source: ``17 Feb 2007`` becomes ``today``.
ru: ``17 Feb 2007`` станет ``today``.

source: ``18 Feb 2007`` becomes ``tomorrow``.
ru: ``18 Feb 2007`` станет ``tomorrow``.

source: Any other day is formatted according to given argument or the :setting:`DATE_FORMAT` setting if no argument is given.
ru: Любая другая дата будет отформатирована в соответствии с переданным аргументом, или форматом из настройки :setting:`DATE_FORMAT`, если формат не передан в фильтр через аргумент.

source: For datetime values, returns a string representing how many seconds, minutes or hours ago it was -- falling back to the :tfilter:`timesince` format if the value is more than a day old. In case the datetime value is in the future the return value will automatically use an appropriate phrase.
ru: Для значений ``datetime`` вернет текстовое представление сколько секунд, минут или часов прошло. Если значение больше одного дня, используется результат фильтра :tfilter:`timesince`. Работает для дат в будущем.

source: Examples (when 'now' is 17 Feb 2007 16:30:00):
ru: Пример (если текущая дата и время 17 февраля 2007 16:30:00):

source: ``17 Feb 2007 16:30:00`` becomes ``now``.
ru: ``17 Feb 2007 16:30:00`` станет ``now``.

source: ``17 Feb 2007 16:29:31`` becomes ``29 seconds ago``.
ru: ``17 Feb 2007 16:29:31`` станет ``29 seconds ago``.

source: ``17 Feb 2007 16:29:00`` becomes ``a minute ago``.
ru: ``17 Feb 2007 16:29:00`` станет ``a minute ago``.

source: ``17 Feb 2007 16:25:35`` becomes ``4 minutes ago``.
ru: ``17 Feb 2007 16:25:35`` станет ``4 minutes ago``.

source: ``17 Feb 2007 15:30:29`` becomes ``59 minutes ago``.
ru: ``17 Feb 2007 15:30:29`` станет ``59 minutes ago``.

source: ``17 Feb 2007 15:30:01`` becomes ``59 minutes ago``.
ru: ``17 Feb 2007 15:30:01`` станет ``59 minutes ago``.

source: ``17 Feb 2007 15:30:00`` becomes ``an hour ago``.
ru: ``17 Feb 2007 15:30:00`` станет ``an hour ago``.

source: ``17 Feb 2007 13:31:29`` becomes ``2 hours ago``.
ru: ``17 Feb 2007 13:31:29`` станет ``2 hours ago``.

source: ``16 Feb 2007 13:31:29`` becomes ``1 day, 2 hours ago``.
ru: ``16 Feb 2007 13:31:29`` станет ``1 day, 2 hours ago``.

source: ``16 Feb 2007 13:30:01`` becomes ``1 day, 2 hours ago``.
ru: ``16 Feb 2007 13:30:01`` станет ``1 day, 2 hours ago``.

source: ``16 Feb 2007 13:30:00`` becomes ``1 day, 3 hours ago``.
ru: ``16 Feb 2007 13:30:00`` станет ``1 day, 3 hours ago``.

source: ``17 Feb 2007 16:30:30`` becomes ``30 seconds from now``.
ru: ``17 Feb 2007 16:30:30`` станет ``30 seconds from now``.

source: ``17 Feb 2007 16:30:29`` becomes ``29 seconds from now``.
ru: ``17 Feb 2007 16:30:29`` станет ``29 seconds from now``.

source: ``17 Feb 2007 16:31:00`` becomes ``a minute from now``.
ru: ``17 Feb 2007 16:31:00`` станет ``a minute from now``.

source: ``17 Feb 2007 16:34:35`` becomes ``4 minutes from now``.
ru: ``17 Feb 2007 16:34:35`` станет ``4 minutes from now``.

source: ``17 Feb 2007 17:30:29`` becomes ``an hour from now``.
ru: ``17 Feb 2007 17:30:29`` станет ``an hour from now``.

source: ``17 Feb 2007 18:31:29`` becomes ``2 hours from now``.
ru: ``17 Feb 2007 18:31:29`` станет ``2 hours from now``.

source: ``18 Feb 2007 16:31:29`` becomes ``1 day from now``.
ru: ``18 Feb 2007 16:31:29`` станет ``1 day from now``.

source: ``26 Feb 2007 18:31:29`` becomes ``1 week, 2 days from now``.
ru: ``26 Feb 2007 18:31:29`` станет ``1 week, 2 days from now``.

source: Converts an integer to its ordinal as a string.
ru: Преобразование целое число в порядковый номер.

source: ``1`` becomes ``1st``.
ru: ``1`` станет ``1st``.

source: ``2`` becomes ``2nd``.
ru: ``2`` станет ``2nd``.

source: ``3`` becomes ``3rd``.
ru: ``3`` станет ``3rd``.
