Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/ref/contrib/markup.po
Languages: ru

source: Django provides template filters that implement the following markup languages:
ru: Django предоставляет шаблонные фильтры, реализующие следующие языки разметки:

source: ``textile`` -- implements `Textile`_ -- requires `PyTextile`_
ru: ``textile`` -- реализация `Textile <http://txstyle.org/>`_ -- требует установки `PyTextile <http://loopcore.com/python-textile/>`_

source: ``markdown`` -- implements `Markdown`_ -- requires `Python-markdown`_ (>=2.1)
ru: ``markdown`` -- реализация `Markdown <http://daringfireball.net/projects/markdown/>`_ -- требует установки `Python-markdown <https://pypi.python.org/pypi/Markdown>`_ (>=2.1)

source: ``restructuredtext`` -- implements `reST (reStructured Text)`_ -- requires `doc-utils`_
ru: ``restructuredtext`` -- реализация `reST (reStructured Text) <http://en.wikipedia.org/wiki/ReStructuredText>`_ -- требует установки `doc-utils <http://docutils.sourceforge.net/>`_

source: In each case, the filter expects formatted markup as a string and returns a string representing the marked-up text. For example, the ``textile`` filter converts text that is marked-up in Textile format to HTML.
ru: В каждом из представленных случаев фильтр ожидает получить соответственно отформатированную строку и возвращает строку размеченного текста. Например, фильтр ``textile`` преобразует текст формата Textile в HTML.

source: To activate these filters, add ``'django.contrib.markup'`` to your :setting:`INSTALLED_APPS` setting. Once you've done that, use ``{% load markup %}`` in a template, and you'll have access to these filters. For more documentation, read the source code in :file:`django/contrib/markup/templatetags/markup.py`.
ru: Для активации этих фильтров добавьте ``'django.contrib.markup'`` в настройки :setting:`INSTALLED_APPS`. После того как это сделано, используйте в шаблоне ``{% load markup %}``, чтобы получить доступ к фильтру. Для получения дополнительных сведений читайте :file:`django/contrib/markup/templatetags/markup.py`.

source: The output of markup filters is marked "safe" and will not be escaped when rendered in a template. Always be careful to sanitize your inputs and make sure you are not leaving yourself vulnerable to cross-site scripting or other types of attacks.
ru: На выходе markup фильтр отмечает строки как "безопасные" и не экранирует символы HTML при выводе шаблона. Всегда будьте осторожны с фильтрами и проверяйте не оставляют ли они возможности проведения различных видов межсайтовых атак.

source: When using the ``restructuredtext`` markup filter you can define a :setting:`RESTRUCTUREDTEXT_FILTER_SETTINGS` in your django settings to override the default writer settings. See the `restructuredtext writer settings`_ for details on what these settings are.
ru: Когда вы используете фильтр ``restructuredtext`` вы должны определить в настройках :setting:`RESTRUCTUREDTEXT_FILTER_SETTINGS`, чтобы переопределить параметры, установленные по-умолчанию. Для получения подробной информации обратитесь к странице `restructuredtext writer settings <http://docutils.sourceforge.net/docs/user/config.html#html4css1-writer>`_.

source: reStructured Text has features that allow raw HTML to be included, and that allow arbitrary files to be included. These can lead to XSS vulnerabilities and leaking of private information. It is your responsibility to check the features of this library and configure appropriately to avoid this. See the `Deploying Docutils Securely <http://docutils.sourceforge.net/docs/howto/security.html>`_ documentation.
ru: reStructured Text имеет свои особенности, благодаря которым возможно включение неэкранированных символов HTML и произвольных файлов. Это может привести к XSS уязвимости и потере приватной информации. Ответственность за проверку возможностей библиотеки и создание корректных настроек во избежание получения уязвимостей ложится на ваши плечи. Обязательно просмотрите следующую документацию: `Deploying Docutils Securely <http://docutils.sourceforge.net/docs/howto/security.html>`_ .

source: The Python Markdown library supports options named "safe_mode" and "enable_attributes". Both relate to the security of the output. To enable both options in tandem, the markdown filter supports the "safe" argument::
ru: Библиотека Python Markdown поддерживает опции "safe_mode" и "enable_attributes". Обе эти опции имеют прямое отношение к безопасности. Для их совместного использования markdown поддерживание аргумент "safe"::

source: Versions of the Python-Markdown library prior to 2.1 do not support the optional disabling of attributes. This is a security flaw. Therefore, ``django.contrib.markup`` has dropped support for versions of Python-Markdown < 2.1 in Django 1.5.
ru: Python-Markdown до версии 2.1 не поддерживает опциональное отключение опций. Это брешь в безопасности. Поэтому поддержка Python-Markdown < 2.1 была прекращена в Django 1.5.
