Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/ref/contrib/sites.po
Languages: ru

source: The "sites" framework
ru: Фреймворк для сайтов

source: Django comes with an optional "sites" framework. It's a hook for associating objects and functionality to particular websites, and it's a holding place for the domain names and "verbose" names of your Django-powered sites.
ru: Django поставляется с опциональным фреймворком для поддержки нескольких сайтов. Это позволяет держать некоторые объекты и функциональность в одном месте в то же время разделяя по сайтам, используя разные доменные имена и названия Django-сайтов.

source: Use it if your single Django installation powers more than one site and you need to differentiate between those sites in some way.
ru: Если в рамках одной установки Django требуется разрабатывать более чем один сайт с отличающейся функциональностью, то как раз для этого случая и был разработан фреймворк для сайтов.

source: The sites framework is mainly based on a simple model:
ru: Поддержка сайтов базируется в основном на простой модели:

source: A model for storing the ``domain`` and ``name`` attributes of a website.
ru: Модель для хранения атрибутов ``domain`` и ``name`` сайта.

source: The fully qualified domain name associated with the website. For example, ``www.example.com``.
ru: Доменное имя, ассоциированное с данным сайтом. Например ``www.example.com``.

source: A human-readable "verbose" name for the website.
ru: Название сайта.

source: The :setting:`SITE_ID` setting specifies the database ID of the :class:`~django.contrib.sites.models.Site` object associated with that particular settings file. If the setting is omitted, the :func:`~django.contrib.sites.shortcuts.get_current_site` function will try to get the current site by comparing the :attr:`~django.contrib.sites.models.Site.domain` with the host name from the :meth:`request.get_host() <django.http.HttpRequest.get_host>` method.
ru: Настройка :setting:`SITE_ID` указывает ID объекта :class:`~django.contrib.sites.models.Site` в базе данных, который связан с текущими настройками и установленным проектом. Если эта настройка не указана, функция :func:`~django.contrib.sites.shortcuts.get_current_site` попытается получить текущий сайт, сравнивая :attr:`~django.contrib.sites.models.Site.domain` с именем хоста, которое возвращает метод :meth:`request.get_host() <django.http.HttpRequest.get_host>`.

source: How you use this is up to you, but Django uses it in a couple of ways automatically via simple conventions.
ru: Как использовать данную модель решать вам, но Django предоставляет несколько способов взаимодействия через соглашения.

source: Example usage
ru: Пример использования

source: Why would you use sites? It's best explained through examples.
ru: Для наглядности продемонстрируем сей механизм на нескольких примерах.

source: Associating content with multiple sites
ru: Связь контента с несколькими сайтами

source: The Django-powered sites LJWorld.com_ and Lawrence.com_ are operated by the same news organization -- the Lawrence Journal-World newspaper in Lawrence, Kansas. LJWorld.com focuses on news, while Lawrence.com focuses on local entertainment. But sometimes editors want to publish an article on *both* sites.
ru: Сайты газеты Lawrence Journal-World LJWorld.com_ и Lawrence.com_ написаны на Django. LJWorld.com ориентирован на освещение глобальных событий, в то время как Lawrence.com фокусируется на местных. Время от времени возникает необходимость публиковать статьи на *обе* площадки.

source: The naive way of solving the problem would be to require site producers to publish the same story twice: once for LJWorld.com and again for Lawrence.com. But that's inefficient for site producers, and it's redundant to store multiple copies of the same story in the database.
ru: Решение в лоб - заставлять контент-менеджеров публиковать статьи дважды: и в LJWorld.com, и в Lawrence.com. Это неудобно не только для людей, но и для железа - придётся хранить в БД 2 одинаковых записи.

source: The better solution is simple: Both sites use the same article database, and an article is associated with one or more sites. In Django model terminology, that's represented by a :class:`~django.db.models.ManyToManyField` in the ``Article`` model::
ru: Если чуть-чуть подумать то можно реализовать более гибкое и в то же время простое решение: оба сайта используют одну и ту же базу статей, каждая из кторых связана с одним или более сайтом. В Django это реализуется через :class:`~django.db.models.ManyToManyField` в модели ``Article``::

source: This accomplishes several things quite nicely:
ru: Это решение достаточно красиво:

source: It lets the site producers edit all content -- on both sites -- in a single interface (the Django admin).
ru: Позволяет редактировать контент двух сайтов в одном интерфейсе (админке Django).

source: It means the same story doesn't have to be published twice in the database; it only has a single record in the database.
ru: Позволяет избежать избыточности в плане хранения записей в БД.

source: It lets the site developers use the same Django view code for both sites. The view code that displays a given story just checks to make sure the requested story is on the current site. It looks something like this::
ru: Позволяет разработчикам сайтов использовать один и тот же код для двух сайтов. Код представления лишь проверяет надо ли выводить данную статью на текущем сайте. Например, как-нибудь так:

source: Associating content with a single site
ru: Связь контента с одним сайтом

source: Similarly, you can associate a model to the :class:`~django.contrib.sites.models.Site` model in a many-to-one relationship, using :class:`~django.db.models.ForeignKey`.
ru: Кроме того вы можете связать свои модели с :class:`~django.contrib.sites.models.Site` через отношение один-ко-многим, используя :class:`~django.db.models.ForeignKey`.

source: For example, if an article is only allowed on a single site, you'd use a model like this::
ru: Например, если статья должна быть доступна только на одном сайте, то вы можете использовать следующую модель::

source: This has the same benefits as described in the last section.
ru: Она имеет преимущества, описанные выше.

source: Hooking into the current site from views
ru: Получение значения текущего сайта в представлении

source: You can use the sites framework in your Django views to do particular things based on the site in which the view is being called. For example::
ru: Вы можете использовать фреймворк для построения сайтов в представлениях для выполнения конкретных вещей, необходимых лишь для текущего, например::

source: Of course, it's ugly to hard-code the site IDs like that. This sort of hard-coding is best for hackish fixes that you need done quickly. The cleaner way of accomplishing the same thing is to check the current site's domain::
ru: Конечно, это ужачный пример завязки на ID сайта который подходит только для мелких исправлений, которые надо выполнить быстро. Гораздо лучше проверять доменное имя::

source: This has also the advantage of checking if the sites framework is installed, and return a :class:`~django.contrib.sites.requests.RequestSite` instance if it is not.
ru: Преимущество в том, что даже если описываемая функциональность Django и не задействована, всё равно вернётся экземпляр :class:`RequestSite`.

source: If you don't have access to the request object, you can use the ``get_current()`` method of the :class:`~django.contrib.sites.models.Site` model's manager. You should then ensure that your settings file does contain the :setting:`SITE_ID` setting. This example is equivalent to the previous one::
ru: Если у вас нет доступа к объекту запроса, можно получить текущий сайт через метод ``get_current()`` класса :class:`~django.contrib.sites.models.Site`. В этом случае надо быть уверенным, что задана константа :setting:`SITE_ID`. Этот пример эквивалентен предыдущему::

source: Getting the current domain for display
ru: Получение текущего домена для отображения

source: LJWorld.com and Lawrence.com both have email alert functionality, which lets readers sign up to get notifications when news happens. It's pretty basic: A reader signs up on a Web form and immediately gets an email saying, "Thanks for your subscription."
ru: LJWorld.com и Lawrence.com имеют функциональность по рассылке уведомлений, которая позволяет читателям получать уведомления. Самый простой пример: читатель заполняет форму, и ему тут же приходит письмо "Спасибо, что подписались."

source: It'd be inefficient and redundant to implement this sign up processing code twice, so the sites use the same code behind the scenes. But the "thank you for signing up" notice needs to be different for each site. By using :class:`~django.contrib.sites.models.Site` objects, we can abstract the "thank you" notice to use the values of the current site's :attr:`~django.contrib.sites.models.Site.name` and :attr:`~django.contrib.sites.models.Site.domain`.
ru: Было бы избыточным реализовывать этот механизм дважды, так что в реальности выполняется один и тот же код. Однако, сообщение должно быть разным для сайтов. Используя объект :class:`~django.contrib.sites.models.Site` мы можем подставить соответствующие :attr:`~django.contrib.sites.models.Site.name` и :attr:`~django.contrib.sites.models.Site.domain`.

source: Here's an example of what the form-handling view looks like::
ru: Покажем это на примере::

source: On Lawrence.com, this email has the subject line "Thanks for subscribing to lawrence.com alerts." On LJWorld.com, the email has the subject "Thanks for subscribing to LJWorld.com alerts." Same goes for the email's message body.
ru: Для Lawrence.com письмо будет содержать строку "Thanks for subscribing to lawrence.com alerts.", для LJWorld.com - "Thanks for subscribing to LJWorld.com alerts.".

source: Note that an even more flexible (but more heavyweight) way of doing this would be to use Django's template system. Assuming Lawrence.com and LJWorld.com have different template directories (:setting:`DIRS <TEMPLATES-DIRS>`), you could simply farm out to the template system like so::
ru: Заметим, что более гибкой (но и более тяжёлой) была бы реализация через шаблонизатор Django. Предполагая, что Lawrence.com и LJWorld.com имеют разные пути к шаблонам (:setting:`DIRS <TEMPLATES-DIRS>`), вышло бы что-то типа::

source: In this case, you'd have to create :file:`subject.txt` and :file:`message.txt` template files for both the LJWorld.com and Lawrence.com template directories. That gives you more flexibility, but it's also more complex.
ru: В этом случае нужно было бы создавать шаблоны :file:`subject.txt` и :file:`message.txt` для каждого сайта. Такое решение более гибкое, но и более сложное.

source: It's a good idea to exploit the :class:`~django.contrib.sites.models.Site` objects as much as possible, to remove unneeded complexity and redundancy.
ru: Хорошей идеей будет использовать :class:`~django.contrib.sites.models.Site` везде, где только можно, для удаления дублирования и упрощения кода.

source: Getting the current domain for full URLs
ru: Получение текущего домена для полного URL

source: Django's ``get_absolute_url()`` convention is nice for getting your objects' URL without the domain name, but in some cases you might want to display the full URL -- with ``http://`` and the domain and everything -- for an object. To do this, you can use the sites framework. A simple example::
ru: Функция ``get_absolute_url()`` полезна для получения URL без протокола и имени домена. Если же нужен полный URL, то его можно сгенерировать следующим образом::

source: Enabling the sites framework
ru: Включение поддержки фреймворка для сайтов

source: To enable the sites framework, follow these steps:
ru: Для того, чтобы воспользоваться описанными выше возможностями, необходимо:

source: Add ``'django.contrib.sites'`` to your :setting:`INSTALLED_APPS` setting.
ru: Добавить ``'django.contrib.sites'`` в :setting:`INSTALLED_APPS`.

source: Define a :setting:`SITE_ID` setting::
ru: Задать :setting:`SITE_ID`::

source: Run :djadmin:`migrate`.
ru: Запустить :djadmin:`migrate`.

source: ``django.contrib.sites`` registers a :data:`~django.db.models.signals.post_migrate` signal handler which creates a default site named ``example.com`` with the domain ``example.com``. This site will also be created after Django creates the test database. To set the correct name and domain for your project, you can use a :ref:`data migration <data-migrations>`.
ru: ``django.contrib.sites`` регистрирует обработчик сигнала :data:`~django.db.models.signals.post_migrate`, который создаёт новый сайт с именем ``example.com`` и доменом ``example.com``. Эта запись также будет создана после инициализации тестовой БД. Для установки правильного имени и домена для проекта можно воспользоваться :ref:`data migration <data-migrations>`.

source: In order to serve different sites in production, you'd create a separate settings file with each ``SITE_ID`` (perhaps importing from a common settings file to avoid duplicating shared settings) and then specify the appropriate :envvar:`DJANGO_SETTINGS_MODULE` for each site.
ru: Чтобы использовать поддержку сайтов на боевом сервере необходимо для каждого ``SITE_ID`` создать свой файл настроек (возможно, с импортом общих, чтобы избежать дублирования) и затем указать соответствующий :envvar:`DJANGO_SETTINGS_MODULE`.

source: Caching the current ``Site`` object
ru: Кеширование текущего объекта ``Site``

source: As the current site is stored in the database, each call to ``Site.objects.get_current()`` could result in a database query. But Django is a little cleverer than that: on the first request, the current site is cached, and any subsequent call returns the cached data instead of hitting the database.
ru: Так как текущий сайт хранится в базе данных, то каждый вызов ``Site.objects.get_current()`` приведёт к выполнению SQL запроса. Разработчики Django позаботились об оптимизации: после первого запроса значение кешируется и в дальнейшем возвращается именно оно без обращения к БД.

source: If for any reason you want to force a database query, you can tell Django to clear the cache using ``Site.objects.clear_cache()``::
ru: Если же вам нужно всё-таки выполнять запрос каждый раз, можно очистить кеш путём вызова ``Site.objects.clear_cache()``::

source: The ``CurrentSiteManager``
ru: ``CurrentSiteManager``

source: If :class:`~django.contrib.sites.models.Site` plays a key role in your application, consider using the helpful :class:`~django.contrib.sites.managers.CurrentSiteManager` in your model(s). It's a model :doc:`manager </topics/db/managers>` that automatically filters its queries to include only objects associated with the current :class:`~django.contrib.sites.models.Site`.
ru: Если вы используете :class:`~django.contrib.sites.models.Site` в качестве внешнего ключа в какой-либо модели, то вам пригодится класс :class:`~django.contrib.sites.managers.CurrentSiteManager`. Это модель :doc:`manager </topics/db/managers>`, которая автоматически фильтрует запросы на принадлежность к текущему :class:`~django.contrib.sites.models.Site`.

source: Mandatory :setting:`SITE_ID`
ru: Обязательная настройка :setting:`SITE_ID`

source: The ``CurrentSiteManager`` is only usable when the :setting:`SITE_ID` setting is defined in your settings.
ru: ``CurrentSiteManager`` можно использовать, только если указана настройка :setting:`SITE_ID`.

source: Use :class:`~django.contrib.sites.managers.CurrentSiteManager` by adding it to your model explicitly. For example::
ru: Используйте :class:`~django.contrib.sites.managers.CurrentSiteManager` для добавления этой функциональности непосредственно в модель::

source: With this model, ``Photo.objects.all()`` will return all ``Photo`` objects in the database, but ``Photo.on_site.all()`` will return only the ``Photo`` objects associated with the current site, according to the :setting:`SITE_ID` setting.
ru: Таким образом, ``Photo.objects.all()`` вернёт все объекты ``Photo``, а ``Photo.on_site.all()`` только те, которые доступны на данном сайте согласно :setting:`SITE_ID`.

source: Put another way, these two statements are equivalent::
ru: Другими словами эти 2 выражения эквивалентны::

source: How did :class:`~django.contrib.sites.managers.CurrentSiteManager` know which field of ``Photo`` was the :class:`~django.contrib.sites.models.Site`? By default, :class:`~django.contrib.sites.managers.CurrentSiteManager` looks for a either a :class:`~django.db.models.ForeignKey` called ``site`` or a :class:`~django.db.models.ManyToManyField` called ``sites`` to filter on. If you use a field named something other than ``site`` or ``sites`` to identify which :class:`~django.contrib.sites.models.Site` objects your object is related to, then you need to explicitly pass the custom field name as a parameter to :class:`~django.contrib.sites.managers.CurrentSiteManager` on your model. The following model, which has a field called ``publish_on``, demonstrates this::
ru: Каким образом :class:`~django.contrib.sites.managers.CurrentSiteManager` узнаёт какое поле относится к :class:`~django.contrib.sites.models.Site`? По умолчанию, :class:`~django.contrib.sites.managers.CurrentSiteManager` смотрит на наличие :class:`~django.db.models.ForeignKey` с именем ``site`` или :class:`~django.db.models.ManyToManyField` с именем ``sites``. Если вы используете другое название поля, то ищется ссылка на :class:`~django.contrib.sites.models.Site`. В этом случае имя поля необходимо передать в :class:`~django.contrib.sites.managers.CurrentSiteManager`. В нашем случае поле названо ``publish_on``::

source: If you attempt to use :class:`~django.contrib.sites.managers.CurrentSiteManager` and pass a field name that doesn't exist, Django will raise a ``ValueError``.
ru: Если вы передадите в :class:`~django.contrib.sites.managers.CurrentSiteManager` несуществующее имя, то возникнет исключение ``ValueError``.

source: Finally, note that you'll probably want to keep a normal (non-site-specific) ``Manager`` on your model, even if you use :class:`~django.contrib.sites.managers.CurrentSiteManager`. As explained in the :doc:`manager documentation </topics/db/managers>`, if you define a manager manually, then Django won't create the automatic ``objects = models.Manager()`` manager for you. Also note that certain parts of Django -- namely, the Django admin site and generic views -- use whichever manager is defined *first* in the model, so if you want your admin site to have access to all objects (not just site-specific ones), put ``objects = models.Manager()`` in your model, before you define :class:`~django.contrib.sites.managers.CurrentSiteManager`.
ru: Напомним, что модель может содержать обычный (не специфичный для сайта) ``Manager`` вместе с :class:`~django.contrib.sites.managers.CurrentSiteManager`. Это описано в :doc:`manager documentation </topics/db/managers>`. Если вы зададите менеджер вручную, то Django не будет создавать автоматически ``objects = models.Manager()``. Помимо всего прочего не забывайте, что некоторые части Django (например, админка и обобщённые представления) используют тот менеджер, который задан *первым*, так что если вы хотите иметь доступ ко всем объектам (а не только специфичным для сайта), определите в модели ``objects = models.Manager()`` перед :class:`~django.contrib.sites.managers.CurrentSiteManager`.

source: Site middleware
ru: Middleware для сайтов

source: If you often use this pattern::
ru: Если вы часто используете подобный шаблон::

source: there is simple way to avoid repetitions. Add :class:`django.contrib.sites.middleware.CurrentSiteMiddleware` to :setting:`MIDDLEWARE`. The middleware sets the ``site`` attribute on every request object, so you can use ``request.site`` to get the current site.
ru: то есть простой способ избежать дублирования кода. Добавьте :class:`django.contrib.sites.middleware.CurrentSiteMiddleware` в :setting:`MIDDLEWARE`. Таким образом для каждого объекта запроса добавится атрибут ``site`` (``request.site``), который указывает на текущий сайт.

source: How Django uses the sites framework
ru: Как Django работает с сайтами

source: Although it's not required that you use the sites framework, it's strongly encouraged, because Django takes advantage of it in a few places. Even if your Django installation is powering only a single site, you should take the two seconds to create the site object with your ``domain`` and ``name``, and point to its ID in your :setting:`SITE_ID` setting.
ru: Хотя задавать сайты вовсе не обязательно, в то же время всё-таки рекомендуется, т.к. Django использует эту информацию в нескольких местах. Даже если вы создаёте единственный сайт, потратьте пару секунд, чтобы задать ``domain`` и ``name`` в базе данных и константу :setting:`SITE_ID` в настройках.

source: Here's how Django uses the sites framework:
ru: Где внутри Django используются сайты:

source: In the :mod:`redirects framework <django.contrib.redirects>`, each redirect object is associated with a particular site. When Django searches for a redirect, it takes into account the current site.
ru: В модуле :mod:`redirects framework <django.contrib.redirects>` каждый объект перенаправления привязан к конкретному сайту. Django ищет его, учитывая текущий сайт.

source: In the :mod:`flatpages framework <django.contrib.flatpages>`, each flatpage is associated with a particular site. When a flatpage is created, you specify its :class:`~django.contrib.sites.models.Site`, and the :class:`~django.contrib.flatpages.middleware.FlatpageFallbackMiddleware` checks the current site in retrieving flatpages to display.
ru: В модуле :mod:`flatpages framework <django.contrib.flatpages>` каждая статичная страница привязана к определённому сайту. При обращении к ней создаётся :class:`~django.contrib.sites.models.Site`, который проверятеся на соответствие запрашиваемому сайту в :class:`~django.contrib.flatpages.middleware.FlatpageFallbackMiddleware`.

source: In the :mod:`syndication framework <django.contrib.syndication>`, the templates for ``title`` and ``description`` automatically have access to a variable ``{{ site }}``, which is the :class:`~django.contrib.sites.models.Site` object representing the current site. Also, the hook for providing item URLs will use the ``domain`` from the current :class:`~django.contrib.sites.models.Site` object if you don't specify a fully-qualified domain.
ru: В модуле :mod:`syndication framework <django.contrib.syndication>` шаблон для ``title`` и ``description`` автоматически получает доступ к переменной ``{{ site }}`` типа :class:`~django.contrib.sites.models.Site`. Также поддержка URL использует ``domain`` из текущего объекта :class:`~django.contrib.sites.models.Site`, если не указан полный путь.

source: In the :mod:`authentication framework <django.contrib.auth>`, :class:`django.contrib.auth.views.LoginView` passes the current :class:`~django.contrib.sites.models.Site` name to the template as ``{{ site_name }}``.
ru: В модуле :mod:`authentication framework <django.contrib.auth>` функция :func:`django.contrib.auth.views.LoginView` передаёт имя текущего :class:`~django.contrib.sites.models.Site` в переменную шаблона ``{{ site_name }}``.

source: The shortcut view (``django.contrib.contenttypes.views.shortcut``) uses the domain of the current :class:`~django.contrib.sites.models.Site` object when calculating an object's URL.
ru: Популярные представления (``django.contrib.contenttypes.views.shortcut``) используют домен текущего объекта :class:`~django.contrib.sites.models.Site` для создания URL.

source: In the admin framework, the "view on site" link uses the current :class:`~django.contrib.sites.models.Site` to work out the domain for the site that it will redirect to.
ru: В админке ссылка "view on site" использует текущий :class:`~django.contrib.sites.models.Site` для генерации полного URL для перехода.
