Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/ref/contrib/sites.po
Languages: ru

source: ``RequestSite`` objects
ru: Объект ``RequestSite``

source: Some :doc:`django.contrib </ref/contrib/index>` applications take advantage of the sites framework but are architected in a way that doesn't *require* the sites framework to be installed in your database. (Some people don't want to, or just aren't *able* to install the extra database table that the sites framework requires.) For those cases, the framework provides a :class:`django.contrib.sites.requests.RequestSite` class, which can be used as a fallback when the database-backed sites framework is not available.
ru: Некоторые приложения из :doc:`django.contrib </ref/contrib/index>` могут воспользоваться информацией о сайтах, но спроектированы с учётом того, что её может и не быть. (Некоторые люди не хотят или не могут установить дополнительную таблицу.) В этом случае создаётся заглушка :class:`~django.contrib.sites.models.RequestSite`.

source: A class that shares the primary interface of :class:`~django.contrib.sites.models.Site` (i.e., it has ``domain`` and ``name`` attributes) but gets its data from a Django :class:`~django.http.HttpRequest` object rather than from a database.
ru: Класс предоставляет такой же интерфейс как и :class:`~django.contrib.sites.models.Site` (включая атрибуты ``domain`` и ``name``), но берёт их из объекта :class:`~django.http.HttpRequest`, а не из базы данных.

source: Sets the ``name`` and ``domain`` attributes to the value of :meth:`~django.http.HttpRequest.get_host`.
ru: Задаёт ``name`` и ``domain`` для метода :meth:`~django.http.HttpRequest.get_host`.

source: A :class:`~django.contrib.sites.requests.RequestSite` object has a similar interface to a normal :class:`~django.contrib.sites.models.Site` object, except its :meth:`~django.contrib.sites.requests.RequestSite.__init__()` method takes an :class:`~django.http.HttpRequest` object. It's able to deduce the ``domain`` and ``name`` by looking at the request's domain. It has ``save()`` and ``delete()`` methods to match the interface of :class:`~django.contrib.sites.models.Site`, but the methods raise :exc:`NotImplementedError`.
ru: Объект :class:`~django.contrib.sites.models.RequestSite` имеет схожий с :class:`~django.contrib.sites.models.Site` интерфейс за исключением метода :meth:`~django.contrib.sites.models.RequestSite.__init__()`, который принимает :class:`~django.http.HttpRequest`. Это позволяет вычислить ``domain`` и ``name`` на основании домена из запроса. Он имеет также методы ``save()`` и ``delete()``, вызов которых приведёт к исключению ``NotImplementedError``.

source: ``get_current_site`` shortcut
ru: сокращение ``get_current_site``

source: Finally, to avoid repetitive fallback code, the framework provides a :func:`django.contrib.sites.shortcuts.get_current_site` function.
ru: Для обеспечения обратной совместимости Django предоставляет функцию `django.contrib.sites.shortcuts.get_current_site`.

source: A function that checks if ``django.contrib.sites`` is installed and returns either the current :class:`~django.contrib.sites.models.Site` object or a :class:`~django.contrib.sites.requests.RequestSite` object based on the request. It looks up the current site based on :meth:`request.get_host() <django.http.HttpRequest.get_host>` if the :setting:`SITE_ID` setting is not defined.
ru: Эта функция проверяет, что ``django.contrib.sites`` установлен и возвращает текущий объект :class:`~django.contrib.sites.models.Site` или :class:`~django.contrib.sites.requests.RequestSite`, который основан на запросе. При определении текущего сайта используется :meth:`request.get_host() <django.http.HttpRequest.get_host>`, если настройка :setting:`SITE_ID` не определена.

source: Both a domain and a port may be returned by :meth:`request.get_host() <django.http.HttpRequest.get_host>` when the Host header has a port explicitly specified, e.g. ``example.com:80``. In such cases, if the lookup fails because the host does not match a record in the database, the port is stripped and the lookup is retried with the domain part only. This does not apply to :class:`~django.contrib.sites.requests.RequestSite` which will always use the unmodified host.
ru: Метод :meth:`request.get_host() <django.http.HttpRequest.get_host>` может вернуть домен и порт, если заголовок ``Host`` содержит явно указанный порт, например ``example.com:80``. В этих случаях, если не найден ни один сайт в базе данных, порт будет обрезан и выполнится поиск только по домену. Это не относится к :class:`~django.contrib.sites.requests.RequestSite`, который всегда использует неизменное значение хоста.
