Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/ref/contrib/staticfiles.po
Languages: ru

source: ``django.contrib.staticfiles`` collects static files from each of your applications (and any other places you specify) into a single location that can easily be served in production.
ru: ``django.contrib.staticfiles`` собирает статические файлы со всех ваших приложений (и остальных мест, которые вы укажите) в одном месте, что позволяет легко настроить выдачу статических файлов на боевом сервере.

source: For an introduction to the static files app and some usage examples, see :doc:`/howto/static-files/index`. For guidelines on deploying static files, see :doc:`/howto/static-files/deployment`.
ru: Примеры использования этого приложения для работы со статикой можно найти в разделе :doc:`/howto/static-files/index`. Как работать со статикой на боевом сервере описано в разделе :doc:`/howto/static-files/deployment`.

source: Settings
ru: Настройки

source: See :ref:`staticfiles settings <settings-staticfiles>` for details on the following settings:
ru: Смотрите :ref:`описание настроек приложения staticfiless <settings-staticfiles>`:

source: Management Commands
ru: Команды

source: ``django.contrib.staticfiles`` exposes three management commands.
ru: ``django.contrib.staticfiles`` предоставляет три команды.

source: Collects the static files into :setting:`STATIC_ROOT`.
ru: Собирает статические файлы в :setting:`STATIC_ROOT`.

source: Duplicate file names are by default resolved in a similar way to how template resolution works: the file that is first found in one of the specified locations will be used. If you're confused, the :djadmin:`findstatic` command can help show you which files are found.
ru: Одинаковые имена файлов обрабатываются как и шаблоны: будет использоваться первый найденный файл. Если вы запутались, команда :djadmin:`findstatic` может показать какой конкретно файл используется.

source: On subsequent ``collectstatic`` runs (if ``STATIC_ROOT`` isn't empty), files are copied only if they have a modified timestamp greater than the timestamp of the file in ``STATIC_ROOT``. Therefore if you remove an application from :setting:`INSTALLED_APPS`, it's a good idea to use the :option:`collectstatic --clear` option in order to remove stale static files.
ru: При последующем запуске ``collectstatic`` (если ``STATIC_ROOT`` не пустой), файлы копируются, только если время их изменения больше, чем у файла в ``STATIC_ROOT``. Также, если вы удалите приложение из :setting:`INSTALLED_APPS`, следует использовать опцию :option:`collectstatic --clear`, чтобы удалить неиспользуемые статические файлы.

source: Files are searched by using the :setting:`enabled finders <STATICFILES_FINDERS>`. The default is to look in all locations defined in :setting:`STATICFILES_DIRS` and in the ``'static'`` directory of apps specified by the :setting:`INSTALLED_APPS` setting.
ru: Файлы ищутся используя бэкенды из :setting:`enabled finders <STATICFILES_FINDERS>`. По умолчанию проверяются каталоги из :setting:`STATICFILES_DIRS` и подкаталоги ``'static'`` приложений из :setting:`INSTALLED_APPS`.

source: The :djadmin:`collectstatic` management command calls the :meth:`~django.contrib.staticfiles.storage.StaticFilesStorage.post_process` method of the :setting:`STATICFILES_STORAGE` after each run and passes a list of paths that have been found by the management command. It also receives all command line options of :djadmin:`collectstatic`. This is used by the :class:`~django.contrib.staticfiles.storage.CachedStaticFilesStorage` by default.
ru: Команда :djadmin:`collectstatic` вызывает метод :meth:`~django.contrib.staticfiles.storage.StaticFilesStorage.post_process` бэкенда :setting:`STATICFILES_STORAGE` и передает список найденных файлов. Также передаются все опции переданные при вызове :djadmin:`collectstatic`. По умолчанию используется :class:`~django.contrib.staticfiles.storage.CachedStaticFilesStorage`.

source: By default, collected files receive permissions from :setting:`FILE_UPLOAD_PERMISSIONS` and collected directories receive permissions from :setting:`FILE_UPLOAD_DIRECTORY_PERMISSIONS`. If you would like different permissions for these files and/or directories, you can subclass either of the :ref:`static files storage classes <staticfiles-storages>` and specify the ``file_permissions_mode`` and/or ``directory_permissions_mode`` parameters, respectively. For example::
ru: По умолчанию, созданные файлы получают права доступа из :setting:`FILE_UPLOAD_PERMISSIONS`, а каталоги из :setting:`FILE_UPLOAD_DIRECTORY_PERMISSIONS`. Если вы хотите использовать другие права доступа для файлов и/или каталогов, вы можете создать дочерний класс :ref:`бэкенда статических файлов <staticfiles-storages>` и указать ``file_permissions_mode`` и/или ``directory_permissions_mode`` параметры соответственно. Например::

source: Then set the :setting:`STATICFILES_STORAGE` setting to ``'path.to.MyStaticFilesStorage'``.
ru: Теперь поменяйте настройку :setting:`STATICFILES_STORAGE` на ``'path.to.MyStaticFilesStorage'``.

source: Some commonly used options are:
ru: Обычно используются следующие параметры:

source: Do NOT prompt the user for input of any kind.
ru: Не запрашивать у пользователя ввод каких либо данных.

source: Ignore files or directories matching this glob-style pattern. Use multiple times to ignore more.
ru: Игнорировать файлы и каталоги подходящие под шаблон. Используйте несколько раз, если необходимо передать несколько шаблонов.

source: Do everything except modify the filesystem.
ru: Выполнить все операции, кроме тех, которые изменяют файловую систему.

source: Clear the existing files before trying to copy or link the original file.
ru: Удалить существующие файлы перед копированием новых.

source: Create a symbolic link to each file instead of copying.
ru: Создать символическую ссылку для каждого файла вместо копирования.

source: Don't call the :meth:`~django.contrib.staticfiles.storage.StaticFilesStorage.post_process` method of the configured :setting:`STATICFILES_STORAGE` storage backend.
ru: Не вызывать метод :meth:`~django.contrib.staticfiles.storage.StaticFilesStorage.post_process` указанного в :setting:`STATICFILES_STORAGE` бекенда для работы с файлами.

source: Don't ignore the common private glob-style patterns ``'CVS'``, ``'.*'`` and ``'*~'``.
ru: Не игнорировать файлы ``'CVS'``, ``'.*'`` and ``'*~'``(по умолчанию игнорируются).

source: For a full list of options, refer to the commands own help by running::
ru: Полный список параметров можно посмотреть выполнив::

source: Customizing the ignored pattern list
ru: Настойка списка шаблонов игнорирования

source: The default ignored pattern list, ``['CVS', '.*', '*~']``, can be customized in a more persistent way than providing the ``--ignore`` command option at each ``collectstatic`` invocation. Provide a custom :class:`~django.apps.AppConfig` class, override the ``ignore_patterns`` attribute of this class and replace ``'django.contrib.staticfiles'`` with that class path in your :setting:`INSTALLED_APPS` setting:
ru: Если вы не хотите при каждом вызове команды ``collectstatic`` использовать опцию ``--ignore`` или хотите изменить список шаблонов по умолчанию (``['CVS', '.*', '*~']``), нужно предоставить собственный класс :class:`~django.apps.AppConfig`. Переопределите атрибут ``ignore_patterns`` и замените ``'django.contrib.staticfiles'`` своим классом в настойке :setting:`INSTALLED_APPS`:

source: Searches for one or more relative paths with the enabled finders.
ru: Ищет файлы по указанному относительному пути(или путях) используя активные бэкенды для поиска файлов.

source: For example::
ru: Например::

source: By default, all matching locations are found. To only return the first match for each relative path, use the ``--first`` option::
ru: По умолчанию, выводятся все найденные файлы. Чтобы вернуть только первый найденный файл, используйте параметр ``--first``::

source: This is a debugging aid; it'll show you exactly which static file will be collected for a given path.
ru: Предназначена для отладки, чтобы понять какие файлы будут использоваться при сборе статики.

source: Use the ``--nostatic`` option to disable serving of static files with the :doc:`staticfiles </ref/contrib/staticfiles>` app entirely. This option is only available if the :doc:`staticfiles </ref/contrib/staticfiles>` app is in your project's :setting:`INSTALLED_APPS` setting.
ru: Используйте ``--nostatic`` чтобы отключить раздачу статических файлов через :doc:`staticfiles </ref/contrib/staticfiles>`. Опция доступна только если приложение :doc:`staticfiles </ref/contrib/staticfiles>` добавлено в :setting:`INSTALLED_APPS`.

source: Example usage::
ru: Пример использования::

source: Storages
ru: Бэкенды

source: A subclass of the :class:`~django.core.files.storage.FileSystemStorage` storage backend that uses the :setting:`STATIC_ROOT` setting as the base file system location and the :setting:`STATIC_URL` setting respectively as the base URL.
ru: Наследуется от :class:`~django.core.files.storage.FileSystemStorage`, используйте :setting:`STATIC_ROOT` как расположение файлов и :setting:`STATIC_URL` как основной URL.

source: This method is called by the :djadmin:`collectstatic` management command after each run and gets passed the local storages and paths of found files as a dictionary, as well as the command line options.
ru: Этот метод вызывается командой :djadmin:`collectstatic`, передается словарь из бэкендов и найденных файлов, а также параметры переданные при вызове команды.

source: The :class:`~django.contrib.staticfiles.storage.CachedStaticFilesStorage` uses this behind the scenes to replace the paths with their hashed counterparts and update the cache appropriately.
ru: :class:`~django.contrib.staticfiles.storage.CachedStaticFilesStorage` использует этот метод, чтобы подменить путь на хешированную версию и соответственно обновить кэш при необходимости.

source: A subclass of the :class:`~django.contrib.staticfiles.storage.StaticFilesStorage` storage backend which stores the file names it handles by appending the MD5 hash of the file's content to the filename. For example, the file ``css/styles.css`` would also be saved as ``css/styles.55e7cbb9ba48.css``.
ru: Подкласс :class:`~django.contrib.staticfiles.storage.StaticFilesStorage`, который кеширует файлы добавляя MD5 хеш содержимого файла к его названию. Например, файл ``css/styles.css`` будет сохранен как ``css/styles.55e7cbb9ba48.css``.

source: The purpose of this storage is to keep serving the old files in case some pages still refer to those files, e.g. because they are cached by you or a 3rd party proxy server. Additionally, it's very helpful if you want to apply `far future Expires headers`_ to the deployed files to speed up the load time for subsequent page visits.
ru: Этот бэкенд необходим, чтобы раздавать старые версии файлов, если они все еще используются некоторыми страницами, например, если страницы кэшированы вами или прокси-сервером. Также, это полезно при `большом значении заголовка Expires <http://developer.yahoo.com/performance/rules.html#expires>`_ для статических файлов, чтобы ускорить загрузку страниц.

source: The storage backend automatically replaces the paths found in the saved files matching other saved files with the path of the cached copy (using the :meth:`~django.contrib.staticfiles.storage.StaticFilesStorage.post_process` method). The regular expressions used to find those paths (``django.contrib.staticfiles.storage.HashedFilesMixin.patterns``) by default covers the `@import`_ rule and `url()`_ statement of `Cascading Style Sheets`_. For example, the ``'css/styles.css'`` file with the content
ru: Бэкенд автоматом заменяет пути, найденные в статических файлах, которые указывают на другие статические файлы, на кешированные версии (используя метод :meth:`~django.contrib.staticfiles.storage.StaticFilesStorage.post_process`). Регулярки, которые используются для этого (``django.contrib.staticfiles.storage.HashedFilesMixin.patterns``), по умолчанию заменяют `@import`_ и `url()`_ в `Cascading Style Sheets`_. Например, ``'css/styles.css'``, содержащий

source: would be replaced by calling the :meth:`~django.core.files.storage.Storage.url` method of the ``ManifestStaticFilesStorage`` storage backend, ultimately saving a ``'css/styles.55e7cbb9ba48.css'`` file with the following content:
ru: был бы заменен вызовом метода :meth:`~django.core.files.storage.Storage.url` бэкенда ``ManifestStaticFilesStorage``, и сохранен как ``'css/styles.55e7cbb9ba48.css'``, содержащий:

source: To enable the ``ManifestStaticFilesStorage`` you have to make sure the following requirements are met:
ru: Чтобы включить ``ManifestStaticFilesStorage``, необходимо выполнить следующие действия:

source: the :setting:`STATICFILES_STORAGE` setting is set to ``'django.contrib.staticfiles.storage.ManifestStaticFilesStorage'``
ru: указать в :setting:`STATICFILES_STORAGE` ``'django.contrib.staticfiles.storage.ManifestStaticFilesStorage'``

source: the :setting:`DEBUG` setting is set to ``False``
ru: установить :setting:`DEBUG` в ``False``

source: you've collected all your static files by using the :djadmin:`collectstatic` management command
ru: вы собрали статические файлы командой :djadmin:`collectstatic`

source: Since creating the MD5 hash can be a performance burden to your website during runtime, ``staticfiles`` will automatically store the mapping with hashed names for all processed files in a file called ``staticfiles.json``. This happens once when you run the :djadmin:`collectstatic` management command.
ru: Т.к. вычисление MD5 хеша может понизить производительность приложения, ``staticfiles`` автоматически сохраняет соответствия названий файлов с новыми в файле ``staticfiles.json``. Это выполняется один раз при вызове команды :djadmin:`collectstatic`.

source: Due to the requirement of running :djadmin:`collectstatic`, this storage typically shouldn't be used when running tests as ``collectstatic`` isn't run as part of the normal test setup. During testing, ensure that the :setting:`STATICFILES_STORAGE` setting is set to something else like ``'django.contrib.staticfiles.storage.StaticFilesStorage'`` (the default).
ru: Т.к. этот бэкенд требует выполнения :djadmin:`collectstatic`, его не следует использовать при тестах т.к. ``collectstatic`` не выполняется при запуске тестов. При тестировании укажите в настройках :setting:`STATICFILES_STORAGE` например ``'django.contrib.staticfiles.storage.StaticFilesStorage'`` (используется по умолчанию).

source: The method that is used when creating the hashed name of a file. Needs to return a hash for the given file name and content. By default it calculates a MD5 hash from the content's chunks as mentioned above. Feel free to override this method to use your own hashing algorithm.
ru: Метод, который вычисляет хеш для файла. Должен вернуть хеш названия и содержимого файла. По умолчанию вычисляет MD5 хеш содержимого файла, как описано выше. Вы можете переопределить этот метод и использовать собственный алгоритм хеширования.

source: ``CachedStaticFilesStorage`` is a similar class like the :class:`~django.contrib.staticfiles.storage.ManifestStaticFilesStorage` class but uses Django's :doc:`caching framework</topics/cache>` for storing the hashed names of processed files instead of a static manifest file called ``staticfiles.json``. This is mostly useful for situations in which you don't have access to the file system.
ru: ``CachedStaticFilesStorage`` аналогичен :class:`~django.contrib.staticfiles.storage.ManifestStaticFilesStorage`, но использует :doc:`кеш</topics/cache>` Django, для сохранения названий файлов, вместо ``staticfiles.json``. Это может быть полезно, если у вас нет доступа к файловой системе.

source: If you want to override certain options of the cache backend the storage uses, simply specify a custom entry in the :setting:`CACHES` setting named ``'staticfiles'``. It falls back to using the ``'default'`` cache backend.
ru: Если вы хотите настроить кеш, используйте запись в настройке :setting:`CACHES` с ключом ``'staticfiles'``. По умолчанию используется кеш ``'default'``.

source: Finders Module
ru: Модуль поиска файлов

source: ``staticfiles`` finders has a ``searched_locations`` attribute which is a list of directory paths in which the finders searched. Example usage::
ru: Модуль поиска файлов ``staticfiles`` содержит атрибут ``searched_locations``, который содержит список каталогов, где происходит поиск файлов. Например::

source: Other Helpers
ru: Дополнительные функции

source: There are a few other helpers outside of the :mod:`staticfiles <django.contrib.staticfiles>` app to work with static files:
ru: Есть дополнительные функции вне :mod:`staticfiles <django.contrib.staticfiles>` для работы со статическими файлами:

source: The :func:`django.template.context_processors.static` context processor which adds :setting:`STATIC_URL` to every template context rendered with :class:`~django.template.RequestContext` contexts.
ru: Контекстный процессор :func:`django.core.context_processors.static`, который добавляет :setting:`STATIC_URL` в контекст каждого шаблона отрендеренного с использованием :class:`~django.template.RequestContext`.

source: The builtin template tag :ttag:`get_static_prefix` which populates a template variable with the static prefix :setting:`STATIC_URL` to be used as a variable or directly.
ru: Шаблонный тег :ttag:`get_static_prefix`, который создает в шаблоне переменную или просто выводит значение :setting:`STATIC_URL`.

source: The similar template tag :ttag:`get_media_prefix` which works like :ttag:`get_static_prefix` but uses :setting:`MEDIA_URL`.
ru: Шаблонный тег :ttag:`get_media_prefix`, который работает как и :ttag:`get_static_prefix`, но для :setting:`MEDIA_URL`.

source: Static file development view
ru: Представления для разработки

source: The static files tools are mostly designed to help with getting static files successfully deployed into production. This usually means a separate, dedicated static file server, which is a lot of overhead to mess with when developing locally. Thus, the ``staticfiles`` app ships with a **quick and dirty helper view** that you can use to serve files locally in development.
ru: Инструменты для работой со статикой предназначены для простого развертывания на боевом сервере. Обычно это выделенный сервер, которые не практично использовать при разработке. Поэтому приложение ``staticfiles`` содержит простые представления для раздачи статики dev-сервером.

source: This view function serves static files in development.
ru: Представление, которое раздает статические файлы при разработке.

source: This view will only work if :setting:`DEBUG` is ``True``.
ru: Работает только при :setting:`DEBUG` равном ``True``.

source: That's because this view is **grossly inefficient** and probably **insecure**. This is only intended for local development, and should **never be used in production**.
ru: Потому что представление **крайне неэффективно** и возможно **небезопасно**. Оно предназначено для разработки и **никогда не должно использоваться на боевом сервере**.

source: To guess the served files' content types, this view relies on the :py:mod:`mimetypes` module from the Python standard library, which itself relies on the underlying platform's map files. If you find that this view doesn't return proper content types for certain files, it is most likely that the platform's map files need to be updated. This can be achieved, for example, by installing or updating the ``mailcap`` package on a Red Hat distribution, or ``mime-support`` on a Debian distribution.
ru: Для определения "content type" файлов, представление использует стандартный модуль Python :py:mod:`mimetypes`, который в свою очередь использует системную библиотеку типов файлов. Если представление использует не правильный "content type" файлов, скорее всего вам необходимо обновить системную библиотеку. Для Red Hat, например, это пакет ``mailcap``, или ``mime-support`` для Debian пакетов.

source: This view is automatically enabled by :djadmin:`runserver` (with a :setting:`DEBUG` setting set to ``True``). To use the view with a different local development server, add the following snippet to the end of your primary URL configuration::
ru: Это представление автоматически используется командой :djadmin:`runserver` (при :setting:`DEBUG` равном ``True``). Чтобы использовать его с другим dev-сервером, добавьте следующий код в настройки URL-ов::

source: Note, the beginning of the pattern (``r'^static/'``) should be your :setting:`STATIC_URL` setting.
ru: Обратите внимание, что начало URL-шаблона (``r'^static/'``) должно быть равным :setting:`STATIC_URL`.

source: Since this is a bit finicky, there's also a helper function that'll do this for you:
ru: Т.к. это все немного сложно, можно воспользоваться специальной функцией:

source: This will return the proper URL pattern for serving static files to your already defined pattern list. Use it like this::
ru: Это вернет правильный URL-шаблон для раздачи статических файлов. Используйте ее следующим образом::

source: This will inspect your :setting:`STATIC_URL` setting and wire up the view to serve static files accordingly. Don't forget to set the :setting:`STATICFILES_DIRS` setting appropriately to let ``django.contrib.staticfiles`` know where to look for files in addition to files in app directories.
ru: Этот код будет использовать значение настройки :setting:`STATIC_URL` для раздачи статических файлов. Не забывайте указать :setting:`STATICFILES_DIRS` чтобы ``django.contrib.staticfiles`` мог найти статические файлы.

source: This helper function will only work if :setting:`DEBUG` is ``True`` and your :setting:`STATIC_URL` setting is neither empty nor a full URL such as ``http://static.example.com/``.
ru: Эта функция работает только при :setting:`DEBUG` равном ``True``, настройка :setting:`STATIC_URL` не может быть пустой или полным URL-ом, таким как ``http://static.example.com/``.

source: Specialized test case to support 'live testing'
ru: Специальный test case для "живого тестирования"

source: This unittest TestCase subclass extends :class:`django.test.LiveServerTestCase`.
ru: Этот unittest TestCase является дочерним классом :class:`django.test.LiveServerTestCase`.

source: Just like its parent, you can use it to write tests that involve running the code under test and consuming it with testing tools through HTTP (e.g. Selenium, PhantomJS, etc.), because of which it's needed that the static assets are also published.
ru: Как и родительский класс, позволяет писать тесты с использованием Selenium, PhantomJS, и др., для которых необходим доступ к статическим файлам.

source: But given the fact that it makes use of the :func:`django.contrib.staticfiles.views.serve` view described above, it can transparently overlay at test execution-time the assets provided by the ``staticfiles`` finders. This means you don't need to run :djadmin:`collectstatic` before or as a part of your tests setup.
ru: Для раздачи статики использует :func:`django.contrib.staticfiles.views.serve`. Поэтому вам не нужно выполнять :djadmin:`collectstatic` перед запуском тестов.
