Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/topics/cache.po
Languages: ru

source: Django's cache framework
ru: Система кеширования Django

source: A fundamental trade-off in dynamic websites is, well, they're dynamic. Each time a user requests a page, the Web server makes all sorts of calculations -- from database queries to template rendering to business logic -- to create the page that your site's visitor sees. This is a lot more expensive, from a processing-overhead perspective, than your standard read-a-file-off-the-filesystem server arrangement.
ru: Главная хитрость современных веб сайтов в том, что они динамичные. Каждый раз, когда пользователь запрашивает страницу, веб сервер производит множество действий, от запросов к базе данных до обработки шаблонов, чтобы создать страницу, которую увидит посетитель вашего сайта. Это требует больше затрат, с точки зрения использования ресурсов, чем статичная выдача файла с файловой системы.

source: For most Web applications, this overhead isn't a big deal. Most Web applications aren't ``washingtonpost.com`` or ``slashdot.org``; they're simply small- to medium-sized sites with so-so traffic. But for medium- to high-traffic sites, it's essential to cut as much overhead as possible.
ru: Для большинства веб приложений такие лишние вычисления не особо заметны. Эти приложения не являются сайтами ``washingtonpost.com`` или ``slashdot.org``. Это сайты небольшого или среднего размера с небольшим трафиком. Но для более крупных сайтов становится очень важна экономия ресурсов.

source: That's where caching comes in.
ru: С этого момента в дело вступает кеширование.

source: To cache something is to save the result of an expensive calculation so that you don't have to perform the calculation next time. Here's some pseudocode explaining how this would work for a dynamically generated Web page::
ru: Кеширование означает сохранение результатов дорогостоящего вычисления, чтобы избежать его повторного вычисления в следующий раз. Ниже представлен псевдокод объясняющий как работает кеширование для динамически созданной веб страницы::

source: Django comes with a robust cache system that lets you save dynamic pages so they don't have to be calculated for each request. For convenience, Django offers different levels of cache granularity: You can cache the output of specific views, you can cache only the pieces that are difficult to produce, or you can cache your entire site.
ru: Django поставляется с надёжной системой кеширования, которая позволяет вам сохранять динамические страницы так, что не потребуется их создавать для каждого запроса. Для удобства, Django даёт возможность тонкого управления уровнем кеширования: вы можете кешировать результат работы представления, вы можете кешировать только те куски, которые трудно вычислять или вы можете кешировать весь ваш сайт.

source: Django also works well with "downstream" caches, such as `Squid <http://www.squid-cache.org>`_ and browser-based caches. These are the types of caches that you don't directly control but to which you can provide hints (via HTTP headers) about which parts of your site should be cached, and how.
ru: Django также может работать с «даунстрим» кешами, такими как `Squid <http://www.squid-cache.org>`_ и кешами браузеров. Это такие типы кешей, которые вы не можете контролировать напрямую, но можете определять их поведение подсказками (через HTTP заголовки) о том, какую часть вашего сайта следует кешировать и как.

source: The :ref:`Cache Framework design philosophy <cache-design-philosophy>` explains a few of the design decisions of the framework.
ru: :ref:`Философия дизайна кеширующих фреймворков <cache-design-philosophy>` объясняет некоторые дизайн решения фреймворка.

source: Setting up the cache
ru: Настройка кеша

source: The cache system requires a small amount of setup. Namely, you have to tell it where your cached data should live -- whether in a database, on the filesystem or directly in memory. This is an important decision that affects your cache's performance; yes, some cache types are faster than others.
ru: Система кеширования требует небольшой настройки. А именно, надо указать где должны располагаться закешированные данные -- в базе данных, на файловой системе или прямо в памяти. Это важное решение, которое повлияет на производительность вашего кеша. Да, типы кешей различаются по скорости работы.

source: Your cache preference goes in the :setting:`CACHES` setting in your settings file. Here's an explanation of all available values for :setting:`CACHES`.
ru: Настройки кеша определяются параметром конфигурации :setting:`CACHES`. Ниже приведено объяснение всех возможных значений этого параметра.

source: The fastest, most efficient type of cache supported natively by Django, Memcached__ is an entirely memory-based cache server, originally developed to handle high loads at LiveJournal.com and subsequently open-sourced by Danga Interactive. It is used by sites such as Facebook and Wikipedia to reduce database access and dramatically increase site performance.
ru: Самый быстрый и эффективный тип кеша, доступный Django, `Memcached <http://memcached.org/>`_ является кешем, который полностью располагается в оперативной памяти, он был разработан для LiveJournal.com и позднее переведён в опенсорс компанией Danga Interactive. Он используется такими сайтами как Facebook и Wikipedia для снижения нагрузки на базу данных и значительного увеличения производительности сайта.

source: Memcached runs as a daemon and is allotted a specified amount of RAM. All it does is provide a fast interface for adding, retrieving and deleting data in the cache. All data is stored directly in memory, so there's no overhead of database or filesystem usage.
ru: Memcached работает как демон и захватывает определённый объём оперативной памяти. Его задачей является представление быстрого интерфейса для добавления, получения и удаления определённых данных в кеше. Все данные хранятся прямо в оперативной памяти, таким образом нет никакой дополнительной нагрузки на базу данных или файловую систему.

source: After installing Memcached itself, you'll need to install a Memcached binding. There are several Python Memcached bindings available; the two most common are `python-memcached`_ and `pylibmc`_.
ru: После установкам самого Memcached, следует установить его пакет для Python. Существует несколько таких пакетов; два наиболее используемых — `python-memcached`_ и `pylibmc`_.

source: To use Memcached with Django:
ru: Для использования Memcached с Django:

source: Set :setting:`BACKEND <CACHES-BACKEND>` to ``django.core.cache.backends.memcached.MemcachedCache`` or ``django.core.cache.backends.memcached.PyLibMCCache`` (depending on your chosen memcached binding)
ru: Установите :setting:`BACKEND <CACHES-BACKEND>` в ``django.core.cache.backends.memcached.MemcachedCache`` или ``django.core.cache.backends.memcached.PyLibMCCache`` (зависит от выбранного пакета).

source: Set :setting:`LOCATION <CACHES-LOCATION>` to ``ip:port`` values, where ``ip`` is the IP address of the Memcached daemon and ``port`` is the port on which Memcached is running, or to a ``unix:path`` value, where ``path`` is the path to a Memcached Unix socket file.
ru: Определите для :setting:`LOCATION <CACHES-LOCATION>` значение ``ip:port`` (где ``ip`` — это IP адрес, на котором работает демон Memcached, ``port`` — его порт) или ``unix:path`` (где ``path`` является путём к файлу-сокету Memcached).

source: In this example, Memcached is running on localhost (127.0.0.1) port 11211, using the ``python-memcached`` binding::
ru: В этом примере Memcached запущен на localhost (127.0.0.1) порт 11211, используя ``python-memcached``::

source: In this example, Memcached is available through a local Unix socket file :file:`/tmp/memcached.sock` using the ``python-memcached`` binding::
ru: В этом примере Memcached доступен через локальный файл-сокет :file:`/tmp/memcached.sock`, используя ``python-memcached``::

source: When using the ``pylibmc`` binding, do not include the ``unix:/`` prefix::
ru: При использовании ``pylibmc``, не включайте префикс ``unix:/``::

source: One excellent feature of Memcached is its ability to share a cache over multiple servers. This means you can run Memcached daemons on multiple machines, and the program will treat the group of machines as a *single* cache, without the need to duplicate cache values on each machine. To take advantage of this feature, include all server addresses in :setting:`LOCATION <CACHES-LOCATION>`, either as a semicolon or comma delimited string, or as a list.
ru: Одной из замечательных особенностей Memcached является возможность распределять кеш по нескольким серверам. Это означает, что вы можете запустить демоны Memcached на нескольких машинах и программа будет рассматривать эту группу машин как *единый* кеш, без необходимости копирования всех значений кеша на каждую машину. Для того, чтобы воспользоваться этой особенностью, укажите адреса всех машин в :setting:`LOCATION <CACHES-LOCATION>`, в виде списка или строки, разделённой запятыми.

source: In this example, the cache is shared over Memcached instances running on IP address 172.19.26.240 and 172.19.26.242, both on port 11211::
ru: В данном примере, кеш распределён по экземплярам Memcached, работающим на IP адресах 172.19.26.240 и 172.19.26.242, на порту 11211 оба::

source: In the following example, the cache is shared over Memcached instances running on the IP addresses 172.19.26.240 (port 11211), 172.19.26.242 (port 11212), and 172.19.26.244 (port 11213)::
ru: В следующем примере, кеш распределён по экземплярам Memcached, работающим на IP адресах 172.19.26.240 (порт 11211), 172.19.26.242 (порт 11212) и на 172.19.26.244 (порт 11213)::

source: A final point about Memcached is that memory-based caching has a disadvantage: because the cached data is stored in memory, the data will be lost if your server crashes. Clearly, memory isn't intended for permanent data storage, so don't rely on memory-based caching as your only data storage. Without a doubt, *none* of the Django caching backends should be used for permanent storage -- they're all intended to be solutions for caching, not storage -- but we point this out here because memory-based caching is particularly temporary.
ru: В конце рассказа о Memcached следует сказать, что этот тип кеша имеет один недостаток: кеш располагается в оперативной памяти и уничтожается при сбое сервера. Очевидно, что оперативная память не предназначена для постоянного хранения информации, поэтому не следует на неё рассчитывать в этом смысле. Несомненно, *ни один* из модулей кеширования не должен использоваться как постоянное хранилище — они предназначены для кеширования, не для хранения — мы особенно это отмечаем для данного типа кеша.

source: Database caching
ru: Кеширование в базу данных

source: Django can store its cached data in your database. This works best if you've got a fast, well-indexed database server.
ru: Кеширование в базу данных отлично работает в случае, если у вас есть быстрый сервер баз данных с поддержкой индексирования.

source: To use a database table as your cache backend:
ru: Для использования таблицы базы данных в качестве бекенда кеша:

source: Set :setting:`BACKEND <CACHES-BACKEND>` to ``django.core.cache.backends.db.DatabaseCache``
ru: Установите :setting:`BACKEND <CACHES-BACKEND>` в ``django.core.cache.backends.db.DatabaseCache``

source: Set :setting:`LOCATION <CACHES-LOCATION>` to ``tablename``, the name of the database table. This name can be whatever you want, as long as it's a valid table name that's not already being used in your database.
ru: Установите :setting:`LOCATION <CACHES-LOCATION>` в ``tablename``, имя таблицы базы данных. Это имя может быть любым, пока оно не противоречит правилам именования таблиц в вашей базе данных и не занято другой таблицей.

source: In this example, the cache table's name is ``my_cache_table``::
ru: В данном примере, именем таблицы для кеша будет ``my_cache_table``::

source: Creating the cache table
ru: Создание таблицы для кеша

source: Before using the database cache, you must create the cache table with this command::
ru: Для того, чтобы использовать таблицу базы данных в качестве кеша, сначала надо её создать с помощью следующей команды::

source: This creates a table in your database that is in the proper format that Django's database-cache system expects. The name of the table is taken from :setting:`LOCATION <CACHES-LOCATION>`.
ru: В результате в базе данных будет создана таблица, структура которой соответствует ожиданиям системы кеширования. Имя для таблицы будет взято из параметра :setting:`LOCATION <CACHES-LOCATION>`.

source: If you are using multiple database caches, :djadmin:`createcachetable` creates one table for each cache.
ru: При использовании нескольких БД кешей, команда :djadmin:`createcachetable` создаст по одной таблице для каждого кеша.

source: If you are using multiple databases, :djadmin:`createcachetable` observes the ``allow_migrate()`` method of your database routers (see below).
ru: Если вы используете множество баз данных, то команда :djadmin:`createcachetable` обратится к методу ``allow_migrate()`` роутера вашей базы данных (см. далее).

source: Like :djadmin:`migrate`, :djadmin:`createcachetable` won't touch an existing table. It will only create missing tables.
ru: Аналогично команде :djadmin:`migrate`, команда :djadmin:`createcachetable` не внесёт изменения в существующую таблицу. Она создаёт только отсутствующие таблицы.

source: To print the SQL that would be run, rather than run it, use the :option:`createcachetable --dry-run` option.
ru: Чтобы вывести SQL, который был бы выполнен, без его выполнения, используйте опцию :option:`createcachetable --dry-run`.

source: Multiple databases
ru: Множество баз данных

source: If you use database caching with multiple databases, you'll also need to set up routing instructions for your database cache table. For the purposes of routing, the database cache table appears as a model named ``CacheEntry``, in an application named ``django_cache``. This model won't appear in the models cache, but the model details can be used for routing purposes.
ru: Если у вас несколько баз данных и вы планируете использовать кеширование, потребуется прописать инструкции роутинга для таблицы кеширования. В целях роутинга таблица кеширования представлена моделью ``CacheEntry`` в приложении ``django_cache``. Эта модель не отобразится в модельном кеше, но содержимое модели может быть использовано для роутинга.

source: For example, the following router would direct all cache read operations to ``cache_replica``, and all write operations to ``cache_primary``. The cache table will only be synchronized onto ``cache_primary``::
ru: Например, представленный ниже роутер будет перенаправлять все операции чтения из кеша на ``cache_replica``, а всё операции записи на ``cache_primary``. Таблица кеширования будет синхронизироваться только с ``cache_primary``::

source: If you don't specify routing directions for the database cache model, the cache backend will use the ``default`` database.
ru: Если вы не настроите роутинг для кеширования, то модуль кеширования будет использовать базу ``default``.

source: Of course, if you don't use the database cache backend, you don't need to worry about providing routing instructions for the database cache model.
ru: Естественно, если вы не используете базу данных для кеша, вам не надо беспокоиться об инструкциях роутинга.

source: Filesystem caching
ru: Кеширование в файловую систему

source: The file-based backend serializes and stores each cache value as a separate file. To use this backend set :setting:`BACKEND <CACHES-BACKEND>` to ``"django.core.cache.backends.filebased.FileBasedCache"`` and :setting:`LOCATION <CACHES-LOCATION>` to a suitable directory. For example, to store cached data in ``/var/tmp/django_cache``, use this setting::
ru: Файловый бекенд сериализует и сохраняет каждое закешированное значение в отдельном файле. Для использования этого бекенда, установите :setting:`BACKEND <CACHES-BACKEND>` в ``"django.core.cache.backends.filebased.FileBasedCache"``, а для :setting:`LOCATION <CACHES-LOCATION>` укажите подходящий каталог. Например, для хранения закешированных данных в ``/var/tmp/django_cache``, используйте такую настройку::

source: If you're on Windows, put the drive letter at the beginning of the path, like this::
ru: Если вы используете Windows, то подставьте букву диска в начало пути, вот так::

source: The directory path should be absolute -- that is, it should start at the root of your filesystem. It doesn't matter whether you put a slash at the end of the setting.
ru: Путь к каталогу должен быть абсолютным, т.е. он должен начинаться с корня файловой системы. Завершающий слэш не имеет значения.

source: Make sure the directory pointed-to by this setting exists and is readable and writable by the system user under which your Web server runs. Continuing the above example, if your server runs as the user ``apache``, make sure the directory ``/var/tmp/django_cache`` exists and is readable and writable by the user ``apache``.
ru: Следует удостовериться, что указанный каталог существует и доступен для чтения и записи для пользователя, от которого работает ваш веб сервер. Продолжая предыдущий пример, если ваш веб сервер запущен от пользователя ``apache``, проверьте, что каталог ``/var/tmp/django_cache`` существует и доступен для чтения и записи пользователю ``apache``.

source: Local-memory caching
ru: Кеширование в оперативной памяти

source: This is the default cache if another is not specified in your settings file. If you want the speed advantages of in-memory caching but don't have the capability of running Memcached, consider the local-memory cache backend. This cache is per-process (see below) and thread-safe. To use it, set :setting:`BACKEND <CACHES-BACKEND>` to ``"django.core.cache.backends.locmem.LocMemCache"``. For example::
ru: Это стандартный кеш, который применяется, если другой не определён в вашем файле конфигурации. Если вам требуется высокая скорость работы кеша, но у вас нет возможности развернуть Memcached, рассмотрите вариант использования кеша в оперативной памяти. Этот кеш по-процессный (см. далее) и потокобезопасный. Для его использования надо параметру конфигурации :setting:`BACKEND <CACHES-BACKEND>` присвоить значение ``"django.core.cache.backends.locmem.LocMemCache"``. Например::

source: The cache :setting:`LOCATION <CACHES-LOCATION>` is used to identify individual memory stores. If you only have one ``locmem`` cache, you can omit the :setting:`LOCATION <CACHES-LOCATION>`; however, if you have more than one local memory cache, you will need to assign a name to at least one of them in order to keep them separate.
ru: Параметр конфигурации :setting:`LOCATION <CACHES-LOCATION>` используется для идентификации отдельных хранилищ в памяти. Если у вас только один такой кеш, то вы можете пропустить этот параметр. Однако, в случае нескольких кешей, вам потребуется назначить имя хотя бы для одного из них, для их различия.

source: Note that each process will have its own private cache instance, which means no cross-process caching is possible. This obviously also means the local memory cache isn't particularly memory-efficient, so it's probably not a good choice for production environments. It's nice for development.
ru: Следует отметить, что каждый процесс будет работать со своим собственным экземпляром кеша, что означает невозможность разделения одного кеша между процессами. Это означает, что кеш данного типа неэкономно использует оперативную память и, возможно, не будет хорошим выбором для боевого окружения. Он хорош на время разработки.

source: Dummy caching (for development)
ru: Псевдокеширование (для разработки)

source: Finally, Django comes with a "dummy" cache that doesn't actually cache -- it just implements the cache interface without doing anything.
ru: Наконец, Django поставляется с «псевдо» кешем, который не выполняет собственно кеширование. Он просто реализует интерфейс кеша, не делая больше ничего.

source: This is useful if you have a production site that uses heavy-duty caching in various places but a development/test environment where you don't want to cache and don't want to have to change your code to special-case the latter. To activate dummy caching, set :setting:`BACKEND <CACHES-BACKEND>` like so::
ru: Он полезен в случае, когда у вас есть боевой сайт , который плотно использует кеширование в различных местах, а также окружение разработки или тестирование, где кешировать ничего не надо. Для активации псевдо кеширования, установите :setting:`BACKEND <CACHES-BACKEND>`::

source: Using a custom cache backend
ru: Использование собственного модуля кеширования

source: While Django includes support for a number of cache backends out-of-the-box, sometimes you might want to use a customized cache backend. To use an external cache backend with Django, use the Python import path as the :setting:`BACKEND <CACHES-BACKEND>` of the :setting:`CACHES` setting, like so::
ru: Несмотря на то, что Django предоставляет ряд модулей кеширования, вам может потребоваться использовать свой кеширующий модуль. Для подключения внешнего кеширующего модуля используйте путь до него в качестве значения :setting:`BACKEND <CACHES-BACKEND>` параметра конфигурации :setting:`CACHES`, вот так::

source: If you're building your own backend, you can use the standard cache backends as reference implementations. You'll find the code in the ``django/core/cache/backends/`` directory of the Django source.
ru: При создании своего кеширующего модуля вы можете использовать стандартные модули в качестве примера. Их код располагается в каталоге ``django/core/cache/backends/`` исходного кода Django.

source: Note: Without a really compelling reason, such as a host that doesn't support them, you should stick to the cache backends included with Django. They've been well-tested and are easy to use.
ru: Следует отметить, если нет важной причины для использования собственного кеширующего модуля, вы должны использовать кеширующие модули, поставляемые с Django. Они протестированы и просты в использовании.

source: Cache arguments
ru: Параметры кеша

source: Each cache backend can be given additional arguments to control caching behavior. These arguments are provided as additional keys in the :setting:`CACHES` setting. Valid arguments are as follows:
ru: После определения типа кеша и имени для каждого из них, для каждого модуля можно указать дополнительные аргументы для управления поведением кеша. Эти аргументы представляются в виде дополнительных ключей в параметре конфигурации :setting:`CACHES`. Приведём список допустимых аргументов:

source: :setting:`TIMEOUT <CACHES-TIMEOUT>`: The default timeout, in seconds, to use for the cache. This argument defaults to ``300`` seconds (5 minutes). You can set ``TIMEOUT`` to ``None`` so that, by default, cache keys never expire. A value of ``0`` causes keys to immediately expire (effectively "don't cache").
ru: :setting:`TIMEOUT <CACHES-TIMEOUT>`: время устаревания кеша по умолчанию, в секундах. По умолчанию ``300`` секунд (5 минут). Вы можете установить ``TIMEOUT`` в ``None``, тогда кеш никогда не устареет. Если указать ``0``, все ключи будут сразу устаревать (таким образом можно заставить "не кешировать").

source: :setting:`OPTIONS <CACHES-OPTIONS>`: Any options that should be passed to the cache backend. The list of valid options will vary with each backend, and cache backends backed by a third-party library will pass their options directly to the underlying cache library.
ru: :setting:`OPTIONS <CACHES-OPTIONS>`: Любая опция, которая должна быть передана модулю. Список допустимых опций варьируется от модуля к модулю и передается непосредственно в библиотеку для кеширования.
