Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/topics/cache.po
Languages: ru

source: If the named key does not exist, ``InvalidCacheBackendError`` will be raised.
ru: Если указанного именованного ключа не существует, то будет вызвано исключение ``InvalidCacheBackendError``.

source: To provide thread-safety, a different instance of the cache backend will be returned for each thread.
ru: Для обеспечения потоковой независимости, каждый поток будет получать разные экземпляры бекенда кеша.

source: As a shortcut, the default cache is available as ``django.core.cache.cache``::
ru: Для простоты, стандартный кеш доступен через ``django.core.cache.cache``::

source: This object is equivalent to ``caches['default']``.
ru: Этот объект эквивалентен ``caches['default']``.

source: Basic usage
ru: Использование

source: The basic interface is ``set(key, value, timeout)`` and ``get(key)``::
ru: Основной интерфейс прост: ``set(key, value, timeout)`` и ``get(key)``::

source: ``key`` should be a ``str``, and ``value`` can be any picklable Python object.
ru: ``key`` должен быть ``str``, а ``value`` - любым сериализируемым обьектом.

source: The ``timeout`` argument is optional and defaults to the ``timeout`` argument of the appropriate backend in the :setting:`CACHES` setting (explained above). It's the number of seconds the value should be stored in the cache. Passing in ``None`` for ``timeout`` will cache the value forever. A ``timeout`` of ``0`` won't cache the value.
ru: Аргумент ``timeout`` является необязательным и обычно равен аргументу ``timeout`` соответствующего бекенда кеша из параметре конфигурации :setting:`CACHES` (читайте выше). Аргумент определяет период в секундах, в течение которого значение должно храниться в кеше. Передав ``None`` в ``timeout`` можно закешировать данные навсегда. При ``timeout`` равном ``0`` значение никогда не будет кешироваться.

source: If the object doesn't exist in the cache, ``cache.get()`` returns ``None``::
ru: Если объект отсутствует в кеше, то ``cache.get()`` возвращает ``None``::

source: We advise against storing the literal value ``None`` in the cache, because you won't be able to distinguish between your stored ``None`` value and a cache miss signified by a return value of ``None``.
ru: Мы не советуем хранить в кеше литеральное значение ``None``, так как вы не сможете определить разницу между сохранённым значением ``None`` и отсутствием значения в кеше, о чём сигнализирует возвращение значения ``None``.

source: ``cache.get()`` can take a ``default`` argument. This specifies which value to return if the object doesn't exist in the cache::
ru: Метод ``cache.get()`` принимает аргумент ``default``. Он определяет значение, которое будет возвращено, если указанного объекта нет в кеше::

source: To add a key only if it doesn't already exist, use the ``add()`` method. It takes the same parameters as ``set()``, but it will not attempt to update the cache if the key specified is already present::
ru: Для того, чтобы добавить элемент в кеш только в случае, когда его там нет, следует использовать метод ``add()``. Он принимает такие же параметры, как и метод ``set()``, но не будет пытаться изменить значение, если оно уже присутствует в кеше::

source: If you need to know whether ``add()`` stored a value in the cache, you can check the return value. It will return ``True`` if the value was stored, ``False`` otherwise.
ru: Если вам надо определить сохранил ли метод ``add()`` значение в кеше, вы можете проверить значение, которое он возвращает. ``True`` указывает, что значение было сохранено, а ``False`` -- наоборот.

source: If you want to get a key's value or set a value if the key isn't in the cache, there is the ``get_or_set()`` method. It takes the same parameters as ``get()`` but the default is set as the new cache value for that key, rather than simply returned::
ru: Если вы хотите получить значение ключа, или установить его, если ключа нет в кеше, используйте метод ``get_or_set()``. Принимает аргументы аналогичные ``get()``, но ``default`` также записывается в кеш::

source: You can also pass any callable as a *default* value::
ru: Вы также можете передать функцию как значение *по умолчанию*::

source: There's also a ``get_many()`` interface that only hits the cache once. ``get_many()`` returns a dictionary with all the keys you asked for that actually exist in the cache (and haven't expired)::
ru: С помощью методы ``get_many()`` можно получить ряд значений из кеша за один запрос. Этот метод возвращает словарь со всеми запрошенными ключами, которые действительно присутствуют в кеше (и имеют актуальный срок действия)::

source: To set multiple values more efficiently, use ``set_many()`` to pass a dictionary of key-value pairs::
ru: Для эффективного кеширования множества значений следует использовать метод ``set_many()``, который принимает словарь ключей и их значений::

source: Like ``cache.set()``, ``set_many()`` takes an optional ``timeout`` parameter.
ru: Аналогично методу ``cache.set()``, метод ``set_many()`` принимает необязательный параметр ``timeout``.

source: On supported backends (memcached), ``set_many()`` returns a list of keys that failed to be inserted.
ru: В поддерживаемых бекендах (memcached) set_many () возвращает список ключей, которые не были вставлены.

source: The return value containing list of failing keys was added.
ru: Возвращаемое значение содержит список ключей, которые не были добавлены.

source: You can delete keys explicitly with ``delete()``. This is an easy way of clearing the cache for a particular object::
ru: Вы можете явно удалять значения из кеша с помощью метода ``delete()``. Это простейший способ очистки кеша для определённого объекта::

source: If you want to clear a bunch of keys at once, ``delete_many()`` can take a list of keys to be cleared::
ru: Для одновременного удаления множества значений надо использовать метод ``delete_many()``, который принимает список ключей, подлежащих удалению::

source: Finally, if you want to delete all the keys in the cache, use ``cache.clear()``. Be careful with this; ``clear()`` will remove *everything* from the cache, not just the keys set by your application. ::
ru: Наконец, для полной очистки кеша надо использовать метод ``cache.clear()``. Будьте осторожными с этим методом. Метод удаляет из кеша *всё*, не только ключи, установленные вашим приложением. ::

source: You can also increment or decrement a key that already exists using the ``incr()`` or ``decr()`` methods, respectively. By default, the existing cache value will be incremented or decremented by 1. Other increment/decrement values can be specified by providing an argument to the increment/decrement call. A ValueError will be raised if you attempt to increment or decrement a nonexistent cache key.::
ru: Вы также можете увеличивать или уменьшать значение ключа, находящегося в кеше, с помощью методов ``incr()`` или ``desc()`` соответственно. По-умолчанию, значение в кеше будет увеличено или уменьшено на единицу. Другой шаг изменения величины может быть указан с помощью соответствующего аргумента методов. При попытке изменения несуществующего в кеше значения будет выброшено исключение ``ValueError``.:

source: ``incr()``/``decr()`` methods are not guaranteed to be atomic. On those backends that support atomic increment/decrement (most notably, the memcached backend), increment and decrement operations will be atomic. However, if the backend doesn't natively provide an increment/decrement operation, it will be implemented using a two-step retrieve/update.
ru: Методы ``incr()`` и ``decr()`` не гарантируют атомарность операции. Тут всё зависит от бекенда. К примеру, Memcached гарантирует атомарность этих операций. Другие бекенды делают это через двойную операцию считывания и сохранения нового значения.

source: You can close the connection to your cache with ``close()`` if implemented by the cache backend.
ru: Можно закрыть подключение к кешу методом ``close()``, если бекенд кеширования предоставляет его.

source: For caches that don't implement ``close`` methods it is a no-op.
ru: Если кеш не реализует метод ``close``, он будет пустым.

source: Cache key prefixing
ru: Прификсы ключей кеша

source: If you are sharing a cache instance between servers, or between your production and development environments, it's possible for data cached by one server to be used by another server. If the format of cached data is different between servers, this can lead to some very hard to diagnose problems.
ru: Если ваш кеш разделяется между несколькими серверами или между окружениями разработки и продакшена, возможна ситуация, когда данные, закешированные одним сервером, будут использованы другим сервером. Если формат закешированных данных различен между серверами, то это может привести к трудно выявляемым проблемам.

source: To prevent this, Django provides the ability to prefix all cache keys used by a server. When a particular cache key is saved or retrieved, Django will automatically prefix the cache key with the value of the :setting:`KEY_PREFIX <CACHES-KEY_PREFIX>` cache setting.
ru: Чтобы избежать такой ситуации, Django предоставляет возможность назначения префиксов для всех ключей кеша, используемых сервером. При работе с ключом Django автоматически добавляет к нему префикс, определённый параметром конфигурации :setting:`KEY_PREFIX <CACHES-KEY_PREFIX>`.

source: By ensuring each Django instance has a different :setting:`KEY_PREFIX <CACHES-KEY_PREFIX>`, you can ensure that there will be no collisions in cache values.
ru: Назначив различные префиксы для каждого экземпляра Django с помощью параметра конфигурации :setting:`KEY_PREFIX <CACHES-KEY_PREFIX>`, вы гарантируете отсутствие коллизий в значениях кеша.

source: Cache versioning
ru: Версионирование кеша

source: When you change running code that uses cached values, you may need to purge any existing cached values. The easiest way to do this is to flush the entire cache, but this can lead to the loss of cache values that are still valid and useful.
ru: При изменении работающего кода, который использует закешированные значения, может потребоваться сброс всех закешированных данных. Простым способом является отчистка всего кеша, но это может привести к потере закешированных данных, которые всё ещё верны и полезны.

source: Django provides a better way to target individual cache values. Django's cache framework has a system-wide version identifier, specified using the :setting:`VERSION <CACHES-VERSION>` cache setting. The value of this setting is automatically combined with the cache prefix and the user-provided cache key to obtain the final cache key.
ru: Django предоставляет отличный способ выделения отдельных значений в кеше. Система кеширования Django обладает глобальным идентификатором версии, определённым в параметре кеша :setting:`VERSION <CACHES-VERSION>`. Значение этого параметра автоматически объединяется с префиксом кеша и пользователем, которые предоставил ключ, получая итоговый ключ для обращения к кешу.

source: By default, any key request will automatically include the site default cache key version. However, the primitive cache functions all include a ``version`` argument, so you can specify a particular cache key version to set or get. For example::
ru: По-умолчанию, запрос любого ключа из кеша автоматически использует текущую версию кеша для сайта. Однако, простейшие функции для работы с кешем принимают аргумент ``version`` и вы можете указывать конкретную версию кеша. Например::

source: The version of a specific key can be incremented and decremented using the ``incr_version()`` and ``decr_version()`` methods. This enables specific keys to be bumped to a new version, leaving other keys unaffected. Continuing our previous example::
ru: Версия нужного ключа может быть увеличена или уменьшена с помощью методов ``incr_version()`` и ``decr_version()``. Эти методы позволяет изменять версии нужных ключей, не затрагивая остальные ключи. Продолжая наш предыдущий пример::

source: Cache key transformation
ru: Преобразование ключа кеша

source: As described in the previous two sections, the cache key provided by a user is not used verbatim -- it is combined with the cache prefix and key version to provide a final cache key. By default, the three parts are joined using colons to produce a final string::
ru: Как описано в предыдущих двух разделах, система кеширования никогда не использует напрямую ключ, предоставленный пользователем. Ключ всегда комбинируется с префиксом кеша и версией ключа. По-умолчанию, эти три части объединяются через двоеточия, создавая итоговый ключ::

source: If you want to combine the parts in different ways, or apply other processing to the final key (e.g., taking a hash digest of the key parts), you can provide a custom key function.
ru: Если вам потребуется объединить эти части другим способом или создать ключ другим способом (т.е. приняв хеш ключа за сам ключ), вы можете указать функцию, которая будет выполнять эту работу.

source: The :setting:`KEY_FUNCTION <CACHES-KEY_FUNCTION>` cache setting specifies a dotted-path to a function matching the prototype of ``make_key()`` above. If provided, this custom key function will be used instead of the default key combining function.
ru: Параметр кеша :setting:`KEY_FUNCTION <CACHES-KEY_FUNCTION>` определяет путь в точечной нотации к функции, соответствующей прототипу ``make_key()`` из предыдущего примера. При наличии такой функции она будет использоваться вместо стандартной функции построения итогового ключа.

source: Cache key warnings
ru: Предупреждения о проблемах с ключами

source: Memcached, the most commonly-used production cache backend, does not allow cache keys longer than 250 characters or containing whitespace or control characters, and using such keys will cause an exception. To encourage cache-portable code and minimize unpleasant surprises, the other built-in cache backends issue a warning (``django.core.cache.backends.base.CacheKeyWarning``) if a key is used that would cause an error on memcached.
ru: Memcached, наиболее используемый в продакшене бекенд кеширования, не поддерживает ключи длиной более 250 символов или содержащих пробелы или управляющие символы. Использование таких ключей приводит к вызову исключения. Для обеспечения уверенности в портируемости кода между кеширующими бекендами и для уменьшения количества неприятных сюрпризов, другие встроенные кеширующие бекенды выбрасывают предупреждение (``django.core.cache.backends.base.CacheKeyWarning``), если используемый ключ может привести к ошибке при работе с Memcached.

source: If you are using a production backend that can accept a wider range of keys (a custom backend, or one of the non-memcached built-in backends), and want to use this wider range without warnings, you can silence ``CacheKeyWarning`` with this code in the ``management`` module of one of your :setting:`INSTALLED_APPS`::
ru: Если вы используете на продакшене кеширующий бекенд, который может принимать широкий диапазон ключей (собственный бекенд или один из встроенных бекендов, кроме Memcached), и не желаете видеть подобные предупреждения, вы можете заглушить ``CacheKeyWarning`` с помощью следующего кода в модуле ``management`` одного из ваших приложений::

source: If you want to instead provide custom key validation logic for one of the built-in backends, you can subclass it, override just the ``validate_key`` method, and follow the instructions for `using a custom cache backend`_. For instance, to do this for the ``locmem`` backend, put this code in a module::
ru: Если вам требуется изменить логику проверки ключа для одного из встроенных бекендов кеширования, вы можете унаследовать свой класс от него и переопределить метод ``validate_key``. Затем следуйте инструкциям :ref:`по использованию собственного бекенда кеширования <using-a-custom-cache-backend>`. Например, для реализации подобного для бекенда ``locmem``, поместите следующий код в модуль::

source: ...and use the dotted Python path to this class in the :setting:`BACKEND <CACHES-BACKEND>` portion of your :setting:`CACHES` setting.
ru: ...и используйте путь в точечной нотации к этому классу в ключе :setting:`BACKEND <CACHES-BACKEND>` параметра конфигурации :setting:`CACHES`.

source: Downstream caches
ru: "Даунстрим" кеши

source: So far, this document has focused on caching your *own* data. But another type of caching is relevant to Web development, too: caching performed by "downstream" caches. These are systems that cache pages for users even before the request reaches your website.
ru: До этого момента данный документ описывал кеширование ваших *собственных* данных. Но есть ещё один тип кеширования, относящийся к веб разработке: кеширование, выполняемое "даунстрим" кешами. Это такие системы, которые кешируют страницы для пользователей так, что они даже не обращаются к вашему сайту.

source: Here are a few examples of downstream caches:
ru: Рассмотрим несколько примеров таких "даунстрим" кешей::

source: Your ISP may cache certain pages, so if you requested a page from https://example.com/, your ISP would send you the page without having to access example.com directly. The maintainers of example.com have no knowledge of this caching; the ISP sits between example.com and your Web browser, handling all of the caching transparently.
ru: Ваш провайдер может кешировать определённые страницы, т.е. если вы запросите страницу с https://example.com/, то провайдер пришлёт её вам без обращения к самому сайту. Основатели данного сайта даже не будут знать о таком кешировании, так как провайдер находится между вашим браузером и сайтом, незаметно выполняя кеширование.

source: Your Django website may sit behind a *proxy cache*, such as Squid Web Proxy Cache (http://www.squid-cache.org/), that caches pages for performance. In this case, each request first would be handled by the proxy, and it would be passed to your application only if needed.
ru: Ваше Django приложение может находится за *прокси-кешем*, таким как Squid Web Proxy Cache (http://www.squid-cache.org/), который кеширует страницы для обеспечения производительности. В таком случае, каждый запрос сначала будет обработан прокси, а затем при необходимости будет передан вашему приложению.

source: Your Web browser caches pages, too. If a Web page sends out the appropriate headers, your browser will use the local cached copy for subsequent requests to that page, without even contacting the Web page again to see whether it has changed.
ru: Ваш веб браузер также кеширует страницы. Если веб страница отправляет соответствующий заголовок, то ваш браузер будет использовать локально закешированную копию для последующих запросов к этой странице, даже не пытаясь проверить, изменилась ли эта страница на сайте.

source: Downstream caching is a nice efficiency boost, but there's a danger to it: Many Web pages' contents differ based on authentication and a host of other variables, and cache systems that blindly save pages based purely on URLs could expose incorrect or sensitive data to subsequent visitors to those pages.
ru: "Даунстрим" кеширование -- неплохой ускоритель, но с ним есть одна проблема: содержимое большинства веб страниц различается в зависимости от аутентификации и других настроек и кеширующие системы, которые слепо сохраняют страницы, основываясь в основном на URL, могут выдать неправильные или секретные данные следующим посетителям этих страниц.

source: For example, say you operate a Web email system, and the contents of the "inbox" page obviously depend on which user is logged in. If an ISP blindly cached your site, then the first user who logged in through that ISP would have their user-specific inbox page cached for subsequent visitors to the site. That's not cool.
ru: К примеру, скажем вы работаете с почтовой системой и содержимое входящих сообщений очевидно зависит от зарегистрированного в системе пользователя. Если провайдер слепо закешировал ваш сайт, то первый пользователь, вошедший через этого же провайдера, закеширует свою страницу для последующих посетителей этого сайта. Это точно не круто.

source: Fortunately, HTTP provides a solution to this problem. A number of HTTP headers exist to instruct downstream caches to differ their cache contents depending on designated variables, and to tell caching mechanisms not to cache particular pages. We'll look at some of these headers in the sections that follow.
ru: К счастью, протокол HTTP предоставляет решение для этой проблемы. Существует ряд HTTP заголовков, которые инструктируют "даунстрим" кеши как именно следует различать страницы в зависимости от определённых переменных, также указывая что некоторые страницы кешировать вообще не следует. Мы рассмотрим некоторые из этих заголовков в следующих секциях.

source: Using ``Vary`` headers
ru: Использование заголовков ``Vary``

source: The ``Vary`` header defines which request headers a cache mechanism should take into account when building its cache key. For example, if the contents of a Web page depend on a user's language preference, the page is said to "vary on language."
ru: Заголовок ``Vary`` определяет какие именно заголовки запроса кеширующий механизм должен принимать во внимание при построении своего ключа. Например, если содержимое страницы зависит от языковой настройки, то страница говорит "обрати внимание на язык."

source: By default, Django's cache system creates its cache keys using the requested fully-qualified URL -- e.g., ``"https://www.example.com/stories/2005/?order_by=author"``. This means every request to that URL will use the same cached version, regardless of user-agent differences such as cookies or language preferences. However, if this page produces different content based on some difference in request headers -- such as a cookie, or a language, or a user-agent -- you'll need to use the ``Vary`` header to tell caching mechanisms that the page output depends on those things.
ru: По-умолчанию, кеширующая система Django создаёт свои ключи, используя запрошенный путь и запрос, т.е., ``"https://www.example.com/stories/2005/?order_by=author"``. Это означает, что каждый запрос по этому URL-у будет использовать одну закешированную версию, независимо от различия в куках или языковых настройках. Однако, если эта страница создаёт своё содержимое, основываясь на разнице в заголовках запроса, таких как куки или язык или тип браузера, вам следует использовать заголовок ``Vary``, чтобы указать кеширующему механизму, что вывод данной страница зависит от этих параметров.

source: To do this in Django, use the convenient :func:`django.views.decorators.vary.vary_on_headers` view decorator, like so::
ru: Чтобы сделать это в Django следует использовать декоратор представления :func:`django.views.decorators.vary.vary_on_headers`, так::

source: In this case, a caching mechanism (such as Django's own cache middleware) will cache a separate version of the page for each unique user-agent.
ru: В этом случае кеширующий механизм (такой как промежуточный слой кеширования Django) закеширует отдельную версию этой страницы для каждого уникального типа браузера.

source: The advantage to using the ``vary_on_headers`` decorator rather than manually setting the ``Vary`` header (using something like ``response['Vary'] = 'user-agent'``) is that the decorator *adds* to the ``Vary`` header (which may already exist), rather than setting it from scratch and potentially overriding anything that was already in there.
ru: Преимущество использования декоратора ``vary_on_headers`` по сравнению с ручной установкой заголовка ``Vary`` (с помощью ``response['Vary'] = 'user-agent'``) в том, что декоратор *добавляет* значение к заголовку ``Vary`` (который может уже существовать), а не переопределяет его.

source: You can pass multiple headers to ``vary_on_headers()``::
ru: Вы можете передавать несколько заголовков в ``vary_on_headers()``::
