Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/topics/cache.po
Languages: ru

source: This tells downstream caches to vary on *both*, which means each combination of user-agent and cookie will get its own cache value. For example, a request with the user-agent ``Mozilla`` and the cookie value ``foo=bar`` will be considered different from a request with the user-agent ``Mozilla`` and the cookie value ``foo=ham``.
ru: Это указывает "даунстрим" кешам, что надо обращать внимание на *оба*, т.е. любая комбинация типа браузера и куки будет кешироваться отдельно. Например, запрос от ``Mozilla`` с кукой ``foo=bar`` будет рассматриваться как отличный от запроса от ``Mozilla`` с кукой ``foo=ham``.

source: Because varying on cookie is so common, there's a :func:`django.views.decorators.vary.vary_on_cookie` decorator. These two views are equivalent::
ru: Так как зависимость от куки является настолько стандартной, что существует декоратор :func:`django.views.decorators.vary.vary_on_cookie`. Следующие два представления эквивалентны::

source: The headers you pass to ``vary_on_headers`` are not case sensitive; ``"User-Agent"`` is the same thing as ``"user-agent"``.
ru: Заголовки, которые вы передаёте в ``vary_on_headers`` нечувствительны к регистру, т.е. ``"User-Agent"`` аналогичен ``"user-agent"``.

source: You can also use a helper function, :func:`django.utils.cache.patch_vary_headers`, directly. This function sets, or adds to, the ``Vary header``. For example::
ru: Также вы можете использовать вспомогательную функцию :func:`django.utils.cache.patch_vary_headers` напрямую. Эта функция устанавливает или добавляет заголовок ``Vary``. Например::

source: ``patch_vary_headers`` takes an :class:`~django.http.HttpResponse` instance as its first argument and a list/tuple of case-insensitive header names as its second argument.
ru: Функция ``patch_vary_headers`` принимает экземпляр :class:`~django.http.HttpResponse` в качестве первого аргумента и список/кортеж имён заголовков в качестве второго аргумента.

source: For more on Vary headers, see the :rfc:`official Vary spec <7231#section-7.1.4>`.
ru: Более подробно о заголовках ``Vary`` можно почитать в :rfc:`официальной спецификации <7231#section-7.1.4>`.

source: Controlling cache: Using other headers
ru: Управление кешированием: Использование других заголовков

source: Other problems with caching are the privacy of data and the question of where data should be stored in a cascade of caches.
ru: Другими проблемами с кешированием являются приватность данных и вопрос от том, где следует выполнять кеширование в каскаде кешей.

source: A user usually faces two kinds of caches: their own browser cache (a private cache) and their provider's cache (a public cache). A public cache is used by multiple users and controlled by someone else. This poses problems with sensitive data--you don't want, say, your bank account number stored in a public cache. So Web applications need a way to tell caches which data is private and which is public.
ru: Пользователь обычно сталкивается с двумя видами кешей: кеш его браузера (личный кеш) и кеш его провайдера (публичный кеш). Публичный кеш используется множеством пользователей и кем-то управляется. Это вызывает проблемы с личными данными, скажем, вам не захочется хранить номер своего банковского счёта в публичном кеше. Таким образом, веб приложения нуждаются в способе указать кешам какие данные являются открытыми, а какие закрытыми.

source: The solution is to indicate a page's cache should be "private." To do this in Django, use the :func:`~django.views.decorators.cache.cache_control` view decorator. Example::
ru: Решением является указание того, что страница должна кешироваться в личном кеше. Для этого в Django следует использовать декоратор представления :func:`~django.views.decorators.cache.cache_control`. Например::

source: This decorator takes care of sending out the appropriate HTTP header behind the scenes.
ru: Этот декоратор обеспечивает автоматическую отправку соответствующих HTTP заголовков.

source: Note that the cache control settings "private" and "public" are mutually exclusive. The decorator ensures that the "public" directive is removed if "private" should be set (and vice versa). An example use of the two directives would be a blog site that offers both private and public entries. Public entries may be cached on any shared cache. The following code uses :func:`~django.utils.cache.patch_cache_control`, the manual way to modify the cache control header (it is internally called by the :func:`~django.views.decorators.cache.cache_control` decorator)::
ru: Следует отметить, что настройки открытости и закрытости взаимоисключающие. Декоратор обеспечивает эту проверку. Примером использования таких настроек будет блог, который содержит закрытые и открытые записи. Открытые записи могут кешироваться везде. Следующий код использует :func:`django.utils.cache.patch_cache_control`, ручной способ изменения управляющего заголовка (обычно эта функция вызывается в декораторе :func:`~django.views.decorators.cache.cache_control`)::

source: You can control downstream caches in other ways as well (see :rfc:`7234` for details on HTTP caching). For example, even if you don't use Django's server-side cache framework, you can still tell clients to cache a view for a certain amount of time with the :rfc:`max-age <7234#section-5.2.2.8>` directive::
ru: Вы также можете уравлять "даунстрим" кешами (см. :Rfc:`7234` для получения подробной информации об HTTP-кешировании). Например, даже если вы не используете фреймворк кеширования на стороне сервера Django, вы все равно можете сказать клиентам кешировать представление в течение определенного времени с помощью директивы :rfc:`max-age <7234 # section-5.2.2.8>`:

source: (If you *do* use the caching middleware, it already sets the ``max-age`` with the value of the :setting:`CACHE_MIDDLEWARE_SECONDS` setting. In that case, the custom ``max_age`` from the :func:`~django.views.decorators.cache.cache_control` decorator will take precedence, and the header values will be merged correctly.)
ru: (Следует отметить, что кеширующий промежуточный слой уже устанавливает заголовок ``max-age`` равным значению параметра конфигурации :setting:`CACHE_MIDDLEWARE_SECONDS`. Если вы используете определённый ``max-age`` в декораторе ``cache_control``, декоратор применит его, правильно объединив значения заголовка.)

source: Any valid ``Cache-Control`` response directive is valid in ``cache_control()``. Here are some more examples:
ru: Любая верная HTTP директива ``Cache-Control`` верна в ``cache_control()``. Приведём список примеров:

source: The full list of known directives can be found in the `IANA registry`_ (note that not all of them apply to responses).
ru: Полный список директив вы можете найти в `IANA registry`_ (обратите внимание, что не все они относятся к ответам).

source: If you want to use headers to disable caching altogether, :func:`~django.views.decorators.cache.never_cache` is a view decorator that adds headers to ensure the response won't be cached by browsers or other caches. Example::
ru: Если потребуется использовать заголовки, которые полностью отключают кеширование, то воспользуйтесь декоратором :func:`django.views.decorators.cache.never_cache`. Этот декоратор добавляет заголовки, гарантирующие что ответ не будет закеширован. Например::

source: Order of ``MIDDLEWARE``
ru: Порядок записей в ``MIDDLEWARE``

source: If you use caching middleware, it's important to put each half in the right place within the :setting:`MIDDLEWARE` setting. That's because the cache middleware needs to know which headers by which to vary the cache storage. Middleware always adds something to the ``Vary`` response header when it can.
ru: Если вы используете кеширующий промежуточный слой, важно правильно его разместить в параметре конфигурации :setting:`MIDDLEWARE`. Так происходит из-за того, что кешируючий промежуточный слой должен знать какие заголовки как влияют на кеширующие системы. Промежуточный слой всегда добавляет что-то в заголовок ``Vary``, когда может.

source: ``UpdateCacheMiddleware`` runs during the response phase, where middleware is run in reverse order, so an item at the top of the list runs *last* during the response phase. Thus, you need to make sure that ``UpdateCacheMiddleware`` appears *before* any other middleware that might add something to the ``Vary`` header. The following middleware modules do so:
ru: ``UpdateCacheMiddleware`` работает во время выдачи отклика, там где промежуточные слои применяются в обратном порядке, т.е. элемент наверху списка выполняется *последним*. Таким образом, надо удостовериться, что ``UpdateCacheMiddleware`` указан *до* любых мидлварей, которые могут добавить что-то в заголовок ``Vary``. Следующие модули как раз такие:

source: ``SessionMiddleware`` adds ``Cookie``
ru: ``SessionMiddleware`` добавляет ``Cookie``

source: ``GZipMiddleware`` adds ``Accept-Encoding``
ru: ``GZipMiddleware`` добавляет ``Accept-Encoding``

source: ``LocaleMiddleware`` adds ``Accept-Language``
ru: ``LocaleMiddleware`` добавляет ``Accept-Language``

source: ``FetchFromCacheMiddleware``, on the other hand, runs during the request phase, where middleware is applied first-to-last, so an item at the top of the list runs *first* during the request phase. The ``FetchFromCacheMiddleware`` also needs to run after other middleware updates the ``Vary`` header, so ``FetchFromCacheMiddleware`` must be *after* any item that does so.
ru: ``FetchFromCacheMiddleware``, с другой стороны, выполняется во время запроса, когда промежуточные слои применяются от начала списка, т.е. элемент наверху списка выполняется *первым*. ``FetchFromCacheMiddleware`` также должен выполняться после других слоев, которые изменяют заголовок ``Vary``.
