Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/topics/cache.po
Languages: ru

source: Cache backends that implement their own culling strategy (i.e., the ``locmem``, ``filesystem`` and ``database`` backends) will honor the following options:
ru: Модули кеширования, которые реализуют собственную стратегию очистки (т.е., модули ``locmem``, ``filesystem`` и ``database``) учитывают следующие опции:

source: ``MAX_ENTRIES``: The maximum number of entries allowed in the cache before old values are deleted. This argument defaults to ``300``.
ru: ``MAX_ENTRIES``: максимальное количество элементов в кеше перед началом удаления старых значений. Обычно, ``300`` элементов.

source: ``CULL_FREQUENCY``: The fraction of entries that are culled when ``MAX_ENTRIES`` is reached. The actual ratio is ``1 / CULL_FREQUENCY``, so set ``CULL_FREQUENCY`` to ``2`` to cull half the entries when ``MAX_ENTRIES`` is reached. This argument should be an integer and defaults to ``3``.
ru: ``CULL_FREQUENCY``: Часть элементов, которые надо удалить при достижении ``MAX_ENTRIES``. Обычное соотношение — ``1/CULL_FREQUENCY``, таким образом, надо установить ``CULL_FREQUENCY`` в ``2``, чтобы удалять половину значений кеша при достижении ``MAX_ENTRIES``. Аргумент должен быть целым числом и по умолчанию равен ``3``.

source: A value of ``0`` for ``CULL_FREQUENCY`` means that the entire cache will be dumped when ``MAX_ENTRIES`` is reached. On some backends (``database`` in particular) this makes culling *much* faster at the expense of more cache misses.
ru: Значение ``0`` для ``CULL_FREQUENCY`` означает, что весь кеш должен быть сброшен при достижении ``MAX_ENTRIES``. Это делает очистку *значительно* быстрее для определенных бекендов(в частности ``database``) ценой увеличения промахов кеша.

source: Memcached backends pass the contents of :setting:`OPTIONS <CACHES-OPTIONS>` as keyword arguments to the client constructors, allowing for more advanced control of client behavior. For example usage, see below.
ru: Бекенд Memcached получает содержимое настройки :setting:`OPTIONS <CACHES-OPTIONS>` как именованные аргументы конструктора клиента, что дает дополнительный контроль его поведения.

source: :setting:`KEY_PREFIX <CACHES-KEY_PREFIX>`: A string that will be automatically included (prepended by default) to all cache keys used by the Django server.
ru: :setting:`KEY_PREFIX <CACHES-KEY_PREFIX>`: Строка, которая автоматически включается (предваряет, по умолчанию) во все ключи кеша, используемые сервером Django.

source: See the :ref:`cache documentation <cache_key_prefixing>` for more information.
ru: Обратитесь к :ref:`документации на кеш <cache_key_prefixing>` для подробностей.

source: :setting:`VERSION <CACHES-VERSION>`: The default version number for cache keys generated by the Django server.
ru: :setting:`VERSION <CACHES-VERSION>`: Номер версии про умолчанию для ключей кеша, созданных сервером Django.

source: See the :ref:`cache documentation <cache_versioning>` for more information.
ru: Обратитесь к :ref:`документации на кеш <cache_versioning>` для подробностей.

source: :setting:`KEY_FUNCTION <CACHES-KEY_FUNCTION>` A string containing a dotted path to a function that defines how to compose a prefix, version and key into a final cache key.
ru: :setting:`KEY_FUNCTION <CACHES-KEY_FUNCTION>` Строка, содержащая путь до функции, которая определяет правила объединения префикса, версии и ключа в итоговый ключ кеша.

source: See the :ref:`cache documentation <cache_key_transformation>` for more information.
ru: Обратитесь к :ref:`документации на кеш <cache_key_transformation>` для подробностей.

source: In this example, a filesystem backend is being configured with a timeout of 60 seconds, and a maximum capacity of 1000 items::
ru: В этом примере, модуль кеширования на файловую систему настроен на таймаут в 60 секунд и ёмкость в 1000 элементов::

source: Here's an example configuration for a ``python-memcached`` based backend with an object size limit of 2MB::
ru: Ниже приведен пример конфигурации для бекенда на основе ``python-memcached`` с ограничением размера объекта в 2MB ::

source: Here's an example configuration for a ``pylibmc`` based backend that enables the binary protocol, SASL authentication, and the ``ketama`` behavior mode::
ru: Ниже приведен пример конфигурации бекенда на основе pylibmc, который позволяет использовать двоичный протокол, аутентификацию SASL и режим поведения ketama:

source: The per-site cache
ru: кеширование всего сайта

source: Once the cache is set up, the simplest way to use caching is to cache your entire site. You'll need to add ``'django.middleware.cache.UpdateCacheMiddleware'`` and ``'django.middleware.cache.FetchFromCacheMiddleware'`` to your :setting:`MIDDLEWARE` setting, as in this example::
ru: После настройки кеша, простейшим способом его использования будет кеширование всего сайта. Вам надо будет добавить ``'django.middleware.cache.UpdateCacheMiddleware'`` и ``'django.middleware.cache.FetchFromCacheMiddleware'`` в параметр конфигурации :setting:`MIDDLEWARE`, как это показано в примере::

source: No, that's not a typo: the "update" middleware must be first in the list, and the "fetch" middleware must be last. The details are a bit obscure, but see `Order of MIDDLEWARE`_ below if you'd like the full story.
ru: Нет, это не ошибка: промежуточный слой "update" должна идти первым в списке, а "fetch" — последним. Подробности тут не приводятся, обратитесь к `Order of MIDDLEWARE`_, проведенному далее, если они вам нужны.

source: Then, add the following required settings to your Django settings file:
ru: Затем, добавьте следующие обязательные параметры в файл конфигурации проекта:

source: :setting:`CACHE_MIDDLEWARE_ALIAS` -- The cache alias to use for storage.
ru: :setting:`CACHE_MIDDLEWARE_ALIAS` -- Метка кеша, используемая для хранилища.

source: :setting:`CACHE_MIDDLEWARE_SECONDS` -- The number of seconds each page should be cached.
ru: :setting:`CACHE_MIDDLEWARE_SECONDS` -- Количество секунд хранения каждой закешированной страницы.

source: :setting:`CACHE_MIDDLEWARE_KEY_PREFIX` -- If the cache is shared across multiple sites using the same Django installation, set this to the name of the site, or some other string that is unique to this Django instance, to prevent key collisions. Use an empty string if you don't care.
ru: :setting:`CACHE_MIDDLEWARE_KEY_PREFIX` -- Если кеш разделён между несколькими сайтами внутри одной инсталляции Django, установите имя сайта или любую другую строку, которая уникальна для этой инсталляции, чтобы предотвратить совпадения. Используйте пустую строку, если это не ваш случай.

source: ``FetchFromCacheMiddleware`` caches GET and HEAD responses with status 200, where the request and response headers allow. Responses to requests for the same URL with different query parameters are considered to be unique pages and are cached separately. This middleware expects that a HEAD request is answered with the same response headers as the corresponding GET request; in which case it can return a cached GET response for HEAD request.
ru: ``FetchFromCacheMiddleware`` кеширует GET и HEAD отклики со статусом 200, если заголовки запроса и отклика это позволяют. Ответы на запросы для одного URL с разными параметрами запроса считаются уникальными и кешируются раздельно. Промежуточный слой ожидает, что запрос HEAD возвращает такие же заголовки, как и соответствующий GET запрос; в этом случае он может вернуть закешированный GET отклик для запроса HEAD.

source: Additionally, ``UpdateCacheMiddleware`` automatically sets a few headers in each :class:`~django.http.HttpResponse`:
ru: Также промежуточный слой ``UpdateCacheMiddleware`` автоматически устанавливает несколько заголовков в каждом :class:`~django.http.HttpResponse`:

source: Sets the ``Expires`` header to the current date/time plus the defined :setting:`CACHE_MIDDLEWARE_SECONDS`.
ru: Устанавливает в заголовке ``Expires`` текущие дату и время, добавляя к ним значение, определённое в :setting:`CACHE_MIDDLEWARE_SECONDS`.

source: Sets the ``Cache-Control`` header to give a max age for the page -- again, from the :setting:`CACHE_MIDDLEWARE_SECONDS` setting.
ru: Устанавливает заголовок ``Cache-Control``, определяя максимальный возраст для страницы, также используя значение из параметра конфигурации :setting:`CACHE_MIDDLEWARE_SECONDS`.

source: See :doc:`/topics/http/middleware` for more on middleware.
ru: Обратитесь к :doc:`/topics/http/middleware` для подробностей.

source: If a view sets its own cache expiry time (i.e. it has a ``max-age`` section in its ``Cache-Control`` header) then the page will be cached until the expiry time, rather than :setting:`CACHE_MIDDLEWARE_SECONDS`. Using the decorators in ``django.views.decorators.cache`` you can easily set a view's expiry time (using the :func:`~django.views.decorators.cache.cache_control` decorator) or disable caching for a view (using the :func:`~django.views.decorators.cache.never_cache` decorator). See the `using other headers`__ section for more on these decorators.
ru: Если представление устанавливает собственное время кеширования (т.е. определяет значение ``max-age`` в заголовке ``Cache-Control``), то страница будет закеширована на указанное время, вместо :setting:`CACHE_MIDDLEWARE_SECONDS`. Используя декораторы из ``django.views.decorators.cache``, вы можете легко определять время кеширования представлений (с помощью декоратора :func:`~django.views.decorators.cache.cache_control`) или отключать кеширование для представления (с помощью декоратора :func:`~django.views.decorators.cache.never_cache`). Обратитесь к разделу :ref:`Использование других заголовков<using-other-headers>` для получения дополнительной информации об этих декораторах.

source: If :setting:`USE_I18N` is set to ``True`` then the generated cache key will include the name of the active :term:`language<language code>` -- see also :ref:`how-django-discovers-language-preference`). This allows you to easily cache multilingual sites without having to create the cache key yourself.
ru: Если параметр конфигурации :setting:`USE_I18N` установлен в ``True``, то созданный ключ значения в кеше будет содержать имя активного :term:`языка<language code>` -- обратитесь к :ref:`определению Django языковой настройки<how-django-discovers-language-preference>`). Такое поведение позволяет легко кешировать мультиязычные сайты, не требуя функционала для создания ключей кеша.

source: Cache keys also include the active :term:`language <language code>` when :setting:`USE_L10N` is set to ``True`` and the :ref:`current time zone <default-current-time-zone>` when :setting:`USE_TZ` is set to ``True``.
ru: Ключи кеша также включают в себя активный :term:`язык <language code>` в случаях, когда :setting:`USE_L10N` установлен в ``True``, а также включают в себя :ref:`текущий часовой пояс <default-current-time-zone>`, если :setting:`USE_TZ` установлен в ``True``.

source: The per-view cache
ru: кеширование на уровне представлений

source: A more granular way to use the caching framework is by caching the output of individual views. ``django.views.decorators.cache`` defines a ``cache_page`` decorator that will automatically cache the view's response for you. It's easy to use::
ru: Более детальный способ использования системы кеширования возможен за счет кеширования вывода отдельных представлений. Модуль ``django.views.decorators.cache`` определяет декоратор ``cache_page``, который автоматически кеширует вывод представления. Использовать его несложно::

source: ``cache_page`` takes a single argument: the cache timeout, in seconds. In the above example, the result of the ``my_view()`` view will be cached for 15 minutes. (Note that we've written it as ``60 * 15`` for the purpose of readability. ``60 * 15`` will be evaluated to ``900`` -- that is, 15 minutes multiplied by 60 seconds per minute.)
ru: Декоратор ``cache_page`` принимает единственный аргумента: длительность кеширования, в секундах. В предыдущем примере, результат представления ``my_view()`` будет закеширован на 15 минут. (Следует отметить, что мы задали значения в виде ``60 * 15`` в целях читаемости. ``60 * 15`` будет вычислено в ``900``, т.е. 15 минут умножается на 60 секунд в минуте.)

source: The per-view cache, like the per-site cache, is keyed off of the URL. If multiple URLs point at the same view, each URL will be cached separately. Continuing the ``my_view`` example, if your URLconf looks like this::
ru: Кеш уровня представления, аналогично кешу уровня сайта, использует ключи на основе URL. Если несколько URL указывают на одно представление, каждый URL будет закеширован отдельно. Продолжая работу с примером ``my_view``, если ваш URLconf выглядит так::

source: then requests to ``/foo/1/`` and ``/foo/23/`` will be cached separately, as you may expect. But once a particular URL (e.g., ``/foo/23/``) has been requested, subsequent requests to that URL will use the cache.
ru: то запросы к ``/foo/1/`` и ``/foo/23/`` будут закешированы отдельно, как вы могли предполагать. Но как только определённый URL (например, ``/foo/23/``) будет запрошен, следующие запросы к этому URL будут использовать кеш.

source: ``cache_page`` can also take an optional keyword argument, ``cache``, which directs the decorator to use a specific cache (from your :setting:`CACHES` setting) when caching view results. By default, the ``default`` cache will be used, but you can specify any cache you want::
ru: Декоратор ``cache_page`` также может принимать необязательный именованный аргумент, ``cache``, который указывает декоратору использовать определённый кеш (из списка параметра конфигурации :setting:`CACHES`) для кеширования результатов. По умолчанию используется кеш ``default``, но вы можете указать любой::

source: You can also override the cache prefix on a per-view basis. ``cache_page`` takes an optional keyword argument, ``key_prefix``, which works in the same way as the :setting:`CACHE_MIDDLEWARE_KEY_PREFIX` setting for the middleware. It can be used like this::
ru: Также вы можете переопределять префикс кеша на уровне представления. Декоратор ``cache_page`` принимает необязательный именованный аргумент ``key_prefix``, который работает аналогично параметру конфигурации :setting:`CACHE_MIDDLEWARE_KEY_PREFIX` для мидлвари. Он может быть использован следующим образом::

source: The ``key_prefix`` and ``cache`` arguments may be specified together. The ``key_prefix`` argument and the :setting:`KEY_PREFIX <CACHES-KEY_PREFIX>` specified under :setting:`CACHES` will be concatenated.
ru: Аргументы ``key_prefix`` и ``cache`` можно указать вместе. Аргумент ``key_prefix`` и параметр :setting:`KEY_PREFIX <CACHES-KEY_PREFIX>` настройки :setting:`CACHES` будут объединены.

source: Specifying per-view cache in the URLconf
ru: Определение кеша уровня представления в URLconf

source: The examples in the previous section have hard-coded the fact that the view is cached, because ``cache_page`` alters the ``my_view`` function in place. This approach couples your view to the cache system, which is not ideal for several reasons. For instance, you might want to reuse the view functions on another, cache-less site, or you might want to distribute the views to people who might want to use them without being cached. The solution to these problems is to specify the per-view cache in the URLconf rather than next to the view functions themselves.
ru: Примеры из предыдущей секции содержат жёсткое определение кеширования представления, так как декоратор ``cache_page`` меняет поведение функции ``my_view``. Такое подход связывает ваше представление с системой кеширования, что не всегда подходит по нескольким причинам. Например, вы можете пожелать распространять представления людям, которые захотят использовать их вне системы кеширования. Решением такой проблемы является указание кеширования в URLconf для каждого представления, а не у каждой функции.

source: Doing so is easy: simply wrap the view function with ``cache_page`` when you refer to it in the URLconf. Here's the old URLconf from earlier::
ru: Сделать это несложно: просто оберните функцию представления с помощью ``cache_page``, при обращении к ней в URLconf. Вот так выглядела старая конфигурация URL::

source: Here's the same thing, with ``my_view`` wrapped in ``cache_page``::
ru: Вот так должно быть в случае, когда ``my_view`` обёрнута с помощью ``cache_page``::

source: Template fragment caching
ru: Кеширование фрагментов шаблона

source: If you're after even more control, you can also cache template fragments using the ``cache`` template tag. To give your template access to this tag, put ``{% load cache %}`` near the top of your template.
ru: Если требуется более тонкий контроль, вы также можете кешировать фрагменты шаблона с помощью шаблонного тега ``cache``. Для работы данного тега необходимо указать ``{% load cache %}`` в начале шаблона.

source: The ``{% cache %}`` template tag caches the contents of the block for a given amount of time. It takes at least two arguments: the cache timeout, in seconds, and the name to give the cache fragment. The fragment is cached forever if timeout is ``None``. The name will be taken as is, do not use a variable. For example:
ru: Шаблонный тег ``{% cache %}`` кеширует содержимое блока на указанный период времени. Он принимает как минимум два аргумента: время кеширования в секундах и имя для закешированного фрагмента. Если вместо времени передать ``None`` - фрагмент будет закеширован навсегда. Имя будет использовано как есть, не используйте переменную. Например:

source: Older versions don't allow a ``None`` timeout.
ru: В старых версиях нельзя было использовать ``None`` вместо времени.

source: Sometimes you might want to cache multiple copies of a fragment depending on some dynamic data that appears inside the fragment. For example, you might want a separate cached copy of the sidebar used in the previous example for every user of your site. Do this by passing one or more additional arguments, which may be variables with or without filters, to the ``{% cache %}`` template tag to uniquely identify the cache fragment:
ru: Иногда требуется кешировать многочисленные копии одного фрагмента, различающиеся только небольшим куском динамических данных. Например, может потребоваться кеширование копии сайдбара из предыдущего примера для каждого пользователя вашего сайта. Это можно сделать, передав дополнительные аргументы в шаблонный тег ``{% cache %}``, что однозначно будет идентифицировать фрагмент. В качестве дополнительный аргументов можно использовать переменные, к которым можно применять фильтры:

source: If :setting:`USE_I18N` is set to ``True`` the per-site middleware cache will :ref:`respect the active language<i18n-cache-key>`. For the ``cache`` template tag you could use one of the :ref:`translation-specific variables<template-translation-vars>` available in templates to achieve the same result:
ru: Если параметр конфигурации :setting:`USE_I18N` установлен в ``True``, то мидлварь кеширования сайта будет :ref:`учитывать активных язык<i18n-cache-key>`. Для шаблонного тега ``cache`` можно использовать одну из :ref:`переменных, предназначенных для перевода<template-translation-vars>`, доступных шаблонам для достижения того же результата:

source: The cache timeout can be a template variable, as long as the template variable resolves to an integer value. For example, if the template variable ``my_timeout`` is set to the value ``600``, then the following two examples are equivalent:
ru: Время жизни фрагмента в кеше также может быть шаблонной переменной, до тех пор пока эта переменная разрешается в целое значение. Например, если шаблонная переменная ``my_timeout`` имеет значение ``600``, то следующие два примера эквивалентны:

source: This feature is useful in avoiding repetition in templates. You can set the timeout in a variable, in one place, and just reuse that value.
ru: Эта особенность полезна для уменьшения количества повторений в шаблонах. Вы можете установить время жизни в переменной, в одном месте, и затем использовать это значение.

source: By default, the cache tag will try to use the cache called "template_fragments". If no such cache exists, it will fall back to using the default cache. You may select an alternate cache backend to use with the ``using`` keyword argument, which must be the last argument to the tag.
ru: По умолчанию, кеширующий тег будет пытаться использовать кеш с именем "template_fragments". При отсутствии такого кеша, будет происходить переключение на стандартный кеш. Вы можете выбрать использование альтернативного бекенда кеша с помощью аргумента ``using``, который должен быть последним аргументом в теге.

source: It is considered an error to specify a cache name that is not configured.
ru: Указание имени несконфигурированного кеша является ошибкой.

source: If you want to obtain the cache key used for a cached fragment, you can use ``make_template_fragment_key``. ``fragment_name`` is the same as second argument to the ``cache`` template tag; ``vary_on`` is a list of all additional arguments passed to the tag. This function can be useful for invalidating or overwriting a cached item, for example:
ru: Чтобы получить ключ кеша для кешированного фрагменты шаблона, можно использовать функцию ``make_template_fragment_key``. ``fragment_name`` -- второй аргумент, передаваемый в тег ``cache``, ``vary_on`` -- список дополнительных аргументов, передаваемых в тег. Эту функцию можно использовать для переназначения или удаления кешированных фрагментов шаблона:

source: The low-level cache API
ru: API низкого уровня для кеширования

source: Sometimes, caching an entire rendered page doesn't gain you very much and is, in fact, inconvenient overkill.
ru: Временами кеширование всей созданной страницы не даёт нужного результата и обычно является неудобным излишеством.

source: Perhaps, for instance, your site includes a view whose results depend on several expensive queries, the results of which change at different intervals. In this case, it would not be ideal to use the full-page caching that the per-site or per-view cache strategies offer, because you wouldn't want to cache the entire result (since some of the data changes often), but you'd still want to cache the results that rarely change.
ru: Допустим, ваш сайт содержит представление, итог работы которого зависит от нескольких ресурсоёмких запросов, результаты которых периодически изменяются. В этом случае, кеширование всей страницы будет только вредить, но вот кеширование редко изменяемых фрагментов было бы хорошим подходом.

source: For cases like this, Django exposes a simple, low-level cache API. You can use this API to store objects in the cache with any level of granularity you like. You can cache any Python object that can be pickled safely: strings, dictionaries, lists of model objects, and so forth. (Most common Python objects can be pickled; refer to the Python documentation for more information about pickling.)
ru: Для подобных случаев Django предоставляет простой API кеширования низкого уровня. Вы можете использовать этот API для хранения объектов в кеше с любым уровнем детализации. Вы можете поместить в кеш любой объект Python, который может быть безопасно сериализован ("pickled"): строки, словари, списки объектов модели и так далее. (То есть, речь идёт о большинстве объектов языка Python, обратитесь к соответствующей документации.)

source: Accessing the cache
ru: Доступ к кешу

source: You can access the caches configured in the :setting:`CACHES` setting through a dict-like object: ``django.core.cache.caches``. Repeated requests for the same alias in the same thread will return the same object.
ru: Вы можете иметь доступ к кешам, определённым в параметре конфигурации :setting:`CACHES`, через словарно-подобный объект ``django.core.cache.caches``. Повторяющиеся запросы по одинаковому псевдониму в одном и том же потоке будут возвращать одинаковый результат.
