Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/topics/checks.po
Languages: ru

source: System check framework
ru: Фреймворк проверки

source: The system check framework is a set of static checks for validating Django projects. It detects common problems and provides hints for how to fix them. The framework is extensible so you can easily add your own checks.
ru: Фреймворк проверки это набор статических тестов для проверки проектов Django . Он обнаруживает распространенные проблемы и дает советы по их исправлению. Этот фреймворк расширяемый, поэтому вы можете легко добавлять свои собственные проверки.

source: Checks can be triggered explicitly via the :djadmin:`check` command. Checks are triggered implicitly before most commands, including :djadmin:`runserver` and :djadmin:`migrate`. For performance reasons, checks are not run as part of the WSGI stack that is used in deployment. If you need to run system checks on your deployment server, trigger them explicitly using :djadmin:`check`.
ru: Проверки могут быть вызваны явно через команду :djadmin:`check`. Проверки вызываются явно до большинства команд, включая :djadmin:`runserver` и :djadmin:`migrate`. По соображениям производительности, проверки не запускаются как часть стека WSGI, который используется при развертывании. Если необходимо выполнить проверки на сервере, на котором развертывается приложение, вызовите их явно, используя команду :djadmin:`check`.

source: Serious errors will prevent Django commands (such as :djadmin:`runserver`) from running at all. Minor problems are reported to the console. If you have inspected the cause of a warning and are happy to ignore it, you can hide specific warnings using the :setting:`SILENCED_SYSTEM_CHECKS` setting in your project settings file.
ru: Серьезные ошибки не позволят выполниться командам Django (таким как :djadmin:`runserver`). Незначительные проблемы будут выведены на консоль. Если Вы уже выявили причину предупреждения и хотите ее проигнорировать, Вы можете убрать определенные предупреждения, используя параметр :setting:`SILENCED_SYSTEM_CHECKS` в файле настроек проекта.

source: A full list of all checks that can be raised by Django can be found in the :doc:`System check reference </ref/checks>`.
ru: Полный список всех проверок, которые могут быть вызваны Django, можно найти в :doc:`System check reference </ref/checks>`.

source: Writing your own checks
ru: Создание собственных проверок

source: The framework is flexible and allows you to write functions that perform any other kind of check you may require. The following is an example stub check function::
ru: Фреймворк является гибким и позволяет создавать функции, выполняющие любые виды проверок, которые могут понадобиться. Далее представлен пример функции-заглушки для проверки::

source: The check function *must* accept an ``app_configs`` argument; this argument is the list of applications that should be inspected. If None, the check must be run on *all* installed apps in the project. The ``**kwargs`` argument is required for future expansion.
ru: Проверяющая функция *должна* принимать ``app_configs`` в качестве аргумента; этот аргумент является списком приложений, которые должны быть проверены. Если None, то проверка будет запущена для всех установленных в проекте приложений. Аргумент ``**kwargs`` необходим для последующего расширения.

source: Messages
ru: Сообщения

source: The function must return a list of messages. If no problems are found as a result of the check, the check function must return an empty list.
ru: Функция должна вернуть список сообщений. Если в ходе проверки не найдены проблемы, то функция возвращает пустой список

source: The warnings and errors raised by the check method must be instances of :class:`~django.core.checks.CheckMessage`. An instance of :class:`~django.core.checks.CheckMessage` encapsulates a single reportable error or warning. It also provides context and hints applicable to the message, and a unique identifier that is used for filtering purposes.
ru: Предупреждения и ошибки вызванные проверочным методом должны быть экземплярами класса :class:`~django.core.checks.CheckMessage`. Экземпляр :class:`~django.core.checks.CheckMessage` содержит одну ошибку или предупреждение. Он также предоставляет контекст и советы применимые к сообщению. А также уникальный идентификатор, которой используется для фильтрации.

source: The concept is very similar to messages from the :doc:`message framework </ref/contrib/messages>` or the :doc:`logging framework </topics/logging>`. Messages are tagged with a ``level`` indicating the severity of the message.
ru: Идея очень похожа на сообщения :doc:`message framework </ref/contrib/messages>` или :doc:`logging framework </topics/logging>`. Тег ``level`` показывает уровень важности сообщения.

source: There are also shortcuts to make creating messages with common levels easier. When using these classes you can omit the ``level`` argument because it is implied by the class name.
ru: Также, существуют вспомогательные вспомогательные функции, позволяющие создавать сообщения со стандартными уровнями. При использовании этих классов Вы можете пропускать аргумент ``level`` , т.к. он вытекает из названия.

source: Registering and labeling checks
ru: Регистрация и маркировка проверок

source: Lastly, your check function must be registered explicitly with system check registry. Checks should be registered in a file that's loaded when your application is loaded; for example, in the :meth:`AppConfig.ready() <django.apps.AppConfig.ready>` method.
ru: Ваша функция проверки должна быть зарегистрирована в системном реестре проверок. Проверка должна быть зарегистрирована в файле, который загружается, когда загружается Ваше приложение; например, :meth:`AppConfig.ready() <django.apps.AppConfig.ready>`.

source: You can pass as many tags to ``register`` as you want in order to label your check. Tagging checks is useful since it allows you to run only a certain group of checks. For example, to register a compatibility check, you would make the following call::
ru: Вы можете передать столько тегов ``register`` сколько хотите, для того чтобы пометить свою проверку. Помеченные проверки очень полезны, т.к. позволяют запускать только определенную группу проверок. Например, для регистрации проверки на совместимость, Вы можете сделать следующий вызов::

source: You can register "deployment checks" that are only relevant to a production settings file like this::
ru: Вы можете регистрировать "deployment checks" , которые уместны только для настроек сервера:

source: You can also use ``register`` as a function rather than a decorator by passing a callable object (usually a function) as the first argument to ``register``.
ru: Вы можете использовать ``register`` как функцию, а не как декоратор, передавая вызываемый объект (обычно функцию) как первый аргумент в ``register``.

source: The code below is equivalent to the code above::
ru: Код ниже эквивалентен коду выше::

source: In some cases, you won't need to register your check function -- you can piggyback on an existing registration.
ru: В некоторых случаях Вам не нужно регистрировать проверочную функцию, можете просто дополнить существующую регистрацию.

source: Consider an example where you are implementing a custom field named ``RangedIntegerField``. This field adds ``min`` and ``max`` arguments to the constructor of ``IntegerField``. You may want to add a check to ensure that users provide a min value that is less than or equal to the max value. The following code snippet shows how you can implement this check::
ru: Рассмотрим пример, в котором Вы реализуете настраиваемое поле с именем ``RangedIntegerField``. Это поле добавляет аргументы ``min`` и ``max`` к конструктору ``IntegerField``. Вы можете захотеть добавить проверку, чтобы убедиться, что пользователь предоставляет минимальное значение, которое меньше или равно максимальному значению. Следующий фрагмент кода показывает, как можно выполнить эту проверку::

source: If you wanted to add checks to a model manager, you would take the same approach on your subclass of :class:`~django.db.models.Manager`.
ru: Если Вы хотите добавить проверку к менеджеру модели, Вы должны использовать такой же подход в вашем подклассе :class:`~django.db.models.Manager`.

source: If you want to add a check to a model class, the approach is *almost* the same: the only difference is that the check is a classmethod, not an instance method::
ru: Если Вы хотите добавить проверку в класс модели, то подход будет *почти* такой же: единственное отличие в том, что проверка будет методом класса, а не методом экземпляра::

source: Messages are comparable. That allows you to easily write tests::
ru: Сообщения можно сравнивать. Это позволяет легко писать тесты::
