Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/topics/email.po
Languages: ru

source: Sending email
ru: Отправка электронных писем

source: Although Python makes sending email relatively easy via the :mod:`smtplib` module, Django provides a couple of light wrappers over it. These wrappers are provided to make sending email extra quick, to make it easy to test email sending during development, and to provide support for platforms that can't use SMTP.
ru: Хотя Python позволяет легко отправлять электронные письма с помощью модуля :mod:`smtplib`, Django предоставляет несколько дополнительных функций. Они позволяют быстро отправлять письма, легко отлаживать оправку при разработке, и предоставляют поддержку окружений, которые не могут использовать SMTP.

source: The code lives in the ``django.core.mail`` module.
ru: Код находится в модуле ``django.core.mail``.

source: Quick example
ru: Простой пример

source: In two lines::
ru: В две строки кода::

source: Mail is sent using the SMTP host and port specified in the :setting:`EMAIL_HOST` and :setting:`EMAIL_PORT` settings. The :setting:`EMAIL_HOST_USER` and :setting:`EMAIL_HOST_PASSWORD` settings, if set, are used to authenticate to the SMTP server, and the :setting:`EMAIL_USE_TLS` and :setting:`EMAIL_USE_SSL` settings control whether a secure connection is used.
ru: Письмо отправлено через SMTP хост и порт, которые указаны в настройках :setting:`EMAIL_HOST` и :setting:`EMAIL_PORT`. Настройки :setting:`EMAIL_HOST_USER` и :setting:`EMAIL_HOST_PASSWORD`, если указаны, используются для авторизации на SMTP сервере, а настройки :setting:`EMAIL_USE_TLS` и :setting:`EMAIL_USE_SSL` указывают использовать ли безопасное соединение.

source: The character set of email sent with ``django.core.mail`` will be set to the value of your :setting:`DEFAULT_CHARSET` setting.
ru: При отправке письма через ``django.core.mail`` будет использоваться кодировка из :setting:`DEFAULT_CHARSET`.

source: The simplest way to send email is using ``django.core.mail.send_mail()``.
ru: Самый простой способ отправить письмо -- использовать ``django.core.mail.send_mail()``.

source: The ``subject``, ``message``, ``from_email`` and ``recipient_list`` parameters are required.
ru: Параметры ``subject``, ``message``, ``from_email`` и ``recipient_list`` являются обязательными.

source: ``subject``: A string.
ru: ``subject``: строка.

source: ``message``: A string.
ru: ``message``: строка.

source: ``from_email``: A string.
ru: ``from_email``: строка.

source: ``recipient_list``: A list of strings, each an email address. Each member of ``recipient_list`` will see the other recipients in the "To:" field of the email message.
ru: ``recipient_list``: список строк, каждая является email. Каждый получатель из ``recipient_list`` будет видеть остальных получателей в поле "To:" письма.

source: ``fail_silently``: A boolean. If it's ``False``, ``send_mail`` will raise an :exc:`smtplib.SMTPException`. See the :mod:`smtplib` docs for a list of possible exceptions, all of which are subclasses of :exc:`~smtplib.SMTPException`.
ru: ``fail_silently``: булево. При ``False`` ``send_mail`` вызовет :exc:`smtplib.SMTPException`. Смотрите документацию :mod:`smtplib`, чтобы узнать список всех ошибок, каждый из которых наследуется от :exc:`~smtplib.SMTPException`.

source: ``auth_user``: The optional username to use to authenticate to the SMTP server. If this isn't provided, Django will use the value of the :setting:`EMAIL_HOST_USER` setting.
ru: ``auth_user``: необязательное имя пользователя, которое используется при авторизации на SMTP сервере. Если не указано, Django будет использовать значение :setting:`EMAIL_HOST_USER`.

source: ``auth_password``: The optional password to use to authenticate to the SMTP server. If this isn't provided, Django will use the value of the :setting:`EMAIL_HOST_PASSWORD` setting.
ru: ``auth_password``: необязательный пароль, который используется при авторизации на SMTP сервере. Если не указано, Django будет использовать значение :setting:`EMAIL_HOST_PASSWORD`.

source: ``connection``: The optional email backend to use to send the mail. If unspecified, an instance of the default backend will be used. See the documentation on :ref:`Email backends <topic-email-backends>` for more details.
ru: ``connection``: необязательный бэкенд, который будет использоваться для отправки письма. Если не указан, будет использоваться бэкенд по умолчанию. Смотрите раздел о :ref:`бэкендах для отправки электронной почты <topic-email-backends>`.

source: ``html_message``: If ``html_message`` is provided, the resulting email will be a :mimetype:`multipart/alternative` email with ``message`` as the :mimetype:`text/plain` content type and ``html_message`` as the :mimetype:`text/html` content type.
ru: ``html_message``: если ``html_message`` указано, письмо будет с :mimetype:`multipart/alternative`, и будет содержать ``message`` с типом :mimetype:`text/plain`, и ``html_message`` с типом :mimetype:`text/html`.

source: The return value will be the number of successfully delivered messages (which can be ``0`` or ``1`` since it can only send one message).
ru: Возвращает количество успешно отправленных писем (которое будет ``0`` или ``1``, т.к. функция отправляет только одно письмо).

source: ``django.core.mail.send_mass_mail()`` is intended to handle mass emailing.
ru: ``django.core.mail.send_mass_mail()`` используется для массовой рассылки электронных писем.

source: ``datatuple`` is a tuple in which each element is in this format::
ru: ``datatuple`` -- кортеж, каждый элемент которого следующего формата::

source: ``fail_silently``, ``auth_user`` and ``auth_password`` have the same functions as in :meth:`~django.core.mail.send_mail()`.
ru: ``fail_silently``, ``auth_user`` и ``auth_password`` аналогичны параметрам :meth:`~django.core.mail.send_mail()`.

source: Each separate element of ``datatuple`` results in a separate email message. As in :meth:`~django.core.mail.send_mail()`, recipients in the same ``recipient_list`` will all see the other addresses in the email messages' "To:" field.
ru: Каждый элемент ``datatuple`` соответствует отдельному письму. Как и для :meth:`~django.core.mail.send_mail()`, получатели из одного списка ``recipient_list`` увидят всех остальных в поле "To:" письма.

source: For example, the following code would send two different messages to two different sets of recipients; however, only one connection to the mail server would be opened::
ru: Например, следующий код отправит два отдельных письма двум отдельным спискам получателей. Однако, будет использоваться одно подключения к почтовому серверу::

source: The return value will be the number of successfully delivered messages.
ru: Возвращает количество успешно отправленных писем.

source: The main difference between :meth:`~django.core.mail.send_mass_mail()` and :meth:`~django.core.mail.send_mail()` is that :meth:`~django.core.mail.send_mail()` opens a connection to the mail server each time it's executed, while :meth:`~django.core.mail.send_mass_mail()` uses a single connection for all of its messages. This makes :meth:`~django.core.mail.send_mass_mail()` slightly more efficient.
ru: Основная разница между :meth:`~django.core.mail.send_mass_mail()` и :meth:`~django.core.mail.send_mail()` -- :meth:`~django.core.mail.send_mail()` создает подключение к почтовому серверу при каждом вызове, в то время как :meth:`~django.core.mail.send_mass_mail()` использует одно подключения для всех писем. Это делает :meth:`~django.core.mail.send_mass_mail()` более эффективной.

source: ``django.core.mail.mail_admins()`` is a shortcut for sending an email to the site admins, as defined in the :setting:`ADMINS` setting.
ru: ``django.core.mail.mail_admins()`` отправляет письма администраторам сайта, которые указаны в настройке :setting:`ADMINS`.

source: ``mail_admins()`` prefixes the subject with the value of the :setting:`EMAIL_SUBJECT_PREFIX` setting, which is ``"[Django] "`` by default.
ru: ``mail_admins()`` к заголовку письма добавляет префикс из :setting:`EMAIL_SUBJECT_PREFIX`, по умолчанию ``"[Django] "``.

source: The "From:" header of the email will be the value of the :setting:`SERVER_EMAIL` setting.
ru: Заголовок "From:" будет содержать значение :setting:`SERVER_EMAIL`.

source: This method exists for convenience and readability.
ru: Этот метод существует для удобства и читаемости.

source: If ``html_message`` is provided, the resulting email will be a :mimetype:`multipart/alternative` email with ``message`` as the :mimetype:`text/plain` content type and ``html_message`` as the :mimetype:`text/html` content type.
ru: Если указан ``html_message``, письмо будет с :mimetype:`multipart/alternative`, и будет содержать ``message`` с типом :mimetype:`text/plain`, и ``html_message`` с типом :mimetype:`text/html`.

source: ``django.core.mail.mail_managers()`` is just like ``mail_admins()``, except it sends an email to the site managers, as defined in the :setting:`MANAGERS` setting.
ru: ``django.core.mail.mail_managers()`` аналогичен ``mail_admins()``, но отправляет письма менеджерам сайта, которые указаны в :setting:`MANAGERS`.

source: Examples
ru: Примеры

source: This sends a single email to john@example.com and jane@example.com, with them both appearing in the "To:"::
ru: Отправляет одно письмо john@example.com и jane@example.com, они оба указаны в "To:"::

source: This sends a message to john@example.com and jane@example.com, with them both receiving a separate email::
ru: Отправляет письма john@example.com и jane@example.com, они получать отдельные письма::

source: Preventing header injection
ru: Защищаемся от инъекции заголовков электронного письма

source: `Header injection`_ is a security exploit in which an attacker inserts extra email headers to control the "To:" and "From:" in email messages that your scripts generate.
ru: `Инъекции заголовков <http://www.nyphp.org/phundamentals/8_Preventing-Email-Header-Injection>`_ -- это атака, во время которой атакующий добавляет данные в заголовки письма "To:" и "From:", которое создает ваш код.

source: The Django email functions outlined above all protect against header injection by forbidding newlines in header values. If any ``subject``, ``from_email`` or ``recipient_list`` contains a newline (in either Unix, Windows or Mac style), the email function (e.g. :meth:`~django.core.mail.send_mail()`) will raise ``django.core.mail.BadHeaderError`` (a subclass of ``ValueError``) and, hence, will not send the email. It's your responsibility to validate all data before passing it to the email functions.
ru: Функции для отправки писем в Django запрещают указывать перенос строки в значениях заголовков. Если ``subject``, ``from_email`` или ``recipient_list`` содержит перенос строки (в Unix, Windows или Mac стиле), функция отправки писем (например, :meth:`~django.core.mail.send_mail()`) вызовет исключение ``django.core.mail.BadHeaderError`` (дочерний класс ``ValueError``), и ничего не оправит. Это ваша ответственность проверять все данные перед тем, как передать в функцию.

source: If a ``message`` contains headers at the start of the string, the headers will simply be printed as the first bit of the email message.
ru: Если ``message`` содержит заголовки в начале, они просто будут выведены в начале содержимого письма.

source: Here's an example view that takes a ``subject``, ``message`` and ``from_email`` from the request's POST data, sends that to admin@example.com and redirects to "/contact/thanks/" when it's done::
ru: Вот пример представления, которое получает ``subject``, ``message`` и ``from_email`` из POST данных запроса, отправляет их на admin@example.com, и перенаправляет по адресу "/contact/thanks/"::

source: Django's :meth:`~django.core.mail.send_mail()` and :meth:`~django.core.mail.send_mass_mail()` functions are actually thin wrappers that make use of the :class:`~django.core.mail.EmailMessage` class.
ru: Функции :meth:`~django.core.mail.send_mail()` и :meth:`~django.core.mail.send_mass_mail()` на самом деле обертки, которые используют класс :class:`~django.core.mail.EmailMessage`.

source: Not all features of the :class:`~django.core.mail.EmailMessage` class are available through the :meth:`~django.core.mail.send_mail()` and related wrapper functions. If you wish to use advanced features, such as BCC'ed recipients, file attachments, or multi-part email, you'll need to create :class:`~django.core.mail.EmailMessage` instances directly.
ru: Не все возможности :class:`~django.core.mail.EmailMessage` доступны через :meth:`~django.core.mail.send_mail()` и остальные функции. Если вы хотите использовать дополнительные возможности, такие как получатели в BCC, отправка файла, или "multi-part" письмо, вам следует использовать непосредственно :class:`~django.core.mail.EmailMessage`.

source: This is a design feature. :meth:`~django.core.mail.send_mail()` and related functions were originally the only interface Django provided. However, the list of parameters they accepted was slowly growing over time. It made sense to move to a more object-oriented design for email messages and retain the original functions only for backwards compatibility.
ru: Это особенности проектирования. :meth:`~django.core.mail.send_mail()` и подобные функции ранее были единственным интерфейсом, который предоставлял Django. Однако, список аргументом постепенно рос и рос. По этому было решено использовать более объектно-ориентированный для электронных писем, а функции оставить для обратной совместимости.

source: :class:`~django.core.mail.EmailMessage` is responsible for creating the email message itself. The :ref:`email backend <topic-email-backends>` is then responsible for sending the email.
ru: :class:`~django.core.mail.EmailMessage` отвечает за создание электронного письма. :ref:`Бэкенд отправки писем <topic-email-backends>` отвечает за отправку писем.

source: For convenience, :class:`~django.core.mail.EmailMessage` provides a simple ``send()`` method for sending a single email. If you need to send multiple messages, the email backend API :ref:`provides an alternative <topics-sending-multiple-emails>`.
ru: Для удобства :class:`~django.core.mail.EmailMessage` предоставляет простой метод ``send()`` для отправки одного письма. Если вы хотите отправить несколько писем, API бэкенда :ref:`предоставляет дополнительные методы <topics-sending-multiple-emails>`.

source: The :class:`~django.core.mail.EmailMessage` class is initialized with the following parameters (in the given order, if positional arguments are used). All parameters are optional and can be set at any time prior to calling the ``send()`` method.
ru: Класс :class:`~django.core.mail.EmailMessage` создает со следующими параметрами (в указанном порядке, если передавать позиционные аргументы). Все параметры не обязательны и их можно установить в любой момент до вызова метода ``send()``.

source: ``subject``: The subject line of the email.
ru: ``subject``: Тема письма.

source: ``body``: The body text. This should be a plain text message.
ru: ``body``: Содержимое письма. Необходимо указать обычный текст.

source: ``from_email``: The sender's address. Both ``fred@example.com`` and ``Fred <fred@example.com>`` forms are legal. If omitted, the :setting:`DEFAULT_FROM_EMAIL` setting is used.
ru: ``from_email``: Адрес отправителя. Можно использовать как ``fred@example.com``, так и ``Fred <fred@example.com>``. Если не указан, будет использовать значение настройки :setting:`DEFAULT_FROM_EMAIL`.

source: ``to``: A list or tuple of recipient addresses.
ru: ``to``: Список, или кортеж, получателей.

source: ``bcc``: A list or tuple of addresses used in the "Bcc" header when sending the email.
ru: ``bcc``: Список, или кортеж, адресов, которые будут указаны в заголовке "Bcc".

source: ``connection``: An email backend instance. Use this parameter if you want to use the same connection for multiple messages. If omitted, a new connection is created when ``send()`` is called.
ru: ``connection``: Экземпляр бэкенда для отправки писем. Используйте этот параметр, если хотите использовать одно подключения для нескольких писем. Если не указан, будет создано новое подключение при вызове ``send()``.

source: ``attachments``: A list of attachments to put on the message. These can be either ``email.MIMEBase.MIMEBase`` instances, or ``(filename, content, mimetype)`` triples.
ru: ``attachments``: Список вложений. Могут быть экземпляры ``email.MIMEBase.MIMEBase``, или кортежи ``(filename, content, mimetype)``.

source: ``headers``: A dictionary of extra headers to put on the message. The keys are the header name, values are the header values. It's up to the caller to ensure header names and values are in the correct format for an email message. The corresponding attribute is ``extra_headers``.
ru: ``headers``: Словарь дополнительных заголовков. Ключами являются названия заголовков, значения -- содержимое заголовка. Вы сами должны убедиться в правильности заголовков. Соответствующий атрибут -- ``extra_headers``.

source: ``cc``: A list or tuple of recipient addresses used in the "Cc" header when sending the email.
ru: ``cc``: Список, или кортеж, получателей, которые будут указаны в заголовке "Cc".

source: ``reply_to``: A list or tuple of recipient addresses used in the "Reply-To" header when sending the email.
ru: ``reply_to``: Список, или кортеж, получателей, которые будут указаны в заголовке "Reply-To".

source: For example::
ru: Например::

source: The class has the following methods:
ru: Класс содержит следующие методы:

source: ``send(fail_silently=False)`` sends the message. If a connection was specified when the email was constructed, that connection will be used. Otherwise, an instance of the default backend will be instantiated and used. If the keyword argument ``fail_silently`` is ``True``, exceptions raised while sending the message will be quashed. An empty list of recipients will not raise an exception.
ru: ``send(fail_silently=False)`` отправляет письмо. Если при создании объекта указали подключение, оно будет использоваться. Иначе будет создан экземпляр бэкенда для отправки почты по умолчанию. Если ``fail_silently`` равен ``True``, все ошибки будут проигнорированы. Пустой список получателей не вызывает исключение.

source: ``message()`` constructs a ``django.core.mail.SafeMIMEText`` object (a subclass of Python's ``email.MIMEText.MIMEText`` class) or a ``django.core.mail.SafeMIMEMultipart`` object holding the message to be sent. If you ever need to extend the :class:`~django.core.mail.EmailMessage` class, you'll probably want to override this method to put the content you want into the MIME object.
ru: ``message()`` создает объект ``django.core.mail.SafeMIMEText`` (дочерний класс ``email.MIMEText.MIMEText``), или ``django.core.mail.SafeMIMEMultipart``, который содержит письмо для отправки. Если вам понадобиться переопределить класс :class:`~django.core.mail.EmailMessage`, скорее всего вы переопределите этот метод, чтобы изменить MIME объект.

source: ``recipients()`` returns a list of all the recipients of the message, whether they're recorded in the ``to``, ``cc`` or ``bcc`` attributes. This is another method you might need to override when subclassing, because the SMTP server needs to be told the full list of recipients when the message is sent. If you add another way to specify recipients in your class, they need to be returned from this method as well.
ru: ``recipients()`` возвращает список всех получателей письма из атрибутов ``to``, ``cc``, или ``bcc``. Вам может понадобиться переопределить этот метод, т.к. SMTP серверу необходимо указать список всех получателей. Если вы добавите новый способ указывать получателей, они должны возвращаться этим методом.

source: ``attach()`` creates a new file attachment and adds it to the message. There are two ways to call ``attach()``:
ru: ``attach()`` создает новый вложенный файл и добавляет его к письму. Есть два способа вызвать ``attach()``:

source: You can pass it a single argument that is an ``email.MIMEBase.MIMEBase`` instance. This will be inserted directly into the resulting message.
ru: Можно передать экземпляр ``email.MIMEBase.MIMEBase``. Он будет добавлен непосредственно в письмо.

source: Alternatively, you can pass ``attach()`` three arguments: ``filename``, ``content`` and ``mimetype``. ``filename`` is the name of the file attachment as it will appear in the email, ``content`` is the data that will be contained inside the attachment and ``mimetype`` is the optional MIME type for the attachment. If you omit ``mimetype``, the MIME content type will be guessed from the filename of the attachment.
ru: Можно передать три аргумента: ``filename``, ``content`` и ``mimetype``. ``filename`` -- название файла, ``content`` -- содержимое файла, ``mimetype`` -- необязательный MIME тип файла. Если вы не укажите ``mimetype``, он будет построен по названию файла.

source: If you specify a ``mimetype`` of ``message/rfc822``, it will also accept :class:`django.core.mail.EmailMessage` and :py:class:`email.message.Message`.
ru: Если вы укажите ``message/rfc822`` в ``mimetype``, можно передать :class:`django.core.mail.EmailMessage` и :py:class:`email.message.Message`.

source: In addition, ``message/rfc822`` attachments will no longer be base64-encoded in violation of :rfc:`2046#section-5.2.1`, which can cause issues with displaying the attachments in `Evolution`__ and `Thunderbird`__.
ru: Также ``message/rfc822`` вложение не будет base64-кодировано в нарушение :rfc:`2046#section-5.2.1`, что может привести к проблемам с отображением вложений в `Evolution`__ и `Thunderbird`__.

source: ``attach_file()`` creates a new attachment using a file from your filesystem. Call it with the path of the file to attach and, optionally, the MIME type to use for the attachment. If the MIME type is omitted, it will be guessed from the filename. The simplest use would be::
ru: ``attach_file()`` создает новое вложения, используя файл с файловой системы. Вызовите, указав путь к файлу. Опционально можно указать MIME тип вложения. Если вы не укажите ``mimetype``, он будет построен по названию файла. Самый простой пример использования::

source: Sending alternative content types
ru: Отправка содержимого разного типа

source: It can be useful to include multiple versions of the content in an email; the classic example is to send both text and HTML versions of a message. With Django's email library, you can do this using the ``EmailMultiAlternatives`` class. This subclass of :class:`~django.core.mail.EmailMessage` has an ``attach_alternative()`` method for including extra versions of the message body in the email. All the other methods (including the class initialization) are inherited directly from :class:`~django.core.mail.EmailMessage`.
ru: Вам может понадобиться отправлять сообщение в нескольких версиях. Классический пример отправлять HTML и текстовую версию сообщения. Django позволяет делать это, используя класс ``EmailMultiAlternatives``. Это дочерний класс :class:`~django.core.mail.EmailMessage` с методом ``attach_alternative()``, которые добавляет дополнительную версию сообщения в письмо. Все остальные методы (включая конструктор) наследуются непосредственно от :class:`~django.core.mail.EmailMessage`.

source: To send a text and HTML combination, you could write::
ru: Чтобы отправить и текстовое, и HTML сообщение, используйте следующий код::
