Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/topics/email.po
Languages: ru

source: By default, the MIME type of the ``body`` parameter in an :class:`~django.core.mail.EmailMessage` is ``"text/plain"``. It is good practice to leave this alone, because it guarantees that any recipient will be able to read the email, regardless of their mail client. However, if you are confident that your recipients can handle an alternative content type, you can use the ``content_subtype`` attribute on the :class:`~django.core.mail.EmailMessage` class to change the main content type. The major type will always be ``"text"``, but you can change the subtype. For example::
ru: По умолчанию MIME-тип параметра ``body`` в :class:`~django.core.mail.EmailMessage` равен ``"text/plain"``. Лучше не менять это значение, это гарантирует, что получатель сможет прочитать сообщение любым почтовым клиентом. Однако, если вы уверены, что получатель может принимать различные типа сообщений, вы можете использовать атрибут ``content_subtype`` класса :class:`~django.core.mail.EmailMessage`. Основной тип будет всегда ``"text"``, но вы можете поменять подтип. Например::

source: Email backends
ru: Бэкенды для отправки электронной почты

source: The actual sending of an email is handled by the email backend.
ru: Непосредственная отправка электронного письма происходит в бэкенде.

source: The email backend class has the following methods:
ru: Бэкенд содержит следующие методы:

source: ``open()`` instantiates a long-lived email-sending connection.
ru: ``open()`` создает длительное соединение.

source: ``close()`` closes the current email-sending connection.
ru: ``close()`` закрывает текущее соединение.

source: ``send_messages(email_messages)`` sends a list of :class:`~django.core.mail.EmailMessage` objects. If the connection is not open, this call will implicitly open the connection, and close the connection afterwards. If the connection is already open, it will be left open after mail has been sent.
ru: ``send_messages(email_messages)`` отправляет список объектов :class:`~django.core.mail.EmailMessage`. Если нет открытого соединения, оно будет создано и закрыто после отправки. Если соединение уже открыто, оно останется открытым после отправки.

source: It can also be used as a context manager, which will automatically call ``open()`` and ``close()`` as needed::
ru: Может использоваться как контекстный менеджер, автоматически вызывая ``open()`` и ``close()`` при необходимости::

source: Obtaining an instance of an email backend
ru: Получаем экземпляр бэкенда для отправки электронной почты

source: The :meth:`get_connection` function in ``django.core.mail`` returns an instance of the email backend that you can use.
ru: Функция :meth:`get_connection` из ``django.core.mail`` возвращает экземпляр бэкенда для отправки почты, который вы можете использовать.

source: By default, a call to ``get_connection()`` will return an instance of the email backend specified in :setting:`EMAIL_BACKEND`. If you specify the ``backend`` argument, an instance of that backend will be instantiated.
ru: По умолчанию вызов ``get_connection()`` вернет экземпляр бэкенда, указанного в :setting:`EMAIL_BACKEND`. Если указать аргумент ``backend``, будет создан указанный бэкенд.

source: The ``fail_silently`` argument controls how the backend should handle errors. If ``fail_silently`` is True, exceptions during the email sending process will be silently ignored.
ru: Аргумент ``fail_silently`` указывает как обрабатывать ошибки. Если ``fail_silently`` равен ``True``, ошибки, которые возникли при оправке почты, будут проигнорированы.

source: All other arguments are passed directly to the constructor of the email backend.
ru: Все остальные аргументы передаются непосредственно в конструктор бэкенда.

source: Django ships with several email sending backends. With the exception of the SMTP backend (which is the default), these backends are only useful during testing and development. If you have special email sending requirements, you can :ref:`write your own email backend <topic-custom-email-backend>`.
ru: Django предоставляет несколько бэкендов. Эти бэкенды, кроме SMTP (который используется по умолчанию), полезны только при разработке или тестировании. Вы можете создать :ref:`собственный бэкенд <topic-custom-email-backend>`.

source: SMTP backend
ru: SMTP бэкенд

source: This is the default backend. Email will be sent through a SMTP server.
ru: Бэкенд по умолчанию. Электронные письма отправляются через SMTP сервер.

source: The value for each argument is retrieved from the matching setting if the argument is ``None``:
ru: Значение аргумента берется из соответствующей настройки, если аругмент ``None``:

source: The SMTP backend is the default configuration inherited by Django. If you want to specify it explicitly, put the following in your settings::
ru: SMTP бэкенд используется в Django по умолчанию. Если вы хотите указать его явно, добавьте в настройки::

source: If unspecified, the default ``timeout`` will be the one provided by :func:`socket.getdefaulttimeout()`, which defaults to ``None`` (no timeout).
ru: Если ``timeout`` не указан, будет использоваться результат :func:`socket.getdefaulttimeout()`, который по умолчанию ``None`` (без "таймаута").

source: Console backend
ru: Консольный бэкенд

source: Instead of sending out real emails the console backend just writes the emails that would be sent to the standard output. By default, the console backend writes to ``stdout``. You can use a different stream-like object by providing the ``stream`` keyword argument when constructing the connection.
ru: Вместо отправки письма, бэкенд выведет его в стандартный вывод. По умолчанию консольный синдром пишет в ``stdout``. Вы можете использовать объекты-потоки, указав параметр ``stream`` при создании соединения.

source: To specify this backend, put the following in your settings::
ru: Чтобы указать этот бэкенд, добавьте следующее в настройки::

source: This backend is not intended for use in production -- it is provided as a convenience that can be used during development.
ru: Этот бэкенд не следует использовать на боевом сервере, он создавался для разработки.

source: File backend
ru: Файловый бэкенд

source: The file backend writes emails to a file. A new file is created for each new session that is opened on this backend. The directory to which the files are written is either taken from the :setting:`EMAIL_FILE_PATH` setting or from the ``file_path`` keyword when creating a connection with :meth:`~django.core.mail.get_connection`.
ru: Этот бэкенд пишет почту в файл. Новый файл создается при создании новой сессии этого бэкенда. Каталог, в котором создаются файлы, берется из настройки :setting:`EMAIL_FILE_PATH` или параметра ``file_path``, который передали при создании соединения :meth:`~django.core.mail.get_connection`.

source: In-memory backend
ru: Бэкенд в памяти

source: The ``'locmem'`` backend stores messages in a special attribute of the ``django.core.mail`` module. The ``outbox`` attribute is created when the first message is sent. It's a list with an :class:`~django.core.mail.EmailMessage` instance for each message that would be sent.
ru: Бэкенд ``'locmem'`` сохраняет почту в специальном атрибуте модуля ``django.core.mail``. Атрибут ``outbox`` создается при первой отправке письма. Это список экземпляров :class:`~django.core.mail.EmailMessage` отправленных писем.

source: This backend is not intended for use in production -- it is provided as a convenience that can be used during development and testing.
ru: Этот бэкенд не следует использовать на боевом сервере, он создавался для разработки.

source: Dummy backend
ru: Dummy бэкенд

source: As the name suggests the dummy backend does nothing with your messages. To specify this backend, put the following in your settings::
ru: Этот бэкенд ничего не делает с почтой. Чтобы указать этот бэкенд, добавьте следующее в настройки::

source: Defining a custom email backend
ru: Создание собственного бэкенда

source: If you need to change how emails are sent you can write your own email backend. The :setting:`EMAIL_BACKEND` setting in your settings file is then the Python import path for your backend class.
ru: Вы можете создать собственный бэкенд для отправки почты. В настройка :setting:`EMAIL_BACKEND` необходимо указать путь для импорта класса вашего бэкенда.

source: Custom email backends should subclass ``BaseEmailBackend`` that is located in the ``django.core.mail.backends.base`` module. A custom email backend must implement the ``send_messages(email_messages)`` method. This method receives a list of :class:`~django.core.mail.EmailMessage` instances and returns the number of successfully delivered messages. If your backend has any concept of a persistent session or connection, you should also implement the ``open()`` and ``close()`` methods. Refer to ``smtp.EmailBackend`` for a reference implementation.
ru: Ваш бэкенд должен наследоваться от ``BaseEmailBackend``, который находится в модуле ``django.core.mail.backends.base``. Бэкенд должен определить метод ``send_messages(email_messages)``. Этот метод принимает список объектов :class:`~django.core.mail.EmailMessage` и вернуть список успешно отправленных писем. Если ваш бэкенд в каком либо виде определяет постоянное подключение, вам следует определить методы ``open()`` и ``close()``. Примеры реализации можно найти в исходном коде ``smtp.EmailBackend``.

source: Sending multiple emails
ru: Отправка нескольких писем

source: Establishing and closing an SMTP connection (or any other network connection, for that matter) is an expensive process. If you have a lot of emails to send, it makes sense to reuse an SMTP connection, rather than creating and destroying a connection every time you want to send an email.
ru: Создание и закрытие SMTP-соединения (или любого другого сетевого подключения) -- это дорогой процесс. Если вам необходимо отправить большое количество писем, есть смысл использовать одно SMTP-соединения, а не создавать каждый раз новое.

source: There are two ways you tell an email backend to reuse a connection.
ru: Есть два способа указать бэкенду использовать одно подключение.

source: Firstly, you can use the ``send_messages()`` method. ``send_messages()`` takes a list of :class:`~django.core.mail.EmailMessage` instances (or subclasses), and sends them all using a single connection.
ru: Первое, вы можете использовать метод ``send_messages()``. ``send_messages()`` принимает список объектов :class:`~django.core.mail.EmailMessage` (или наследников), и отправляет их, используя одно подключение.

source: For example, if you have a function called ``get_notification_email()`` that returns a list of :class:`~django.core.mail.EmailMessage` objects representing some periodic email you wish to send out, you could send these emails using a single call to send_messages::
ru: Например, если у вас есть функция ``get_notification_email()``, которая возвращает список объектов :class:`~django.core.mail.EmailMessage`, вы можете отправить их следующим образом::

source: In this example, the call to ``send_messages()`` opens a connection on the backend, sends the list of messages, and then closes the connection again.
ru: В этом примере ``send_messages()`` откроет соединение, отправит письма, и закроет соединение.

source: The second approach is to use the ``open()`` and ``close()`` methods on the email backend to manually control the connection. ``send_messages()`` will not manually open or close the connection if it is already open, so if you manually open the connection, you can control when it is closed. For example::
ru: Второй вариант -- использовать методы ``open()`` и ``close()``, чтобы явно контролировать соединение. ``send_messages()`` не будет создавать и закрывать соединение, если оно уже создано. Поэтому, если вы создадите соединение, вы можете контролировать, когда оно будет закрыто. Например::

source: Configuring email for development
ru: Настройка почты при разработке

source: There are times when you do not want Django to send emails at all. For example, while developing a website, you probably don't want to send out thousands of emails -- but you may want to validate that emails will be sent to the right people under the right conditions, and that those emails will contain the correct content.
ru: Иногда вы не хотите, чтобы Django отправлял почту. Например, при разработке сайта. Вряд ли вы захотите отправлять тысячи писем, но при этом необходимо проверить, что код их отправляет правильным получателям с правильным содержимым.

source: The easiest way to configure email for local development is to use the :ref:`console <topic-email-console-backend>` email backend. This backend redirects all email to stdout, allowing you to inspect the content of mail.
ru: Самый простой способ настроить почту для разработки -- использовать бэкенд :ref:`console <topic-email-console-backend>`. Этот бэкенд перенаправляет всю почту в stdout, позволяя увидеть содержимое писем.

source: The :ref:`file <topic-email-file-backend>` email backend can also be useful during development -- this backend dumps the contents of every SMTP connection to a file that can be inspected at your leisure.
ru: Также можно использовать :ref:`file <topic-email-file-backend>`. Этот бэкенд сохраняет содержимое каждого SMTP-соединения в файл.

source: Another approach is to use a "dumb" SMTP server that receives the emails locally and displays them to the terminal, but does not actually send anything. Python has a built-in way to accomplish this with a single command::
ru: Еще один способ -- использовать локальный SMTP-сервер, который принимает письма и выводит их в консоль, но никуда их не оправляет. Python позволяет создать такой сервер одной командой::

source: This command will start a simple SMTP server listening on port 1025 of localhost. This server simply prints to standard output all email headers and the email body. You then only need to set the :setting:`EMAIL_HOST` and :setting:`EMAIL_PORT` accordingly. For a more detailed discussion of SMTP server options, see the Python documentation for the :mod:`smtpd` module.
ru: Эта команда запускает простой SMTP-сервер, который слушает 1025 порт на localhost. Этот сервер выводит заголовки и содержимое полученных писем в консоль. Вам необходимо указать в настройках :setting:`EMAIL_HOST` и :setting:`EMAIL_PORT`. Подробности об этом SMTP-сервер смотрите в документации Python к модулю :mod:`smtpd`.

source: For information about unit-testing the sending of emails in your application, see the :ref:`topics-testing-email` section of the testing documentation.
ru: Информацию об отправке электронной почты при тестировании смотрите в разделе :ref:`topics-testing-email`.
