Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/topics/files.po
Languages: ru

source: Managing files
ru: Управление файлами

source: This document describes Django's file access APIs for files such as those uploaded by a user. The lower level APIs are general enough that you could use them for other purposes. If you want to handle "static files" (JS, CSS, etc.), see :doc:`/howto/static-files/index`.
ru: Этот документ описывает API Django для работы с файлами, которые были загружены пользователем. API более низкого уровня довольно стандартны и вы можете использовать их для других целей. Если вам надо обрабатывать "статические файлы" (JS, CSS и так далее), обратитесь к :doc:`/howto/static-files/index`.

source: By default, Django stores files locally, using the :setting:`MEDIA_ROOT` and :setting:`MEDIA_URL` settings. The examples below assume that you're using these defaults.
ru: Как правило, Django хранит файлы локально, используя настройки :setting:`MEDIA_ROOT` и :setting:`MEDIA_URL`. Примеры, данные ниже, предполагают использование значений по умолчанию.

source: However, Django provides ways to write custom `file storage systems`_ that allow you to completely customize where and how Django stores files. The second half of this document describes how these storage systems work.
ru: Однако, Django предоставляет возможность записи в пользовательские :doc:`системы хранения файлов </howto/custom-file-storage>`, которые позволяют полностью настроить то, как и где Django будет располагать файлы. Вторая часть этого руководства призвана описать как это работает.

source: Using files in models
ru: Использования файлов в моделях

source: When you use a :class:`~django.db.models.FileField` or :class:`~django.db.models.ImageField`, Django provides a set of APIs you can use to deal with that file.
ru: Когда вы используете классы :class:`~django.db.models.FileField` или :class:`~django.db.models.ImageField`, Django предоставляет интерфейс программирования приложений (API), чтобы открыть вам доступ к файлам.

source: Consider the following model, using an :class:`~django.db.models.ImageField` to store a photo::
ru: Рассмотрим следующую модель, используя :class:`~django.db.models.ImageField` для хранения фотографии::

source: Any ``Car`` instance will have a ``photo`` attribute that you can use to get at the details of the attached photo::
ru: Любой экземпляр класса ``Car`` будет иметь атрибут ``photo``, к которому можно обращаться, чтобы получить сведения о загруженной фотографии::

source: This object -- ``car.photo`` in the example -- is a ``File`` object, which means it has all the methods and attributes described below.
ru: Этот объект -- ``car.photo`` является файловым объектом, а значит имеет ряд атрибутов, описанных ниже.

source: The file is saved as part of saving the model in the database, so the actual file name used on disk cannot be relied on until after the model has been saved.
ru: Файл сохраняется в базе данных как часть модели, поэтому фактическое название файла не может быть использовано до того момента, пока не будет сохранена модель, включающая его.

source: For example, you can change the file name by setting the file's :attr:`~django.core.files.File.name` to a path relative to the file storage's location (:setting:`MEDIA_ROOT` if you are using the default :class:`~django.core.files.storage.FileSystemStorage`)::
ru: Например, вы можете изменить название файла, указав в атрибуте :attr:`~django.core.files.File.name` относительный путь для хранилища файлов (:setting:`MEDIA_ROOT`, если вы используете по умолчанию :class:`~django.core.files.storage.FileSystemStorage`)::

source: The ``File`` object
ru: Объект ``File``

source: Internally, Django uses a :class:`django.core.files.File` instance any time it needs to represent a file.
ru: Django использует класс :class:`django.core.files.File`, который должен представлять собой объект файла.

source: Most of the time you'll use a ``File`` that Django's given you (i.e. a file attached to a model as above, or perhaps an uploaded file).
ru: Большую часть времени вы будете просто использовать ``File``, предоставляемый Django (то есть прикреплённый к соответствующей модели, как показано выше, или, возможно, загруженный файл).

source: If you need to construct a ``File`` yourself, the easiest way is to create one using a Python built-in ``file`` object::
ru: Но если вам вдруг понадобится создать объект ``File`` самостоятельно, проще всего использовать для этого указанный выше встроенный файловый объект языка Python::

source: Now you can use any of the documented attributes and methods of the :class:`~django.core.files.File` class.
ru: Теперь у вас есть возможность использовать любой из атрибутов и методов стандартного класса :class:`~django.core.files.File`.

source: Be aware that files created in this way are not automatically closed. The following approach may be used to close files automatically::
ru: Отдавайте себе отчёт в том, что файлы, созданные таким образом, не будут автоматически закрыты. Для решения этой проблемы может быть использован следующий подход::

source: Closing files is especially important when accessing file fields in a loop over a large number of objects. If files are not manually closed after accessing them, the risk of running out of file descriptors may arise. This may lead to the following error::
ru: Закрытие файлов особенно важно при получении доступа к файлу в цикле с большим количеством объектов. Если файлы не будут закрыты вручную после получения доступа к ним, может возникнуть риск того, что все файловые дескрипторы будут исчерпаны. В свою очередь это может привести к следующей ошибке::

source: File storage
ru: Хранение файлов

source: Behind the scenes, Django delegates decisions about how and where to store files to a file storage system. This is the object that actually understands things like file systems, opening and reading files, etc.
ru: За кулисами Django принимает решение о том, как и где будут сохранены ваши файлы. Фактически это означает, что Django понимает такие вещи, как файловая система, открытие и запись файлов и прочее.

source: Django's default file storage is given by the :setting:`DEFAULT_FILE_STORAGE` setting; if you don't explicitly provide a storage system, this is the one that will be used.
ru: Выбор места для хранения файлов задаётся в настройках :setting:`DEFAULT_FILE_STORAGE`. Если вы не указали иного назначения, это первое, что будет использовано.

source: See below for details of the built-in default file storage system, and see :doc:`/howto/custom-file-storage` for information on writing your own file storage system.
ru: Для получения более подробной информации о встроенной системе хранения файлов смотрите нижеследующие абзацы или обратитесь к главе о создании пользовательской системы хранения файлов :doc:`/howto/custom-file-storage`, чтобы понять, как с ней работать.

source: Storage objects
ru: Объект Storage

source: Though most of the time you'll want to use a ``File`` object (which delegates to the proper storage for that file), you can use file storage systems directly. You can create an instance of some custom file storage class, or -- often more useful -- you can use the global default storage system::
ru: Хотя большую часть времени вам, скорее всего, будет достаточно объекта ``File`` (который осуществляет надлежащее хранение файлов), вы можете обращаться к файловой системе напрямую. У вас имеется возможность создать экземпляр объекта некоторого пользовательского класса для хранения файлов или – что зачастую более полезно – использовать систему хранения, предусмотренную по умолчанию::

source: See :doc:`/ref/files/storage` for the file storage API.
ru: См. :doc:`/ref/files/storage` для получения информации об API доступа к файлам Django.

source: The built-in filesystem storage class
ru: Встроенный класс `FileSystemStorage`

source: Django ships with a :class:`django.core.files.storage.FileSystemStorage` class which implements basic local filesystem file storage.
ru: Django поставляется со встроенным классом :class:`django.core.files.storage.FileSystemStorage`, который реализует основное локальное файловое хранилище.

source: For example, the following code will store uploaded files under ``/media/photos`` regardless of what your :setting:`MEDIA_ROOT` setting is::
ru: Например, следующий код будет хранить загруженные файлы в ``/media/photos``, игнорируя настройки :setting:`MEDIA_ROOT`::

source: :doc:`Custom storage systems </howto/custom-file-storage>` work the same way: you can pass them in as the ``storage`` argument to a :class:`~django.db.models.FileField`.
ru: :doc:`Custom storage systems </howto/custom-file-storage>` работает аналогичным образом: вы можете обратиться к нему как к аргументу ``storage`` класса :class:`~django.db.models.FileField`.
