Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/topics/install.po
Languages: ru

source: How to install Django
ru: Как установить Django

source: This document will get you up and running with Django.
ru: Этот документ призван проинструктировать вас о том, как получить и запустить Django.

source: Install Python
ru: Установка Python

source: Get the latest version of Python at https://www.python.org/downloads/ or with your operating system's package manager.
ru: Последнюю версию Python можно скачать на https://www.python.org/downloads/ или используя пакетный менеджер вашей операционной системы.

source: Django on Jython
ru: Django на Jython

source: Python on Windows
ru: Python на Windows

source: If you are just starting with Django and using Windows, you may find :doc:`/howto/windows` useful.
ru: Если вы только начали изучать Django и используете Windows, советуем почитать :doc:`/howto/windows`.

source: Install Apache and ``mod_wsgi``
ru: Установка Apache и ``mod_wsgi``

source: If you just want to experiment with Django, skip ahead to the next section; Django includes a lightweight web server you can use for testing, so you won't need to set up Apache until you're ready to deploy Django in production.
ru: Если вы просто хотите поэкспериментировать с Django, пропустите этот раздел и перейдите к следующему; Django включает в себя легковесный web-сервер, предназначенный для тестирования, поэтому вы вправе не устанавливать Apache до тех пор, пока ваш проект не будет готов для развёртывания на "боевом"-сервере.

source: See :doc:`How to use Django with mod_wsgi </howto/deployment/wsgi/modwsgi>` for information on how to configure mod_wsgi once you have it installed.
ru: См. :doc:`Использование Django и mod_wsgi </howto/deployment/wsgi/modwsgi>` для получения информации о настройке mod_wsgi сразу после того, как он будет установлен.

source: If you can't use mod_wsgi for some reason, fear not: Django supports many other deployment options. One is :doc:`uWSGI </howto/deployment/wsgi/uwsgi>`; it works very well with `nginx`_. Additionally, Django follows the WSGI spec (:pep:`3333`), which allows it to run on a variety of server platforms.
ru: Если по какой-либо причине вы не можете использовать mod_wsgi, не волнуйтесь: Django поддерживает множество других вариантов развёртывания. Один из них -- :doc:`uWSGI </howto/deployment/wsgi/uwsgi>`; он отлично работает с `nginx <http://nginx.org/ru/>`_ . Дополнительно Django следует WSGI спецификации (PEP 3333), которая позволяет ему работать на различных серверных платформах.

source: Get your database running
ru: Создание рабочей базы данных

source: If you plan to use Django's database API functionality, you'll need to make sure a database server is running. Django supports many different database servers and is officially supported with PostgreSQL_, MySQL_, Oracle_ and SQLite_.
ru: Если вы планируете использовать функционал API баз данных Django, вам нужно удостовериться, что сервер баз данных запущен. Django поддерживает много различных СУБД. В частности к ним относятся `PostgreSQL <http://www.postgresql.org/>`_, `MySQL <http://www.mysql.com/>`_, `Oracle <http://www.oracle.com/ru/products/database/overview/index.html>`_ и `SQLite <http://www.sqlite.org/>`_.

source: In addition to the officially supported databases, there are :ref:`backends provided by 3rd parties <third-party-notes>` that allow you to use other databases with Django.
ru: В дополнение к официально поддерживаемым базам данных есть :ref:`бэкэнды <third-party-notes>`, поставляемые третьими сторонами, которые позволяют использовать другие БД с Django.

source: In addition to a database backend, you'll need to make sure your Python database bindings are installed.
ru: В дополнение к установке необходимой БД вы также должны убедиться, что вами выбран и установлен соответствующий модуль Python.

source: If you're using PostgreSQL, you'll need the `psycopg2`_ package. Refer to the :ref:`PostgreSQL notes <postgresql-notes>` for further details.
ru: При использовании PostgreSQL вам понадобится пакет `psycopg2`_. Вы можете обратиться к :ref:`заметкам о PostgreSQL <postgresql-notes>` для получения дальнейших инструкций, специфичных для этой БД.

source: If you're using MySQL, you'll need a :ref:`DB API driver <mysql-db-api-drivers>` like ``mysqlclient``. See :ref:`notes for the MySQL backend <mysql-notes>` for details.
ru: При использовании MySQL вам понадобится :ref:`DB API драйвер <mysql-db-api-drivers>`, такой как ``mysqlclient``. Обратитесь к :ref:`заметкам о MySQL <mysql-notes>` для информации.

source: If you're using SQLite you might want to read the :ref:`SQLite backend notes <sqlite-notes>`.
ru: Если вы используете SQLite, вам следует прочитать про :ref:`особенности использования SQLite <sqlite-notes>`.

source: If you're using Oracle, you'll need a copy of cx_Oracle_, but please read the :ref:`notes for the Oracle backend <oracle-notes>` for details regarding supported versions of both Oracle and ``cx_Oracle``.
ru: При использовании Oracle вам понадобится копия `cx_Oracle`_, но, пожалуйста, обязательно ознакомьтесь с :ref:`заметками для Oracle <oracle-notes>` , которая содержит информацию о поддерживаемых версиях Oracle и ``cx_Oracle``.

source: If you're using an unofficial 3rd party backend, please consult the documentation provided for any additional requirements.
ru: При использовании неофициальных бэкендов от сторонних разработчиков смотрите соответствующую документацию о дополнительных требованиях.

source: If you plan to use Django's ``manage.py migrate`` command to automatically create database tables for your models (after first installing Django and creating a project), you'll need to ensure that Django has permission to create and alter tables in the database you're using; if you plan to manually create the tables, you can simply grant Django ``SELECT``, ``INSERT``, ``UPDATE`` and ``DELETE`` permissions. After creating a database user with these permissions, you'll specify the details in your project's settings file, see :setting:`DATABASES` for details.
ru: Если вы планируете использовать команду ``manage.py migrate`` для автоматической генерации таблиц БД для ваших моделей (после первого запуска Django и создания проекта), вам нужно убедиться, что Django имеет разрешение на создание и изменение таблиц БД; если же вы хотите создавать таблицы вручную, вам надо просто предоставить Django разрешения ``SELECT``, ``INSERT``, ``UPDATE`` и ``DELETE``. После создания пользователя БД с указанными привилегиями, вам понадобится изменить настройки вашего проекта, см. :setting:`DATABASES`.

source: If you're using Django's :doc:`testing framework</topics/testing/index>` to test database queries, Django will need permission to create a test database.
ru: Если вы используете :doc:`среду тестирования Django</topics/testing/index>` для проверки запросов к базе данных, Django понадобится разрешение на создание тестовой БД.

source: Install the Django code
ru: Установка Django

source: Installation instructions are slightly different depending on whether you're installing a distribution-specific package, downloading the latest official release, or fetching the latest development version.
ru: Инструкции по установке несколько различаются в зависимости от того, каким способом вы устанавливаете пакет: установка для конкретного дистрибутива, загрузка последней официальной версии или получение текущей разрабатываемой версии.

source: It's easy, no matter which way you choose.
ru: Это просто, независимо от того, какой вариант будет вами выбран.

source: Installing an official release with ``pip``
ru: Установка официальной версии с помощью ``pip``

source: This is the recommended way to install Django.
ru: Это рекомендуемый способ установки Django.

source: Install pip_. The easiest is to use the `standalone pip installer`_. If your distribution already has ``pip`` installed, you might need to update it if it's outdated. If it's outdated, you'll know because installation won't work.
ru: Установите `pip <https://pypi.python.org/pypi/pip>`_. Самым простым способом сделать это является использование `автономного установщика pip <http://www.pip-installer.org/en/latest/>`_. Если ваш дистрибутив уже включает установленную версию ``pip``, возможно, вам потребуется обновить её до более свежей. (Если версия устарела, вы сразу поймёте это, поскольку установка не будет работать.)

source: Take a look at virtualenv_ and virtualenvwrapper_. These tools provide isolated Python environments, which are more practical than installing packages systemwide. They also allow installing packages without administrator privileges. The :doc:`contributing tutorial </intro/contributing>` walks through how to create a virtualenv.
ru: Взгляните на `virtualenv <https://pypi.python.org/pypi/virtualenv>`_ и `virtualenvwrapper <http://virtualenvwrapper.readthedocs.org/en/latest/>`_. Эти программы предоставляют изолированное окружение Python, что намного более практично, чем установка общесистемных пакетов. Такой подход также позволяет провести установку без административных прав. :doc:`Раздел о разработке Django </intro/contributing>` описывает как создать виртуальное окружение

source: After you've created and activated a virtual environment, enter the command ``pip install Django`` at the shell prompt.
ru: После того, как вы создали и активировали виртуальное окружение, выполните в консоли ``pip install Django``.

source: Installing a distribution-specific package
ru: Установка пакета для конкретного дистрибутива

source: Check the :doc:`distribution specific notes </misc/distributions>` to see if your platform/distribution provides official Django packages/installers. Distribution-provided packages will typically allow for automatic installation of dependencies and easy upgrade paths; however, these packages will rarely contain the latest release of Django.
ru: Проверьте наличие :doc:`готового пакета </misc/distributions>`, если ваша операционная система предоставляет возможность получить пакет/установщик Django. Как правило, этот способ удобен автоматическим разрешением зависимостей и обновлением версии Django. Однако эти пакеты редко содержат последний релиз Django.

source: Installing the development version
ru: Установка разрабатываемой версии

source: Tracking Django development
ru: Следим за разработкой Django

source: If you decide to use the latest development version of Django, you'll want to pay close attention to `the development timeline`_, and you'll want to keep an eye on the :ref:`release notes for the upcoming release <development_release_notes>`. This will help you stay on top of any new features you might want to use, as well as any changes you'll need to make to your code when updating your copy of Django. (For stable releases, any necessary changes are documented in the release notes.)
ru: Если вы приняли решение использовать текущую разрабатываемую версию Django, вам нужно следить за информацией о выпуске новых исправлений на `the development timeline <https://code.djangoproject.com/timeline>`_. Это поможет вам оставаться в курсе происходящих изменений , таких как включение новой функциональности. Для получения изменений вы должны будете обновить вашу копию Django. (Для стабильных релизов, все необходимые изменения описаны в :ref:`примечаниях к выпуску <development_release_notes>`.)

source: If you'd like to be able to update your Django code occasionally with the latest bug fixes and improvements, follow these instructions:
ru: Если вы хотите обновить Django до разрабатываемой версии, чтобы иметь возможность использовать последние, возможно, нестабильные изменения и улучшения, следуйте этой инструкции:

source: Make sure that you have Git_ installed and that you can run its commands from a shell. (Enter ``git help`` at a shell prompt to test this.)
ru: Убедитесь, что у вас установлен `Git <http://git-scm.com/>`_ и вы можете запустить его из командной оболочки. (Введите ``git help`` в командной оболочке, чтобы проверить это.)

source: Check out Django's main development branch like so:
ru: Склонируйте разрабатываемую ветку Django вот так:

source: This will create a directory ``django`` in your current directory.
ru: Эта команда создаст каталог ``django`` в вашей текущей директории.

source: Make sure that the Python interpreter can load Django's code. The most convenient way to do this is to use virtualenv_, virtualenvwrapper_, and pip_. The :doc:`contributing tutorial </intro/contributing>` walks through how to create a virtualenv.
ru: Убедитесь, что интерпретатор Python может загрузить код Django. Самый удобный способ сделать это -- использовать `virtualenv <https://pypi.python.org/pypi/virtualenv>`_, `virtualenvwrapper <http://virtualenvwrapper.readthedocs.org/en/latest/>`_ и `pip <https://pypi.python.org/pypi/pip>`_. :doc:`Раздел о разработке Django </intro/contributing>` описывает как создать виртуальное окружение.

source: After setting up and activating the virtualenv, run the following command:
ru: После того, как вы создали и активировали виртуальное окружение, выполните в консоли:

source: This will make Django's code importable, and will also make the ``django-admin`` utility command available. In other words, you're all set!
ru: Это сделает код Django импортируемым, а также сделает доступным запуск ``django-admin.py``. Иначе говоря, всё готово!

source: When you want to update your copy of the Django source code, just run the command ``git pull`` from within the ``django`` directory. When you do this, Git will automatically download any changes.
ru: Когда вам понадобится обновить вашу копию Django, просто запустите команду ``git pull`` в директории ``django``.После того, как вы сделаете это, Git автоматически загрузит изменения.
