Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/topics/logging.po
Languages: ru

source: Logging
ru: Логгирование

source: A quick logging primer
ru: Быстрый пример использования логгирования

source: Django uses Python's builtin :mod:`logging` module to perform system logging. The usage of this module is discussed in detail in Python's own documentation. However, if you've never used Python's logging framework (or even if you have), here's a quick primer.
ru: Django использует встроенный модуль Python :mod:`logging` для системного логгирования. Подробности об использовании этого модуля описаны в документации модуля. Но для тех, кто никогда не использовал этот модуль (да и для тех кто использовал), мы приводим небольшой пример.

source: The cast of players
ru: Действующие лица

source: A Python logging configuration consists of four parts:
ru: Конфигурация логгирования в Python состоит из четырех частей:

source: Loggers
ru: Loggers(Логгеры)

source: A logger is the entry point into the logging system. Each logger is a named bucket to which messages can be written for processing.
ru: Логгер -- это точка входа в систему логгирования. Каждый логгер как именованный канал для сообщений, в который они отправляются для обработки.

source: A logger is configured to have a *log level*. This log level describes the severity of the messages that the logger will handle. Python defines the following log levels:
ru: У каждого логгера есть *уровень логгирования* (log level). Уровень логгирования указывает важность принимаемых сообщений. Python определяет следующие уровни логгирования:

source: ``DEBUG``: Low level system information for debugging purposes
ru: ``DEBUG``: Низкий уровень логгирования системной информации для последующего использования в отладке

source: ``INFO``: General system information
ru: ``INFO``: Общая системная информация

source: ``WARNING``: Information describing a minor problem that has occurred.
ru: ``WARNING``: Информация о мелких проблемах возникших при работе приложения

source: ``ERROR``: Information describing a major problem that has occurred.
ru: ``ERROR``: Информация об ошибках возникших при работе приложения

source: ``CRITICAL``: Information describing a critical problem that has occurred.
ru: ``CRITICAL``: Информация о критических ошибках

source: Each message that is written to the logger is a *Log Record*. Each log record also has a *log level* indicating the severity of that specific message. A log record can also contain useful metadata that describes the event that is being logged. This can include details such as a stack trace or an error code.
ru: Каждое сообщение записанное в логгер называется *Log Record(Запись)*. Каждая запись содержит *уровень логгирования*, который указывает важность сообщения. Сообщение также может содержать метаданные, которые описывают произошедшее событие. Метаданные могут содержать код ошибки или отладочную информацию.

source: When a message is given to the logger, the log level of the message is compared to the log level of the logger. If the log level of the message meets or exceeds the log level of the logger itself, the message will undergo further processing. If it doesn't, the message will be ignored.
ru: Когда сообщение передается в логгер, уровень логгирования сообщения сравнивается с уровнем логгирования логгера. Если уровень логгирования сообщения равен или выше уровню логгирования логгера, сообщение будет обработано, иначе - проигнорировано.

source: Once a logger has determined that a message needs to be processed, it is passed to a *Handler*.
ru: После того, как логгер принял сообщение на обработку, оно передается в *Handler(Обработчик)*.

source: Handlers
ru: Handlers(Обработчики)

source: The handler is the engine that determines what happens to each message in a logger. It describes a particular logging behavior, such as writing a message to the screen, to a file, or to a network socket.
ru: Обработчик определяет что делать с сообщением пришедшим из логгера. Он определяет поведение логгирования, например: вывести сообщение на экран, записать в файл или сокет.

source: Like loggers, handlers also have a log level. If the log level of a log record doesn't meet or exceed the level of the handler, the handler will ignore the message.
ru: Как и логгеры, обработчики имеют уровень логгирования. Если уровень логгирования сообщения ниже уровня логгирования обработчика, сообщение будет проигнорировано.

source: A logger can have multiple handlers, and each handler can have a different log level. In this way, it is possible to provide different forms of notification depending on the importance of a message. For example, you could install one handler that forwards ``ERROR`` and ``CRITICAL`` messages to a paging service, while a second handler logs all messages (including ``ERROR`` and ``CRITICAL`` messages) to a file for later analysis.
ru: Логгер может содержать несколько обработчиков, которые могут иметь различный уровень логгирования. Это позволяет обрабатывать сообщения в соответствии с их уровнем важности. Например, вы можете установить обработчик для ``ERROR`` и ``CRITICAL`` сообщений, который будет отправлять через какой-то сервер сообщений, и в то же время обработчик записывающий все сообщения (включая ``ERROR`` и ``CRITICAL``) в файл.

source: Filters
ru: Filters(Фильтры)

source: A filter is used to provide additional control over which log records are passed from logger to handler.
ru: Фильтры предоставляют дополнительный контроль над тем, какие сообщения будут переданы из логгера в обработчик.

source: By default, any log message that meets log level requirements will be handled. However, by installing a filter, you can place additional criteria on the logging process. For example, you could install a filter that only allows ``ERROR`` messages from a particular source to be emitted.
ru: По умолчанию все сообщения, прошедшие проверку уровня логгирования, будут переданы в обработчик. Добавив фильтры вы можете определить дополнительные правила проверки при обработке сообщений. Например, вы можете добавить фильтр, который позволяет обрабатывать ``ERROR`` сообщения отправленные определенным источником.

source: Filters can also be used to modify the logging record prior to being emitted. For example, you could write a filter that downgrades ``ERROR`` log records to ``WARNING`` records if a particular set of criteria are met.
ru: Фильтры также могу изменить сообщение. Например, вы можете создать фильтр, который изменяет уровень логгирования определенных сообщения с ``ERROR`` на ``WARNING``.

source: Filters can be installed on loggers or on handlers; multiple filters can be used in a chain to perform multiple filtering actions.
ru: Фильтр могут быть добавлены к логгеру или обработчику, можно использовать несколько фильтров.

source: Formatters
ru: Formatters(Форматер)

source: Ultimately, a log record needs to be rendered as text. Formatters describe the exact format of that text. A formatter usually consists of a Python formatting string containing :ref:`LogRecord attributes <python:logrecord-attributes>`; however, you can also write custom formatters to implement specific formatting behavior.
ru: В результате сообщение должно быть представлено в виде текста. Форматеры определяют точный формат этого текста. Обычно это строка форматирования Python, содержащая :ref:`атрибуты LogRecord <python:logrecord-attributes>`;но вы также можете создать собственный класс форматера для реализации необходимого поведения.

source: Using logging
ru: Использование логгирования

source: Once you have configured your loggers, handlers, filters and formatters, you need to place logging calls into your code. Using the logging framework is very simple. Here's an example::
ru: После настройки логгеров, обработчиков, фильтров и форматеров, добавим логгирование в наш код. Использовать логгирование очень просто. Вот небольшой пример::

source: And that's it! Every time the ``bad_mojo`` condition is activated, an error log record will be written.
ru: Это все! При каждой успешной проверке условия ``bad_mojo`` будет записано сообщение ошибки.

source: Naming loggers
ru: Именование логгеров

source: The call to :func:`logging.getLogger()` obtains (creating, if necessary) an instance of a logger. The logger instance is identified by a name. This name is used to identify the logger for configuration purposes.
ru: Вызов :meth:`logging.getLogger()` возвращает (создает при необходимости) экземпляр логгера. Экземпляру логгера может назначить имя. Это имя используется при настройке логгирования.

source: By convention, the logger name is usually ``__name__``, the name of the python module that contains the logger. This allows you to filter and handle logging calls on a per-module basis. However, if you have some other way of organizing your logging messages, you can provide any dot-separated name to identify your logger::
ru: Для удобства обычно используется ``__name__`` в качестве названия -- название модуля, который содержит логгер. Это позволяет вам управлять логгированием на уровне модулей. Однако, если вы используете другую систему организации сообщений, вы может использовать любое составное название, разделенное точками::

source: The dotted paths of logger names define a hierarchy. The ``project.interesting`` logger is considered to be a parent of the ``project.interesting.stuff`` logger; the ``project`` logger is a parent of the ``project.interesting`` logger.
ru: Точки в названии логгера позволяют определять иерархию. Логгер ``project.interesting`` считается родительским по отношению к логгеру ``project.interesting.stuff``; логгер ``project`` родительским по отношению к ``project.interesting``.

source: Why is the hierarchy important? Well, because loggers can be set to *propagate* their logging calls to their parents. In this way, you can define a single set of handlers at the root of a logger tree, and capture all logging calls in the subtree of loggers. A logging handler defined in the ``project`` namespace will catch all logging messages issued on the ``project.interesting`` and ``project.interesting.stuff`` loggers.
ru: Почему иерархия так важна? Потому что логгеры могут быть настроены на *передачу* сообщений родительским логгерам. Таким образом вы можете определить один обработчик для корневого логгера и обрабатывать сообщения ко всем дочерним логгерам. Обработчик назначенный логгеру ``project`` будет обрабатывать сообщения к ``project.interesting`` и ``project.interesting.stuff``.

source: This propagation can be controlled on a per-logger basis. If you don't want a particular logger to propagate to its parents, you can turn off this behavior.
ru: Передачу сообщений можно настроить для конкретного логгера. Если вы не хотите, чтобы определенный логгер передавал свои сообщения родительского логгеру, вы можете отключить такое поведение.

source: Making logging calls
ru: Функции логгирования

source: The logger instance contains an entry method for each of the default log levels:
ru: Логгер предоставляет методы для каждого уровня логгирования:

source: There are two other logging calls available:
ru: Также есть два дополнительных метода:

source: ``logger.log()``: Manually emits a logging message with a specific log level.
ru: ``logger.log()``: отправить сообщение с указанным уровнем логгирования

source: ``logger.exception()``: Creates an ``ERROR`` level logging message wrapping the current exception stack frame.
ru: ``logger.exception()``: Создать ``ERROR`` сообщение из последнего исключения(*пер.* the current exception stack frame).

source: Configuring logging
ru: Настройка логгирования

source: Of course, it isn't enough to just put logging calls into your code. You also need to configure the loggers, handlers, filters and formatters to ensure that logging output is output in a useful way.
ru: Конечно же не достаточно просто добавить вызов функций логгирования в ваш код. Вы также должны настроить логгеры, обработчики, фильтры и форматеры, чтобы сообщения попали в нужное место.

source: In order to configure logging, you use :setting:`LOGGING` to define a dictionary of logging settings. These settings describes the loggers, handlers, filters and formatters that you want in your logging setup, and the log levels and other properties that you want those components to have.
ru: Для настройки логгирования используется настройка :setting:`LOGGING`. Эта настройка описывает логгеры, обработчики, фильтры и форматеры а также их параметры.

source: By default, the :setting:`LOGGING` setting is merged with :ref:`Django's default logging configuration <default-logging-configuration>` using the following scheme.
ru: По умолчанию, параметр конфигурации :setting:`LOGGING` совмещается с :ref:`стандартной конфигурацией журналирования Django <default-logging-configuration>` с помощью следующей схемы.

source: If the ``disable_existing_loggers`` key in the :setting:`LOGGING` dictConfig is set to ``True`` (which is the default) then all loggers from the default configuration will be disabled. Disabled loggers are not the same as removed; the logger will still exist, but will silently discard anything logged to it, not even propagating entries to a parent logger. Thus you should be very careful using ``'disable_existing_loggers': True``; it's probably not what you want. Instead, you can set ``disable_existing_loggers`` to ``False`` and redefine some or all of the default loggers; or you can set :setting:`LOGGING_CONFIG` to ``None`` and :ref:`handle logging config yourself <disabling-logging-configuration>`.
ru: Если ключ ``disable_existing_loggers`` в параметре конфигурации :setting:`LOGGING` установлен в ``True`` (по умолчанию это так), тогда все логгеры стандартной конфигурации отключаются. Отключенные логгеры отличаются от удалённых; логгер продолжает существовать, но тихо игнорирует всё, что ему передаётся, не пытаясь передавать записи в родительский логгер. Следовательно, вам надо быть аккуратным, используя ``'disable_existing_loggers': True``; скорее всего вам не нужно такое поведение. Вместо этого, вы можете установить ``disable_existing_loggers`` в ``False`` и переопределить некоторые или все стандартные логгер; также вы можете установить :setting:`LOGGING_CONFIG` в ``None`` и :ref:`самостоятельно обработать конфигурацию журналирования <disabling-logging-configuration>`.

source: Logging is configured as part of the general Django ``setup()`` function. Therefore, you can be certain that loggers are always ready for use in your project code.
ru: Настройка логгирования происходит в момент инициализации Django функцией ``setup()``. Поэтому можно быть увереннем, что логгирование всегда доступно в коде вашего проекта.

source: Examples
ru: Примеры

source: If you use this example, be sure to change the ``'filename'`` path to a location that's writable by the user that's running the Django application.
ru: При использовании этого примера убедитесь, что пользователь, от которого запускается Django приложение, имеет права на запись файла, указанного в ``'filename'``.

source: Second, here's an example of how to make the logging system print Django's logging to the console. It may be useful during local development.
ru: Во-вторых, здесь представлен пример того, как заставить систему журналирования Django выводить сообщения на консоль. Это может пригодится в локальной разработке.

source: By default, this config only sends messages of level ``INFO`` or higher to the console (same as Django's default logging config, except that the default only displays log records when ``DEBUG=True``). Django does not log many such messages. With this config, however, you can also set the environment variable ``DJANGO_LOG_LEVEL=DEBUG`` to see all of Django's debug logging which is very verbose as it includes all database queries::
ru: По умолчанию, данная конфигурация только отсылает сообщения уровня ``INFO`` или выше на консоль (как и при настройках по умолчанию, за исключением того, что по умолчанию сообщения выводятся только при ``DEBUG=True``). Django не журналирует большое количество таких сообщений. Для того, чтобы увидеть отладочные сообщения Django, которые очень информативны и даже включают в себя все запросы к базе данных, установите переменную окружения ``DJANGO_LOG_LEVEL=DEBUG``::

source: Finally, here's an example of a fairly complex logging setup::
ru: Наконец, здесь показан пример достаточно сложной конфигурации журналирования::

source: This logging configuration does the following things:
ru: Эта конфигурация выполняет следующее:

source: Identifies the configuration as being in 'dictConfig version 1' format. At present, this is the only dictConfig format version.
ru: Указывает что конфигурация задана в формате 'dictConfig версия 1'. На данный момент это единственная версия dictConfig формата.

source: Defines two formatters:
ru: Определяет два форматера:

source: ``simple``, that just outputs the log level name (e.g., ``DEBUG``) and the log message.
ru: ``simple``, просто возвращает уровень логгирования сообщения (например, ``DEBUG``) и содержимое сообщения.

source: ``verbose``, that outputs the log level name, the log message, plus the time, process, thread and module that generate the log message.
ru: ``verbose``, выведет уровень логгирования, сообщение, время, название процесса, потока и модуля, который создал сообщение.

source: Defines two filters:
ru: Определяет два фильтра:

source: ``project.logging.SpecialFilter``, using the alias ``special``. If this filter required additional arguments, they can be provided as additional keys in the filter configuration dictionary. In this case, the argument ``foo`` will be given a value of ``bar`` when instantiating ``SpecialFilter``.
ru: ``project.logging.SpecialFilter`` с названием ``special``. Если конструктор фильтра требует наличия дополнительных аргументов, вы можете указать их в словаре настройки фильтра. В этом случае будет передан аргумент ``foo`` со значением ``bar`` при создании экземпляра :class:`SpecialFilter`.

source: ``django.utils.log.RequireDebugTrue``, which passes on records when :setting:`DEBUG` is ``True``.
ru: ``django.utils.log.RequireDebugTrue`` -- пропускает записи только в случае когда параметр конфигурации :setting:`DEBUG` равен `True`.

source: Defines two handlers:
ru: Определяет два обработчика:

source: ``mail_admins``, an AdminEmailHandler, which will email any ``ERROR`` (or higher) message to the site admins. This handler uses the ``special`` filter.
ru: ``mail_admins``, AdminEmailHandler, который отправляет e-mail с сообщением уровня ``ERROR`` (и выше) администраторам сайта. Этот обработчик использует фильтр ``special``.

source: Configures three loggers:
ru: Настраивает три логгера:

source: ``django``, which passes all messages to the ``console`` handler.
ru: ``django``, который перенаправляет все сообщения в обработчик ``console``.

source: ``django.request``, which passes all ``ERROR`` messages to the ``mail_admins`` handler. In addition, this logger is marked to *not* propagate messages. This means that log messages written to ``django.request`` will not be handled by the ``django`` logger.
ru: ``django.request``, который передает все сообщения уровня ``ERROR`` в обработчик ``mail_admins``. Также указывается, что логгер *не* должен передавать сообщения родительским логгерам. Это означает что сообщения переданные в ``django.request`` не будут обрабатываться логгером ``django``.

source: ``myproject.custom``, which passes all messages at ``INFO`` or higher that also pass the ``special`` filter to two handlers -- the ``console``, and ``mail_admins``. This means that all ``INFO`` level messages (or higher) will be printed to the console; ``ERROR`` and ``CRITICAL`` messages will also be output via email.
ru: ``myproject.custom``, который передает все сообщения уровня ``INFO`` и выше прошедшие фильтр ``special`` в два обработчика -- ``console`` и ``mail_admins``. Это означает что все сообщения уровня ``INFO`` (или выше) будут отправлены в консоль, сообщения ``ERROR`` и ``CRITICAL`` будут отосланы через e-mail.

source: Custom logging configuration
ru: Собственная конфигурация логгирования

source: If you don't want to use Python's dictConfig format to configure your logger, you can specify your own configuration scheme.
ru: Если вы не хотите использовать формат dictConfig для настройки логгирования, вы можете определить собственный формат.

source: The :setting:`LOGGING_CONFIG` setting defines the callable that will be used to configure Django's loggers. By default, it points at Python's :func:`logging.config.dictConfig()` function. However, if you want to use a different configuration process, you can use any other callable that takes a single argument. The contents of :setting:`LOGGING` will be provided as the value of that argument when logging is configured.
ru: Параметр конфигурации :setting:`LOGGING_CONFIG` определяет функцию, которая настраивает логгирование в Django. По умолчанию, параметр указывает на :meth:`logging.dictConfig()`. Однако, если вы хотите переопределить настройку логгирования, укажите функцию, которая принимает один аргумент. Содержимое :setting:`LOGGING` будет передано в функцию при настройке логгирования.

source: Disabling logging configuration
ru: Отключение настройки логгирования

source: If you don't want to configure logging at all (or you want to manually configure logging using your own approach), you can set :setting:`LOGGING_CONFIG` to ``None``. This will disable the configuration process for :ref:`Django's default logging <default-logging-configuration>`. Here's an example that disables Django's logging configuration and then manually configures logging:
ru: Если вы вообще не желаете настраивать журналирование (или требуется самостоятельно настроить журналирование, используя собственный механизм\2), вы можете установить :setting:`LOGGING_CONFIG` в ``None``. Это отключит процесс настройки журналирования для :ref:`случая по умолчанию <default-logging-configuration>`. Здесь приведён пример отключения конфигурации журналирования Django и затем ручной её настройки:

source: Setting :setting:`LOGGING_CONFIG` to ``None`` only means that the automatic configuration process is disabled, not logging itself. If you disable the configuration process, Django will still make logging calls, falling back to whatever default logging behavior is defined.
ru: Установка :setting:`LOGGING_CONFIG` в ``None`` только означает, что процесс автоматической настройки отключен, это не влияет на само журналирование. Если вы отключите процесс конфигурации, Django все равно будет вызывать методы журналирования, используя поведение логгеров, настроенное по умолчанию.

source: Django's logging extensions
ru: Расширения для логгирования в Django

source: Django provides a number of utilities to handle the unique requirements of logging in Web server environment.
ru: Django предоставляет набор утилит для решения стандартных задач логгирования в Web-приложениях.

source: Django provides several built-in loggers.
ru: Django предоставляет несколько встроенных логгеров.

source: Log messages related to the handling of requests. 5XX responses are raised as ``ERROR`` messages; 4XX responses are raised as ``WARNING`` messages.
ru: Принимает сообщения связанные с процессом обработки запросов. 5XX ответы отправляют ``ERROR`` сообщения, 4XX ответы -- ``WARNING`` сообщения.

source: Messages to this logger have the following extra context:
ru: Сообщения этого логгера содержат дополнительные данные:

source: ``status_code``: The HTTP response code associated with the request.
ru: ``status_code``: HTTP код ответа.

source: ``request``: The request object that generated the logging message.
ru: ``request``: объект запроса, который спровоцировал сообщение.

source: Log messages related to the rendering of templates.
ru: Записывает логи связанные с рендерингом шаблонов.
