Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/topics/logging.po
Languages: ru

source: Missing context variables are logged as ``DEBUG`` messages.
ru: Отсутствие переменной шаблона записывается как ``DEBUG`` сообщение.

source: Uncaught exceptions raised during the rendering of an :ttag:`{% include %} <include>` are logged as ``WARNING`` messages when debug mode is off (helpful since ``{% include %}`` silences the exception and returns an empty string in that case).
ru: Исключения при выполнении тега :ttag:`{% include %} <include>` логгируются как ``WARNING`` сообщения при выключенной отладке (удобно т.к. ``{% include %}`` перехватывает все исключения и возвращает пустую строку).

source: Messages relating to the interaction of code with the database. For example, every application-level SQL statement executed by a request is logged at the ``DEBUG`` level to this logger.
ru: Сообщения связанные с взаимодействием кода с базой данной. Например, каждый SQL запрос создает ``DEBUG`` сообщение в этот логер.

source: ``duration``: The time taken to execute the SQL statement.
ru: ``duration``: Время выполнения SQL запроса.

source: ``sql``: The SQL statement that was executed.
ru: ``sql``: SQL запрос.

source: ``params``: The parameters that were used in the SQL call.
ru: ``params``: Параметры используемые при выполнении SQL запроса.

source: For performance reasons, SQL logging is only enabled when ``settings.DEBUG`` is set to ``True``, regardless of the logging level or handlers that are installed.
ru: Для повышения производительности логгирование SQL запросов включено только при ``settings.DEBUG`` равном ``True``, независимо от уровня логгирования и назначенных обработчиков.

source: This logging does not include framework-level initialization (e.g. ``SET TIMEZONE``) or transaction management queries (e.g. ``BEGIN``, ``COMMIT``, and ``ROLLBACK``). Turn on query logging in your database if you wish to view all database queries.
ru: Это логгирование не включает запросы, выполняемые при инициализации приложения (например, ``SET TIMEZONE``), или запросы управления транзакциями (такие как ``BEGIN``, ``COMMIT`` и ``ROLLBACK``). Используйте логгирование на уровне базы данных, если вы хотите записывать все запросы.

source: To silence a particular type of ``SuspiciousOperation``, you can override that specific logger following this example:
ru: Чтобы игнорировать определенные типы ``SuspiciousOperation``, вы можете переопределить логгер следующим образом:

source: Django provides one log handler in addition to those provided by the Python logging module.
ru: Django предоставляет один дополнительный обработчик.

source: This handler sends an email to the site admins for each log message it receives.
ru: Этот логгер отсылает e-mail администраторам сайта с принятым сообщением.

source: If the log record contains stack trace information, that stack trace will be included in the email.
ru: Если сообщение содержит стек трассировки(*пер.* stack trace information), он будет включен в e-mail.

source: The ``include_html`` argument of ``AdminEmailHandler`` is used to control whether the traceback email includes an HTML attachment containing the full content of the debug Web page that would have been produced if :setting:`DEBUG` were ``True``. To set this value in your configuration, include it in the handler definition for ``django.utils.log.AdminEmailHandler``, like this:
ru: Параметр ``include_html`` в ``AdminEmailHandler`` указывает будет ли e-mail содержать HTML содержимое debug-страницы, которая была бы создана при :setting:`DEBUG` равном ``True``. Чтобы установить этот параметр, укажите его в словаре конфигурации ``django.utils.log.AdminEmailHandler``, например так:

source: Note that this HTML version of the email contains a full traceback, with names and values of local variables at each level of the stack, plus the values of your Django settings. This information is potentially very sensitive, and you may not want to send it over email. Consider using something such as `Sentry`_ to get the best of both worlds -- the rich information of full tracebacks plus the security of *not* sending the information over email. You may also explicitly designate certain sensitive information to be filtered out of error reports -- learn more on :ref:`Filtering error reports<filtering-error-reports>`.
ru: Заметим, что HTML версия письма содержит полный трейсбек с названиями и значениями локальных переменных на каждом уровне стека, а также значения настроек Django. Эта информация потенциально очень важна и возможно вы не захотите отправлять её через электронную почту. Рекомендуется использовать что-то вроде `django-sentry <Sentry>`_, чтобы получить все преимущества -- полная информация c трейсбеком и *отсутствие* отправки важной информации через электронную почту. Вы можете также явно указать фильтрацию важной информации -- подробнее в разделе о :ref:`фильтрации отчетов об ошибках <filtering-error-reports>`.

source: By setting the ``email_backend`` argument of ``AdminEmailHandler``, the :ref:`email backend <topic-email-backends>` that is being used by the handler can be overridden, like this:
ru: Через параметр ``email_backend`` класса ``AdminEmailHandler``, можно переопределить :ref:`бекенд отправки email <topic-email-backends>`:

source: By default, an instance of the email backend specified in :setting:`EMAIL_BACKEND` will be used.
ru: По умолчанию используется экземпляр класса, указанного в :setting:`EMAIL_BACKEND`.

source: Sends emails to admin users. To customize this behavior, you can subclass the :class:`~django.utils.log.AdminEmailHandler` class and override this method.
ru: Отправляет сообщения по электронной почте администраторам. Для изменения этого поведения следует унаследовать класс :class:`~django.utils.log.AdminEmailHandler` и переопределить данный метод.

source: This filter accepts a callback function (which should accept a single argument, the record to be logged), and calls it for each record that passes through the filter. Handling of that record will not proceed if the callback returns False.
ru: Этот фильтр принимает функцию (которая должна принимать один аргумент - логгированное сообщение), и вызывает ее для каждого переданного сообщения. Сообщение не будет обработано если функция вернет False.

source: For instance, to filter out :exc:`~django.http.UnreadablePostError` (raised when a user cancels an upload) from the admin emails, you would create a filter function::
ru: Например, для исключения из писем информации об исключении :exc:`~django.http.UnreadablePostError` (выбрасывается, когда пользователь прерывает загрузку файла), вы можете создать функцию фильтрации::

source: and then add it to your logging config:
ru: и затем добавить её в свою конфигурацию логгирования:

source: This filter will only pass on records when settings.DEBUG is False.
ru: Этот фильтр работает только если настройка :setting:`DEBUG` равна False.

source: This filter is used as follows in the default :setting:`LOGGING` configuration to ensure that the :class:`AdminEmailHandler` only sends error emails to admins when :setting:`DEBUG` is ``False``:
ru: Этот фильтр используется в конфигурации :setting:`LOGGING` по-умолчанию, чтобы предотвратить отсылку писем обработчиком :class:`AdminEmailHandler` если настройка :setting:`DEBUG` не равна `False`:

source: This filter is similar to :class:`RequireDebugFalse`, except that records are passed only when :setting:`DEBUG` is ``True``.
ru: Этот фильтр аналогичен :class:`RequireDebugFalse` за исключением того, что он пропускает записи только в случае когда параметр конфигурации :setting:`DEBUG` равен `True`.

source: Django's default logging configuration
ru: Стандартная конфигурация логгирования

source: By default, Django configures the following logging:
ru: По умолчанию, Django настраивает следующую конфигурацию журналирования:

source: When :setting:`DEBUG` is ``True``:
ru: Если :setting:`DEBUG` равна ``True``:

source: When :setting:`DEBUG` is ``False``:
ru: Если :setting:`DEBUG` установлен в ``False``:

source: See also :ref:`Configuring logging <configuring-logging>` to learn how you can complement or replace this default logging configuration.
ru: Также см. :ref:`настройку логгирования <configuring-logging>`, чтобы разобраться как вы можете дополнить или заменить стандартную конфигурацию логгирования.
