Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/topics/migrations.po
Languages: ru

source: Migrations
ru: Миграции

source: Migrations are Django's way of propagating changes you make to your models (adding a field, deleting a model, etc.) into your database schema. They're designed to be mostly automatic, but you'll need to know when to make migrations, when to run them, and the common problems you might run into.
ru: Django использует миграции для переноса изменений в моделях (добавление поля, удаление модели и т.д.) на структуру базы данных. Миграции создавались в основном для автоматической работы, но вам необходимо знать когда их создавать, запускать и как решать различные проблемы.

source: The Commands
ru: Команды

source: There are several commands which you will use to interact with migrations and Django's handling of database schema:
ru: Django предоставляет две команды для работы с миграциями и структурой базы данных:

source: :djadmin:`makemigrations`, which is responsible for creating new migrations based on the changes you have made to your models.
ru: :djadmin:`makemigrations`, которая отвечает за создание новых миграций на основе изменений в моделях.

source: :djadmin:`sqlmigrate`, which displays the SQL statements for a migration.
ru: :djadmin:`sqlmigrate`, которая выводит SQL запросы для миграции.

source: You should think of migrations as a version control system for your database schema. ``makemigrations`` is responsible for packaging up your model changes into individual migration files - analogous to commits - and ``migrate`` is responsible for applying those to your database.
ru: Следует рассматривать миграции, как систему контроля версий для базы данных. ``makemigrations`` отвечает за сохранение состояния моделей в файле миграции - аналог коммита - а ``migrate`` отвечает за их применение к базе данных.

source: The migration files for each app live in a "migrations" directory inside of that app, and are designed to be committed to, and distributed as part of, its codebase. You should be making them once on your development machine and then running the same migrations on your colleagues' machines, your staging machines, and eventually your production machines.
ru: Файлы с миграциями находятся в каталоге "migrations" приложения. Они являются частью приложения и должны распространятся вместе с остальным кодом приложения. Они должны создаваться при разработке и потом применятся на машинах коллег, тестовом и "боевом" серверах.

source: It is possible to override the name of the package which contains the migrations on a per-app basis by modifying the :setting:`MIGRATION_MODULES` setting.
ru: Вы можете изменить пакет, который хранит миграции, указав его в настройке :setting:`MIGRATION_MODULES`.

source: Migrations will run the same way on the same dataset and produce consistent results, meaning that what you see in development and staging is, under the same circumstances, exactly what will happen in production.
ru: Миграции работают идентично на одном и том же наборе данных. Это означает, что на сервере разработки, тестовом и "боевом" серверах вы получите один и тот же результат при одинаковых условиях выполнения миграций.

source: Django will make migrations for any change to your models or fields - even options that don't affect the database - as the only way it can reconstruct a field correctly is to have all the changes in the history, and you might need those options in some data migrations later on (for example, if you've set custom validators).
ru: Django создаст миграции при любых изменениях модели или полей - даже тех параметров, которые не влияют на базу данных - т.к. единственный способ восстановить состояние моделей - это хранить все изменения в истории. Вам могут понадобится эти параметры в миграциях данных в будущем (например, если вы добавите собственную проверку данных).

source: Backend Support
ru: Поддержка бэкендами

source: Migrations are supported on all backends that Django ships with, as well as any third-party backends if they have programmed in support for schema alteration (done via the :doc:`SchemaEditor </ref/schema-editor>` class).
ru: Миграции поддерживаются всеми бэкендами, которые предоставляет Django, как и сторонними, если они реализуют API внесения изменений в структуру базы данных (через класс :doc:`SchemaEditor </ref/schema-editor>`).

source: However, some databases are more capable than others when it comes to schema migrations; some of the caveats are covered below.
ru: Тем не менее, некоторые базы данных поддерживают больше возможностей, чем другие, в случаях когда речь идёт о миграциях схемы. Некоторые ограничения будут описаны далее.

source: MySQL lacks support for transactions around schema alteration operations, meaning that if a migration fails to apply you will have to manually unpick the changes in order to try again (it's impossible to roll back to an earlier point).
ru: В MySQL отсутствует поддержка транзакций при изменении структуры. Это означает, что если миграция не выполнится из-за ошибки вам придется вручную откатывать изменения, чтобы попытаться снова (т.к. невозможно вернуться к исходному состоянию автоматически).

source: In addition, MySQL will fully rewrite tables for almost every schema operation and generally takes a time proportional to the number of rows in the table to add or remove columns. On slower hardware this can be worse than a minute per million rows - adding a few columns to a table with just a few million rows could lock your site up for over ten minutes.
ru: Кроме того, MySQL будет полностью переписывать таблицы почти для каждой операции изменения структуры, это занимает время, пропорциональное количеству строк в таблице. На медленном оборудовании это может занимать больше, чем минута на миллион строк. Добавление нескольких столбцов в таблицу с всего несколькими миллионами строк может заблокировать ваш сайт на более чем десять минут.

source: SQLite has very little built-in schema alteration support, and so Django attempts to emulate it by:
ru: SQLite очень плохо поддерживает изменения в структуре базы данных, но Django пытается эмулировать их следующим образом:

source: Creating a new table with the new schema
ru: Создание новой таблицы для новой структуры

source: Copying the data across
ru: Копирование данных в новую таблицу

source: Dropping the old table
ru: Удаление старой таблицы

source: Renaming the new table to match the original name
ru: Переименование новой таблицы

source: This process generally works well, but it can be slow and occasionally buggy. It is not recommended that you run and migrate SQLite in a production environment unless you are very aware of the risks and its limitations; the support Django ships with is designed to allow developers to use SQLite on their local machines to develop less complex Django projects without the need for a full database.
ru: Этот процесс как правило хорошо работает, но может быть медленным и иногда глючит. Не рекомендуется использовать и мигрировать SQLite на "боевом" сервере, если вы не очень осведомлены о рисках и его ограничениях. Django поддерживает SQLite, чтобы позволить разработчикам использовать SQLite для разработки простых проектов.

source: Workflow
ru: Работа с миграциями

source: Your models will be scanned and compared to the versions currently contained in your migration files, and then a new set of migrations will be written out. Make sure to read the output to see what ``makemigrations`` thinks you have changed - it's not perfect, and for complex changes it might not be detecting what you expect.
ru: Ваши модели будут просканированы и сравнены с версией, которая содержится в файлах миграций, затем будут созданы новые миграции. Не забывайте проверять вывод команды, чтобы понимать, как ``makemigrations`` видит ваши изменения - для сложных изменений вы можете получить не совсем ожидаемый результат.

source: Once you have your new migration files, you should apply them to your database to make sure they work as expected::
ru: Создав новые миграции, вам следует применить их к вашей базе данных, чтобы убедиться, что всё работает::

source: Once the migration is applied, commit the migration and the models change to your version control system as a single commit - that way, when other developers (or your production servers) check out the code, they'll get both the changes to your models and the accompanying migration at the same time.
ru: После того, как миграция отработала, добавьте миграции и изменения к моделям в одном коммите - таким образом, когда другие разработчики (или на "боевом" сервере) обновят код, они получат как изменения ваших моделей, так и миграции для них.

source: Version control
ru: Контроль версий

source: Because migrations are stored in version control, you'll occasionally come across situations where you and another developer have both committed a migration to the same app at the same time, resulting in two migrations with the same number.
ru: Поскольку миграции хранятся в системе контроля версий, вы будете иногда сталкиваться с ситуациями, когда вы и другой разработчик одновременно добавили миграции для одного приложения, в результате чего появилось две миграции с одним и тем же номером.

source: Don't worry - the numbers are just there for developers' reference, Django just cares that each migration has a different name. Migrations specify which other migrations they depend on - including earlier migrations in the same app - in the file, so it's possible to detect when there's two new migrations for the same app that aren't ordered.
ru: Не волнуйтесь - номер просто для разработчиков, Django главное, чтобы миграции имели уникальные названия. Миграции определяют зависимости к другим миграции - включая предыдущую миграцию из этого приложения. Таким образом можно определить наличие двух миграций с неправильным порядком.

source: When this happens, Django will prompt you and give you some options. If it thinks it's safe enough, it will offer to automatically linearize the two migrations for you. If not, you'll have to go in and modify the migrations yourself - don't worry, this isn't difficult, and is explained more in :ref:`migration-files` below.
ru: Когда это произойдет, Django предложит выбрать один из вариантов действий. Если Django определит, что достаточно безопасно может сам решить проблему, он предложит автоматически поменять порядок конфликтующим миграциям. Если нет, то вам придется самостоятельно это сделать - не волнуйтесь, это не трудно, и описано в :ref:`migration-files` ниже.

source: Dependencies
ru: Зависимости

source: This means that when you run the migrations, the ``authors`` migration runs first and creates the table the ``ForeignKey`` references, and then the migration that makes the ``ForeignKey`` column runs afterwards and creates the constraint. If this didn't happen, the migration would try to create the ``ForeignKey`` column without the table it's referencing existing and your database would throw an error.
ru: Это означает, что при запуске миграций, сначала применяются миграции приложения ``authors``, создаётся таблица, на которую ссылается ``ForeignKey``, и затем миграция, которая создаёт ``ForeignKey``. Иначе миграция попыталась бы создать ``ForeignKey`` на таблицу, которая может ещё не существовать, и мы получили бы ошибку.

source: This dependency behavior affects most migration operations where you restrict to a single app. Restricting to a single app (either in ``makemigrations`` or ``migrate``) is a best-efforts promise, and not a guarantee; any other apps that need to be used to get dependencies correct will be.
ru: Такое поведение зависимостей влияет на большинство миграционных операций, которые вы ограничили рамками одного приложения. Подобное ограничение (в ``makemigrations`` или ``migrate``) было отличным обещанием, но не гарантией. Любое другое приложение, которое потребуется для удовлетворения зависимости, будет использовано автоматически.

source: Migration files
ru: Файлы с миграциями

source: A basic migration file looks like this::
ru: Базовый файл миграции выглядит следующим образом::

source: What Django looks for when it loads a migration file (as a Python module) is a subclass of ``django.db.migrations.Migration`` called ``Migration``. It then inspects this object for four attributes, only two of which are used most of the time:
ru: При загрузке файла миграции (импортируя как Python модуль) Django ищет дочерний класс ``django.db.migrations.Migration``, который должен называться ``Migration``. Затем он анализирует четыре атрибута класса, из которых обычно используются только два:

source: ``dependencies``, a list of migrations this one depends on.
ru: ``dependencies`` - список зависимых миграций.

source: ``operations``, a list of ``Operation`` classes that define what this migration does.
ru: ``operations`` - список подклассов ``Operation``, которые определяют необходимые для миграции операции.

source: The operations are the key; they are a set of declarative instructions which tell Django what schema changes need to be made. Django scans them and builds an in-memory representation of all of the schema changes to all apps, and uses this to generate the SQL which makes the schema changes.
ru: Список операций - самое главное в миграции. Он декларативно описывает необходимые операции для изменения структуры базы данных. Django анализирует все операции и в памяти строит схему всех необходимых изменений, чтобы сгенерировать необходимые SQL-запросы.

source: That in-memory structure is also used to work out what the differences are between your models and the current state of your migrations; Django runs through all the changes, in order, on an in-memory set of models to come up with the state of your models last time you ran ``makemigrations``. It then uses these models to compare against the ones in your ``models.py`` files to work out what you have changed.
ru: Схема в памяти также используется чтобы определить отличия между вашими текущими моделями и состоянием моделей, описанном в миграциях. Django проходит по всем изменениям и создает структуру моделей на момент последнего выполнения ``makemigrations``. Затем эта структура сравнивается со структурой моделей в ``models.py`` и определяются изменения, которые вы внесли в ваши модели.

source: You should rarely, if ever, need to edit migration files by hand, but it's entirely possible to write them manually if you need to. Some of the more complex operations are not autodetectable and are only available via a hand-written migration, so don't be scared about editing them if you have to.
ru: Скорее всего вам никогда не понадобится менять сгенерированные миграции, но при необходимости вы можете сами написать миграцию. Некоторые сложные изменения Django не может автоматически определить, в таких случаях их необходимо описать самостоятельно. Но не бойтесь, это несложно.

source: Custom fields
ru: Собственные поля

source: You can't modify the number of positional arguments in an already migrated custom field without raising a ``TypeError``. The old migration will call the modified ``__init__`` method with the old signature. So if you need a new argument, please create a keyword argument and add something like ``assert 'argument_name' in kwargs`` in the constructor.
ru: Вы не можете поменять количество позиционных аргументов в уже промигрированном собственном поле, в таком случае будет вызвано исключение ``TypeError``. Это вызвано тем, что старая миграция попытается вызвать измененный метод ``__init__`` со старыми аргументами. Поэтому, если вам необходимо добавить новый аргумент в конструктор поля, используйте именованный аргумент и добавьте в конструктор что-то вроде ``assert 'argument_name' in kwargs``.

source: Model managers
ru: Менеджеры модели

source: You can optionally serialize managers into migrations and have them available in :class:`~django.db.migrations.operations.RunPython` operations. This is done by defining a ``use_in_migrations`` attribute on the manager class::
ru: Вы можете сериализировать менеджеры модели в миграции, чтобы использовать в их операциях :class:`~django.db.migrations.operations.RunPython`. Для этого укажите атрибут ``use_in_migrations`` в классе менеджера::

source: If you are using the :meth:`~django.db.models.from_queryset` function to dynamically generate a manager class, you need to inherit from the generated class to make it importable::
ru: Если вы используете функцию :meth:`~django.db.models.from_queryset`для создания менеджера, вам следует унаследоваться от сгенерированного класса::

source: Please refer to the notes about :ref:`historical-models` in migrations to see the implications that come along.
ru: Советуем ознакомиться с заметками в разделе :ref:`historical-models`.

source: Initial migrations
ru: Начальные миграции

source: Initial migrations are marked with an ``initial = True`` class attribute on the migration class. If an ``initial`` class attribute isn't found, a migration will be considered "initial" if it is the first migration in the app (i.e. if it has no dependencies on any other migration in the same app).
ru: Начальные миграции помечаются атрибутом ``initial = True`` в классе миграции. Если атрибут ``initial`` не указан, миграция будет считаться "начальной", если это первая миграция в приложении (то есть она не зависит от другой миграции текущего приложения).

source: Adding migrations to apps
ru: Добавление миграций в приложение

source: Note that this only works given two things:
ru: Обратите внимание, это работает только при соблюдении следующих условий:

source: You have not changed your models since you made their tables. For migrations to work, you must make the initial migration *first* and then make changes, as Django compares changes against migration files, not the database.
ru: Вы не меняли модели после создания таблиц в базе данных. Чтобы миграции сработали, необходимо *сначала* создать начальную миграцию, а потом вносить изменения, т.к. Django определяет изменения по файлам миграций, а не структуре в базе данных.

source: You have not manually edited your database - Django won't be able to detect that your database doesn't match your models, you'll just get errors when migrations try to modify those tables.
ru: Вы не меняли самостоятельно структуру базы данных. Django не сможет определить, что структура базы данных не соответствует структуре ваших моделей. Скорее всего вы получите ошибку при выполнении миграций.

source: Historical models
ru: "Исторические" модели

source: Because it's impossible to serialize arbitrary Python code, these historical models will not have any custom methods that you have defined. They will, however, have the same fields, relationships, managers (limited to those with ``use_in_migrations = True``) and ``Meta`` options (also versioned, so they may be different from your current ones).
ru: Т.к. невозможно сериализовать произвольный код Python, эти версии моделей не будут содержать методы, который вы добавили в модели. Однако, модели будут содержать аналогичные поля, связи, менеджеры(только те, которые содержат ``use_in_migrations = True``) и параметры ``Meta`` (с учетом версии модели, так что они могут отличаться от моделей, которые находятся на данный момент в приложении).

source: This means that you will NOT have custom ``save()`` methods called on objects when you access them in migrations, and you will NOT have any custom constructors or instance methods. Plan appropriately!
ru: Это означает, что вы НЕ сможете использовать переопределённый метод ``save()``. Также НЕ будет использоваться переопределённый конструктор модели. Вы должны учитывать это при создании Python кода миграций!

source: References to functions in field options such as ``upload_to`` and ``limit_choices_to`` and model manager declarations with managers having ``use_in_migrations = True`` are serialized in migrations, so the functions and classes will need to be kept around for as long as there is a migration referencing them. Any :doc:`custom model fields </howto/custom-model-fields>` will also need to be kept, since these are imported directly by migrations.
ru: Ссылки на функции, которые используются в параметрах поля (например, ``upload_to`` и ``limit_choices_to``), и менеджеры моделей с ``use_in_migrations = True`` будут сериализированы в миграциях. Такие функции нельзя удалять из кода проекта, пока существуют миграции, которые ссылаются на них. Все :doc:`собственные поля моделей </howto/custom-model-fields>` также должы быть доступны т.к. они явно импортируются в миграциях.

source: Considerations when removing model fields
ru: Советы по удалению полей модели

source: Similar to the "references to historical functions" considerations described in the previous section, removing custom model fields from your project or third-party app will cause a problem if they are referenced in old migrations.
ru: Из предыдущего раздела вы узнали, что удаление собственных полей модели из проекта или используемых приложений может привести к проблемам с миграциями, если существуют миграции, которые ссылаются на эти поля.

source: To help with this situation, Django provides some model field attributes to assist with model field deprecation using the :doc:`system checks framework </topics/checks>`.
ru: Чтобы помочь решить эту проблему, были добавлены атрибуты в поля модели, которые могут указать на устаревшие поля при :doc:`проверке проекта </topics/checks>`.

source: Add the ``system_check_deprecated_details`` attribute to your model field similar to the following::
ru: Добавьте атрибут ``system_check_deprecated_details`` к полю модели::

source: After a deprecation period of your choosing (two or three feature releases for fields in Django itself), change the ``system_check_deprecated_details`` attribute to ``system_check_removed_details`` and update the dictionary similar to::
ru: После определенного периода поддержки устаревшего кода (Django использует три мажорных релиза для своих полей), замените ``system_check_deprecated_details`` на ``system_check_removed_details`` со следующим значением::

source: You should keep the field's methods that are required for it to operate in database migrations such as ``__init__()``, ``deconstruct()``, and ``get_internal_type()``. Keep this stub field for as long as any migrations which reference the field exist. For example, after squashing migrations and removing the old ones, you should be able to remove the field completely.
ru: Вы должны сохранить методы поля поля, которые используются в миграции: ``__init__()``, ``deconstruct()`` и ``get_internal_type()``. Храните это поле-заглушку, пока существуют миграции, которые ссылаются на него. Например, после объединения миграций и удаления старых, вы сможете полностью удалить эти поля.

source: Data Migrations
ru: Миграция данных

source: As well as changing the database schema, you can also use migrations to change the data in the database itself, in conjunction with the schema if you want.
ru: Вы можете использовать миграции не только для изменения структуры базы данных, но и для изменения данных. Можно и в контексте изменения структуры, чтобы мигрировать данные на новую структуру таблицы.

source: Migrations that alter data are usually called "data migrations"; they're best written as separate migrations, sitting alongside your schema migrations.
ru: Миграции, которые изменяют данные, обычно называют "миграциями данных". Их лучше выносить в отдельную миграцию.
