Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/topics/migrations.po
Languages: ru

source: Django can't automatically generate data migrations for you, as it does with schema migrations, but it's not very hard to write them. Migration files in Django are made up of :doc:`Operations </ref/migration-operations>`, and the main operation you use for data migrations is :class:`~django.db.migrations.operations.RunPython`.
ru: Django не может автоматически создать миграции данных для вас, как это происходит с миграциями структуры, но их не сложно создать самостоятельно. Файлы миграций в Django содержат :doc:`Операции </ref/migration-operations>`. Для миграций данных вы будете использовать в основном :class:`~django.db.migrations.operations.RunPython`.

source: To start, make an empty migration file you can work from (Django will put the file in the right place, suggest a name, and add dependencies for you)::
ru: Для начала создайте пустую миграцию (Django создаст файл миграции, положит его в правильно место, создаст название и добавит необходимые зависимости)::

source: Then, open up the file; it should look something like this::
ru: Теперь откройте файл, он будет выглядеть следующим образом::

source: Now, all you need to do is create a new function and have :class:`~django.db.migrations.operations.RunPython` use it. :class:`~django.db.migrations.operations.RunPython` expects a callable as its argument which takes two arguments - the first is an :doc:`app registry </ref/applications/>` that has the historical versions of all your models loaded into it to match where in your history the migration sits, and the second is a :doc:`SchemaEditor </ref/schema-editor>`, which you can use to manually effect database schema changes (but beware, doing this can confuse the migration autodetector!)
ru: Теперь необходимо создать новую функцию и указать её в :class:`~django.db.migrations.operations.RunPython`. :class:`~django.db.migrations.operations.RunPython` принимает в качестве аргумента функцию (или любой другой вызываемый объект), которая принимает два аргумента. Первый - это :doc:`регистр приложений </ref/applications/>`, который содержит приложения и исторические версии моделей, соответствующие текущей структуре, описанной в миграциях. Второй - :doc:`SchemaEditor </ref/schema-editor>`, который можно использовать для изменения структуры базы данных (но будьте осторожны, это может сбить с толку автоматическое определение изменений структуры моделей!)

source: You can pass a second callable to :class:`~django.db.migrations.operations.RunPython` to run whatever logic you want executed when migrating backwards. If this callable is omitted, migrating backwards will raise an exception.
ru: Вы можете передать вторым аргументом :class:`~django.db.migrations.operations.RunPython` еще одну функцию, которая будет использоваться при отмене миграции. Если такая функция не указана, то при попытке отменить миграцию будет вызвано исключение.

source: Accessing models from other apps
ru: Доступ к моделям в других приложениях

source: When writing a ``RunPython`` function that uses models from apps other than the one in which the migration is located, the migration's ``dependencies`` attribute should include the latest migration of each app that is involved, otherwise you may get an error similar to: ``LookupError: No installed app with label 'myappname'`` when you try to retrieve the model in the ``RunPython`` function using ``apps.get_model()``.
ru: Если функция для ``RunPython`` использует модели другого приложения, атрибут ``dependencies`` миграции должен включать последнюю миграцию приложения, модель которого используется. Иначе вы можете получить исключение: ``LookupError: No installed app with label 'myappname'`` в функции ``RunPython`` при использовании ``apps.get_model()``.

source: In the following example, we have a migration in ``app1`` which needs to use models in ``app2``. We aren't concerned with the details of ``move_m1`` other than the fact it will need to access models from both apps. Therefore we've added a dependency that specifies the last migration of ``app2``::
ru: В примере у нас есть миграция из приложения ``app1``, которая используем модели из приложения ``app2``. Нас не интересует реализация ``move_m1``, но мы знаем, что этой функции необходим доступ к моделям из обоих приложений. Для этого мы добавили в зависимости последнюю миграцию ``app2``::

source: More advanced migrations
ru: Миграции для продвинутых

source: If you're interested in the more advanced migration operations, or want to be able to write your own, see the :doc:`migration operations reference </ref/migration-operations>` and the "how-to" on :doc:`writing migrations </howto/writing-migrations>`.
ru: Если вы хотите узнать как писать более сложные миграции, или как создавать миграции с нуля, смотрите :doc:`раздел об операциях в миграциях </ref/migration-operations>` и "how-to" о :doc:`создании миграций </howto/writing-migrations>`.

source: Squashing migrations
ru: Объединение миграций

source: You are encouraged to make migrations freely and not worry about how many you have; the migration code is optimized to deal with hundreds at a time without much slowdown. However, eventually you will want to move back from having several hundred migrations to just a few, and that's where squashing comes in.
ru: Вы можете создавать сколько угодно миграций и не задумываться об их количестве. Код миграций оптимизирован и может работать с сотнями миграций за вменяемое время. Но, если вы хотите уменьшить количество миграций, вы можете объединить их.

source: Squashing is the act of reducing an existing set of many migrations down to one (or sometimes a few) migrations which still represent the same changes.
ru: Объединение позволяет сократить количество миграций до одной (или нескольких), которая будет выполнять аналогичные изменения структуры.

source: Django does this by taking all of your existing migrations, extracting their ``Operation``\s and putting them all in sequence, and then running an optimizer over them to try and reduce the length of the list - for example, it knows that :class:`~django.db.migrations.operations.CreateModel` and :class:`~django.db.migrations.operations.DeleteModel` cancel each other out, and it knows that :class:`~django.db.migrations.operations.AddField` can be rolled into :class:`~django.db.migrations.operations.CreateModel`.
ru: Django загрузит все ваши миграции, соберёт последовательность объектов ``Operation``, затем попытается оптимизировать и сократить этот список. Например, Django понимает, что :class:`~django.db.migrations.operations.CreateModel` и :class:`~django.db.migrations.operations.DeleteModel` отменяют друг друга, и что :class:`~django.db.migrations.operations.AddField` может быть добавлена в :class:`~django.db.migrations.operations.CreateModel`.

source: Note that model interdependencies in Django can get very complex, and squashing may result in migrations that do not run; either mis-optimized (in which case you can try again with ``--no-optimize``, though you should also report an issue), or with a ``CircularDependencyError``, in which case you can manually resolve it.
ru: Обратите внимание, зависимости между моделями могут быть очень сложными. В результате объединения может получиться неработающая миграция или неправильно оптимизированная (в этом случае можете попробовать с опцией ``--no-optimize``, и желательно сообщить нам о проблеме), или может вызывать исключение ``CircularDependencyError`` (в этом случае вы можете самостоятельно исправить проблему).

source: Once you've squashed your migration, you should then commit it alongside the migrations it replaces and distribute this change to all running instances of your application, making sure that they run ``migrate`` to store the change in their database.
ru: После объединения миграций закоммитьте их, не удаляя старые миграции. После этого обновите все установленные версии проекта.

source: Once you've squashed a migration, you should not then re-squash that squashed migration until you have fully transitioned it to a normal migration.
ru: Объединив миграции в новую, вы не можете снова использовать её при новом объединении, пока она не будет преобразована в обычную миграцию.

source: Serializing values
ru: Сериализация значений

source: While Django can serialize most things, there are some things that we just can't serialize out into a valid Python representation - there's no Python standard for how a value can be turned back into code (``repr()`` only works for basic values, and doesn't specify import paths).
ru: Хотя Django может сериализовать большинство вещей, есть некоторые веши, которые нельзя сериализовать в представление Python - нет в Python стандарта, который определяет как преобразовать значение обратно в код (``repr()`` работает только для простых значений и не позволяет указать путь для импорта).

source: Django can serialize the following:
ru: Django позволяет сериализовать следующее:

source: ``datetime.date``, ``datetime.time``, and ``datetime.datetime`` instances (include those that are timezone-aware)
ru: Объекты ``datetime.date``, ``datetime.time`` и ``datetime.datetime`` (включая те, у которых указан часовой пояс)

source: ``decimal.Decimal`` instances
ru: Объекты ``decimal.Decimal``

source: ``LazyObject`` instances which wrap a serializable value.
ru: Объекты ``LazyObject``, которые содержат сериализируемое значение.

source: Any Django field
ru: Любое поле Django

source: Any function or method reference (e.g. ``datetime.datetime.today``) (must be in module's top-level scope)
ru: Ссылку на любую функцию или метод (например ``datetime.datetime.today``) (должны быть доступны на уровне модуля)

source: Any class reference (must be in module's top-level scope)
ru: Ссылка на класс (должны быть доступны на уровне модуля)

source: Anything with a custom ``deconstruct()`` method (:ref:`see below <custom-deconstruct-method>`)
ru: Любой объект с методом ``deconstruct()`` (:ref:`смотрите ниже <custom-deconstruct-method>`)

source: Django cannot serialize:
ru: Django не может сериализовать:

source: Nested classes
ru: Вложенные классы

source: Arbitrary class instances (e.g. ``MyClass(4.3, 5.7)``)
ru: Экземпляры произвольного класса (например ``MyClass(4.3, 5.7)``)

source: Lambdas
ru: Лямбда-функции

source: You can let Django serialize your own custom class instances by giving the class a ``deconstruct()`` method. It takes no arguments, and should return a tuple of three things ``(path, args, kwargs)``:
ru: Вы можете научить Django сериализовать объекты вашего класса, добавив ему метод ``deconstruct()``. Он не принимает аргументы и должен вернуть кортеж из трех элементов ``(path, args, kwargs)``:

source: ``path`` should be the Python path to the class, with the class name included as the last part (for example, ``myapp.custom_things.MyClass``). If your class is not available at the top level of a module it is not serializable.
ru: ``path`` - Python путь для импорта класса, включая название класса (например ``myapp.custom_things.MyClass``). Если класс не доступен для импорта напрямую из модуля, его нельзя сериализировать.

source: ``args`` should be a list of positional arguments to pass to your class' ``__init__`` method. Everything in this list should itself be serializable.
ru: ``args`` - список позиционных аргументов, которые необходимо передать в метод ``__init__``. Аргументы также должны быть сериализируемыми.

source: ``kwargs`` should be a dict of keyword arguments to pass to your class' ``__init__`` method. Every value should itself be serializable.
ru: ``kwargs`` - список именованных аргументов, которые необходимо передать в метод ``__init__``. Аргументы также должны быть сериализируемыми.

source: This return value is different from the ``deconstruct()`` method :ref:`for custom fields <custom-field-deconstruct-method>` which returns a tuple of four items.
ru: Метод ``deconstruct()`` :ref:`собственных полей <custom-field-deconstruct-method>` немного отличается, он должен возвращать кортеж из четырех элементов.

source: Django will write out the value as an instantiation of your class with the given arguments, similar to the way it writes out references to Django fields.
ru: Django запишет полученное значение, как инициализацию для всего класса с заданными аргументами, аналогично тому, как это делается для встроенных полей.

source: To prevent a new migration from being created each time :djadmin:`makemigrations` is run, you should also add a ``__eq__()`` method to the decorated class. This function will be called by Django's migration framework to detect changes between states.
ru: Чтобы Django не создавал новую миграцию при каждом выполнении :djadmin:`makemigrations`, добавьте метод ``__eq__()`` к декорируемому классу. Эта функция будет вызываться Django, чтобы определить не поменялось ли состояние моделей.

source: As long as all of the arguments to your class' constructor are themselves serializable, you can use the ``@deconstructible`` class decorator from ``django.utils.deconstruct`` to add the ``deconstruct()`` method::
ru: Если все аргументы вашего класса сериализируемые, то для автоматического создания метода вы можете использовать декоратор класса ``@deconstructible`` из ``django.utils.deconstruct``, чтобы добавить метод ``deconstruct()``::

source: The decorator adds logic to capture and preserve the arguments on their way into your constructor, and then returns those arguments exactly when deconstruct() is called.
ru: Декоратор сохраняет все аргументы, передаваемые в конструктор, и возвращает их при вызове ``deconstruct()``.

source: Supporting multiple Django versions
ru: Поддержка нескольких версий Django

source: If you are the maintainer of a third-party app with models, you may need to ship migrations that support multiple Django versions. In this case, you should always run :djadmin:`makemigrations` **with the lowest Django version you wish to support**.
ru: Если вы разрабатываете распространяемое приложение с моделями, вам необходимо создать миграции, которые поддерживают различные версии Django. В этом случае вы должны всегда выполнять :djadmin:`makemigrations` **для самый старой версии Django, которую вы поддерживаете**.

source: The migrations system will maintain backwards-compatibility according to the same policy as the rest of Django, so migration files generated on Django X.Y should run unchanged on Django X.Y+1. The migrations system does not promise forwards-compatibility, however. New features may be added, and migration files generated with newer versions of Django may not work on older versions.
ru: Система миграций поддерживает обратную совместимость как и остальная часть Django, и файлы миграций для Django X.Y должны работать для Django X.Y+1. Однако, система миграций не гарантирует обратную совместимость. Могут добавляться новые возможности и новые миграции не будут работать на старой версии Django.

source: Covers the schema operations API, special operations, and writing your own operations.
ru: Описывает API операций для изменений структуры базы данных, специальные операции, и создания своих операций.

source: Explains how to structure and write database migrations for different scenarios you might encounter.
ru: Описывает как самостоятельно создать миграции для решения различных ситуаций.
