Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/topics/pagination.po
Languages: ru

source: Pagination
ru: Постраничный вывод

source: Django provides a few classes that help you manage paginated data -- that is, data that's split across several pages, with "Previous/Next" links. These classes live in :file:`django/core/paginator.py`.
ru: Django предоставляет несколько классов, которые помогают реализовать постраничный вывод данных, т.е. данных, распределённых на несколько страниц с ссылками «Предыдущая/Следующая». Эти классы располагаются в :file:`django/core/paginator.py`.

source: Example
ru: Пример

source: Give :class:`Paginator` a list of objects, plus the number of items you'd like to have on each page, and it gives you methods for accessing the items for each page::
ru: Передайте в класс :class:`Paginator` список объектов и количество элементов, которое надо отображать на странице. Класс предоставит методы для доступа к элементам каждой страницы::

source: Note that you can give ``Paginator`` a list/tuple, a Django ``QuerySet``, or any other object with a ``count()`` or ``__len__()`` method. When determining the number of objects contained in the passed object, ``Paginator`` will first try calling ``count()``, then fallback to using ``len()`` if the passed object has no ``count()`` method. This allows objects such as Django's ``QuerySet`` to use a more efficient ``count()`` method when available.
ru: Следует отметить, что вы можете передать классу ``Paginator`` список/кортеж, ``QuerySet`` Django или любой другой объект, который имеет методы ``count()`` или ``__len__()``. Для определения количества объектов, содержащихся в переданном объекте, ``Paginator`` сначала попробует вызвать метод ``count()``, затем, при его отсутствии, вызывает ``len()``. Такой подход позволяет объектам, подобным ``QuerySet``, более эффективно использовать метод ``count()`` при его наличии.

source: Using ``Paginator`` in a view
ru: Использование ``Paginator`` в представлении

source: Here's a slightly more complex example using :class:`Paginator` in a view to paginate a queryset. We give both the view and the accompanying template to show how you can display the results. This example assumes you have a ``Contacts`` model that has already been imported.
ru: Здесь приведён более сложный пример использования класса :class:`Paginator` в представлении для постраничного вывода результатов запроса. Мы предоставили представление и его шаблон, чтобы показать, как вы можете отображать результаты. Данный пример предполагает наличие у вас модели ``Contacts``, которая уже была импортирована.

source: The view function looks like this::
ru: Функция представления может выглядеть так::

source: In the template :file:`list.html`, you'll want to include navigation between pages along with any interesting information from the objects themselves::
ru: В шаблоне :file:`list.html` подключен блок навигации по страницам::

source: ``Paginator`` objects
ru: Объекты ``Paginator``

source: The :class:`Paginator` class has this constructor:
ru: У класса :class:`Paginator` есть конструктор:

source: Required arguments
ru: Обязательные аргументы

source: A list, tuple, ``QuerySet``, or other sliceable object with a ``count()`` or ``__len__()`` method. For consistent pagination, ``QuerySet``\s should be ordered, e.g. with an :meth:`~django.db.models.query.QuerySet.order_by` clause or with a default :attr:`~django.db.models.Options.ordering` on the model.
ru: Список, кортеж, ``QuerySet`` или другие интериремые объекты с методами ``count()`` или ``__len__()``. Для постоянного постраничного вывода ``QuerySet`` должен быть отсортирован, например, с помощью метода :meth:`~django.db.models.query.QuerySet.order_by` или атрибутом модели :attr:`~django.db.models.Options.ordering`.

source: Performance issues paginating large ``QuerySet``\s
ru: Проблемы с производительностью при постраничном выводе больших ``QuerySet``

source: If you're using a ``QuerySet`` with a very large number of items, requesting high page numbers might be slow on some databases, because the resulting ``LIMIT``/``OFFSET`` query needs to count the number of ``OFFSET`` records which takes longer as the page number gets higher.
ru: Если вы используете ``QuerySet`` с большим количеством объектов, запрос страницы с большим номер может быть очень медленным на некоторых базах данных, т.к. ``LIMIT``/``OFFSET`` запроса должен учитывать записи до ``OFFSET``, что занимает больше времени, когда номер страницы увеличивается.

source: The maximum number of items to include on a page, not including orphans (see the ``orphans`` optional argument below).
ru: Максимальное количество элементов на странице, без учёта остатка (см. далее необязательный аргумент``orphans``).

source: Optional arguments
ru: Необязательные аргументы

source: Use this when you don't want to have a last page with very few items. If the last page would normally have a number of items less than or equal to ``orphans``, then those items will be added to the previous page (which becomes the last page) instead of leaving the items on a page by themselves. For example, with 23 items, ``per_page=10``, and ``orphans=3``, there will be two pages; the first page with 10 items and the second (and last) page with 13 items. ``orphans`` defaults to zero, which means pages are never combined and the last page may have one item.
ru: Используйте, когда нежелательно отображать последнюю страницу почти пустой. Если последняя страница будет содержать количество элементов меньше или равно ``orphans``, то эти элементы будут добавлены к предыдущей странице (которая станет последней). Например, для 23 элементов, ``per_page=10``и ``orphans=3``, будет выдано две страницы; первая страница будет содержать 10 элементов, а вторая (и последняя) — 13. ``orphans`` по умолчанию равен нулю и последняя страница может содержать один элемент.

source: Whether or not the first page is allowed to be empty. If ``False`` and ``object_list`` is empty, then an ``EmptyPage`` error will be raised.
ru: Позволять или нет первой странице быть пустой. Если указан ``False`` и ``object_list`` пустой, то будет вызвано исключение ``EmptyPage``.

source: Methods
ru: Методы

source: Returns a :class:`Page` object with the given 1-based index, while also handling out of range and invalid page numbers.
ru: Возвращает объект :class:`Page` по переданному индексу (начинается с единицы). Проверяет правильный ли номер страницы.

source: If the page isn't a number, it returns the first page. If the page number is negative or greater than the number of pages, it returns the last page.
ru: Если номер страницы не число, возвращает первую страницу. Если номер страницы отрицательный или больше, чем количество страниц, возвращает последнюю страницу.

source: It raises an exception (:exc:`EmptyPage`) only if you specify ``Paginator(..., allow_empty_first_page=False)`` and the ``object_list`` is empty.
ru: Вызывает исключение (:exc:`EmptyPage`) только если вы указали ``Paginator(..., allow_empty_first_page=False)`` и ``object_list`` пустой.

source: Returns a :class:`Page` object with the given 1-based index. Raises :exc:`InvalidPage` if the given page number doesn't exist.
ru: Возвращает объект :class:`Page` по переданному индексу (начинается с единицы). Вызывает исключение :exc:`InvalidPage`, если указанная страница не существует.

source: Attributes
ru: Атрибуты

source: The total number of objects, across all pages.
ru: Общее количество объектов, распределенных по всем страницам.

source: When determining the number of objects contained in ``object_list``, ``Paginator`` will first try calling ``object_list.count()``. If ``object_list`` has no ``count()`` method, then ``Paginator`` will fallback to using ``len(object_list)``. This allows objects, such as Django's ``QuerySet``, to use a more efficient ``count()`` method when available.
ru: При определении количества объектов, содержащихся в ``object_list``, ``Paginator`` сначала пробует вызвать ``object_list.count()``. Если у ``object_list`` нет метода ``count()``, то ``Paginator`` попробует вызвать ``len(object_list)``. Такой подход позволяет объектам, подобным ``QuerySet`` Django, более эффективно использовать метод ``count()`` при его наличии.

source: The total number of pages.
ru: Общее количество страниц.

source: A 1-based range iterator of page numbers, e.g. yielding ``[1, 2, 3, 4]``.
ru: Диапазон номеров страниц, начинающийся с единицы, т.е., ``[1, 2, 3, 4]``.

source: ``InvalidPage`` exceptions
ru: ``InvalidPage`` исключения

source: A base class for exceptions raised when a paginator is passed an invalid page number.
ru: Базовый класс для исключений, которые вызываются когда происходит запрос страницы по несуществующему номеру.

source: The :meth:`Paginator.page` method raises an exception if the requested page is invalid (i.e., not an integer) or contains no objects. Generally, it's enough to catch the ``InvalidPage`` exception, but if you'd like more granularity, you can catch either of the following exceptions:
ru: Метод :meth:`Paginator.page` вызывает исключение, если номер запрошенной страницы является неправильным (например, не представлен целым числом) или не содержит объектов. В общем случае, достаточно обрабатывать исключение ``InvalidPage``, но если вам требуется более тонкий контроль, вы можете отрабатывать следующие исключения:

source: Raised when ``page()`` is given a value that isn't an integer.
ru: Вызывается, если ``page()`` получает значение, которое не является целым числом.

source: Raised when ``page()`` is given a valid value but no objects exist on that page.
ru: Вызывается, если ``page()`` получает правильное значение, но для указанной страницы нет объектов.

source: Both of the exceptions are subclasses of :exc:`InvalidPage`, so you can handle them both with a simple ``except InvalidPage``.
ru: Эти исключения являются потомками класса :exc:`InvalidPage`, таким образом, вы можете обрабатывать их с помощью простого ``except InvalidPage``.

source: ``Page`` objects
ru: Объекты ``Page``

source: You usually won't construct ``Page`` objects by hand -- you'll get them using :meth:`Paginator.page`.
ru: Обычно создавать объекты ``Page`` вручную не требуется, так как вы получаете их с помощью метода :meth:`Paginator.page`.

source: A page acts like a sequence of :attr:`Page.object_list` when using ``len()`` or iterating it directly.
ru: Страница работает как срез :attr:`Page.object_list` при использовании ``len()`` или итерации по ней.

source: Returns ``True`` if there's a next page.
ru: Возвращает ``True``, если следующая страница существует.

source: Returns ``True`` if there's a previous page.
ru: Возвращает ``True``, если предыдущая страница существует.

source: Returns ``True`` if there's a next *or* previous page.
ru: Возвращает ``True``, если существует следующая *или* предыдущая страница.

source: Returns the next page number. Raises :exc:`InvalidPage` if next page doesn't exist.
ru: Возвращает номер следующей страницы. Вызывает :exc:`InvalidPage` если следующая страница не существует.

source: Returns the previous page number. Raises :exc:`InvalidPage` if previous page doesn't exist.
ru: Возвращает номер предыдущей страницы. Вызывает :exc:`InvalidPage` если предыдущая страница не существует.

source: Returns the 1-based index of the first object on the page, relative to all of the objects in the paginator's list. For example, when paginating a list of 5 objects with 2 objects per page, the second page's :meth:`~Page.start_index` would return ``3``.
ru: Возвращает индекс (начинается с единицы) первого объекта на странице относительно списка всех объектов. Например, для списка из пяти объектов при отображении двух объектов на странице, то для второй страницы метод :meth:`~Page.start_index` вернёт ``3``.

source: Returns the 1-based index of the last object on the page, relative to all of the objects in the paginator's list. For example, when paginating a list of 5 objects with 2 objects per page, the second page's :meth:`~Page.end_index` would return ``4``.
ru: Возвращает индекс (начинается с единицы) последнего объекта на странице относительно списка всех объектов. Например, для списка из пяти объектов при отображении двух объектов на странице, то для второй страницы метод :meth:`~Page.end_index` вернёт ``4``.

source: The list of objects on this page.
ru: Список объектов текущей страницы.

source: The 1-based page number for this page.
ru: Номер (начинается с единицы) текущей страницы.

source: The associated :class:`Paginator` object.
ru: Соответствующий объект :class:`Paginator`.
