Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/topics/security.po
Languages: ru

source: Take care with any :ref:`user uploaded files <file-upload-security>`.
ru: Будьте осторожны с любыми файлами, которые :ref:`загружены пользователями <file-upload-security>`.

source: Django does not throttle requests to authenticate users. To protect against brute-force attacks against the authentication system, you may consider deploying a Django plugin or Web server module to throttle these requests.
ru: Django не ограничивает количество запросов при аутентификации пользователей. Для того, чтобы защититься от перебора логина/пароля, вы можете поставить дополнительное приложение для Django или модуль для веб сервера, чтобы ограничивать такие запросы.

source: Keep your :setting:`SECRET_KEY` a secret.
ru: Храните содержимое параметра :setting:`SECRET_KEY` в секрете.

source: It is a good idea to limit the accessibility of your caching system and database using a firewall.
ru: Хорошей идеей будет ограничить доступ к вашей системе кэширования и к базе данных с помощью фаервола.

source: Take a look at the Open Web Application Security Project (OWASP) `Top 10 list`_ which identifies some common vulnerabilities in web applications. While Django has tools to address some of the issues, other issues must be accounted for in the design of your project.
ru: Обратите внимание на список `Топ 10 уязвимостей <https://www.owasp.org/index.php/Top_10_2013-Top_10>`_ на сайте Open Web Application Security Project (OWASP). Хотя Django содержит инструменты для защиты от некоторых из них, остальные должны быть учтены в архитектуре вашего проекта.
