Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/topics/security.po
Languages: ru

source: Security in Django
ru: Безопасность в Django

source: This document is an overview of Django's security features. It includes advice on securing a Django-powered site.
ru: Этот документ рассматривает возможности Django с точки зрения безопасности. В документе приведены советы по защите сайтов, созданных с помощью Django.

source: Cross site scripting (XSS) protection
ru: Защита от межсайтового скриптинга (XSS)

source: XSS attacks allow a user to inject client side scripts into the browsers of other users. This is usually achieved by storing the malicious scripts in the database where it will be retrieved and displayed to other users, or by getting users to click a link which will cause the attacker's JavaScript to be executed by the user's browser. However, XSS attacks can originate from any untrusted source of data, such as cookies or Web services, whenever the data is not sufficiently sanitized before including in a page.
ru: XSS атаки позволяют пользователю вставить собственные JS скрипты в браузеры других пользователей. Это достигается с помощью сохранения вредоносных скриптов в базе данных, которые затем запрашиваются и отображаются браузерами других пользователей, или принуждением пользователя нажать на ссылку, которая позволит вредоносному скрипту выполниться в браузере пользователя. Однако, XSS атаки могут происходить из любого недоверенного источника данных, такого как куки или веб сервисы, в случае когда данные были недостаточно очищены перед их размещением на странице.

source: Using Django templates protects you against the majority of XSS attacks. However, it is important to understand what protections it provides and its limitations.
ru: Использование шаблонов Django защищает вас от большинства XSS атак. Тем не менее, важно понимать, какую именно защиту они обеспечивают и где находится граница их возможностей.

source: Django templates :ref:`escape specific characters <automatic-html-escaping>` which are particularly dangerous to HTML. While this protects users from most malicious input, it is not entirely foolproof. For example, it will not protect the following:
ru: Шаблоны Django :ref:`экранируют специальные символы <automatic-html-escaping>`, которые обычно создают проблемы для HTML. И хотя экранирование защищает пользователя от большинства видов вредоносного ввода, оно не является панацеей. Например, оно не защитит от такого:

source: If ``var`` is set to ``'class1 onmouseover=javascript:func()'``, this can result in unauthorized JavaScript execution, depending on how the browser renders imperfect HTML. (Quoting the attribute value would fix this case.)
ru: Если ``var`` содержит ``'class1 onmouseover=javascript:func()'``, то это может вылиться в неавторизованный запуск JavaScript, здесь всё зависит от того, как браузер интерпретирует несовершенный HTML. (Установка кавычек вокруг значения атрибута решает данную проблему.)

source: It is also important to be particularly careful when using ``is_safe`` with custom template tags, the :tfilter:`safe` template tag, :mod:`mark_safe <django.utils.safestring>`, and when autoescape is turned off.
ru: Важно обратить особое внимание на использование ``is_safe`` совместно с сторонними шаблонными тегами, с шаблонным тегом :ttag:`safe`, с :mod:`mark_safe <django.utils.safestring>` и когда автоматическое экранирование отключено.

source: In addition, if you are using the template system to output something other than HTML, there may be entirely separate characters and words which require escaping.
ru: Дополнительно, если вы используйте шаблонную систему для вывода контента, отличного от HTML, то там могут быть отдельные символы и слова, которые требуют экранирования.

source: You should also be very careful when storing HTML in the database, especially when that HTML is retrieved and displayed.
ru: Вы также должны быть очень осторожны при сохранении HTML в базе данных, особенно в случае, когда этот HTML будет отображаться впоследствии.

source: Cross site request forgery (CSRF) protection
ru: Защита от подделки межсайтового запроса (CSRF)

source: CSRF attacks allow a malicious user to execute actions using the credentials of another user without that user's knowledge or consent.
ru: CSRF атаки позволяют недобросовестному пользователю выполнять действия от имени другого пользователя, без ведома последнего или его согласия.

source: Django has built-in protection against most types of CSRF attacks, providing you have :ref:`enabled and used it <using-csrf>` where appropriate. However, as with any mitigation technique, there are limitations. For example, it is possible to disable the CSRF module globally or for particular views. You should only do this if you know what you are doing. There are other :ref:`limitations <csrf-limitations>` if your site has subdomains that are outside of your control.
ru: Django обладает встроенной защитой против большинства типов CSRF атак, если вы :ref:`активировали и использовали её <using-csrf>` там, где это необходимо. Однако, как это обычно бывает, существуют ограничения. Например, есть возможность отключить защиту CSRF глобально или на уровне отдельного представления. Такое можно делать, только если вы точно уверены в своих действиях. Существуют другие :ref:`ограничения <csrf-limitations>`, если у вашего сайта есть поддомены, не находящиеся под вашим управлением.

source: When deployed with :ref:`HTTPS <security-recommendation-ssl>`, ``CsrfViewMiddleware`` will check that the HTTP referer header is set to a URL on the same origin (including subdomain and port). Because HTTPS provides additional security, it is imperative to ensure connections use HTTPS where it is available by forwarding insecure connection requests and using HSTS for supported browsers.
ru: При работе через :ref:`HTTPS <security-recommendation-ssl>`, ``CsrfViewMiddleware`` будет проверять, что заголовок HTTP Referer установлен на URL того же источника (включая поддомен и порт). Так как HTTPS предоставляет дополнительную защиту, надо всегда проверять, что соединения используют его всегда, перенаправляя на HTTPS запросы по незащищённым соединениям и используя HSTS для браузеров, которые это поддерживают.

source: Be very careful with marking views with the ``csrf_exempt`` decorator unless it is absolutely necessary.
ru: Будьте очень внимательны, декорируя представления с помощью ``csrf_exempt``, когда в этом нет явной необходимости.

source: SQL injection protection
ru: Защита от внедрения SQL

source: SQL injection is a type of attack where a malicious user is able to execute arbitrary SQL code on a database. This can result in records being deleted or data leakage.
ru: Внедрение SQL — это тип атаки, когда недобросовестный пользователь имеет возможность выполнить в базе данных определённый SQL запрос. Результатом выполнения такого запроса может быть удаление или даже утечка данных.

source: Django's querysets are protected from SQL injection since their queries are constructed using query parameterization. A query's SQL code is defined separately from the query's parameters. Since parameters may be user-provided and therefore unsafe, they are escaped by the underlying database driver.
ru: Забросы через Django ORM защищены от SQL-инъекции т.к. они формируются с использованием параметров запроса. SQL код запроса отделен от параметров запроса. Т.к. параметры запроса могут поступать от пользователя и быть не безопасными, они экранируют на уровне драйвера базы данных.

source: Django also gives developers power to write :ref:`raw queries <executing-raw-queries>` or execute :ref:`custom sql <executing-custom-sql>`. These capabilities should be used sparingly and you should always be careful to properly escape any parameters that the user can control. In addition, you should exercise caution when using :meth:`~django.db.models.query.QuerySet.extra` and :class:`~django.db.models.expressions.RawSQL`.
ru: Django предоставляет разработчикам возможность писать :ref:`запросы напрямую <executing-raw-queries>` или выполнять :ref:`собственные запросы <executing-custom-sql>`. Эти возможности следует использовать умеренно и всегда обращать пристальное внимание на экранирование всех параметров, которые предоставлены пользователем. Также следует проявлять осторожность при использовании :meth:`~django.db.models.query.QuerySet.extra` и :class:`~django.db.models.expressions.RawSQL`.

source: Clickjacking protection
ru: Защита от скликивания

source: Clickjacking is a type of attack where a malicious site wraps another site in a frame. This attack can result in an unsuspecting user being tricked into performing unintended actions on the target site.
ru: Скликивание — это атака, при которой вредоносный сайт подменяет другой сайт используя <iframe>. В результате этой атаки ничего не подозревающий пользователь принуждается к выполнению определённых действий на целевом сайте.

source: Django contains :ref:`clickjacking protection <clickjacking-prevention>` in the form of the :mod:`X-Frame-Options middleware <django.middleware.clickjacking.XFrameOptionsMiddleware>` which in a supporting browser can prevent a site from being rendered inside a frame. It is possible to disable the protection on a per view basis or to configure the exact header value sent.
ru: Django предоставляет :ref:`защиту от этой атаки <clickjacking-prevention>` в виде модуля :mod:`X-Frame-Options <django.middleware.clickjacking.XFrameOptionsMiddleware>`, который, при использовании соответствующего браузера, может предотвратить отображение сайта внутри фрейма. Есть возможность отключить данную защиту для выбранных представлений или настроить значение отправляемого заголовка.

source: The middleware is strongly recommended for any site that does not need to have its pages wrapped in a frame by third party sites, or only needs to allow that for a small section of the site.
ru: Этот функциональный слой настоятельно рекомендуется использовать на любом сайте, страницы которого не должны отображаться внутри другого сайта. Можно позволить такое отображение для простых страниц.

source: It is always better for security to deploy your site behind HTTPS. Without this, it is possible for malicious network users to sniff authentication credentials or any other information transferred between client and server, and in some cases -- **active** network attackers -- to alter data that is sent in either direction.
ru: Лучше предоставлять доступ к вашему сайту только через HTTPS. При отсутствии HTTPS злоумышленник имеет возможность перехватывать аутентификационные данные или любую другую информацию, передаваемую между клиентом и сервером. А в случае **активной** атаки — может даже изменять данные, передаваемые в любом направлении.

source: If you want the protection that HTTPS provides, and have enabled it on your server, there are some additional steps you may need:
ru: Если вам нужна защита, предоставляемая HTTPS, и на сервере произведена соответствующая настройка ПО, то надо выполнить ещё несколько шагов, чтобы быть уверенным в защите своей информации:

source: If necessary, set :setting:`SECURE_PROXY_SSL_HEADER`, ensuring that you have understood the warnings there thoroughly. Failure to do this can result in CSRF vulnerabilities, and failure to do it correctly can also be dangerous!
ru: При необходимости, установите параметр конфигурации :setting:`SECURE_PROXY_SSL_HEADER`, чтобы показать, что вы поняли все предупреждения. Отказ от этого может привести к CSRF проблемам, а отказ сделать это правильно также может быть опасен!

source: Set :setting:`SECURE_SSL_REDIRECT` to ``True``, so that requests over HTTP are redirected to HTTPS.
ru: Настройте перенаправление HTTP запросов на HTTPS, указав ``True`` в :setting:`SECURE_SSL_REDIRECT`.

source: Please note the caveats under :setting:`SECURE_PROXY_SSL_HEADER`. For the case of a reverse proxy, it may be easier or more secure to configure the main Web server to do the redirect to HTTPS.
ru: Пожалуйста, обратите внимание на недостатки :setting:`SECURE_PROXY_SSL_HEADER`. Для случая обратного прокси, может быть проще или более безопасно настроить главный веб сервер для перенаправление запросов по HTTPS.

source: Use 'secure' cookies.
ru: Использование 'безопасных' куки.

source: If a browser connects initially via HTTP, which is the default for most browsers, it is possible for existing cookies to be leaked. For this reason, you should set your :setting:`SESSION_COOKIE_SECURE` and :setting:`CSRF_COOKIE_SECURE` settings to ``True``. This instructs the browser to only send these cookies over HTTPS connections. Note that this will mean that sessions will not work over HTTP, and the CSRF protection will prevent any POST data being accepted over HTTP (which will be fine if you are redirecting all HTTP traffic to HTTPS).
ru: Если браузер изначально подключается через HTTP, что характерно для большинства браузеров, есть возможность утечки существующих кук. По этой причине вам сделать установить параметры :setting:`SESSION_COOKIE_SECURE` и :setting:`CSRF_COOKIE_SECURE` в ``True``. Это заставить браузер отправлять такие куки только через HTTPS. Следует отметить, это сделает невозможным работу сессий через HTTP, а CSRF защита не будет принимать POST данные, полученные через HTTP (это решается с помощью перенаправления HTTP трафика через HTTPS).

source: Use :ref:`http-strict-transport-security` (HSTS)
ru: Использование :ref:`http-strict-transport-security` (HSTS)

source: HSTS is an HTTP header that informs a browser that all future connections to a particular site should always use HTTPS. Combined with redirecting requests over HTTP to HTTPS, this will ensure that connections always enjoy the added security of SSL provided one successful connection has occurred. HSTS may either be configured with :setting:`SECURE_HSTS_SECONDS`, :setting:`SECURE_HSTS_INCLUDE_SUBDOMAINS`, and :setting:`SECURE_HSTS_PRELOAD`, or on the Web server.
ru: HSTS является HTTP заголовком, который информирует браузер, что все следующие соединения к конкретному сайту всегда должны использовать HTTPS. Дополняя это перенаправлением HTTP запросов на HTTPS, мы получаем дополнительную защиту от использования SSL. HSTS может быть настроен с помощью настроек :setting:`SECURE_HSTS_SECONDS`, :setting:`SECURE_HSTS_INCLUDE_SUBDOMAINS` и :setting:`SECURE_HSTS_PRELOAD`, или на web-сервере.

source: Host header validation
ru: Проверка заголовка хоста

source: Django uses the ``Host`` header provided by the client to construct URLs in certain cases. While these values are sanitized to prevent Cross Site Scripting attacks, a fake ``Host`` value can be used for Cross-Site Request Forgery, cache poisoning attacks, and poisoning links in emails.
ru: Django использует заголовок ``Host``, предоставляемый клиентом, для создания URL в определённых случаях. Несмотря на то, что эти данные безопасны с точки зрения Cross Site Scripting атак, поддельный заголовок ``Host`` может быть использован для атак CSRF, подмены кэша и для подмены ссылок в сообщениях электронной почты.

source: Because even seemingly-secure web server configurations are susceptible to fake ``Host`` headers, Django validates ``Host`` headers against the :setting:`ALLOWED_HOSTS` setting in the :meth:`django.http.HttpRequest.get_host()` method.
ru: Поскольку даже по-видимому безопасные конфигурации веб-сервера восприимчивы к поддельным заголовкам ``Host`` заголовки, Django проверяет этот заголовок относительно параметра конфигурации :setting:`ALLOWED_HOSTS` с помощью метода :meth:`django.http.HttpRequest.get_host()`.

source: This validation only applies via :meth:`~django.http.HttpRequest.get_host()`; if your code accesses the ``Host`` header directly from ``request.META`` you are bypassing this security protection.
ru: Эта проверка применяется только через :meth:`~django.http.HttpRequest.get_host()`. Если ваш код получает содержимое заголовка ``Host`` напрямую из ``request.META``, то вы игнорируете эту защиту.

source: For more details see the full :setting:`ALLOWED_HOSTS` documentation.
ru: Для подробностей смотрите полную документацию на параметр конфигурации :setting:`ALLOWED_HOSTS`.

source: Previous versions of this document recommended configuring your web server to ensure it validates incoming HTTP ``Host`` headers. While this is still recommended, in many common web servers a configuration that seems to validate the ``Host`` header may not in fact do so. For instance, even if Apache is configured such that your Django site is served from a non-default virtual host with the ``ServerName`` set, it is still possible for an HTTP request to match this virtual host and supply a fake ``Host`` header. Thus, Django now requires that you set :setting:`ALLOWED_HOSTS` explicitly rather than relying on web server configuration.
ru: Предыдущие версии этого документа рекомендовали настраивать ваш веб сервер на проверку входящих HTTP заголовков ``Host``. Рекомендация всё ещё в силе, на многих веб-серверах используется конфигурация, которая не проверяет заголовок ``Host``, хотя по всем признакам должна это делать. Например, даже если Apache настроен таким образом, что ваш сайт работает на нестандартном виртуальном узле с установленным ``ServerName``, всё ещё есть возможность предоставить поддельный заголовок для этого узла. Таким образом, Django теперь требует явного определения параметра конфигурации :setting:`ALLOWED_HOSTS`, не доверяя конфигурации самого веб сервера.

source: Additionally, Django requires you to explicitly enable support for the ``X-Forwarded-Host`` header (via the :setting:`USE_X_FORWARDED_HOST` setting) if your configuration requires it.
ru: Дополнительно Django требует явную активацию поддержки заголовка ``X-Forwarded-Host`` (через параметр конфигурации :setting:`USE_X_FORWARDED_HOST`), если ваша конфигурация в нём нуждается.

source: Session security
ru: Безопасность сессий

source: Similar to the :ref:`CSRF limitations <csrf-limitations>` requiring a site to be deployed such that untrusted users don't have access to any subdomains, :mod:`django.contrib.sessions` also has limitations. See :ref:`the session topic guide section on security <topics-session-security>` for details.
ru: Аналогично требованиям :ref:`ограничений CSRF <csrf-limitations>`, чтобы сайт был настроен так, чтобы недоверенные пользователи не имели доступа ни к одному поддомену, :mod:`django.contrib.sessions` также имеет ограничения. Обратитесь к :ref:`разделу по безопасной настройке сессий <topics-session-security>` для подробностей.

source: User-uploaded content
ru: Контент, загружаемый пользователями

source: Consider :ref:`serving static files from a cloud service or CDN <staticfiles-from-cdn>` to avoid some of these issues.
ru: Обратите внимание на :ref:`раздачу файлов из облачного сервиса или CDN <staticfiles-from-cdn>` для избежания некоторых из этих проблем.

source: If your site accepts file uploads, it is strongly advised that you limit these uploads in your Web server configuration to a reasonable size in order to prevent denial of service (DOS) attacks. In Apache, this can be easily set using the LimitRequestBody_ directive.
ru: Если ваш сайт принимает файлы, настоятельно советуем ограничить размер таких загрузок в конфигурации веб сервера для предотвращения атак на отказ сервиса (DOS). В случае Apache это легко можно сделать с помощью директивы LimitRequestBody_.

source: If you are serving your own static files, be sure that handlers like Apache's ``mod_php``, which would execute static files as code, are disabled. You don't want users to be able to execute arbitrary code by uploading and requesting a specially crafted file.
ru: Если вы самостоятельно раздаете статические файлы, убедитесь, что обработчики, как ``mod_php`` в Apache, который будет выполнять статические файлы в виде кода, будут отключены. Вы же не хотите, чтобы пользователи могли выполнить произвольный код путем загрузки и запроса специально созданного файла.

source: Django's media upload handling poses some vulnerabilities when that media is served in ways that do not follow security best practices. Specifically, an HTML file can be uploaded as an image if that file contains a valid PNG header followed by malicious HTML. This file will pass verification of the library that Django uses for :class:`~django.db.models.ImageField` image processing (Pillow). When this file is subsequently displayed to a user, it may be displayed as HTML depending on the type and configuration of your web server.
ru: Обработка загрузки медиа файлов в Django имеет некоторые уязвимости, если медиа файлы раздаются без учета некоторых правил безопасности. В частности, HTML файл может быть загружен в виде изображения, если этот файл содержит правильный заголовок PNG с последующим вредоносным HTML. Этот файл будет проходить проверку библиотеками, которые Django использует для обработки изображений (Pillow) в :class:`~django.db.models.ImageField`. Когда этот файл впоследствии отображается для пользователя, он может отображаться как HTML в зависимости от типа и конфигурации веб-сервера.

source: No bulletproof technical solution exists at the framework level to safely validate all user uploaded file content, however, there are some other steps you can take to mitigate these attacks:
ru: Не существует идеального технического решения на уровне Django для безопасной проверки всех типов файлов, которые могут загрузить другие пользователи. Однако, можно предпринять некоторые другие способы, чтобы обезопасить себя от атаки:

source: One class of attacks can be prevented by always serving user uploaded content from a distinct top-level or second-level domain. This prevents any exploit blocked by `same-origin policy`_ protections such as cross site scripting. For example, if your site runs on ``example.com``, you would want to serve uploaded content (the :setting:`MEDIA_URL` setting) from something like ``usercontent-example.com``. It's *not* sufficient to serve content from a subdomain like ``usercontent.example.com``.
ru: Один класс атак можно предотвратить путем раздачи медиа файлов с отдельного домена верхнего уровня или второго уровня. Это предотвращает любые эксплойты, которые могут быть заблокированы `same-origin policy`_, таких как межсайтовый скриптинг. Например, если ваш сайт работает на ``example.com``, вам следует раздавать медиа файлы (настройка :setting:`MEDIA_URL`) с другого домена, например ``usercontent-example.com``. Но *не* достаточно раздавать медиа файлы с поддомен вида ``usercontent.example.com``.

source: Beyond this, applications may choose to define a whitelist of allowable file extensions for user uploaded files and configure the web server to only serve such files.
ru: Помимо этого, приложения могут определять белый список допустимых расширений файлов для загружаемых пользователем файлов и настроить веб-сервер чтобы раздавать только такие файлы.

source: Additional security topics
ru: Дополнительные вопросы безопасности

source: While Django provides good security protection out of the box, it is still important to properly deploy your application and take advantage of the security protection of the Web server, operating system and other components.
ru: Несмотря на то, что Django предоставляет защиту прямо из коробки, правильная установка вашего приложения всё ещё имеет значение. Также важно иметь правильно настроенный веб сервер, операционную систему и другие компоненты.

source: Make sure that your Python code is outside of the Web server's root. This will ensure that your Python code is not accidentally served as plain text (or accidentally executed).
ru: Код вашего приложения должен находиться вне корня веб сервера. Это не позволит случайно отобразить его в виде текста или выполнить его.
