Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/topics/settings.po
Languages: ru

source: Django settings
ru: Настройки Django

source: A Django settings file contains all the configuration of your Django installation. This document explains how settings work and which settings are available.
ru: Файл настроек Django содержит полную конфигурацию установленного проекта. Этот раздел описывает какие настройки доступны и как они работают.

source: The basics
ru: Основы

source: A settings file is just a Python module with module-level variables.
ru: Файл настроек -- это просто модуль Python с переменными модуля.

source: Here are a couple of example settings::
ru: Вот пример настроек::

source: If you set :setting:`DEBUG` to ``False``, you also need to properly set the :setting:`ALLOWED_HOSTS` setting.
ru: Если установить ``False`` в :setting:`DEBUG`, вам также необходимо правильно определить :setting:`ALLOWED_HOSTS`.

source: Because a settings file is a Python module, the following apply:
ru: Так как файл настроек это модуль Python, верно следующее:

source: It doesn't allow for Python syntax errors.
ru: Не допускаются ошибки синтаксиса Python.

source: It can assign settings dynamically using normal Python syntax. For example::
ru: Можно динамически определять настройки, используя обычный синтаксис Python. Например::

source: It can import values from other settings files.
ru: Можно импортировать значения из других файлов настроек.

source: Designating the settings
ru: Определения файла настроек

source: When you use Django, you have to tell it which settings you're using. Do this by using an environment variable, ``DJANGO_SETTINGS_MODULE``.
ru: При использовании Django необходимо указать какие настройки вы используете. Используйте для этого переменную окружения ``DJANGO_SETTINGS_MODULE``.

source: The value of ``DJANGO_SETTINGS_MODULE`` should be in Python path syntax, e.g. ``mysite.settings``. Note that the settings module should be on the Python `import search path`_.
ru: Значение ``DJANGO_SETTINGS_MODULE`` должно содержать путь импорта Python, например ``mysite.settings``. Обратите внимание, модуль с настройками должен быть доступен для `импорта <http://www.diveintopython.net/getting_to_know_python/everything_is_an_object.html>`_.

source: The ``django-admin`` utility
ru: Использование ``django-admin``

source: When using :doc:`django-admin </ref/django-admin>`, you can either set the environment variable once, or explicitly pass in the settings module each time you run the utility.
ru: При использовании :doc:`django-admin </ref/django-admin>` вы можете один раз определить переменную окружения, или каждый раз явно указывать модуль с настройками.

source: Example (Unix Bash shell)::
ru: Например (Unix Bash shell)::

source: Example (Windows shell)::
ru: Например (Windows shell)::

source: Use the ``--settings`` command-line argument to specify the settings manually::
ru: Используйте аргумент ``--settings``, чтобы явно указать модуль с настройками::

source: On the server (``mod_wsgi``)
ru: Настройки сервера (``mod_wsgi``)

source: In your live server environment, you'll need to tell your WSGI application what settings file to use. Do that with ``os.environ``::
ru: При настройках сервера вам понадобиться указать WSGI-приложению какой файл с настройками использовать. Для этого используйте ``os.environ``::

source: Read the :doc:`Django mod_wsgi documentation </howto/deployment/wsgi/modwsgi>` for more information and other common elements to a Django WSGI application.
ru: Подробности читайте в :doc:`разделе о Django mod_wsgi </howto/deployment/wsgi/modwsgi>`.

source: Default settings
ru: Настройки по умолчанию

source: A Django settings file doesn't have to define any settings if it doesn't need to. Each setting has a sensible default value. These defaults live in the module :file:`django/conf/global_settings.py`.
ru: Проект Django не обязан определять какие-либо настройки, если в этом нет необходимости. Каждая настройка содержит значение по умолчанию. Эти значния можно найти в модуле :file:`django/conf/global_settings.py`.

source: Here's the algorithm Django uses in compiling settings:
ru: Django использует следующий алгоритм для загрузки настроек:

source: Load settings from ``global_settings.py``.
ru: Загружает настройки из ``global_settings.py``.

source: Load settings from the specified settings file, overriding the global settings as necessary.
ru: Загружает настройки из указанного файла настроек, перезаписывая значения по умолчанию.

source: Note that a settings file should *not* import from ``global_settings``, because that's redundant.
ru: Обратите внимание, файла с настройками *не* должен импортировать ``global_settings``.

source: Seeing which settings you've changed
ru: Узнать какие настройки вы поменяли

source: There's an easy way to view which of your settings deviate from the default settings. The command ``python manage.py diffsettings`` displays differences between the current settings file and Django's default settings.
ru: Есть простой способ узнать какие настройки вашего проекта отличаются от настроек по умолчанию. Команда ``python manage.py diffsettings`` показывает разницу между текущими настройками и настройками по умолчанию Django.

source: For more, see the :djadmin:`diffsettings` documentation.
ru: Подробности смотрите в описании :djadmin:`diffsettings`.

source: Using settings in Python code
ru: Использование настроек в коде Python

source: In your Django apps, use settings by importing the object ``django.conf.settings``. Example::
ru: В вашем приложении Django вы можете использовать настройки, импортировав ``django.conf.settings``. Например::

source: Note that ``django.conf.settings`` isn't a module -- it's an object. So importing individual settings is not possible::
ru: Обратите внимание, ``django.conf.settings`` -- это не модуль, а объект. По этому нельзя импортировать отдельные настройки::

source: Also note that your code should *not* import from either ``global_settings`` or your own settings file. ``django.conf.settings`` abstracts the concepts of default settings and site-specific settings; it presents a single interface. It also decouples the code that uses settings from the location of your settings.
ru: Также ваш код *не* должен использовать непосредственно ``global_settings`` или ваш модуль настроек. ``django.conf.settings`` предоставляет единый интерфейс работы с настройками, реализуя концепцию настроек по умолчанию и настроек проекта. Также разделяет код, который использует настройки, и сами настройки.

source: Altering settings at runtime
ru: Изменяем настройки в процессе работы

source: You shouldn't alter settings in your applications at runtime. For example, don't do this in a view::
ru: Вам не следует менять настройки в процессе работы приложения. Например, не делайте следующее в представлении::

source: The only place you should assign to settings is in a settings file.
ru: Единственное место, где вы можете определять настройки -- это файл с настройками.

source: Security
ru: Безопасность

source: Because a settings file contains sensitive information, such as the database password, you should make every attempt to limit access to it. For example, change its file permissions so that only you and your Web server's user can read it. This is especially important in a shared-hosting environment.
ru: Файл настроек содержит конфиденциальную информацию, например, как пароль к базе данных, вы должны хранить его в безопасности. Например, поменяйте права доступа к файлу, чтобы только вы и пользователь веб-сервера имел к нему доступ. Это особенно важно для хостингов с общим окружением.

source: Available settings
ru: Доступные настройки

source: For a full list of available settings, see the :doc:`settings reference </ref/settings>`.
ru: Полный список настроек смотрите в :doc:`разделе о настройках </ref/settings>`.

source: Creating your own settings
ru: Добавление собственных настроек

source: There's nothing stopping you from creating your own settings, for your own Django apps. Just follow these guidelines:
ru: Вы можете добавлять настройки для ваших приложений Django. Просто следуйте правилам:

source: Setting names must be all uppercase.
ru: Названия настроек должны быть в верхнем регистре.

source: Don't reinvent an already-existing setting.
ru: Не изобретайте заново существующие настройки.

source: For settings that are sequences, Django itself uses lists, but this is only a convention.
ru: Для настроек, которые представляют множество, Django использует списки, но это это не обязательно.

source: Using settings without setting ``DJANGO_SETTINGS_MODULE``
ru: Использование настроек без `DJANGO_SETTINGS_MODULE``

source: In some cases, you might want to bypass the ``DJANGO_SETTINGS_MODULE`` environment variable. For example, if you're using the template system by itself, you likely don't want to have to set up an environment variable pointing to a settings module.
ru: В некоторых случаях вы можете не использовать переменную окружения ``DJANGO_SETTINGS_MODULE``. Например, если вы используете систему шаблонов без Django, вряд ли вы захотите настраивать переменную окружения для настроек.

source: In these cases, you can configure Django's settings manually. Do this by calling:
ru: В этом случае вы можете явно определить настройки Django. Для этого вызовите:

source: Example::
ru: Например::

source: Pass ``configure()`` as many keyword arguments as you'd like, with each keyword argument representing a setting and its value. Each argument name should be all uppercase, with the same name as the settings described above. If a particular setting is not passed to ``configure()`` and is needed at some later point, Django will use the default setting value.
ru: Вы можете передать в ``configure()`` любое количество именованных аргументов, которые представляют настройки и их значения. Названия аргументов должны быть в верхнем регистре, как и названия настроек. Если какая-то настройка не была указанна в ``configure()``, Django при необходимости будет использовать значение по умолчанию.

source: Configuring Django in this fashion is mostly necessary -- and, indeed, recommended -- when you're using a piece of the framework inside a larger application.
ru: Настройка Django таким способом необходима, и рекомендуется использовать, при использовании части фреймверка в другом приложении.

source: Consequently, when configured via ``settings.configure()``, Django will not make any modifications to the process environment variables (see the documentation of :setting:`TIME_ZONE` for why this would normally occur). It's assumed that you're already in full control of your environment in these cases.
ru: При настройке через ``settings.configure()`` Django не меняет переменные окружения (смотрите описание :setting:`TIME_ZONE`, чтобы узнать когда это происходит). Подразумевается, что вы уже полностью контролируете свое окружение.

source: Custom default settings
ru: Собственные значения по умолчанию

source: If you'd like default values to come from somewhere other than ``django.conf.global_settings``, you can pass in a module or class that provides the default settings as the ``default_settings`` argument (or as the first positional argument) in the call to ``configure()``.
ru: Если вы хотите, чтобы значения по умолчанию загружались не с ``django.conf.global_settings``, вы можете указать аргумент ``default_settings`` (или первый аргумент) при вызове ``configure()``, который содержит модуль или класс со значениями по умолчанию.

source: In this example, default settings are taken from ``myapp_defaults``, and the :setting:`DEBUG` setting is set to ``True``, regardless of its value in ``myapp_defaults``::
ru: В этом примере настройки по умолчанию загружаются с ``myapp_defaults``, и настройка :setting:`DEBUG` равна ``True``, несмотря на значение из ``myapp_defaults``::

source: The following example, which uses ``myapp_defaults`` as a positional argument, is equivalent::
ru: Следующий пример, который использует ``myapp_defaults`` как позиционный аргумент, аналогичен предыдущему::

source: Normally, you will not need to override the defaults in this fashion. The Django defaults are sufficiently tame that you can safely use them. Be aware that if you do pass in a new default module, it entirely *replaces* the Django defaults, so you must specify a value for every possible setting that might be used in that code you are importing. Check in ``django.conf.settings.global_settings`` for the full list.
ru: Скорее всего вам не понадобится переопределять их таким способом. Настройки по умолчанию Django достаточно удобны, чтобы использовать их. Обратите внимание, если вы указали собственные настройки по умолчанию, они полностью *заменяют* настройки Django, поэтому необходимо указать все настройки, которые могут использовать в вашем коде. Полный список можно найти в модуле ``django.conf.settings.global_settings``.

source: Either ``configure()`` or ``DJANGO_SETTINGS_MODULE`` is required
ru: Требуется ``configure()`` или ``DJANGO_SETTINGS_MODULE``

source: If you're not setting the ``DJANGO_SETTINGS_MODULE`` environment variable, you *must* call ``configure()`` at some point before using any code that reads settings.
ru: Если вы не указали переменную окружения ``DJANGO_SETTINGS_MODULE``, вы *должны* вызывать ``configure()`` перед кодом, который использует настройки.

source: If you don't set ``DJANGO_SETTINGS_MODULE`` and don't call ``configure()``, Django will raise an ``ImportError`` exception the first time a setting is accessed.
ru: Если вы не указали ``DJANGO_SETTINGS_MODULE`` и не вызвали ``configure()``, Django вызовет исключение ``ImportError`` при первом доступе к настройкам.

source: If you set ``DJANGO_SETTINGS_MODULE``, access settings values somehow, *then* call ``configure()``, Django will raise a ``RuntimeError`` indicating that settings have already been configured. There is a property just for this purpose:
ru: Если вы укажите ``DJANGO_SETTINGS_MODULE``, обратитесь к настройкам, а *затем* вызовите ``configure()``, Django вызовет исключение ``RuntimeError``, указывая, что настройки уже определены. Для проверки этого существует свойство ``settings.configured``.

source: For example::
ru: Например::

source: Also, it's an error to call ``configure()`` more than once, or to call ``configure()`` after any setting has been accessed.
ru: Также нельзя вызывать ``configure()`` несколько раз, или вызывать ``configure()`` после обращения к настройкам.

source: It boils down to this: Use exactly one of either ``configure()`` or ``DJANGO_SETTINGS_MODULE``. Not both, and not neither.
ru: Все сводится к правилам: используйте ``configure()``, или ``DJANGO_SETTINGS_MODULE``. Не оба, и хотя бы один.

source: Calling ``django.setup()`` is required for "standalone" Django usage
ru: Для "отдельного" использования Django необходимо вызывать ``django.setup()``

source: If you're using components of Django "standalone" -- for example, writing a Python script which loads some Django templates and renders them, or uses the ORM to fetch some data -- there's one more step you'll need in addition to configuring settings.
ru: Если вы используете компоненты Django "отдельно" -- например, в Python скрипте, который загружает шаблоны Django и рендерит их, или использует ORM для загрузки данных -- вам понадобится указать настройки.

source: After you've either set :envvar:`DJANGO_SETTINGS_MODULE` or called ``configure()``, you'll need to call :func:`django.setup()` to load your settings and populate Django's application registry. For example::
ru: После того, как вы указали переменную окружения :envvar:`DJANGO_SETTINGS_MODULE`, или вызвали ``configure()``, необходимы вызвать :func:`django.setup()`, чтобы загрузить настройки и позволить Django загрузить приложения. Например::

source: Note that calling ``django.setup()`` is only necessary if your code is truly standalone. When invoked by your Web server, or through :doc:`django-admin </ref/django-admin>`, Django will handle this for you.
ru: Обратите внимание, ``django.setup()`` необходим, только если компоненты Django используются действительно отдельно. При запуске через Web-сервер, или :doc:`django-admin </ref/django-admin>`, Django все сделает самостоятельно.

source: ``django.setup()`` may only be called once.
ru: ``django.setup()`` можно вызвать только один раз.

source: Therefore, avoid putting reusable application logic in standalone scripts so that you have to import from the script elsewhere in your application. If you can't avoid that, put the call to ``django.setup()`` inside an ``if`` block::
ru: Поэтому избегайте добавление логики приложения в отдельный скрипт, чтобы вам не приходилось импортировать этот скрипт где-либо в коде приложения. Если вы не можете избежать этого, добавьте ``django.setup()`` в блок ``if``::

source: The Settings Reference
ru: Список настроек

source: Contains the complete list of core and contrib app settings.
ru: Содержит полный список основных настроек и настроек встроенных приложений.
