Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/topics/signing.po
Languages: ru

source: Cryptographic signing
ru: Криптографическая подпись

source: The golden rule of Web application security is to never trust data from untrusted sources. Sometimes it can be useful to pass data through an untrusted medium. Cryptographically signed values can be passed through an untrusted channel safe in the knowledge that any tampering will be detected.
ru: Золотое правило безопасного веб приложения -- это никогда не доверять данным из чужих источников. Временами передача данных через недоверенную среду может оказаться полезной. Криптографически подписанные значения могут безопасно передаваться через недоверенный канал, если известно, что любая подмена данных будет обнаружена.

source: Django provides both a low-level API for signing values and a high-level API for setting and reading signed cookies, one of the most common uses of signing in Web applications.
ru: Django предоставляет низкоуровневое API для подписывания значения и высокоуровневое API для установки и чтения подписанных кук, одного из наиболее часто используемых функционалов подписи в веб приложениях.

source: You may also find signing useful for the following:
ru: Вы также можете найти подпись полезной для следующего:

source: Generating "recover my account" URLs for sending to users who have lost their password.
ru: Генерация URL для восстановления аккаунта пользователя, которые будут отправлены пользователю, потерявшему свой пароль.

source: Ensuring data stored in hidden form fields has not been tampered with.
ru: Проверка целостности данных, спрятанных в скрытом поле формы.

source: Generating one-time secret URLs for allowing temporary access to a protected resource, for example a downloadable file that a user has paid for.
ru: Генерация одноразового секретного URL для обеспечения временного доступа к защищённому ресурсу, например на скачивание файла за который заплатил пользователь.

source: Protecting the ``SECRET_KEY``
ru: Защита ``SECRET_KEY``

source: When you create a new Django project using :djadmin:`startproject`, the ``settings.py`` file is generated automatically and gets a random :setting:`SECRET_KEY` value. This value is the key to securing signed data -- it is vital you keep this secure, or attackers could use it to generate their own signed values.
ru: При создании нового Django проекта с помощью :djadmin:`startproject` автоматически генерируется файл ``settings.py`` и определяется случайное значение :setting:`SECRET_KEY`. Это значение является ключевым аспектом защиты подписанных данных -- очень важно сохранять его в тайне. В противном случае у сторонних людей появляется возможность генерировать собственные подписанные значения.

source: Using the low-level API
ru: Использование низкоуровневого API

source: Django's signing methods live in the ``django.core.signing`` module. To sign a value, first instantiate a ``Signer`` instance::
ru: Методы подписи расположены в модуле ``django.core.signing``. Для того, чтобы подписать значение, сначала создайте экземпляр ``Signer``::

source: The signature is appended to the end of the string, following the colon. You can retrieve the original value using the ``unsign`` method::
ru: Сигнатура добавляется в конец строки, отделённая двоеточием. Вы можете получить оригинальное значение с помощью метода ``unsing``::

source: If the signature or value have been altered in any way, a ``django.core.signing.BadSignature`` exception will be raised::
ru: Если подпись или значение были изменены любым способом, то будет вызвано исключение ``django.core.signing.BadSignature``::

source: By default, the ``Signer`` class uses the :setting:`SECRET_KEY` setting to generate signatures. You can use a different secret by passing it to the ``Signer`` constructor::
ru: По умолчанию, класс ``Signer`` использует настройку :setting:`SECRET_KEY` для генерации сигнатур. Вы можете использовать другой ключ, передав его в конструктор::

source: Returns a signer which uses ``key`` to generate signatures and ``sep`` to separate values. ``sep`` cannot be in the `URL safe base64 alphabet <https://tools.ietf.org/html/rfc4648#section-5>`_. This alphabet contains alphanumeric characters, hyphens, and underscores.
ru: Возвращает класс для подписи, который использует ``key`` для генерации подписи и ``sep`` для разделения значений. ``sep`` не может быть частью `URL safe base64 таблицы <https://tools.ietf.org/html/rfc4648#section-5>`_, которая содержит буквы, цифры, дефис и подчеркивание.

source: Using the ``salt`` argument
ru: Использование аргумента ``salt``

source: If you do not wish for every occurrence of a particular string to have the same signature hash, you can use the optional ``salt`` argument to the ``Signer`` class. Using a salt will seed the signing hash function with both the salt and your :setting:`SECRET_KEY`::
ru: Если требуется, чтобы подпись одинаковой строки всегда создавала разные сигнатуры, вы можете использовать необязательный аргумент ``salt`` конструктора. Функция подписи воспользуется "солью" и :setting:`SECRET_KEY`::

source: Using salt in this way puts the different signatures into different namespaces. A signature that comes from one namespace (a particular salt value) cannot be used to validate the same plaintext string in a different namespace that is using a different salt setting. The result is to prevent an attacker from using a signed string generated in one place in the code as input to another piece of code that is generating (and verifying) signatures using a different salt.
ru: Использование "соли" размещает разные сигнатуры в разных именованных областях. Сигнатура из одной области (определённая значением "соли") не может быть использована для проверки исходной строки текста в другой именованной области (другое значение "соли"). Результатом является невозможность использовать атакующим строки, подписанные в одном месте, в качестве источника данных в другом.

source: Unlike your :setting:`SECRET_KEY`, your salt argument does not need to stay secret.
ru: В отличие от значения :setting:`SECRET_KEY`, ваша "соль" не является секретом.

source: Verifying timestamped values
ru: Проверка значений с подписанным слепком времени

source: ``TimestampSigner`` is a subclass of :class:`~Signer` that appends a signed timestamp to the value. This allows you to confirm that a signed value was created within a specified period of time::
ru: ``TimestampSigner`` -- подкласс :class:`~Signer`, который добавляет подписанный слепок времени к значению. Это позволяет вам удостоверять, что подписанное значение было создано в указанный период времени::

source: Sign ``value`` and append current timestamp to it.
ru: Подписывает ``value`` и добавляет текущее время к нему.

source: Checks if ``value`` was signed less than ``max_age`` seconds ago, otherwise raises ``SignatureExpired``. The ``max_age`` parameter can accept an integer or a :py:class:`datetime.timedelta` object.
ru: Проверяет, был ли подписан ``value`` меньше чем ``max_age`` секунд назад, иначе выбрасывает исключение ``SignatureExpired``. Параметр ``max_age`` может принимать как целое, так и объект вида :py:class:`datetime.timedelta`.

source: Protecting complex data structures
ru: Защита сложных структур данных

source: If you wish to protect a list, tuple or dictionary you can do so using the signing module's ``dumps`` and ``loads`` functions. These imitate Python's pickle module, but use JSON serialization under the hood. JSON ensures that even if your :setting:`SECRET_KEY` is stolen an attacker will not be able to execute arbitrary commands by exploiting the pickle format::
ru: Если вам потребуется защитить список, кортеж или словарь, вы можете это сделать с помощью функций ``dumps`` и ``loads`` модуля. Они имитируют поведение функций модуля Pickle, но используют JSON сериализацию. JSON гарантирует, что даже украв ваш :setting:`SECRET_KEY`, атакующий не сможет выполнить определённые команды взломав pickle формат::

source: Because of the nature of JSON (there is no native distinction between lists and tuples) if you pass in a tuple, you will get a list from ``signing.loads(object)``::
ru: Из-за особенностей JSON (нет отдельных типов для списка и кортежа), если передать кортеж, в результате выполнения ``signing.loads(object)`` будет получен список::

source: Returns URL-safe, sha1 signed base64 compressed JSON string. Serialized object is signed using :class:`~TimestampSigner`.
ru: Возвращает безопасный (с точки зрения URL), подписанный SHA1, закодированную base64 JSON строку. Сериализованный объект подписывается с помощью класса :class:`~TimestampSigner`.

source: Reverse of ``dumps()``, raises ``BadSignature`` if signature fails. Checks ``max_age`` (in seconds) if given.
ru: Обратный методу``dumps()``, вызывает исключение ``BadSignature``, если проверка подписи не пройдена. Проверяет ``max_age`` (в секундах) при его наличии.
