Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/topics/signals.po
Languages: ru

source: Signals
ru: Сигналы

source: Django includes a "signal dispatcher" which helps allow decoupled applications get notified when actions occur elsewhere in the framework. In a nutshell, signals allow certain *senders* to notify a set of *receivers* that some action has taken place. They're especially useful when many pieces of code may be interested in the same events.
ru: Django содержит "диспетчер сигналов", который позволяет одним приложениям фреймворка получать уведомления от других после того, как в последних произойдут некоторые события. Вкратце, сигналы позволяют определённым *отправителям* уведомлять некоторый набор *получателей* о совершении действий. Сигналы особенно полезны, когда поведение многих фрагментов кода зависит от инициации одних и тех же событий.

source: Django provides a :doc:`set of built-in signals </ref/signals>` that let user code get notified by Django itself of certain actions. These include some useful notifications:
ru: Django предоставляет набор встроенных сигналов, которые позволяют пользовательскому коду получать уведомление от Django об определённых событиях. Эти сигналы включают в себя некоторые полезные уведомления:

source: Sent before or after a model's :meth:`~django.db.models.Model.save` method is called.
ru: Отправляются до или после вызова метода :meth:`~django.db.models.Model.save` модели.

source: Sent before or after a model's :meth:`~django.db.models.Model.delete` method or queryset's :meth:`~django.db.models.query.QuerySet.delete` method is called.
ru: Отправляются до или после вызова метода :meth:`~django.db.models.Model.delete` модели или :meth:`~django.db.models.query.QuerySet.delete` класса QuerySet.

source: Sent when a :class:`~django.db.models.ManyToManyField` on a model is changed.
ru: Отправляются после изменения :class:`~django.db.models.ManyToManyField` в модели.

source: Sent when Django starts or finishes an HTTP request.
ru: Отправляются, когда Django начинает или заканчивает HTTP запрос.

source: See the :doc:`built-in signal documentation </ref/signals>` for a complete list, and a complete explanation of each signal.
ru: Полный список этих сигналов, а также описание каждого сигнала, см. в :doc:`документации по встроенным сигналам </ref/signals>`.

source: You can also `define and send your own custom signals`_; see below.
ru: Вы можете также :ref:`определять и посылать свои собственные сигналы <defining-and-sending-signals>`; см. ниже.

source: Listening to signals
ru: Прослушивание сигналов

source: To receive a signal, you need to register a *receiver* function that gets called when the signal is sent by using the :meth:`Signal.connect` method:
ru: Для того, чтобы принять сигнал, Вам необходимо с помощью метода :meth:`.Signal.connect` зарегистрировать функцию *receiver*, которая вызывается, когда сигнал послан:

source: The callback function which will be connected to this signal. See :ref:`receiver-functions` for more information.
ru: Функция, которая будет привязана к этому сигналу. Смотрите :ref:`receiver-functions`.

source: Specifies a particular sender to receive signals from. See :ref:`connecting-to-specific-signals` for more information.
ru: Указывает конкретного отправителя. Смотрите :ref:`connecting-to-specific-signals`.

source: Django stores signal handlers as weak references by default. Thus, if your receiver is a local function, it may be garbage collected. To prevent this, pass ``weak=False`` when you call the signal's ``connect()`` method.
ru: Django сохраняет обработчики сигналов используя слабые ссылки(weak references). Поэтому, если функция-обработчик является локальной функцией, сборщик мусора может удалить ее. Чтобы избежать этого, передайте ``weak=False`` в ``connect()``.

source: A unique identifier for a signal receiver in cases where duplicate signals may be sent. See :ref:`preventing-duplicate-signals` for more information.
ru: Уникальный идентификатор получателя сигнала. На случай, если назначение обработчика может вызываться несколько раз. Смотрите :ref:`preventing-duplicate-signals`.

source: Let's see how this works by registering a signal that gets called after each HTTP request is finished. We'll be connecting to the :data:`~django.core.signals.request_finished` signal.
ru: Давайте посмотрим, как это работает, зарегистрировав сигнал :data:`~django.core.signals.request_finished`, который вызывается после завершения выполнения HTTP запроса.

source: Receiver functions
ru: Функции-получатели

source: First, we need to define a receiver function. A receiver can be any Python function or method::
ru: Во-первых, мы должны определить функцию-получатель. Получатель должен быть Python функцией или методом::

source: Notice that the function takes a ``sender`` argument, along with wildcard keyword arguments (``**kwargs``); all signal handlers must take these arguments.
ru: Заметьте, что функция принимает аргумент ``sender``, а также аргументы (``**kwargs``) в формате словаря; все обработчики сигналов должны принимать подобные аргументы.

source: We'll look at senders `a bit later`_, but right now look at the ``**kwargs`` argument. All signals send keyword arguments, and may change those keyword arguments at any time. In the case of :data:`~django.core.signals.request_finished`, it's documented as sending no arguments, which means we might be tempted to write our signal handling as ``my_callback(sender)``.
ru: Отправителей мы рассмотрим :ref:`чуть позже <connecting-to-specific-signals>`, а сейчас обратите внимание на аргументы ``**kwargs``. Все сигналы имеют возможность посылать именованные аргументы и могут изменить их набор в любой момент. Сигнал :data:`~django.core.signals.request_finished` документирован как не посылающий аргументов, и у нас может появиться искушение записывать наш обработчик сигнала в виде ``my_callback(sender)``.

source: This would be wrong -- in fact, Django will throw an error if you do so. That's because at any point arguments could get added to the signal and your receiver must be able to handle those new arguments.
ru: Это было бы неверно -- на самом деле, Django выдаст ошибку, если Вы это сделаете. Так произойдёт, потому что при любом вызове аргументы могут быть добавлены к сигналу и получатель должен быть в состоянии обработать эти новые аргументы.

source: Connecting receiver functions
ru: Регистрация функции-получателя

source: There are two ways you can connect a receiver to a signal. You can take the manual connect route::
ru: Есть два способа, которыми Вы можете подключить получатель к сигналу. Вы можете вручную вызвать connect::

source: Alternatively, you can use a :func:`receiver` decorator:
ru: Кроме того, вы можете использовать декоратор :func:`receiver` при определении вашего получателя:

source: A signal or a list of signals to connect a function to.
ru: Сигнал или список обрабатываемых сигналов.

source: Here's how you connect with the decorator::
ru: Вот как можно использовать декоратор::

source: Now, our ``my_callback`` function will be called each time a request finishes.
ru: Теперь наша функция ``my_callback`` будет вызываться каждый раз, когда запрос завершается.

source: Where should this code live?
ru: Куда положить этот код?

source: Strictly speaking, signal handling and registration code can live anywhere you like, although it's recommended to avoid the application's root module and its ``models`` module to minimize side-effects of importing code.
ru: Код обработчиков сигналов и подключения может находиться где угодно. Но мы рекомендуем избегать корневого модуля приложения и ``models``, чтобы сократить побочный эффект при импорте приложения.

source: In practice, signal handlers are usually defined in a ``signals`` submodule of the application they relate to. Signal receivers are connected in the :meth:`~django.apps.AppConfig.ready` method of your application configuration class. If you're using the :func:`receiver` decorator, simply import the ``signals`` submodule inside :meth:`~django.apps.AppConfig.ready`.
ru: На практике, обработчики сигналов лежат в модуле ``signals`` приложения, к которому они относятся. Подключение к сигналам выполняется в методе :meth:`~django.apps.AppConfig.ready` конфигурационного класса приложения. При использовании декоратора :func:`receiver` просто импортируйте модуль ``signals`` в :meth:`~django.apps.AppConfig.ready`.

source: The :meth:`~django.apps.AppConfig.ready` method may be executed more than once during testing, so you may want to :ref:`guard your signals from duplication <preventing-duplicate-signals>`, especially if you're planning to send them within tests.
ru: Метод :meth:`~django.apps.AppConfig.ready` можно выполнить более одного раза во время тестировани, таким образом, вам может потребоваться :ref:`защитить ваши сигналы от дублирования <preventing-duplicate-signals>`, особенно, если вы планируете отправлять их из тестов.

source: Connecting to signals sent by specific senders
ru: Сигналы, получаемые от определённых отправителей.

source: Some signals get sent many times, but you'll only be interested in receiving a certain subset of those signals. For example, consider the :data:`django.db.models.signals.pre_save` signal sent before a model gets saved. Most of the time, you don't need to know when *any* model gets saved -- just when one *specific* model is saved.
ru: Некоторые сигналы могу быть посланы много раз, но Вам будет нужно получать только определённое подмножество этих сигналов. Например, рассмотрим :data:`django.db.models.signals.pre_save` - сигнал, посылаемый перед сохранением модели. Бывает, что Вам не нужно знать о сохранении любой модели, Вас интересует только одна конкретная модель:

source: In these cases, you can register to receive signals sent only by particular senders. In the case of :data:`django.db.models.signals.pre_save`, the sender will be the model class being saved, so you can indicate that you only want signals sent by some model::
ru: В этих случаях Вы можете получать только сигналы, посланные определёнными отправителями. В случае :data:`django.db.models.signals.pre_save` отправитель будет сохраняемой моделью некоторого класса, так что вы можете указать, что вы хотите получать только сигналы, посылаемые этой моделью::

source: The ``my_handler`` function will only be called when an instance of ``MyModel`` is saved.
ru: Функция ``my_handler`` будет вызвана только при сохранении объекта класса ``MyModel``.

source: Different signals use different objects as their senders; you'll need to consult the :doc:`built-in signal documentation </ref/signals>` for details of each particular signal.
ru: Отправителями различных сигналов могут быть различные объекты. Для получения детальной информации по каждому такому сигналу обращайтесь к :doc:`документации по встроенным сигналам </ref/signals>`.

source: Preventing duplicate signals
ru: Предотвращение дублирования сигналов

source: In some circumstances, the code connecting receivers to signals may run multiple times. This can cause your receiver function to be registered more than once, and thus called multiples times for a single signal event.
ru: В некоторых случаях модуль, в котором Вы подключаете сигналы, может быть импортирован несколько раз. Это может привести к тому, что получатель сигнала будет зарегистрирован несколько раз, и таким образом, вызов сигнала произойдет несколько раз при наступлении одного и того же события.

source: If this behavior is problematic (such as when using signals to send an email whenever a model is saved), pass a unique identifier as the ``dispatch_uid`` argument to identify your receiver function. This identifier will usually be a string, although any hashable object will suffice. The end result is that your receiver function will only be bound to the signal once for each unique ``dispatch_uid`` value::
ru: Такое поведение может приводить к проблемам (например, если происходит отправка электронной почты всякий раз, когда посылается сигнал о сохранении модели), поэтому передавайте некоторый уникальный идентификатор в качестве значения аргумента ``dispatch_uid`` для идентификации в функции-получателе. Обычно, этот идентификатор является строкой, хотя подойдёт любой хешируемый объект. В итоге функция-получатель будет привязана к сигналу единожды для каждого уникального значения ``dispatch_uid``.

source: Defining and sending signals
ru: Создание и посылка сигналов.

source: Your applications can take advantage of the signal infrastructure and provide its own signals.
ru: Вы можете создавать свои собственные сигналы в ваших приложениях.

source: Defining signals
ru: Создание сигналов

source: All signals are :class:`django.dispatch.Signal` instances. The ``providing_args`` is a list of the names of arguments the signal will provide to listeners. This is purely documentational, however, as there is nothing that checks that the signal actually provides these arguments to its listeners.
ru: Все сигналы являются экземплярами класса :class:`django.dispatch.Signal`, где ``providing_args`` -- список названий аргументов сигнала, которые будут доступны слушателям. Этот аргумент предназначен просто для документирования, никакой проверки, передаёт ли сигнал эти параметры, не выполняется.

source: For example::
ru: Например::

source: This declares a ``pizza_done`` signal that will provide receivers with ``toppings`` and ``size`` arguments.
ru: Это объявление сигнала ``pizza_done``, который предоставит получателям аргументы ``toppings`` и ``size``.

source: Remember that you're allowed to change this list of arguments at any time, so getting the API right on the first try isn't necessary.
ru: Вы можете задать в этом списке аргументов любые значения передаваемых параметров.

source: Sending signals
ru: Отправка сигналов

source: There are two ways to send signals in Django.
ru: В Django существует два способа отправки сигналов.

source: For example, here's how sending our ``pizza_done`` signal might look::
ru: Например, вот как может выглядеть отправка сигнала ``pizza_done``::

source: Both ``send()`` and ``send_robust()`` return a list of tuple pairs ``[(receiver, response), ... ]``, representing the list of called receiver functions and their response values.
ru: И ``send()``, и ``send_robust()`` возвращают список кортежей пар ``[(receiver, response), ... ]``. Каждый кортеж содержит вызываемую функцию и ее ответ.

source: ``send()`` differs from ``send_robust()`` in how exceptions raised by receiver functions are handled. ``send()`` does *not* catch any exceptions raised by receivers; it simply allows errors to propagate. Thus not all receivers may be notified of a signal in the face of an error.
ru: ``send()`` отличается от ``send_robust()`` способом обработки исключений, генерируемых функцией-получателем. ``send()`` *не* ловит никаких исключений, сгенерированных в получателе, позволяя исключению проваливаться дальше. Таким образом, не все получатели могут получить сигнал при возникновении ошибки.

source: ``send_robust()`` catches all errors derived from Python's ``Exception`` class, and ensures all receivers are notified of the signal. If an error occurs, the error instance is returned in the tuple pair for the receiver that raised the error.
ru: ``send_robust()`` перехватывает все ошибки, наследуемые от класса ``Exception`` языка Python, и гарантирует, что сигнал дойдёт до всех получателей. Если произойдёт ошибка в одном из них, экземпляр исключения будет помещён в кортежную пару, для получателя, который соответствует вызываемой ошибке.

source: The tracebacks are present on the ``__traceback__`` attribute of the errors returned when calling ``send_robust()``.
ru: Трассировочная информация доступна через атрибут ``__traceback__`` ошибок, возвращаемых при вызове ``send_robust()``.

source: Disconnecting signals
ru: Отключение сигнала

source: To disconnect a receiver from a signal, call :meth:`Signal.disconnect`. The arguments are as described in :meth:`.Signal.connect`. The method returns ``True`` if a receiver was disconnected and ``False`` if not.
ru: Чтобы отключить получатель от сигнала, вызовите :meth:`Signal.disconnect`. Аргументы те же, что и у :meth:`.Signal.connect`. Метод возвращает ``True`` в случае, если получатель был отключен и ``False`` - если нет.

source: The ``receiver`` argument indicates the registered receiver to disconnect. It may be ``None`` if ``dispatch_uid`` is used to identify the receiver.
ru: В аргументе ``receiver`` указывается получатель, который должен перестать получать сигнал. Аргумент может содержать ``None``, если для идентификации получателя используется ``dispatch_uid``.

source: The ``weak`` argument is deprecated as it has no effect. It will be removed in Django 2.0.
ru: Аргумент ``weak`` устарел и не имеет никакого эффекта. Он будет удален в Django 2.0.
