Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/topics/templates.po
Languages: ru

source: ``'loader'``: a loader configured for :setting:`DIRS <TEMPLATES-DIRS>` and :setting:`APP_DIRS <TEMPLATES-APP_DIRS>`
ru: ``'loader'``: загрузчик соответствующий настройкам :setting:`DIRS <TEMPLATES-DIRS>` и :setting:`APP_DIRS <TEMPLATES-APP_DIRS>`

source: For example, you can create ``myproject/jinja2.py`` with this content::
ru: Например, вы можете создать следующий ``myproject/jinja2.py``::

source: and set the ``'environment'`` option to ``'myproject.jinja2.environment'``.
ru: и указать в настройке ``'environment'`` ``'myproject.jinja2.environment'``.

source: Then you could use the following constructs in Jinja2 templates:
ru: Теперь вы можете использовать в шаблонах Jinja2:

source: Custom backends
ru: Собственный бэкенд

source: Here's how to implement a custom template backend in order to use another template system. A template backend is a class that inherits ``django.template.backends.base.BaseEngine``. It must implement ``get_template()`` and optionally ``from_string()``. Here's an example for a fictional ``foobar`` template library::
ru: Вот небольшой пример собственного шаблонизатора. Шаблонизатор должен наследоваться от ``django.template.backends.base.BaseEngine`` и определить метод ``get_template()``, и опционально ``from_string()``. Код нашего шаблонизатора ``foobar``::

source: See `DEP 182`_ for more information.
ru: Подробности смотрите в `DEP 182`_.

source: The Django template language
ru: Язык шаблонов Django

source: Syntax
ru: Синтаксис

source: About this section
ru: Об этом документе

source: This is an overview of the Django template language's syntax. For details see the :doc:`language syntax reference </ref/templates/language>`.
ru: Этот раздел описывает основы синтаксиса языка шаблонов Django. Подробности смотрите в :doc:`полном описании </ref/templates/language>`.

source: A template is rendered with a context. Rendering replaces variables with their values, which are looked up in the context, and executes tags. Everything else is output as is.
ru: Шаблон рендерится с контекстом. Рендеринг заменяет переменные на их значения, которые ищутся в контексте, и выполняет теги. Все остальное выводится как есть.

source: The syntax of the Django template language involves four constructs.
ru: Синтаксис языка шаблонов Django использует четыре конструкции.

source: Variables
ru: Переменные

source: A variable outputs a value from the context, which is a dict-like object mapping keys to values.
ru: Переменные выводят значения из контекста, который является словарем.

source: Variables are surrounded by ``{{`` and ``}}`` like this::
ru: Переменные выделяются ``{{`` и ``}}``, например::

source: With a context of ``{'first_name': 'John', 'last_name': 'Doe'}``, this template renders to::
ru: Для контекста ``{'first_name': 'John', 'last_name': 'Doe'}`` шаблон отрендерит::

source: Dictionary lookup, attribute lookup and list-index lookups are implemented with a dot notation::
ru: Обращение к ключам словаря, атрибутам объектов и элементам списка выполняется через точку::

source: If a variable resolves to a callable, the template system will call it with no arguments and use its result instead of the callable.
ru: Если значение переменной является вызываемый объект, шаблонизатор вызовет его без аргументов и подставит результат.

source: Tags
ru: Теги

source: Tags provide arbitrary logic in the rendering process.
ru: Теги позволяют добавлять произвольную логику в шаблон.

source: This definition is deliberately vague. For example, a tag can output content, serve as a control structure e.g. an "if" statement or a "for" loop, grab content from a database, or even enable access to other template tags.
ru: Например, теги могут выводить текст, добавлять логические операторы, такие как "if" или "for", получать содержимое из базы данных, или предоставлять доступ к другим тегам.

source: Tags are surrounded by ``{%`` and ``%}`` like this::
ru: Теги выделяются ``{%`` и ``%}``, например::

source: Most tags accept arguments::
ru: Большинство тегов принимают аргументы::

source: Some tags require beginning and ending tags::
ru: Некоторые теги требуют закрывающий тег::

source: A :ref:`reference of built-in tags <ref-templates-builtins-tags>` is available as well as :ref:`instructions for writing custom tags <howto-writing-custom-template-tags>`.
ru: Ознакомьтесь со :ref:`списком всех встроенных тегов <ref-templates-builtins-tags>` и с :ref:`руководством по созданию тегов <howto-writing-custom-template-tags>`.

source: Filters
ru: Фильтры

source: Filters transform the values of variables and tag arguments.
ru: Фильтры преобразуют переменные и аргументы тегов.

source: They look like this::
ru: Могут выглядеть таким образом::

source: With a context of ``{'django': 'the web framework for perfectionists with deadlines'}``, this template renders to::
ru: Для контекста ``{'django': 'the web framework for perfectionists with deadlines'}`` этот шаблон выведет::

source: Some filters take an argument::
ru: Некоторые фильтры принимают аргументы::

source: A :ref:`reference of built-in filters <ref-templates-builtins-filters>` is available as well as :ref:`instructions for writing custom filters <howto-writing-custom-template-filters>`.
ru: Ознакомьтесь со :ref:`списком встроенных фильтров <ref-templates-builtins-filters>` и :ref:`руководством по созданию фильтра <howto-writing-custom-template-filters>`.

source: Comments
ru: Комментарии

source: Comments look like this::
ru: Комментарии могут выглядеть таким образом::

source: A :ttag:`{% comment %} <comment>` tag provides multi-line comments.
ru: Тег :ttag:`{% comment %} <comment>` позволяет добавлять многострочные комментарии.

source: Components
ru: Компоненты

source: This is an overview of the Django template language's APIs. For details see the :doc:`API reference </ref/templates/api>`.
ru: Это обзор API языка шаблонов Django. Подробности смотрите в :doc:`полном описании API </ref/templates/api>`.

source: :class:`django.template.Engine` encapsulates an instance of the Django template system. The main reason for instantiating an :class:`~django.template.Engine` directly is to use the Django template language outside of a Django project.
ru: :class:`django.template.Engine` инкапсулирует шаблонизатор Django. Главная причина использовать непосредственно :class:`~django.template.Engine` -- использовать шаблонизатор Django все проекта Django.

source: :class:`django.template.backends.django.DjangoTemplates` is a thin wrapper adapting :class:`django.template.Engine` to Django's template backend API.
ru: :class:`django.template.backends.django.DjangoTemplates` -- адаптер :class:`django.template.Engine` для API шаблонов Django.

source: Template
ru: Шаблон

source: :class:`django.template.Template` represents a compiled template. Templates are obtained with :meth:`Engine.get_template() <django.template.Engine.get_template>` or :meth:`Engine.from_string() <django.template.Engine.from_string>`
ru: :class:`django.template.Template` представляет скомпилированный шаблон. Шаблоны загружаются с помощью :meth:`Engine.get_template() <django.template.Engine.get_template>` или :meth:`Engine.from_string() <django.template.Engine.from_string>`

source: Likewise ``django.template.backends.django.Template`` is a thin wrapper adapting :class:`django.template.Template` to the common template API.
ru: ``django.template.backends.django.Template`` -- адаптер :class:`django.template.Template` для API шаблонов Django.

source: Context
ru: Контекст

source: :class:`django.template.Context` holds some metadata in addition to the context data. It is passed to :meth:`Template.render() <django.template.Template.render>` for rendering a template.
ru: :class:`django.template.Context` содержит данные контекста и некоторые метаданные. Передается в :meth:`Template.render() <django.template.Template.render>` при рендеринге шаблона.

source: :class:`django.template.RequestContext` is a subclass of :class:`~django.template.Context` that stores the current :class:`~django.http.HttpRequest` and runs template context processors.
ru: :class:`django.template.RequestContext` -- дочерний класс :class:`~django.template.Context`, который содержит текущий :class:`~django.http.HttpRequest` и выполняет процессоры контекста.

source: The common API doesn't have an equivalent concept. Context data is passed in a plain :class:`dict` and the current :class:`~django.http.HttpRequest` is passed separately if needed.
ru: API шаблонов Django не содержит аналога. Данные контекста передаются как :class:`dict`, а текущий :class:`~django.http.HttpRequest` передается отдельно при необходимости.

source: Loaders
ru: Загрузчики

source: Template loaders are responsible for locating templates, loading them, and returning :class:`~django.template.Template` objects.
ru: Загрузчики шаблонов отвечают за их поиск, загрузку и создание объекта :class:`~django.template.Template`.

source: Django provides several :ref:`built-in template loaders <template-loaders>` and supports :ref:`custom template loaders <custom-template-loaders>`.
ru: Django предоставляет несколько :ref:`встроенных загрузчиков шаблонов <template-loaders>` и поддерживает :ref:`собственные загрузчики <custom-template-loaders>`.

source: Context processors
ru: Процессоры контекста

source: Context processors are functions that receive the current :class:`~django.http.HttpRequest` as an argument and return a :class:`dict` of data to be added to the rendering context.
ru: Процессоры контекста -- это функции, которые принимают текущий :class:`~django.http.HttpRequest`, и возвращают :class:`dict` данными, которые будут добавлены в контекст.

source: Their main use is to add common data shared by all templates to the context without repeating code in every view.
ru: Используются для добавления данных, которые необходимы при рендеринге различных шаблонов, чтобы избежать дублирования кода в представлениях.
