Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/topics/templates.po
Languages: ru

source: Templates
ru: Шаблоны

source: Being a web framework, Django needs a convenient way to generate HTML dynamically. The most common approach relies on templates. A template contains the static parts of the desired HTML output as well as some special syntax describing how dynamic content will be inserted. For a hands-on example of creating HTML pages with templates, see :doc:`Tutorial 3 </intro/tutorial03>`.
ru: Будучи веб фреймверком, Django позволяет динамически генерировать HTML. Самый распространенный подход - использование шаблонов. Шаблоны содержат статический HTML и динамические данные, рендеринг которых описан специальным синтаксисом. Пример использования шаблонов для создания HTML шаблонов можно найти в учебнике :doc:`Часть 3 </intro/tutorial03>`.

source: A Django project can be configured with one or several template engines (or even zero if you don't use templates). Django ships built-in backends for its own template system, creatively called the Django template language (DTL), and for the popular alternative Jinja2_. Backends for other template languages may be available from third-parties.
ru: Проект Django может использовать один или несколько механизмов создания шаблонов (или ни одного, если вы не используете шаблоны). Django предоставляет бэкенд для собственной системы шаблонов, которая называется - язык шаблонов Django (Django template language, DTL), и популярного альтернативного шаблонизатора `Jinja2 <http://jinja.pocoo.org/>`_. Сторонние приложения могут предоставлять бэкенд и для других систем шаблонов.

source: Django defines a standard API for loading and rendering templates regardless of the backend. Loading consists of finding the template for a given identifier and preprocessing it, usually compiling it to an in-memory representation. Rendering means interpolating the template with context data and returning the resulting string.
ru: Django предоставляет стандартный API для загрузки и рендеринга шаблонов, незавимисо от используемого бэкенда. Загрузка включает в себя поиск шаблона по названию и предварительную обработку, обычно выполняется загрузка шаблона в память. Рендеринг означает передачу данных контекста в шаблон и возвращение строки с результатом.

source: The :doc:`Django template language </ref/templates/language>` is Django's own template system. Until Django 1.8 it was the only built-in option available. It's a good template library even though it's fairly opinionated and sports a few idiosyncrasies. If you don't have a pressing reason to choose another backend, you should use the DTL, especially if you're writing a pluggable application and you intend to distribute templates. Django's contrib apps that include templates, like :doc:`django.contrib.admin </ref/contrib/admin/index>`, use the DTL.
ru: :doc:`Язык шаблонов Django </ref/templates/language>` -- собственная система шаблонов Django. До Django 1.8 -- это была единственная альтернатива. Это хорошая система шаблонов, но со своими особенностями. Если у вас нет причин использовать другую систему шаблон, используйте встроенную, особенно, если разрабатываете распространяемое приложение, содержащее шаблоны. Встроенные шаблоны Django, которые содержат шаблоны, например :doc:`django.contrib.admin </ref/contrib/admin/index>`, используют систему шаблонов Django.

source: For historical reasons, both the generic support for template engines and the implementation of the Django template language live in the ``django.template`` namespace.
ru: По историческим причинам поддержка шаблонов и встроенная система шаблонов Django находятся в одном пакете ``django.template``.

source: Support for template engines
ru: Поддержка систем шаблонов

source: Configuration
ru: Настройки

source: Templates engines are configured with the :setting:`TEMPLATES` setting. It's a list of configurations, one for each engine. The default value is empty. The ``settings.py`` generated by the :djadmin:`startproject` command defines a more useful value::
ru: Шаблоны можно настроить с помощью настройки :setting:`TEMPLATES`. Это список, который содержит настройки для систем шаблонов. По умолчанию настройка пустая. ``settings.py``, сгенерированный командой :djadmin:`startproject`, содержит более полезное значение::

source: :setting:`BACKEND <TEMPLATES-BACKEND>` is a dotted Python path to a template engine class implementing Django's template backend API. The built-in backends are :class:`django.template.backends.django.DjangoTemplates` and :class:`django.template.backends.jinja2.Jinja2`.
ru: :setting:`BACKEND <TEMPLATES-BACKEND>` путь для импорта Python к классу бэкенда шаблонов. Встроенные бэкенды это :class:`django.template.backends.django.DjangoTemplates` и :class:`django.template.backends.jinja2.Jinja2`.

source: Since most engines load templates from files, the top-level configuration for each engine contains two common settings:
ru: Т.к. большинство систем шаблонов загружают шаблоны с файлов, настройки содержат:

source: :setting:`DIRS <TEMPLATES-DIRS>` defines a list of directories where the engine should look for template source files, in search order.
ru: :setting:`DIRS <TEMPLATES-DIRS>`, которая содержим список каталогов с шаблонами. Бэкенд ищет в них шаблон в указанном порядке.

source: :setting:`APP_DIRS <TEMPLATES-APP_DIRS>` tells whether the engine should look for templates inside installed applications. Each backend defines a conventional name for the subdirectory inside applications where its templates should be stored.
ru: :setting:`APP_DIRS <TEMPLATES-APP_DIRS>` указывает бэкенду искать ли шаблоны в установленных приложениях. Каждый бэкенд определяет определенное название для каталога с шаблонами в приложении.

source: While uncommon, it's possible to configure several instances of the same backend with different options. In that case you should define a unique :setting:`NAME <TEMPLATES-NAME>` for each engine.
ru: Хотя это и не особо полезно, вы можете настроить несколько экземпляров одной системы шаблонов. В этом случае необходимо указать уникальные значения :setting:`NAME <TEMPLATES-NAME>` для каждого экземпляра.

source: :setting:`OPTIONS <TEMPLATES-OPTIONS>` contains backend-specific settings.
ru: :setting:`OPTIONS <TEMPLATES-OPTIONS>` содержит настройки специфические для бэкенда.

source: Usage
ru: Использование

source: The ``django.template.loader`` module defines two functions to load templates.
ru: Модуль ``django.template.loader`` предоставляет две функции для загрузки шаблонов.

source: This function loads the template with the given name and returns a ``Template`` object.
ru: Эта функция загружает шаблон с указанным названием и возвращает объект ``Template``.

source: The exact type of the return value depends on the backend that loaded the template. Each backend has its own ``Template`` class.
ru: Возвращаемое значение зависит от используемого бэкенда т.к. каждый бэкенд использует свой класс ``Template``.

source: ``get_template()`` tries each template engine in order until one succeeds. If the template cannot be found, it raises :exc:`~django.template.TemplateDoesNotExist`. If the template is found but contains invalid syntax, it raises :exc:`~django.template.TemplateSyntaxError`.
ru: ``get_template()`` пытается загрузить шаблон каждым из бэкендов, пока шаблон не будет загружен. Если шаблон не найден, будет вызвано исключение :exc:`~django.template.TemplateDoesNotExist`. Если шаблон найден, но синтаксис не верен, будет вызвано :exc:`~django.template.TemplateSyntaxError`.

source: How templates are searched and loaded depends on each engine's backend and configuration.
ru: Как шаблоны ищутся и загружаются, зависит от используемого бэкенда шаблонов и его настроек.

source: If you want to restrict the search to a particular template engine, pass the engine's :setting:`NAME <TEMPLATES-NAME>` in the ``using`` argument.
ru: Если вы хотите использовать конкретный бэкенд, передайте его название из :setting:`NAME <TEMPLATES-NAME>` в аргументе ``using``.

source: ``select_template()`` is just like ``get_template()``, except it takes a list of template names. It tries each name in order and returns the first template that exists.
ru: ``select_template()`` как и ``get_template()``, но принимает список названий шаблонов. Пытается загрузить по очереди каждый из шаблонов, возвращает первый загруженный.

source: If loading a template fails, the following two exceptions, defined in ``django.template``, may be raised:
ru: Если не удалось загрузить шаблон, вызываются исключения, описанные в ``django.template``:

source: This exception is raised when a template cannot be found. It accepts the following optional arguments for populating the :ref:`template postmortem <template-postmortem>` on the debug page:
ru: Это исключение вызывается, если шаблоне не был найден. Принимает дополнительные параметры, которые отображаются на :ref:`странице ошибки <template-postmortem>`:

source: The template backend instance from which the exception originated.
ru: Бэкенд шаблонов, который вызывал исключение.

source: A list of sources that were tried when finding the template. This is formatted as a list of tuples containing ``(origin, status)``, where ``origin`` is an :ref:`origin-like <template-origin-api>` object and ``status`` is a string with the reason the template wasn't found.
ru: Список источников шаблонов, которые проверялись при поиске шаблона. Состоит из списка кортежей вида ``(origin, status)``, где ``origin`` -- это :ref:`объект Origin <template-origin-api>`, а ``status`` -- строка, которая описывает ошибку.

source: A list of intermediate :exc:`~django.template.TemplateDoesNotExist` exceptions raised when trying to load a template. This is used by functions, such as :func:`~django.template.loader.get_template`, that try to load a given template from multiple engines.
ru: Список промежуточных ошибок :exc:`~django.template.TemplateDoesNotExist`, которые были вызваны при поиске шаблона. Используется функцией, например :func:`~django.template.loader.get_template`, которая пытается загрузить шаблон, используя разные бэкенды.

source: This exception is raised when a template was found but contains errors.
ru: Это исключение вызывается, если шаблон найден, но содержит ошибки.

source: ``Template`` objects returned by ``get_template()`` and ``select_template()`` must provide a ``render()`` method with the following signature:
ru: Объекты ``Template``, которые возвращают ``get_template()`` и ``select_template()``, должны содержать метод ``render()`` со следующей сигнатурой:

source: Renders this template with a given context.
ru: Рендерит шаблон с переданным контекстом.

source: If ``context`` is provided, it must be a :class:`dict`. If it isn't provided, the engine will render the template with an empty context.
ru: Если ``context`` передан, это должен быть :class:`dict`. Если не передан, используется пустой контекст.

source: If ``request`` is provided, it must be an :class:`~django.http.HttpRequest`. Then the engine must make it, as well as the CSRF token, available in the template. How this is achieved is up to each backend.
ru: Если передан ``request``, это должен быть экземпляр :class:`~django.http.HttpRequest`. Шаблонизатор должен добавить его в шаблон, как и CSRF токен. Как это должно происходит определяет шаблонизатор.

source: Here's an example of the search algorithm. For this example the :setting:`TEMPLATES` setting is::
ru: Пример алгоритма поиска шаблона. Возьмем следующую настройку :setting:`TEMPLATES`::

source: If you call ``get_template('story_detail.html')``, here are the files Django will look for, in order:
ru: Если вызвать ``get_template('story_detail.html')``, Django будет искать следующие файлы:

source: ``/home/html/example.com/story_detail.html`` (``'django'`` engine)
ru: ``/home/html/example.com/story_detail.html`` (шаблонизатор ``'django'``)

source: ``/home/html/default/story_detail.html`` (``'django'`` engine)
ru: ``/home/html/default/story_detail.html`` (шаблонизатор ``'django'``)

source: ``/home/html/jinja2/story_detail.html`` (``'jinja2'`` engine)
ru: ``/home/html/jinja2/story_detail.html`` (шаблонизатор ``'jinja2'``)

source: If you call ``select_template(['story_253_detail.html', 'story_detail.html'])``, here's what Django will look for:
ru: Если вызвать ``select_template(['story_253_detail.html', 'story_detail.html'])``, Django бдудет искать:

source: ``/home/html/example.com/story_253_detail.html`` (``'django'`` engine)
ru: ``/home/html/example.com/story_253_detail.html`` (шаблонизатор ``'django'``)

source: ``/home/html/default/story_253_detail.html`` (``'django'`` engine)
ru: ``/home/html/default/story_253_detail.html`` (шаблонизатор ``'django'``)

source: ``/home/html/jinja2/story_253_detail.html`` (``'jinja2'`` engine)
ru: ``/home/html/jinja2/story_253_detail.html`` (шаблонизатор ``'jinja2'``)

source: When Django finds a template that exists, it stops looking.
ru: Если Django находит шаблон, поиск останавливается.

source: Tip
ru: Советы

source: You can use :func:`~django.template.loader.select_template()` for flexible template loading. For example, if you've written a news story and want some stories to have custom templates, use something like ``select_template(['story_%s_detail.html' % story.id, 'story_detail.html'])``. That'll allow you to use a custom template for an individual story, with a fallback template for stories that don't have custom templates.
ru: Вы можете использовать :func:`~django.template.loader.select_template()` для гибкой загрузки шаблонов. Например, вы написали новость и хотите использовать другой шаблон для некоторых новостей. Вы можете использовать ``select_template(['story_%s_detail.html' % story.id, 'story_detail.html'])``. Это позволить создать отдельный шаблон для определенных новостей, а для всех остальных использовать шаблон по умолчанию.

source: It's possible -- and preferable -- to organize templates in subdirectories inside each directory containing templates. The convention is to make a subdirectory for each Django app, with subdirectories within those subdirectories as needed.
ru: Мы советуем хранить шаблоны в подкаталогах в каталогах с шаблонами. Следует создать подкаталог для каждого приложения Django, в котором вы можете хранить шаблоны в различных подкаталогах, если это необходимо.

source: Do this for your own sanity. Storing all templates in the root level of a single directory gets messy.
ru: Хранить все шаблоны в корневом каталоге может привести к хаосу в шаблонах.

source: Using the same :setting:`TEMPLATES` option as above, this will attempt to load the following templates:
ru: При использовании настроек :setting:`TEMPLATES`, приведенных выше, Django будет искать следующие шаблоны:

source: ``/home/html/example.com/news/story_detail.html`` (``'django'`` engine)
ru: ``/home/html/example.com/news/story_detail.html`` (шаблонизатор ``'django'``)

source: ``/home/html/default/news/story_detail.html`` (``'django'`` engine)
ru: ``/home/html/default/news/story_detail.html`` (шаблонизатор ``'django'``)

source: ``/home/html/jinja2/news/story_detail.html`` (``'jinja2'`` engine)
ru: ``/home/html/jinja2/news/story_detail.html`` (шаблонизатор ``'jinja2'``)

source: In addition, to cut down on the repetitive nature of loading and rendering templates, Django provides a shortcut function which automates the process.
ru: Django предоставляет несколько вспомогательных функций для работы с шаблонами.

source: ``render_to_string()`` loads a template like :func:`get_template` and calls its ``render()`` method immediately. It takes the following arguments.
ru: ``render_to_string()`` загружает шаблон как и :func:`get_template`, и вызывает метод ``render()``. Принимает следующие аргументы.

source: The name of the template to load and render. If it's a list of template names, Django uses :func:`select_template` instead of :func:`get_template` to find the template.
ru: Название шаблона, который будет загружен и выполнен. Если указать список шаблонов, для поиска шаблонов Django будет использовать :func:`select_template` вместо :func:`get_template`.

source: A :class:`dict` to be used as the template's context for rendering.
ru: :class:`dict`, который будет использовать как контекст при рендеринге шаблона.

source: An optional :class:`~django.http.HttpRequest` that will be available during the template's rendering process.
ru: Необязательный :class:`~django.http.HttpRequest`, который будет использоваться при рендеринге шаблона.

source: Finally, you can use configured engines directly:
ru: Вы можете использовать шаблонизатор непосредственно:

source: Template engines are available in ``django.template.engines``::
ru: Шаблонизаторы доступны в ``django.template.engines``::

source: The lookup key — ``'django'`` in this example — is the engine's :setting:`NAME <TEMPLATES-NAME>`.
ru: Ключ ``'django'`` в этом примере соответствует :setting:`NAME <TEMPLATES-NAME>`.

source: Built-in backends
ru: Встроенные бэкенды

source: Set :setting:`BACKEND <TEMPLATES-BACKEND>` to ``'django.template.backends.django.DjangoTemplates'`` to configure a Django template engine.
ru: Укажите ``'django.template.backends.django.DjangoTemplates'`` в :setting:`BACKEND <TEMPLATES-BACKEND>`, чтобы использовать шаблонизатор Django.

source: When :setting:`APP_DIRS <TEMPLATES-APP_DIRS>` is ``True``, ``DjangoTemplates`` engines look for templates in the ``templates`` subdirectory of installed applications. This generic name was kept for backwards-compatibility.
ru: Если :setting:`APP_DIRS <TEMPLATES-APP_DIRS>` равна ``True``, ``DjangoTemplates`` будет искать шаблоны в подкаталогах ``templates`` установленных приложений. Такое название используется для обратной совместимости.

source: ``DjangoTemplates`` engines accept the following :setting:`OPTIONS <TEMPLATES-OPTIONS>`:
ru: ``DjangoTemplates`` принимает следующие параметры :setting:`OPTIONS <TEMPLATES-OPTIONS>`:

source: ``'context_processors'``: a list of dotted Python paths to callables that are used to populate the context when a template is rendered with a request. These callables take a request object as their argument and return a :class:`dict` of items to be merged into the context.
ru: ``'context_processors'``: список путей Python, который указывают на процессоры контекста, которые добавляют дополнительные переменные в контекст при рендеринге шаблона в процессе обработки запроса. Процессоры контекста -- это функции, или другие вызываемые объекты, которые принимают объект запроса и возвращают :class:`dict` значений, который будут добавлены в контекст.

source: It defaults to an empty list.
ru: По умолчанию содержит пустой список.

source: See :class:`~django.template.RequestContext` for more information.
ru: Подробности смотрите в описании :class:`~django.template.RequestContext`.

source: ``'debug'``: a boolean that turns on/off template debug mode. If it is ``True``, the fancy error page will display a detailed report for any exception raised during template rendering. This report contains the relevant snippet of the template with the appropriate line highlighted.
ru: ``'debug'``: булево значение, которое включает/выключает отладку шаблонов. При ``True`` будет отображаться страница с отладочной информацией, если возникнет ошибка при рендеринге шаблона. Страница показывает часть шаблона, которая вызвала ошибку.

source: It defaults to the value of the :setting:`DEBUG` setting.
ru: По умолчанию равна значению :setting:`DEBUG`.

source: ``'loaders'``: a list of dotted Python paths to template loader classes. Each ``Loader`` class knows how to import templates from a particular source. Optionally, a tuple can be used instead of a string. The first item in the tuple should be the ``Loader`` class name, and subsequent items are passed to the ``Loader`` during initialization.
ru: ``'loaders'``: список путей Python к загрузчикам шаблонов. Каждый класс ``Loader`` знает как загрузить шаблон из определенного источника. Можно использовать кортеж вместо строки. Первым элементом должен быть путь к ``Loader``, последующие элементы передаются в ``Loader`` при инициализации.

source: The default depends on the values of :setting:`DIRS <TEMPLATES-DIRS>` and :setting:`APP_DIRS <TEMPLATES-APP_DIRS>`.
ru: Значение по умолчанию зависит от значений :setting:`DIRS <TEMPLATES-DIRS>` и :setting:`APP_DIRS <TEMPLATES-APP_DIRS>`.

source: See :ref:`template-loaders` for details.
ru: Подробности смотрите в :ref:`template-loaders`.

source: ``'string_if_invalid'``: the output, as a string, that the template system should use for invalid (e.g. misspelled) variables.
ru: ``'string_if_invalid'``: строка, которая будет использоваться для неправильных (например, с опечаткой) переменных в шаблоне.

source: It defaults to an empty string.
ru: По умолчанию пустая строка.

source: See :ref:`invalid-template-variables` for details.
ru: Подробности смотрите в :ref:`invalid-template-variables`.

source: ``'file_charset'``: the charset used to read template files on disk.
ru: ``'file_charset'``: кодировка, которая используется при чтении файла шаблона с диска.

source: ``'libraries'``: A dictionary of labels and dotted Python paths of template tag modules to register with the template engine. This can be used to add new libraries or provide alternate labels for existing ones. For example::
ru: ``'libraries'``: словарь библиотек тегов, которые зарегистрированы для бэкенда. Состоит из названия библиотеки и пути для импорта. Позволяет добавлять новые библиотеки, или поменять название для существующих. Например::

source: Libraries can be loaded by passing the corresponding dictionary key to the :ttag:`{% load %}<load>` tag.
ru: Библиотеки могут быть загружены с помощью тега :ttag:`{% load %}<load>`, в котором нужно указать соответствующий ключ словаря.

source: ``'builtins'``: A list of dotted Python paths of template tag modules to add to :doc:`built-ins </ref/templates/builtins>`. For example::
ru: ``'builtins'``: список путей для импорта библиотек тегов, которые будут автоматически загружены и добавлены к :doc:`встроенным тегам и фильтрам </ref/templates/builtins>`. Например::

source: Tags and filters from built-in libraries can be used without first calling the :ttag:`{% load %} <load>` tag.
ru: Теги и фильтры из этих библиотек могу быть использованы без вызова :ttag:`{% load %} <load>`.

source: Requires Jinja2_ to be installed:
ru: Для использования необходимо установить Jinja2_:

source: Set :setting:`BACKEND <TEMPLATES-BACKEND>` to ``'django.template.backends.jinja2.Jinja2'`` to configure a Jinja2_ engine.
ru: Укажите ``'django.template.backends.jinja2.Jinja2'`` в :setting:`BACKEND <TEMPLATES-BACKEND>` для настройки шаблонизатора Jinja2_.

source: When :setting:`APP_DIRS <TEMPLATES-APP_DIRS>` is ``True``, ``Jinja2`` engines look for templates in the ``jinja2`` subdirectory of installed applications.
ru: Если :setting:`APP_DIRS <TEMPLATES-APP_DIRS>` равна ``True``, ``Jinja2`` будет искать шаблоны в подкаталоге ``jinja2``установленных приложений.

source: The most important entry in :setting:`OPTIONS <TEMPLATES-OPTIONS>` is ``'environment'``. It's a dotted Python path to a callable returning a Jinja2 environment. It defaults to ``'jinja2.Environment'``. Django invokes that callable and passes other options as keyword arguments. Furthermore, Django adds defaults that differ from Jinja2's for a few options:
ru: Самой важной настройкой в :setting:`OPTIONS <TEMPLATES-OPTIONS>` является ``'environment'``. Это путь для импорта функции, или другого вызываемого объекта, которая возвращает Jinja2. По умолчанию ``'jinja2.Environment'``. Django вызывает функцию и передает другие параметры как именованные аргументы. Также Django указывает значения по умолчанию для некоторых параметров Jinja2:
