Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/ref/models/fields.po
Languages: ru

source: The :class:`FloatField` class is sometimes mixed up with the :class:`DecimalField` class. Although they both represent real numbers, they represent those numbers differently. ``FloatField`` uses Python's ``float`` type internally, while ``DecimalField`` uses Python's ``Decimal`` type. For information on the difference between the two, see Python's documentation for the :mod:`decimal` module.
ru: :class:`FloatField` иногда путают с :class:`DecimalField`. Хоть оба и представляют вещественные числа, они делают это по разному. ``FloatField`` использует тип ``float`` в Python, в то время как ``DecimalField`` использует тип ``Decimal``. Подробности смотрите в документации Python модуля :mod:`decimal`.

source: Inherits all attributes and methods from :class:`FileField`, but also validates that the uploaded object is a valid image.
ru: Наследует все атрибуты и методы поля :class:`FileField`, но также проверяет является ли загруженный файл изображением.

source: In addition to the special attributes that are available for :class:`FileField`, an :class:`ImageField` also has ``height`` and ``width`` attributes.
ru: В дополнение к атрибутам поля :class:`FileField` :class:`ImageField` содержит также ``height`` и ``width``.

source: To facilitate querying on those attributes, :class:`ImageField` has two extra optional arguments:
ru: Для определения этих аргументов :class:`ImageField` принимает дополнительные аргументы:

source: Name of a model field which will be auto-populated with the height of the image each time the model instance is saved.
ru: Имя поля, которому автоматически будет присвоено значение высоты изображения при каждом сохранении объекта.

source: Name of a model field which will be auto-populated with the width of the image each time the model instance is saved.
ru: Имя поля, которому автоматически будет присвоено значение ширины изображения при каждом сохранении объекта.

source: Requires the `Pillow`_ library.
ru: Требуется библиотека `Pillow`_.

source: :class:`ImageField` instances are created in your database as ``varchar`` columns with a default max length of 100 characters. As with other fields, you can change the maximum length using the :attr:`~CharField.max_length` argument.
ru: По-умолчанию, экземпляр :class:`ImageField` создается как колонка ``varchar`` в базе данных. Как и с другими полями вы можете изменить максимальную длину используя аргумент :attr:`~CharField.max_length`.

source: An integer. Values from ``-2147483648`` to ``2147483647`` are safe in all databases supported by Django. The default form widget for this field is a :class:`~django.forms.NumberInput` when :attr:`~django.forms.Field.localize` is ``False`` or :class:`~django.forms.TextInput` otherwise.
ru: Число. Значение от ``-2147483648`` до ``2147483647`` для всех поддерживаемых баз данных Django. Форма использует виджет :class:`~django.forms.NumberInput` при :attr:`~django.forms.Field.localize` равном ``False``, иначе :class:`~django.forms.TextInput`.

source: An IPv4 or IPv6 address, in string format (e.g. ``192.0.2.30`` or ``2a02:42fe::4``). The default form widget for this field is a :class:`~django.forms.TextInput`.
ru: Адрес IPv4 или IPv6 в виде строки (например, ``192.0.2.30`` или ``2a02:42fe::4``). Форма использует виджет :class:`~django.forms.TextInput`.

source: The IPv6 address normalization follows :rfc:`4291#section-2.2` section 2.2, including using the IPv4 format suggested in paragraph 3 of that section, like ``::ffff:192.0.2.0``. For example, ``2001:0::0:01`` would be normalized to ``2001::1``, and ``::ffff:0a0a:0a0a`` to ``::ffff:10.10.10.10``. All characters are converted to lowercase.
ru: Преобразование адреса IPv6 происходит в соответствии с :rfc:`4291#section-2.2` раздел 2.2, включая рекомендации по форматированию IPv4 в параграфа 3 этого раздела, таких как ``::ffff:192.0.2.0``. Например, ``2001:0::0:01`` будет преобразован ``2001::1``, а ``::ffff:0a0a:0a0a`` в ``::ffff:10.10.10.10``. Все символы будут преобразованы в нижний регистр.

source: Limits valid inputs to the specified protocol. Accepted values are ``'both'`` (default), ``'IPv4'`` or ``'IPv6'``. Matching is case insensitive.
ru: Определяет формат IP адреса. Принимает значение ``'both'`` (по умолчанию), ``'IPv4'`` или ``'IPv6'``. Значение не чувствительно регистру.

source: Unpacks IPv4 mapped addresses like ``::ffff:192.0.2.1``. If this option is enabled that address would be unpacked to ``192.0.2.1``. Default is disabled. Can only be used when ``protocol`` is set to ``'both'``.
ru: Преобразует адрес IPv4. Если эта опция установлена, адрес ``::ffff::192.0.2.1`` будет преобразован в ``192.0.2.1``. По-умолчанию отключена. Может быть использовано, если ``protocol`` установлен в ``'both'``.

source: If you allow for blank values, you have to allow for null values since blank values are stored as null.
ru: Если вы разрешили пустые значение, необходимо также разрешить ``null`` т.к. пустые значения сохраняются как ``null``.

source: Like a :class:`BooleanField`, but allows ``NULL`` as one of the options. Use this instead of a :class:`BooleanField` with ``null=True``. The default form widget for this field is a :class:`~django.forms.NullBooleanSelect`.
ru: Как и :class:`BooleanField`, но принимает значение ``NULL``. Используете его вместо :class:`BooleanField` с ``null=True``. Форма использует виджет :class:`~django.forms.NullBooleanSelect`.

source: Like an :class:`IntegerField`, but must be either positive or zero (``0``). Values from ``0`` to ``2147483647`` are safe in all databases supported by Django. The value ``0`` is accepted for backward compatibility reasons.
ru: Как и поле :class:`IntegerField`, но значение должно быть больше или равно нулю (`0`). Можно использовать значение от ``0`` до ``2147483647``. Значение `0` принимается для обратной совместимости.

source: Like a :class:`PositiveIntegerField`, but only allows values under a certain (database-dependent) point. Values from ``0`` to ``32767`` are safe in all databases supported by Django.
ru: Как и поле :class:`PositiveIntegerField`, но принимает значения в определенном диапазоне(зависит от типа базы данных). Для баз данных поддерживаемых Django можно использовать значения от ``0`` до ``32767``.

source: :term:`Slug` is a newspaper term. A slug is a short label for something, containing only letters, numbers, underscores or hyphens. They're generally used in URLs.
ru: :term:`Slug` -- газетный термин. "Slug" -- это короткое название-метка, которое содержит только буквы, числа, подчеркивание или дефис. В основном используются в URL.

source: Like a CharField, you can specify :attr:`~CharField.max_length` (read the note about database portability and :attr:`~CharField.max_length` in that section, too). If :attr:`~CharField.max_length` is not specified, Django will use a default length of 50.
ru: Как и для ``CharField``, можно указать :attr:`~CharField.max_length` (упомянутые особенности работы с различными типами баз данных актуальны). Если :attr:`~CharField.max_length` не указан, Django будет использовать значение 50.

source: Implies setting :attr:`Field.db_index` to ``True``.
ru: Устанавливает :attr:`Field.db_index` в ``True``, если аргумент явно не указан.

source: It is often useful to automatically prepopulate a SlugField based on the value of some other value. You can do this automatically in the admin using :attr:`~django.contrib.admin.ModelAdmin.prepopulated_fields`.
ru: Обычно значение SlugField создается на основе какого-то другого значения(например, название статьи). Это может работать автоматически в интерфейсе администрации благодаря параметру :attr:`~django.contrib.admin.ModelAdmin.prepopulated_fields`.

source: If ``True``, the field accepts Unicode letters in addition to ASCII letters. Defaults to ``False``.
ru: При ``True`` поле может принимать Unicode символы кроме ASCII. Значение по умолчанию -- ``False``.

source: Like an :class:`IntegerField`, but only allows values under a certain (database-dependent) point. Values from ``-32768`` to ``32767`` are safe in all databases supported by Django.
ru: Как и поле :class:`IntegerField`, но принимает значения в определенном диапазоне(зависит от типа базы данных). Для баз данных поддерживаемых Django можно использовать значения от ``-32768`` до ``32767``.

source: A large text field. The default form widget for this field is a :class:`~django.forms.Textarea`.
ru: Большое текстовое поле. Форма использует виджет :class:`~django.forms.Textarea`.

source: If you specify a ``max_length`` attribute, it will be reflected in the :class:`~django.forms.Textarea` widget of the auto-generated form field. However it is not enforced at the model or database level. Use a :class:`CharField` for that.
ru: Если указать атрибут ``max_length``, это повлияет на поле, создаваемое виджетом :class:`~django.forms.Textarea`. Но не учитывается на уровне модели или базы данных. Для этого используйте :class:`CharField`.

source: A time, represented in Python by a ``datetime.time`` instance. Accepts the same auto-population options as :class:`DateField`.
ru: Время, представленное объектом ``datetime.time`` Python. Принимает те же аргументы, что и :class:`DateField`.

source: The default form widget for this field is a :class:`~django.forms.TextInput`. The admin adds some JavaScript shortcuts.
ru: Форма использует виджет :class:`~django.forms.TextInput`. Интерфейс администратора также использует немного JavaScript.

source: A :class:`CharField` for a URL.
ru: Поле :class:`CharField` для URL.

source: Like all :class:`CharField` subclasses, :class:`URLField` takes the optional :attr:`~CharField.max_length` argument. If you don't specify :attr:`~CharField.max_length`, a default of 200 is used.
ru: Как подкласс :class:`CharField` :class:`URLField` принимает необязательный аргумент :attr:`~CharField.max_length`. Если вы не укажите :attr:`~CharField.max_length`, будет использовано значение -- 200.

source: A field for storing universally unique identifiers. Uses Python's :class:`~python:uuid.UUID` class. When used on PostgreSQL, this stores in a ``uuid`` datatype, otherwise in a ``char(32)``.
ru: Поля для сохранения UUID. Использует класс Python :class:`~python:uuid.UUID`. Для PostgreSQL используется тип ``uuid``, иначе ``char(32)``.

source: Universally unique identifiers are a good alternative to :class:`AutoField` for :attr:`~Field.primary_key`. The database will not generate the UUID for you, so it is recommended to use :attr:`~Field.default`::
ru: UUID является хорошей альтернативой :class:`AutoField` с :attr:`~Field.primary_key`. База данных не сгенерирует UUID за вас, по этому следует использовать :attr:`~Field.default`::

source: Note that a callable (with the parentheses omitted) is passed to ``default``, not an instance of ``UUID``.
ru: Обратите внимание, указана функция (без скобок) в ``default``, а не объект ``UUID``.

source: Relationship fields
ru: Поля отношений

source: Django also defines a set of fields that represent relations.
ru: Django предоставляет набор полей для определения связей между моделями.

source: A many-to-one relationship. Requires a positional argument: the class to which the model is related.
ru: Связь многое-к-одному. Принимает позиционный аргумент: класс связанной модели.

source: To create a recursive relationship -- an object that has a many-to-one relationship with itself -- use ``models.ForeignKey('self', on_delete=models.CASCADE)``.
ru: Для создания рекурсивной связи -- объект со связью многое-к-одному на себя -- используйте ``models.ForeignKey('self', on_delete=models.CASCADE)``.

source: If you need to create a relationship on a model that has not yet been defined, you can use the name of the model, rather than the model object itself::
ru: Если вам необходимо добавить связь на модель, которая еще не определена, вы можете использовать имя модели вместо класса::

source: To refer to models defined in another application, you can explicitly specify a model with the full application label. For example, if the ``Manufacturer`` model above is defined in another application called ``production``, you'd need to use::
ru: Для связи на модель из другого приложения используйте название модели и приложения. Например, если модель ``Manufacturer`` находится в приложении ``production``, используйте::

source: This sort of reference can be useful when resolving circular import dependencies between two applications.
ru: Такой способ позволяет создать циклическую зависимость между моделями из разных приложений.

source: A database index is automatically created on the ``ForeignKey``. You can disable this by setting :attr:`~Field.db_index` to ``False``. You may want to avoid the overhead of an index if you are creating a foreign key for consistency rather than joins, or if you will be creating an alternative index like a partial or multiple column index.
ru: В базе данных автоматом создается индекс для ``ForeignKey``. Можно указать для :attr:`~Field.db_index` ``False``, чтобы отключить такое поведение. Это может пригодиться, если внешний ключ используется для согласованности данных, а не объединения(join) в запросах, или вы хотите самостоятельно создать альтернативный индекс или индекс на несколько колонок.

source: Database Representation
ru: Представление в базе данных

source: Behind the scenes, Django appends ``"_id"`` to the field name to create its database column name. In the above example, the database table for the ``Car`` model will have a ``manufacturer_id`` column. (You can change this explicitly by specifying :attr:`~Field.db_column`) However, your code should never have to deal with the database column name, unless you write custom SQL. You'll always deal with the field names of your model object.
ru: За кулисами, Django добавляет ``"_id"`` к названию поля для создания названия колонки. В примере выше, таблица для модели ``Car`` будет содержать колонку ``manufacturer_id``. (Такое поведение можно изменить, указав аргумент :attr:`~Field.db_column`) Хотя, ваш код никогда не должен использовать названий колонок, если только вы не используете чистый SQL. Вы всегда будете использовать названия полей модели.

source: Arguments
ru: Параметры

source: :class:`ForeignKey` accepts other arguments that define the details of how the relation works.
ru: :class:`ForeignKey` принимает дополнительные аргументы, которые определяют, как должна работать связь.

source: When an object referenced by a :class:`ForeignKey` is deleted, Django will emulate the behavior of the SQL constraint specified by the :attr:`on_delete` argument. For example, if you have a nullable :class:`ForeignKey` and you want it to be set null when the referenced object is deleted::
ru: Когда объект, на который ссылается :class:`ForeignKey`, удаляется, Django эмулирует поведение SQL правил, указанных в аргументе :attr:`on_delete`. Например, если ваше поле :class:`ForeignKey` может содержать ``NULL`` и вы хотите, чтобы оно устанавливалось в ``NULL`` после удаления связанного объекта::

source: :attr:`~ForeignKey.on_delete` will become a required argument in Django 2.0. In older versions it defaults to ``CASCADE``.
ru: :attr:`~ForeignKey.on_delete` будет обязательным аргументом в Django 2.0. В предыдущих версиях по умолчанию было ``CASCADE``.

source: The possible values for :attr:`~ForeignKey.on_delete` are found in :mod:`django.db.models`:
ru: Возможные значения для :attr:`~ForeignKey.on_delete` находятся в :mod:`django.db.models`:

source: Cascade deletes. Django emulates the behavior of the SQL constraint ON DELETE CASCADE and also deletes the object containing the ForeignKey.
ru: Каскадное удаление. Django эмулирует поведение SQL правила ON DELETE CASCADE и так же удаляет объекты, связанные через ForeignKey.

source: Prevent deletion of the referenced object by raising :exc:`~django.db.models.ProtectedError`, a subclass of :exc:`django.db.IntegrityError`.
ru: Препятствует удалению связанного объекта вызывая исключение :exc:`django.db.models.ProtectedError`(подкласс :exc:`django.db.IntegrityError`).

source: Set the :class:`ForeignKey` null; this is only possible if :attr:`~Field.null` is ``True``.
ru: Устанавливает :class:`ForeignKey` в ``NULL``; возможно только если :attr:`null` равен ``True``.

source: Set the :class:`ForeignKey` to its default value; a default for the :class:`ForeignKey` must be set.
ru: Устанавливает :class:`ForeignKey` в значение по умолчанию; значение по-умолчанию должно быть указано для :class:`ForeignKey`.

source: Set the :class:`ForeignKey` to the value passed to :func:`~django.db.models.SET()`, or if a callable is passed in, the result of calling it. In most cases, passing a callable will be necessary to avoid executing queries at the time your models.py is imported::
ru: Устанавливает :class:`ForeignKey` в значение указанное в :func:`~django.db.models.SET()`. Если указан выполняемый объект, результат его выполнения. Вызываемый объект можно использовать, чтобы избежать запросов во время импорта models.py::

source: Take no action. If your database backend enforces referential integrity, this will cause an :exc:`~django.db.IntegrityError` unless you manually add an SQL ``ON DELETE`` constraint to the database field.
ru: Ничего не делать. Если используемый тип базы данных следит за целостностью связей, будет вызвано исключение :exc:`~django.db.IntegrityError`, за исключением, когда вы самостоятельно добавите SQL правило ``ON DELETE`` для поля таблицы.

source: Sets a limit to the available choices for this field when this field is rendered using a ``ModelForm`` or the admin (by default, all objects in the queryset are available to choose). Either a dictionary, a :class:`~django.db.models.Q` object, or a callable returning a dictionary or :class:`~django.db.models.Q` object can be used.
ru: Ограничивает доступные значения для поля при создании ``ModelForm`` или в админке (по умолчанию можно выбрать любой объект связанной модели). Можно передать словарь, объект :class:`~django.db.models.Q` или функцию, которая возвращает словарь или объект :class:`~django.db.models.Q`.

source: causes the corresponding field on the ``ModelForm`` to list only ``Users`` that have ``is_staff=True``. This may be helpful in the Django admin.
ru: указывает полю ``ModelForm`` показывать только объекты ``Users``, которые соответствуют ``is_staff=True``. Может быть полезно в админке.

source: The callable form can be helpful, for instance, when used in conjunction with the Python ``datetime`` module to limit selections by date range. For example::
ru: Указание функции может быть полезно, если используется объект Python ``datetime`` для фильтрации. Например::

source: If ``limit_choices_to`` is or returns a :class:`Q object <django.db.models.Q>`, which is useful for :ref:`complex queries <complex-lookups-with-q>`, then it will only have an effect on the choices available in the admin when the field is not listed in :attr:`~django.contrib.admin.ModelAdmin.raw_id_fields` in the ``ModelAdmin`` for the model.
ru: Вместо словаря можете использовать объект :class:`~django.db.models.Q` или функцию, которая возвращает такой объект, для создания :ref:`сложных запросов <complex-lookups-with-q>`. Однако, если ``limit_choices_to`` объект :class:`~django.db.models.Q`, он будет использован в интерфейсе администратора, только если поле не находится в ``raw_id_fields`` класса ``ModelAdmin`` для этой модели.

source: If a callable is used for ``limit_choices_to``, it will be invoked every time a new form is instantiated. It may also be invoked when a model is validated, for example by management commands or the admin. The admin constructs querysets to validate its form inputs in various edge cases multiple times, so there is a possibility your callable may be invoked several times.
ru: Если используется функция для ``limit_choices_to``, она будет вызываться при каждом создании формы. Также она может быть вызвана при валидации модели, например, командой или админкой. Админка может вызывать эту функцию несколько раз при проверке данных.

source: The name to use for the relation from the related object back to this one. It's also the default value for :attr:`related_query_name` (the name to use for the reverse filter name from the target model). See the :ref:`related objects documentation <backwards-related-objects>` for a full explanation and example. Note that you must set this value when defining relations on :ref:`abstract models <abstract-base-classes>`; and when you do so :ref:`some special syntax <abstract-related-name>` is available.
ru: Название, используемое для обратной связи от связанной модели. Также значение по умолчанию для :attr:`related_query_name` (название обратной связи используемое при фильтрации результата запроса). Ищите подробности и примеры в :ref:`разделе о связанных объектах <backwards-related-objects>`. Заметим, что вы должны определить этот параметр для поля в :ref:`абстрактной модели <abstract-base-classes>`; при этом можно использовать :ref:`некоторые дополнительные возможности <abstract-related-name>`.

source: If you'd prefer Django not to create a backwards relation, set ``related_name`` to ``'+'`` or end it with ``'+'``. For example, this will ensure that the ``User`` model won't have a backwards relation to this model::
ru: Если вы не хотите, чтобы Django создавал обратную связь, установите ``related_name`` в ``'+'`` или добавьте в конце ``'+'``. Например, такой код создаст связь, но не добавит обратную связь в модель ``User``::

source: Controls whether or not a constraint should be created in the database for this foreign key. The default is ``True``, and that's almost certainly what you want; setting this to ``False`` can be very bad for data integrity. That said, here are some scenarios where you might want to do this:
ru: Указывает создавать ли "constraint" для внешнего ключа в базе данных. По умолчанию ``True`` и в большинстве случает это то, что вам нужно. Указав ``False`` вы рискуете целостностью данных. Некоторые ситуации, когда вам может быть это необходимо:

source: You have legacy data that is not valid.
ru: Вам досталась в наследство нецелостная база данных

source: You're sharding your database.
ru: Вы используете шардинг базы данных.

source: If this is set to ``False``, accessing a related object that doesn't exist will raise its ``DoesNotExist`` exception.
ru: При ``False``, если связанный объект не существует, при обращении к нему будет вызвано исключение ``DoesNotExist``.

source: Controls the migration framework's reaction if this :class:`ForeignKey` is pointing at a swappable model. If it is ``True`` - the default - then if the :class:`ForeignKey` is pointing at a model which matches the current value of ``settings.AUTH_USER_MODEL`` (or another swappable model setting) the relationship will be stored in the migration using a reference to the setting, not to the model directly.
ru: Управляет поведением миграций, если :class:`ForeignKey` ссылается на подменяемую(swappable) модель. При ``True`` - значение по умолчанию - если :class:`ForeignKey` ссылается на модель, указанную через ``settings.AUTH_USER_MODEL`` (или другую настройку, определяющую какую модель использовать), связь в миграции будет использовать настройку, а не саму модель.

source: You only want to override this to be ``False`` if you are sure your model should always point towards the swapped-in model - for example, if it is a profile model designed specifically for your custom user model.
ru: Вам может понадобится значение ``False`` только, если связь должна указывать на какую-то конкретную модель, игнорируя настройку - например, если это модель профиля пользователя для какой-то конкретной модели пользователя и не будет работать с любой моделью из настройки.
