Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/ref/models/fields.po
Languages: ru

source: It should return the value of the appropriate attribute from ``model_instance`` for this field. The attribute name is in ``self.attname`` (this is set up by :class:`~django.db.models.Field`).
ru: Должен вернуть значение соответствующего этому полю атрибута ``model_instance``. Название атрибута можно получить из ``self.attname`` (устанавливается :class:`~django.db.models.Field`).

source: See :ref:`preprocessing-values-before-saving` for usage.
ru: Смотрите :ref:`preprocessing-values-before-saving`.

source: Fields often receive their values as a different type, either from serialization or from forms.
ru: Поля часто принимает значения разных типов из сериализатора, или формы

source: Converts the value into the correct Python object. It acts as the reverse of :meth:`value_to_string`, and is also called in :meth:`~django.db.models.Model.clean`.
ru: Преобразует значение в правильный объект Python. Выполняет действия обратные :meth:`value_to_string`, и вызывается в :meth:`~django.db.models.Model.clean`.

source: Besides saving to the database, the field also needs to know how to serialize its value:
ru: Кроме сохранения в базу данных, поле также должно знать как сериализовать свое значение:

source: Converts ``obj`` to a string. Used to serialize the value of the field.
ru: Преобразует ``obj`` в строку. Используется при сериализации значения поля.

source: See :ref:`converting-model-field-to-serialization` for usage.
ru: Смотрите :ref:`converting-model-field-to-serialization`.

source: When using :class:`model forms <django.forms.ModelForm>`, the ``Field`` needs to know which form field it should be represented by:
ru: При использовании :class:`django.forms.ModelForm` ``Field`` должно указать, какое поле формы необходимо использовать для его представления в форме:

source: Returns the default :class:`django.forms.Field` of this field for :class:`~django.forms.ModelForm`.
ru: Возвращает :class:`django.forms.Field` поля модели для :class:`~django.forms.ModelForm`.

source: See :ref:`specifying-form-field-for-model-field` for usage.
ru: Смотрите :ref:`specifying-form-field-for-model-field`.

source: Returns a 4-tuple with enough information to recreate the field:
ru: Возвращает 4-х элементный кортеж с информацией, как воссоздать поле:

source: The name of the field on the model.
ru: Название поля в модели.

source: The import path of the field (e.g. ``"django.db.models.IntegerField"``). This should be the most portable version, so less specific may be better.
ru: Путь для импорта класса поля (например, ``"django.db.models.IntegerField"``). Должен возвращаться максимально переносимый между платформами и версиями вариант.

source: A list of positional arguments.
ru: Список позиционных аргументов.

source: A dict of keyword arguments.
ru: Словарь именованных аргументов.

source: This method must be added to fields prior to 1.7 to migrate its data using :doc:`/topics/migrations`.
ru: Этот метод должен быть добавлен полям, созданным до 1.7, для использования :doc:`/topics/migrations`.

source: Field attribute reference
ru: Атрибуты поля

source: Every ``Field`` instance contains several attributes that allow introspecting its behavior. Use these attributes instead of ``isinstance`` checks when you need to write code that depends on a field's functionality. These attributes can be used together with the :ref:`Model._meta API <model-meta-field-api>` to narrow down a search for specific field types. Custom model fields should implement these flags.
ru: Каждый экземпляр ``Field`` содержит атрибуты, определяющие поведение поля. Используйте эти атрибуты вместо проверки ``isinstance``, если вам необходимо написать код, который зависит от поведения поля. Эти атрибуты можно использовать совместно с :ref:`Model._meta API <model-meta-field-api>`, чтобы проверять поля конкретного типа. Собственные поля модели должны определять эти атрибуты.

source: Attributes for fields
ru: Атрибуты поля

source: Boolean flag that indicates if the field was automatically created, such as the ``OneToOneField`` used by model inheritance.
ru: Флаг, который указывает было ли поле создано автоматически, например ``OneToOneField`` при наследовании моделей.

source: Boolean flag that indicates if the field has a database column associated with it.
ru: Флаг, который указывает представлено ли поле колонкой в таблице в базе данных.

source: Boolean flag that indicates if a field is used to back another non-hidden field's functionality (e.g. the ``content_type`` and ``object_id`` fields that make up a ``GenericForeignKey``). The ``hidden`` flag is used to distinguish what constitutes the public subset of fields on the model from all the fields on the model.
ru: Флаг, который указывает, что поле скрыто и используется для работы другого не скрытого поля (например, поля ``content_type`` и ``object_id`` используются для работы ``GenericForeignKey``). Флаг ``hidden`` используется, чтобы выделить публичные поля модели из всех полей.

source: :meth:`Options.get_fields() <django.db.models.options.Options.get_fields()>` excludes hidden fields by default. Pass in ``include_hidden=True`` to return hidden fields in the results.
ru: :meth:`Options.get_fields() <django.db.models.options.Options.get_fields()>` не возвращает скрытые поля. Передайте ``include_hidden=True``, чтобы получить все поля.

source: Boolean flag that indicates if a field contains references to one or more other models for its functionality (e.g. ``ForeignKey``, ``ManyToManyField``, ``OneToOneField``, etc.).
ru: Флаг, который указывает, ссылается ли поле на другие модели (например, ``ForeignKey``, ``ManyToManyField``, ``OneToOneField``, и т.д.).

source: Returns the model on which the field is defined. If a field is defined on a superclass of a model, ``model`` will refer to the superclass, not the class of the instance.
ru: Содержит модель, в которой это поле определено. Если поле определено в родительском классе, ``model`` будет ссылаться на этот класс, а не класс экземпляра модели.

source: Attributes for fields with relations
ru: Атрибуты связывающих полей

source: These attributes are used to query for the cardinality and other details of a relation. These attribute are present on all fields; however, they will only have boolean values (rather than ``None``) if the field is a relation type (:attr:`Field.is_relation=True <Field.is_relation>`).
ru: Атрибуты, определяющие связь поля. Эти атрибуты присутствуют во всех полях, однако, только для связывающих полей(:attr:`Field.is_relation=True <Field.is_relation>`) они содержат булевы значения(а не ``None``).

source: Boolean flag that is ``True`` if the field has a many-to-many relation; ``False`` otherwise. The only field included with Django where this is ``True`` is ``ManyToManyField``.
ru: Флаг, который содержит ``True``, если поле содержит связь многие-ко-многим, иначе ``False``. Единственное поле Django, которое содержит ``True`` -- это ``ManyToManyField``.

source: Boolean flag that is ``True`` if the field has a many-to-one relation, such as a ``ForeignKey``; ``False`` otherwise.
ru: Флаг, который содержит ``True``, если поле содержит связь многие-к-одному, такие как ``ForeignKey``, иначе ``False``.

source: Boolean flag that is ``True`` if the field has a one-to-many relation, such as a ``GenericRelation`` or the reverse of a ``ForeignKey``; ``False`` otherwise.
ru: Флаг, который содержит ``True``, если поле содержит связь один-ко-многим, такие как ``GenericRelation`` или обратная связь ``ForeignKey``, иначе ``False``.

source: Boolean flag that is ``True`` if the field has a one-to-one relation, such as a ``OneToOneField``; ``False`` otherwise.
ru: Флаг, который содержит ``True``, если поле содержит связь один-к-одному, такие как ``OneToOneField``, иначе ``False``.
