Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/ref/models/fields.po
Languages: ru

source: For :class:`DateTimeField`: ``default=timezone.now`` - from :func:`django.utils.timezone.now`
ru: Для :class:`DateTimeField`: ``default=timezone.now`` - из :func:`django.utils.timezone.now`

source: The default form widget for this field is a :class:`~django.forms.TextInput`. The admin adds a JavaScript calendar, and a shortcut for "Today". Includes an additional ``invalid_date`` error message key.
ru: В форме поле будет представлено как `:class:`~django.forms.TextInput` с JavaScript календарем, и кнопкой "Сегодня". Содержит дополнительную ошибку ``invalid_date``.

source: The options ``auto_now_add``, ``auto_now``, and ``default`` are mutually exclusive. Any combination of these options will result in an error.
ru: Опции ``auto_now_add``, ``auto_now`` и ``default`` взаимоисключающие. Использование их вместе вызовет ошибку.

source: As currently implemented, setting ``auto_now`` or ``auto_now_add`` to ``True`` will cause the field to have ``editable=False`` and ``blank=True`` set.
ru: При использовании ``auto_now`` или ``auto_now_add`` со значением ``True`` будут установлены параметры ``editable=False`` и ``blank=True``.

source: The ``auto_now`` and ``auto_now_add`` options will always use the date in the :ref:`default timezone <default-current-time-zone>` at the moment of creation or update. If you need something different, you may want to consider simply using your own callable default or overriding ``save()`` instead of using ``auto_now`` or ``auto_now_add``; or using a ``DateTimeField`` instead of a ``DateField`` and deciding how to handle the conversion from datetime to date at display time.
ru: Опции``auto_now`` и ``auto_now_add`` всегда используют дату в :ref:`часовом поясе по умолчанию <default-current-time-zone>` в момент создания или изменения объекта. Если такое поведение вам не подходит, вы можете указать свою функцию как значение по умолчанию, или переопределить метод ``save()``, вместо использования ``auto_now`` или ``auto_now_add``. Или использовать ``DateTimeField`` вместо ``DateField`` и выполнять преобразование в дату при выводе значения.

source: A date and time, represented in Python by a ``datetime.datetime`` instance. Takes the same extra arguments as :class:`DateField`.
ru: Дата и время, представленные объектом ``datetime.datetime`` Python. Принимает аналогичные параметры что и :class:`DateField`.

source: The default form widget for this field is a single :class:`~django.forms.TextInput`. The admin uses two separate :class:`~django.forms.TextInput` widgets with JavaScript shortcuts.
ru: Виджет по умолчанию в форме для этого поля - :class:`~django.forms.TextInput`. Интерфейс администратора использует два виджета :class:`~django.forms.TextInput` и JavaScript.

source: A fixed-precision decimal number, represented in Python by a :class:`~decimal.Decimal` instance. Has two **required** arguments:
ru: Десятичное число с фиксированной точностью, представленное объектом :class:`~decimal.Decimal` Python. Принимает два **обязательных** параметра:

source: The maximum number of digits allowed in the number. Note that this number must be greater than or equal to ``decimal_places``.
ru: Максимальное количество цифр в числе. Заметим, что это число должно быть больше или равно ``decimal_places``.

source: The number of decimal places to store with the number.
ru: Количество знаков после запятой.

source: For example, to store numbers up to ``999`` with a resolution of 2 decimal places, you'd use::
ru: Например, для хранения числа до ``999`` с двумя знаками после запятой, используйте::

source: And to store numbers up to approximately one billion with a resolution of 10 decimal places::
ru: Для хранения числа до миллиарда и 10 знаков после запятой::

source: The default form widget for this field is a :class:`~django.forms.NumberInput` when :attr:`~django.forms.Field.localize` is ``False`` or :class:`~django.forms.TextInput` otherwise.
ru: Виджет по умолчанию в форме для этого поля - :class:`~django.forms.NumberInput`, если :attr:`~django.forms.Field.localize` равен ``False``, иначе :class:`~django.forms.TextInput`.

source: For more information about the differences between the :class:`FloatField` and :class:`DecimalField` classes, please see :ref:`FloatField vs. DecimalField <floatfield_vs_decimalfield>`.
ru: Для дополнительной информации о разнице между :class:`FloatField` и :class:`DecimalField`, смотрите раздел :ref:`FloatField vs. DecimalField <floatfield_vs_decimalfield>`.

source: A field for storing periods of time - modeled in Python by :class:`~python:datetime.timedelta`. When used on PostgreSQL, the data type used is an ``interval`` and on Oracle the data type is ``INTERVAL DAY(9) TO SECOND(6)``. Otherwise a ``bigint`` of microseconds is used.
ru: Поля для хранения периодов времени - используется объект Python :class:`~python:datetime.timedelta`. Для PostgreSQL используется тип ``interval``, а в Oracle -- ``INTERVAL DAY(9) TO SECOND(6)``. Иначе используется ``bigint``, в котором хранится количество микросекунд.

source: Arithmetic with ``DurationField`` works in most cases. However on all databases other than PostgreSQL, comparing the value of a ``DurationField`` to arithmetic on ``DateTimeField`` instances will not work as expected.
ru: Арифметика над ``DurationField`` работает в большинстве случаев. Однако, для всех баз данных, кроме PostgreSQL, арифметическое сравнение ``DurationField`` и ``DateTimeField`` работает не как ожидается.

source: A :class:`CharField` that checks that the value is a valid email address. It uses :class:`~django.core.validators.EmailValidator` to validate the input.
ru: Поле :class:`CharField` для хранения правильного email-адреса. Использует :class:`~django.core.validators.EmailValidator` для проверки значения.

source: A file-upload field.
ru: Поле для загрузки файла.

source: Has two optional arguments:
ru: Также принимается два дополнительных параметра:

source: This attribute provides a way of setting the upload directory and file name, and can be set in two ways. In both cases, the value is passed to the :meth:`Storage.save() <django.core.files.storage.Storage.save>` method.
ru: Этот атрибут позволяет указать каталог и название файла при его сохранении. Его можно использовать двумя способами. В обоих случаях значение будет передано в метод :meth:`Storage.save() <django.core.files.storage.Storage.save>`.

source: If you specify a string value, it may contain :func:`~time.strftime` formatting, which will be replaced by the date/time of the file upload (so that uploaded files don't fill up the given directory). For example::
ru: Поддерживает форматирование :func:`~time.strftime`, которое будет заменено на дату/время загруженного файла (и загружаемые файлы не заполнят один каталог). Например::

source: If you are using the default :class:`~django.core.files.storage.FileSystemStorage`, the string value will be appended to your :setting:`MEDIA_ROOT` path to form the location on the local filesystem where uploaded files will be stored. If you are using a different storage, check that storage's documentation to see how it handles ``upload_to``.
ru: Если вы используйте бэкенд по умолчанию :class:`~django.core.files.storage.FileSystemStorage`, значение будет добавлено к :setting:`MEDIA_ROOT`, чтобы сформировать путь в файловой системе для сохранения файла. Если вы используете другой бэкенд, обратитесь к его документации, чтобы узнать как он обрабатывает ``upload_to``.

source: ``upload_to`` may also be a callable, such as a function. This will be called to obtain the upload path, including the filename. This callable must accept two arguments and return a Unix-style path (with forward slashes) to be passed along to the storage system. The two arguments are:
ru: ``upload_to`` также принимается вызываемый объект, такой как функция, который будет вызван для получения пути к загруженному файлу, включая имя файла. Вызываемый объект должен принимать два обязательных аргумента, и возвращать путь в стиле Unix (с прямыми слэшами), который будет передан в систему хранения файлов(storage). Два аргумента это:

source: Argument
ru: Аргумент

source: Description
ru: Описание

source: An instance of the model where the ``FileField`` is defined. More specifically, this is the particular instance where the current file is being attached.
ru: Экземпляр модели, для которой определено поле ``FileField``. Точнее, это объект, для которого сохраняется текущий файл.

source: In most cases, this object will not have been saved to the database yet, so if it uses the default ``AutoField``, *it might not yet have a value for its primary key field*.
ru: В большинстве случаев объект еще не будет сохранен в базу данных, и при использовании ``AutoField``, *первичный ключ объекта может быть пустым*.

source: The filename that was originally given to the file. This may or may not be taken into account when determining the final destination path.
ru: Оригинальное имя файла. Вы можете его учитывать, или проигнорировать при определении окончательного пути к файлу.

source: For example::
ru: Например::

source: A storage object, which handles the storage and retrieval of your files. See :doc:`/topics/files` for details on how to provide this object.
ru: Объект "storage", который отвечает за хранение и получение файлов. Смотрите :doc:`/topics/files` для подробной информации.

source: The default form widget for this field is a :class:`~django.forms.ClearableFileInput`.
ru: Виджет форма для этого поля - :class:`~django.forms.ClearableFileInput`.

source: Using a :class:`FileField` or an :class:`ImageField` (see below) in a model takes a few steps:
ru: Использование :class:`FileField` или :class:`ImageField` (смотрите ниже) требует некоторых дополнительных действий:

source: In your settings file, you'll need to define :setting:`MEDIA_ROOT` as the full path to a directory where you'd like Django to store uploaded files. (For performance, these files are not stored in the database.) Define :setting:`MEDIA_URL` as the base public URL of that directory. Make sure that this directory is writable by the Web server's user account.
ru: В файле настроек необходимо определить :setting:`MEDIA_ROOT`, как полный путь к каталогу, куда Django должен сохранять файлы. (Для повышения производительности файлы не хранятся в базе данных.) Определить :setting:`MEDIA_URL`, который является URL-ом к этому каталогу и используется для создания URL-а к файлу. Убедитесь, что пользователь, от которого работает сервер, имеет права записи в этот каталог.

source: Add the :class:`FileField` or :class:`ImageField` to your model, defining the :attr:`~FileField.upload_to` option to specify a subdirectory of :setting:`MEDIA_ROOT` to use for uploaded files.
ru: Добавьте :class:`FileField` или :class:`ImageField` к модели, определите :attr:`~FileField.upload_to`, чтобы указать Django в каком подкаталоге в :setting:`MEDIA_ROOT` должны быть сохранены файлы.

source: All that will be stored in your database is a path to the file (relative to :setting:`MEDIA_ROOT`). You'll most likely want to use the convenience :attr:`~django.db.models.fields.files.FieldFile.url` attribute provided by Django. For example, if your :class:`ImageField` is called ``mug_shot``, you can get the absolute path to your image in a template with ``{{ object.mug_shot.url }}``.
ru: Все, что будет сохранено в базе данных, это путь к файлу (относительно :setting:`MEDIA_ROOT`). Скорее всего вы будете использовать :attr:`~django.db.models.fields.files.FieldFile.url` предоставленную Django. Например, если :class:`ImageField` назван ``mug_shot``, вы можете получить URL к файлу в шаблоне используя ``{{ object.mug_shot.url }}``.

source: For example, say your :setting:`MEDIA_ROOT` is set to ``'/home/media'``, and :attr:`~FileField.upload_to` is set to ``'photos/%Y/%m/%d'``. The ``'%Y/%m/%d'`` part of :attr:`~FileField.upload_to` is :func:`~time.strftime` formatting; ``'%Y'`` is the four-digit year, ``'%m'`` is the two-digit month and ``'%d'`` is the two-digit day. If you upload a file on Jan. 15, 2007, it will be saved in the directory ``/home/media/photos/2007/01/15``.
ru: Например, :setting:`MEDIA_ROOT` равен ``'/home/media'``, и :attr:`~FileField.upload_to` равен ``'photos/%Y/%m/%d'``. ``'%Y/%m/%d'`` часть параметра :attr:`~FileField.upload_to` это форматирование :func:`~time.strftime`; ``'%Y'`` -- год из 4-х цифр, ``'%m'`` -- номер месяца из 2-х цифр и ``'%d'`` -- число месяца из 2-х цифр. Если вы загрузили файл 15 января 2007, он будет сохранен в каталоге ``/home/media/photos/2007/01/15``.

source: If you wanted to retrieve the uploaded file's on-disk filename, or the file's size, you could use the :attr:`~django.core.files.File.name` and :attr:`~django.core.files.File.size` attributes respectively; for more information on the available attributes and methods, see the :class:`~django.core.files.File` class reference and the :doc:`/topics/files` topic guide.
ru: Если вам нужны название файла или его размер, используйте атрибуты :attr:`~django.core.files.File.name` и :attr:`~django.core.files.File.size` соответственно; больше информации о доступных методах и атрибутах вы найдете в справке о :class:`~django.core.files.File` и разделе документации :doc:`/topics/files`.

source: The file is saved as part of saving the model in the database, so the actual file name used on disk cannot be relied on until after the model has been saved.
ru: Процесс сохранения файла -- часть процесса сохранения объекта, таким образом имя файла, сохраненного на диске, не будет доступно, пока объект не будет сохранен.

source: The uploaded file's relative URL can be obtained using the :attr:`~django.db.models.fields.files.FieldFile.url` attribute. Internally, this calls the :meth:`~django.core.files.storage.Storage.url` method of the underlying :class:`~django.core.files.storage.Storage` class.
ru: Чтобы получить URL к загруженному файлу, используйте атрибут :attr:`~django.db.models.fields.files.FieldFile.url`. При этом будет вызван метод :meth:`~django.core.files.storage.Storage.url` класса :class:`~django.core.files.storage.Storage`.

source: Note that whenever you deal with uploaded files, you should pay close attention to where you're uploading them and what type of files they are, to avoid security holes. *Validate all uploaded files* so that you're sure the files are what you think they are. For example, if you blindly let somebody upload files, without validation, to a directory that's within your Web server's document root, then somebody could upload a CGI or PHP script and execute that script by visiting its URL on your site. Don't allow that.
ru: Заметим, что при загрузке файлов, вы должны обращать внимание, куда вы загружаете файлы и какие типы файлов загружаются, чтобы предотвратить возможные уязвимости в защите системы. *Проверяйте все загружаемые файлы*. Например, если вы разрешите загрузить файл без проверки в каталог, который обрабатывается сервером, кто-нибудь сможет загрузить CGI или PHP скрипт и выполнить его, посетив его URL на вашем сайте. Не допускайте это.

source: Also note that even an uploaded HTML file, since it can be executed by the browser (though not by the server), can pose security threats that are equivalent to XSS or CSRF attacks.
ru: Также заметим что это относится и к HTML файлам, так как они могу быть выполнены в браузере(хоть и не на сервере), и нести угрозу XSS или CSRF атаки.

source: :class:`FileField` instances are created in your database as ``varchar`` columns with a default max length of 100 characters. As with other fields, you can change the maximum length using the :attr:`~CharField.max_length` argument.
ru: По-умолчанию, экземпляр :class:`FileField` создается как колонка ``varchar`` в базе данных. Как и с другими полями, вы можете изменить максимальную длину, используя аргумент :attr:`~CharField.max_length`.

source: A read-only property to access the file's relative URL by calling the :meth:`~django.core.files.storage.Storage.url` method of the underlying :class:`~django.core.files.storage.Storage` class.
ru: read-only свойство для получения URL вызовом метода :meth:`~django.core.files.storage.Storage.url` класса :class:`~django.core.files.storage.Storage`.

source: Behaves like the standard Python ``file.close()`` method and closes the file associated with this instance.
ru: Работает так же как и метод ``file.close()`` в Python и закрывает файл связанный с объектом.

source: This method takes a filename and file contents and passes them to the storage class for the field, then associates the stored file with the model field. If you want to manually associate file data with :class:`~django.db.models.FileField` instances on your model, the ``save()`` method is used to persist that file data.
ru: Этот метод принимает имя файла и содержимое и передает его в экземпляр класса "storage" этого поля, потом добавляет файл в модель. Если вы хотите самостоятельно добавить содержимое файла в поле :class:`~django.db.models.FileField` вашей модели, метод ``save()`` то, что вам нужно.

source: Takes two required arguments: ``name`` which is the name of the file, and ``content`` which is an object containing the file's contents. The optional ``save`` argument controls whether or not the model instance is saved after the file associated with this field has been altered. Defaults to ``True``.
ru: Принимает два аргумента: ``name`` -- название файла, и ``content`` -- содержимое файла. Дополнительный аргумент ``save`` указывает сохранять ли объект после изменения поля. По-умолчанию ``True``.

source: Note that the ``content`` argument should be an instance of :class:`django.core.files.File`, not Python's built-in file object. You can construct a :class:`~django.core.files.File` from an existing Python file object like this::
ru: Заметим, что аргумент ``content`` должен быть экземпляром :class:`django.core.files.File`, а не встроенный объект файла в Python. Вы можете создать объект :class:`~django.core.files.File` из существующего объекта файла Python::

source: Or you can construct one from a Python string like this::
ru: Или же создать из строки с содержимым файла::

source: For more information, see :doc:`/topics/files`.
ru: Подробности в :doc:`/topics/files`.

source: Deletes the file associated with this instance and clears all attributes on the field. Note: This method will close the file if it happens to be open when ``delete()`` is called.
ru: Удаляет файл связанный с объектом и очищает все атрибуты поля. Заметка: этот метод закрывает файл, если он был открыт во время вызова ``delete()``.

source: The optional ``save`` argument controls whether or not the model instance is saved after the file associated with this field has been deleted. Defaults to ``True``.
ru: Дополнительный аргумент ``save`` указывает сохранять ли модель после удаления файла. По-умолчанию ``True``.

source: Note that when a model is deleted, related files are not deleted. If you need to cleanup orphaned files, you'll need to handle it yourself (for instance, with a custom management command that can be run manually or scheduled to run periodically via e.g. cron).
ru: Обратите внимание, когда объект модели удаляется, связанные файлы не удаляются. Если вам необходимо удалять их, делайте это самостоятельно (например, используя команду, запущенную через cron).

source: A :class:`CharField` whose choices are limited to the filenames in a certain directory on the filesystem. Has three special arguments, of which the first is **required**:
ru: Поле :class:`CharField` значение которого ограничено именем файла из определенного каталога. Принимает три дополнительных аргумента, первый из них **обязателен**:

source: Required. The absolute filesystem path to a directory from which this :class:`FilePathField` should get its choices. Example: ``"/home/images"``.
ru: Обязательно. Абсолютный путь к каталогу, из которого :class:`FilePathField` принимает значение. Например: ``"/home/images"``.

source: Optional. A regular expression, as a string, that :class:`FilePathField` will use to filter filenames. Note that the regex will be applied to the base filename, not the full path. Example: ``"foo.*\.txt$"``, which will match a file called ``foo23.txt`` but not ``bar.txt`` or ``foo23.png``.
ru: Необязательный. Регулярное выражение как строка, которое :class:`FilePathField` использует как фильтр названий. Регулярное выражение применяется к названию файла, а не к полному пути. Например: ``"foo.*\.txt$"``, соответствует ``foo23.txt`` но отфильтрует ``bar.txt`` или ``foo23.gif``.

source: Optional. Either ``True`` or ``False``. Default is ``False``. Specifies whether all subdirectories of :attr:`~FilePathField.path` should be included
ru: Необязательный. Принимает ``True`` или ``False``. По-умолчанию ``False``. Определяет, должны ли быть включены подкаталоги :attr:`~FilePathField.path`.

source: Optional. Either ``True`` or ``False``. Default is ``True``. Specifies whether files in the specified location should be included. Either this or :attr:`~FilePathField.allow_folders` must be ``True``.
ru: Необязательный. Принимает ``True`` или ``False``. По-умолчанию ``True``. Определяет, должны ли быть включены указанные подкаталоги. Этот параметр или :attr:`~FilePathField.allow_folders` должен быть ``True``.

source: Optional. Either ``True`` or ``False``. Default is ``False``. Specifies whether folders in the specified location should be included. Either this or :attr:`~FilePathField.allow_files` must be ``True``.
ru: Необязательный. Принимает ``True`` или ``False``. По-умолчанию ``False``. Определяет, должны ли быть включены указанные подкаталоги. Этот параметр или :attr:`~FilePathField.allow_files` должен быть ``True``.

source: Of course, these arguments can be used together.
ru: Конечно же можно использовать все аргумента вместе.

source: The one potential gotcha is that :attr:`~FilePathField.match` applies to the base filename, not the full path. So, this example::
ru: Следует помнить, что :attr:`~FilePathField.match` применяется к имени файла, а не абсолютному пути. Таким образом::

source: ...will match ``/home/images/foo.png`` but not ``/home/images/foo/bar.png`` because the :attr:`~FilePathField.match` applies to the base filename (``foo.png`` and ``bar.png``).
ru: ...распознает ``/home/images/foo.png``, но не ``/home/images/foo/bar.png``, т.к. :attr:`~FilePathField.match` применяется к имени файла (``foo.png`` и ``bar.png``).

source: :class:`FilePathField` instances are created in your database as ``varchar`` columns with a default max length of 100 characters. As with other fields, you can change the maximum length using the :attr:`~CharField.max_length` argument.
ru: По-умолчанию, экземпляр :class:`FilePathField` создается как колонка ``varchar`` в базе данных с максимальной длинной по умолчанию 100 символов. Как и с другими полями, вы можете изменить максимальную длину, используя аргумент :attr:`~CharField.max_length`.

source: A floating-point number represented in Python by a ``float`` instance.
ru: Число с плавающей точкой представленное объектом ``float``.

source: ``FloatField`` vs. ``DecimalField``
ru: ``FloatField`` или ``DecimalField``
