Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/ref/models/fields.po
Languages: ru

source: Setting it to ``False`` does not mean you can reference a swappable model even if it is swapped out - ``False`` just means that the migrations made with this ForeignKey will always reference the exact model you specify (so it will fail hard if the user tries to run with a User model you don't support, for example).
ru: Указав ``False``, вы не сможете ссылаться на подменяемую модель даже после того, как её подменили. ``False`` означает, что миграция, содержащая этот ``ForeignKey``, будет указывать на конкретную модель, которую вы укажите (и пользователь вашего приложения получит ошибку, если попытается выполнить с моделью ``User``, которую вы не поддерживаете, например).

source: If in doubt, leave it to its default of ``True``.
ru: Если вы не уверены какое значение выбрать, используйте значение по умолчанию ``True``.

source: A many-to-many relationship. Requires a positional argument: the class to which the model is related, which works exactly the same as it does for :class:`ForeignKey`, including :ref:`recursive <recursive-relationships>` and :ref:`lazy <lazy-relationships>` relationships.
ru: Связь многие-ко-многим. Принимает позиционный аргумент: класс связанной модели. Работает так же как и :class:`ForeignKey`, включая :ref:`рекурсивную <recursive-relationships>` и :ref:`ленивую <lazy-relationships>` связь.

source: Related objects can be added, removed, or created with the field's :class:`~django.db.models.fields.related.RelatedManager`.
ru: Связанные объекты могут быть добавлены, удалены или созданы с помощью :class:`~django.db.models.fields.related.RelatedManager`.

source: Behind the scenes, Django creates an intermediary join table to represent the many-to-many relationship. By default, this table name is generated using the name of the many-to-many field and the name of the table for the model that contains it. Since some databases don't support table names above a certain length, these table names will be automatically truncated to 64 characters and a uniqueness hash will be used. This means you might see table names like ``author_books_9cdf4``; this is perfectly normal. You can manually provide the name of the join table using the :attr:`~ManyToManyField.db_table` option.
ru: Django самостоятельно создаст промежуточную таблицу для хранения связи многое-ко-многим. По-умолчанию, название этой таблицы создается из названия поля и связанной модели. Так как некоторые базы данных не поддерживают длинные названия таблиц, оно будет обрезано до 64 символов и будет добавлен уникальный хеш. Это означает что вы можете увидеть такие названия таблиц ``author_books_9cdf4``; это нормально. Вы можете указать название промежуточной таблицы, используя параметр :attr:`~ManyToManyField.db_table`.

source: :class:`ManyToManyField` accepts an extra set of arguments -- all optional -- that control how the relationship functions.
ru: :class:`ManyToManyField` принимает дополнительные аргументы -- все не обязательны -- которые определяют как должна работать связь.

source: Same as :attr:`ForeignKey.related_name`.
ru: Аналогично :attr:`ForeignKey.related_name`.

source: Same as :attr:`ForeignKey.related_query_name`.
ru: Аналогично :attr:`ForeignKey.related_query_name`.

source: Same as :attr:`ForeignKey.limit_choices_to`.
ru: Аналогично :attr:`ForeignKey.limit_choices_to`.

source: ``limit_choices_to`` has no effect when used on a ``ManyToManyField`` with a custom intermediate table specified using the :attr:`~ManyToManyField.through` parameter.
ru: ``limit_choices_to``не работает для ``ManyToManyField`` переопределенной через :attr:`~ManyToManyField.through` промежуточной моделью.

source: Only used in the definition of ManyToManyFields on self. Consider the following model::
ru: Используется только при рекурсивной связи. Например, есть модель::

source: When Django processes this model, it identifies that it has a :class:`ManyToManyField` on itself, and as a result, it doesn't add a ``person_set`` attribute to the ``Person`` class. Instead, the :class:`ManyToManyField` is assumed to be symmetrical -- that is, if I am your friend, then you are my friend.
ru: Загружая эту модель Django определяет, что она содержит :class:`ManyToManyField` указывающее на себя, и не добавляет атрибут ``person_set`` классу модели ``Person``. Вместо этого подразумевается, что :class:`ManyToManyField`симметрично -- то есть, если я твой друг, то и ты мне друг.

source: If you do not want symmetry in many-to-many relationships with ``self``, set :attr:`~ManyToManyField.symmetrical` to ``False``. This will force Django to add the descriptor for the reverse relationship, allowing :class:`ManyToManyField` relationships to be non-symmetrical.
ru: Если вам не нужна симметричность для связи многое-ко-многим к ``self``, установите :attr:`~ManyToManyField.symmetrical` в ``False``. Это заставит Django добавить дескриптор для обратной связи, позволяя :class:`ManyToManyField` быть не симметричным.

source: Django will automatically generate a table to manage many-to-many relationships. However, if you want to manually specify the intermediary table, you can use the :attr:`~ManyToManyField.through` option to specify the Django model that represents the intermediate table that you want to use.
ru: Django автоматически создает промежуточную таблицу для хранения связи. Однако, если вы хотите самостоятельно определить промежуточную таблицу, используйте параметр :attr:`~ManyToManyField.through` указав модель Django, которая будет хранить связь между моделями.

source: The most common use for this option is when you want to associate :ref:`extra data with a many-to-many relationship <intermediary-manytomany>`.
ru: Обычно используют для :ref:`хранения дополнительных данных <intermediary-manytomany>`.

source: If you don't specify an explicit ``through`` model, there is still an implicit ``through`` model class you can use to directly access the table created to hold the association. It has three fields to link the models.
ru: Если вы не указали ``through`` модель, вы все равно может обратиться к неявно промежуточной модели, которая была автоматически создана. Она содержит три поля, связывающие модели.

source: If the source and target models differ, the following fields are generated:
ru: Если связанные модели разные, создаются следующие поля:

source: ``id``: the primary key of the relation.
ru: ``id``: первичный ключ для связи.

source: ``<containing_model>_id``: the ``id`` of the model that declares the ``ManyToManyField``.
ru: ``<containing_model>_id``: ``id`` модели, которая содержит поле ``ManyToManyField``.

source: ``<other_model>_id``: the ``id`` of the model that the ``ManyToManyField`` points to.
ru: ``<other_model>_id``: ``id`` модели, на которую ссылается ``ManyToManyField``.

source: If the ``ManyToManyField`` points from and to the same model, the following fields are generated:
ru: Если ``ManyToManyField`` ссылается на одну и ту же модель, будут созданы поля:

source: ``from_<model>_id``: the ``id`` of the instance which points at the model (i.e. the source instance).
ru: ``from_<model>_id``: ``id`` объекта основной модели (исходный объект).

source: ``to_<model>_id``: the ``id`` of the instance to which the relationship points (i.e. the target model instance).
ru: ``to_<model>_id``: ``id`` объекта, на который указывает связь (целевой объект).

source: This class can be used to query associated records for a given model instance like a normal model.
ru: Этот класс может использоваться для получения связей.

source: Only used when a custom intermediary model is specified. Django will normally determine which fields of the intermediary model to use in order to establish a many-to-many relationship automatically. However, consider the following models::
ru: Используется, если явно указана промежуточная модель для связи многое-ко-многим. Обычно Django самостоятельно определяется какие поля использовать для создания связи. Однако, возьмем такой пример::

source: ``Membership`` has *two* foreign keys to ``Person`` (``person`` and ``inviter``), which makes the relationship ambiguous and Django can't know which one to use. In this case, you must explicitly specify which foreign keys Django should use using ``through_fields``, as in the example above.
ru: ``Membership`` содержит *два* внешних ключа на ``Person`` (``person`` и ``inviter``). В таком случае Django не знает какой ключ использовать для создания связи. В таком случае необходимо явно указать Django, какой внешний ключ правильный, используя параметр ``through_fields``, как в примере выше.

source: ``through_fields`` accepts a 2-tuple ``('field1', 'field2')``, where ``field1`` is the name of the foreign key to the model the :class:`ManyToManyField` is defined on (``group`` in this case), and ``field2`` the name of the foreign key to the target model (``person`` in this case).
ru: ``through_fields`` принимает двух-элементный кортеж ``('field1', 'field2')``, где ``field1`` -- название внешнего ключа, который ссылается на модель, которая содержит :class:`ManyToManyField` (в нашем примере ``group``), а ``field2`` -- внешний ключ, который ссылается на целевую модель (в нашем примере ``person``).

source: When you have more than one foreign key on an intermediary model to any (or even both) of the models participating in a many-to-many relationship, you *must* specify ``through_fields``. This also applies to :ref:`recursive relationships <recursive-relationships>` when an intermediary model is used and there are more than two foreign keys to the model, or you want to explicitly specify which two Django should use.
ru: Если промежуточная модель содержит несколько внешний ключей на одну из моделей связи (или обе модели), вы *должны* указать ``through_fields``. Это также относится и к :ref:`рекурсивной связи <recursive-relationships>`, если используется своя промежуточная модель, в которой больше двух связей на модель, или вы хотите явно указать Django, какие внешние ключи использовать.

source: Recursive relationships using an intermediary model are always defined as non-symmetrical -- that is, with :attr:`symmetrical=False <ManyToManyField.symmetrical>` -- therefore, there is the concept of a "source" and a "target". In that case ``'field1'`` will be treated as the "source" of the relationship and ``'field2'`` as the "target".
ru: Рекурсивные связи, использующие промежуточную модель, всегда считаются несимметричными -- то есть с :attr:`symmetrical=False <ManyToManyField.symmetrical>` -- поэтому существуют понятия "источник" и "цель" связи. В этом случае ``'field1'`` будет "источником" связи, а ``'field2'`` -- "целью".

source: The name of the table to create for storing the many-to-many data. If this is not provided, Django will assume a default name based upon the names of: the table for the model defining the relationship and the name of the field itself.
ru: Имя промежуточной таблицы для хранения связей многое-ко-многим. Если не указан, Django самостоятельно создаст название по умолчанию используя название таблицы определяющей связь и название поля.

source: Controls whether or not constraints should be created in the database for the foreign keys in the intermediary table. The default is ``True``, and that's almost certainly what you want; setting this to ``False`` can be very bad for data integrity. That said, here are some scenarios where you might want to do this:
ru: Указывает создавать ли "constraint" для внешних ключей в промежуточной таблице в базе данных. По умолчанию ``True`` и в большинстве случает это то, что вам нужно. Указав ``False`` вы рискуете целостностью данных. Некоторые ситуации, когда вам может быть это необходимо:

source: It is an error to pass both ``db_constraint`` and ``through``.
ru: Нельзя указать ``db_constraint`` и ``through`` одновременно.

source: Controls the migration framework's reaction if this :class:`ManyToManyField` is pointing at a swappable model. If it is ``True`` - the default - then if the :class:`ManyToManyField` is pointing at a model which matches the current value of ``settings.AUTH_USER_MODEL`` (or another swappable model setting) the relationship will be stored in the migration using a reference to the setting, not to the model directly.
ru: Управляет поведением миграций, если :class:`ManyToManyField` ссылается на подменяемую(swappable) модель. При ``True`` - значение по умолчанию - если :class:`ManyToManyField` ссылается на модель, указанную через ``settings.AUTH_USER_MODEL`` (или другую настройку, определяющую какую модель использовать), связь в миграции будет использовать настройку, а не саму модель.

source: :class:`ManyToManyField` does not support :attr:`~Field.validators`.
ru: :class:`ManyToManyField` не поддерживает :attr:`~Field.validators`.

source: :attr:`~Field.null` has no effect since there is no way to require a relationship at the database level.
ru: :attr:`~Field.null` не влияет на работу поля т.к. нет способа сделать связь обязательной на уровне базы данных.

source: A one-to-one relationship. Conceptually, this is similar to a :class:`ForeignKey` with :attr:`unique=True <Field.unique>`, but the "reverse" side of the relation will directly return a single object.
ru: Связь один-к-одному. Работает так же, как и :class:`ForeignKey` с :attr:`unique=True <Field.unique>`, но "обратная" связь возвращает один объект.

source: This is most useful as the primary key of a model which "extends" another model in some way; :ref:`multi-table-inheritance` is implemented by adding an implicit one-to-one relation from the child model to the parent model, for example.
ru: В основном применяется как первичный ключ модели, которая "расширяет" другую модель. Например, :ref:`multi-table-inheritance` работает через неявное добавление связи один-к-одному от дочерней модели к родительской.

source: One positional argument is required: the class to which the model will be related. This works exactly the same as it does for :class:`ForeignKey`, including all the options regarding :ref:`recursive <recursive-relationships>` and :ref:`lazy <lazy-relationships>` relationships.
ru: Принимает обязательный позиционный аргумент: класс связанной модели. Работает так же как и :class:`ForeignKey`, включая :ref:`рекурсивную <recursive-relationships>` и :ref:`"ленивую" <lazy-relationships>` связь.

source: If you do not specify the :attr:`~ForeignKey.related_name` argument for the ``OneToOneField``, Django will use the lower-case name of the current model as default value.
ru: Если вы не указали :attr:`~ForeignKey.related_name` для ``OneToOneField``, Django будет использовать название модели в нижнем регистре.

source: With the following example::
ru: В примере ниже::

source: your resulting ``User`` model will have the following attributes::
ru: модель ``User`` будет содержать следующие атрибуты::

source: A ``DoesNotExist`` exception is raised when accessing the reverse relationship if an entry in the related table doesn't exist. For example, if a user doesn't have a supervisor designated by ``MySpecialUser``::
ru: При получении связанного объекта через обратную связь, если такой объект не существует, будет вызвано исключение ``DoesNotExist``. Например, если пользователь не имеет соответствующего экземпляра в ``MySpecialUser``::

source: Additionally, ``OneToOneField`` accepts all of the extra arguments accepted by :class:`ForeignKey`, plus one extra argument:
ru: Также ``OneToOneField`` принимает все дополнительные параметры принимаемые :class:`ForeignKey`, и еще один дополнительный:

source: When ``True`` and used in a model which inherits from another :term:`concrete model`, indicates that this field should be used as the link back to the parent class, rather than the extra ``OneToOneField`` which would normally be implicitly created by subclassing.
ru: При ``True`` и связанной модели, которая наследуется от другой модели, определяет, что должна сохраняться связь на родительскую модель, а не поле ``OneToOneField`` дочерней модели, которое используется для организации наследования моделей.

source: See :doc:`One-to-one relationships </topics/db/examples/one_to_one>` for usage examples of ``OneToOneField``.
ru: Смотрите примеров использования ``OneToOneField`` в :doc:`Связь один к одному </topics/db/examples/one_to_one>`.

source: Field API reference
ru: Справочник по полям модели

source: A field is thus a fundamental piece in different Django APIs, notably, :class:`models <django.db.models.Model>` and :class:`querysets <django.db.models.query.QuerySet>`.
ru: Таким образом поле является фундаментальной частью различных API Django, в частности, :class:`models <django.db.models.Model>` и :class:`querysets <django.db.models.query.QuerySet>`.

source: In models, a field is instantiated as a class attribute and represents a particular table column, see :doc:`/topics/db/models`. It has attributes such as :attr:`null` and :attr:`unique`, and methods that Django uses to map the field value to database-specific values.
ru: В модели экземпляр поля добавляется как атрибут класса и представляет определенное поле таблицы, смотрите :doc:`/topics/db/models`. Оно содержит атрибуты, такие как :attr:`null` и :attr:`unique`, и методы, которые Django используется для преобразования значения поля в значение в базе данных.

source: A ``Field`` is a subclass of :class:`~django.db.models.lookups.RegisterLookupMixin` and thus both :class:`~django.db.models.Transform` and :class:`~django.db.models.Lookup` can be registered on it to be used in ``QuerySet``\s (e.g. ``field_name__exact="foo"``). All :ref:`built-in lookups <field-lookups>` are registered by default.
ru: ``Field`` -- дочерний класс :class:`~django.db.models.lookups.RegisterLookupMixin`, что позволяет регистрировать :class:`~django.db.models.Transform` и :class:`~django.db.models.Lookup`, чтобы использовать в ``QuerySet`` (например, ``field_name__exact="foo"``). Все :ref:`встроенные фильтры <field-lookups>` зарегистрированы по умолчанию.

source: All of Django's built-in fields, such as :class:`CharField`, are particular implementations of ``Field``. If you need a custom field, you can either subclass any of the built-in fields or write a ``Field`` from scratch. In either case, see :doc:`/howto/custom-model-fields`.
ru: Все встроенные поля Django, например :class:`CharField`, наследуются от ``Field``. Если вы хотите создать свое поле, можно унаследоваться от любого встроенного поля, или от ``Field``. Подробности смотрите в :doc:`/howto/custom-model-fields`.

source: A verbose description of the field, e.g. for the :mod:`django.contrib.admindocs` application.
ru: Читабельное описание поля, например, для приложения :mod:`django.contrib.admindocs`.

source: The description can be of the form::
ru: Может использовать форматирование::

source: where the arguments are interpolated from the field's ``__dict__``.
ru: Аргументы будут подставляется из значений ``__dict__`` поля.

source: Returns a string naming this field for backend specific purposes. By default, it returns the class name.
ru: Возвращает текстовое название типа поля для использования в бэкендах баз данных. По умолчанию возвращает название класса.

source: See :ref:`emulating-built-in-field-types` for usage in custom fields.
ru: Смотрите :ref:`emulating-built-in-field-types`, как использовать в собственных полях модели.

source: Returns the database column data type for the :class:`Field`, taking into account the ``connection``.
ru: Возвращает тип поля в базе данных :class:`Field`, учитывая ``connection``.

source: See :ref:`custom-database-types` for usage in custom fields.
ru: Смотрите :ref:`custom-database-types`, как использовать в собственных полях модели.

source: There are three main situations where Django needs to interact with the database backend and fields:
ru: Существует три основных ситуации, когда Django используется преобразование типа поля:

source: when it queries the database (Python value -> database backend value)
ru: при запросе как базе данных (значение Python -> значение бэкенда базы данных)

source: when it loads data from the database (database backend value -> Python value)
ru: при загрузке данных из базы данных (значение бэкенда базы данных -> значение Python)

source: when it saves to the database (Python value -> database backend value)
ru: при сохранении в базу данных (значение Python -> значение бэкенда базы данных)

source: When querying, :meth:`get_db_prep_value` and :meth:`get_prep_value` are used:
ru: При запросе используются методы :meth:`get_db_prep_value` и :meth:`get_prep_value`:

source: ``value`` is the current value of the model's attribute, and the method should return data in a format that has been prepared for use as a parameter in a query.
ru: ``value`` -- значение атрибута поля модели. Метод должен вернуть значение, которое можно использовать как параметр в запросе.

source: See :ref:`converting-python-objects-to-query-values` for usage.
ru: Смотрите :ref:`converting-python-objects-to-query-values`.

source: Converts ``value`` to a backend-specific value. By default it returns ``value`` if ``prepared=True`` and :meth:`~Field.get_prep_value` if is ``False``.
ru: Преобразует ``value`` в значение для бэкенда базы данных. По умолчанию возвращает ``value``, если ``prepared=True``, иначе -- результат :meth:`~Field.get_prep_value`.

source: See :ref:`converting-query-values-to-database-values` for usage.
ru: Смотрите :ref:`converting-query-values-to-database-values`.

source: When loading data, :meth:`from_db_value` is used:
ru: При загрузке данных используется :meth:`from_db_value`:

source: Converts a value as returned by the database to a Python object. It is the reverse of :meth:`get_prep_value`.
ru: Преобразует значение из базы данных в объект Python. Метод обратный :meth:`get_prep_value`.

source: This method is not used for most built-in fields as the database backend already returns the correct Python type, or the backend itself does the conversion.
ru: Для большинства встроенных полей этот метод не используется т.к. бэкенд базы данных возвращает уже правильный объект Python, или же бэкенд сам выполняет необходимые преобразования.

source: See :ref:`converting-values-to-python-objects` for usage.
ru: Смотрите :ref:`converting-values-to-python-objects`.

source: For performance reasons, ``from_db_value`` is not implemented as a no-op on fields which do not require it (all Django fields). Consequently you may not call ``super`` in your definition.
ru: Для повышения производительности поля, которые не используют ``from_db_value``, не содержат пустую реализацию этого метода (все поля Django). По этому нет необходимости вызывать ``super`` в вашем методе.

source: When saving, :meth:`pre_save` and :meth:`get_db_prep_save` are used:
ru: При сохранении используются методы :meth:`pre_save` и :meth:`get_db_prep_save`:

source: Same as the :meth:`get_db_prep_value`, but called when the field value must be *saved* to the database. By default returns :meth:`get_db_prep_value`.
ru: Аналогичен :meth:`get_db_prep_value`, но используется при *сохранении* значения в базу данных. По умолчанию возвращает результат :meth:`get_db_prep_value`.

source: Method called prior to :meth:`get_db_prep_save` to prepare the value before being saved (e.g. for :attr:`DateField.auto_now`).
ru: Метод вызывается перед :meth:`get_db_prep_save`, чтобы подготовить значение перед сохранением (например, при :attr:`DateField.auto_now`).

source: ``model_instance`` is the instance this field belongs to and ``add`` is whether the instance is being saved to the database for the first time.
ru: ``model_instance`` -- объект модели, к которому принадлежит поле, ``add`` -- указывает сохраняется ли объект первый раз в базу данных.
