Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/ref/models/fields.po
Languages: ru

source: Model field reference
ru: Справочник по полям модели

source: This document contains all the API references of :class:`Field` including the `field options`_ and `field types`_ Django offers.
ru: Этот раздел содержит все существующие подробности о всех :ref:`параметрах поля <common-model-field-options>` и :ref:`типах полей <model-field-types>` в Django.

source: Also, you can easily :doc:`write your own custom model fields </howto/custom-model-fields>`.
ru: Также вы можете легко :doc:`создать собственное поле для модели </howto/custom-model-fields>`.

source: Technically, these models are defined in :mod:`django.db.models.fields`, but for convenience they're imported into :mod:`django.db.models`; the standard convention is to use ``from django.db import models`` and refer to fields as ``models.<Foo>Field``.
ru: Технически, эти поля определенны в :mod:`django.db.models.fields`, но для удобства они импортированы в :mod:`django.db.models`; по неписанному соглашению принято использовать ``from django.db import models`` и обращаться к полям, как ``models.<Foo>Field``.

source: Field options
ru: Параметры поля

source: The following arguments are available to all field types. All are optional.
ru: Приведенные аргументы доступны для всех полей. Все они не обязательны.

source: If ``True``, Django will store empty values as ``NULL`` in the database. Default is ``False``.
ru: При ``True`` Django сохранит пустое значение как ``NULL`` в базе данных. Значение по умолчанию -- ``False``.

source: For both string-based and non-string-based fields, you will also need to set ``blank=True`` if you wish to permit empty values in forms, as the :attr:`~Field.null` parameter only affects database storage (see :attr:`~Field.blank`).
ru: Для всех типов полей, вы также должны указать ``blank=True`` если вы хотите разрешить пустые значения в формах, т.к. параметр :attr:`~Field.null` влияет только на сохранение в базе данных (смотрите :attr:`~Field.blank`).

source: When using the Oracle database backend, the value ``NULL`` will be stored to denote the empty string regardless of this attribute.
ru: При использовании Oracle, ``NULL`` будет использоваться для пустой строки независимо от значения этого параметра.

source: If you want to accept :attr:`~Field.null` values with :class:`BooleanField`, use :class:`NullBooleanField` instead.
ru: Если хотите использовать :attr:`~Field.null` для :class:`BooleanField`, используйте :class:`NullBooleanField` вместо этого.

source: If ``True``, the field is allowed to be blank. Default is ``False``.
ru: При ``True`` поле может быть пустым. Значение по умолчанию -- ``False``.

source: Note that this is different than :attr:`~Field.null`. :attr:`~Field.null` is purely database-related, whereas :attr:`~Field.blank` is validation-related. If a field has ``blank=True``, form validation will allow entry of an empty value. If a field has ``blank=False``, the field will be required.
ru: Заметим что этот параметр отличается от :attr:`~Field.null`. :attr:`~Field.null` указывается для базы данных, в то время как :attr:`~Field.blank` -- для проверки данных. При ``blank=True``, проверка данных в форме позволит сохранять пустое значение в поле. При ``blank=False`` поле будет обязательным.

source: An iterable (e.g., a list or tuple) consisting itself of iterables of exactly two items (e.g. ``[(A, B), (A, B) ...]``) to use as choices for this field. If this is given, the default form widget will be a select box with these choices instead of the standard text field.
ru: Итератор (например, список или кортеж) двухэлементных кортежей(например, ``[(A, B), (A, B) ...]``), который будет использоваться как варианты значений для поля. Если этот параметр указан, в форме будет использоваться ``select`` для этого поля.

source: The first element in each tuple is the actual value to be set on the model, and the second element is the human-readable name. For example::
ru: Первый элемент каждого кортежа -- это значение, которое будет сохранено в базе данных. Второй элемент -- название, которое будет отображаться для пользователей. Например::

source: Generally, it's best to define choices inside a model class, and to define a suitably-named constant for each value::
ru: Значения лучше указать в константах внутри модели::

source: Though you can define a choices list outside of a model class and then refer to it, defining the choices and names for each choice inside the model class keeps all of that information with the class that uses it, and makes the choices easy to reference (e.g, ``Student.SOPHOMORE`` will work anywhere that the ``Student`` model has been imported).
ru: Можно указать список значений и не в модели, но так все данные будут связаны с моделью, и к значениям можно легко обратиться (например, ``Student.SOPHOMORE`` можно использовать импортировав модель ``Student``).

source: You can also collect your available choices into named groups that can be used for organizational purposes::
ru: Вы можете сгруппировать значения в именованные группы::

source: The first element in each tuple is the name to apply to the group. The second element is an iterable of 2-tuples, with each 2-tuple containing a value and a human-readable name for an option. Grouped options may be combined with ungrouped options within a single list (such as the `unknown` option in this example).
ru: Первый элемент каждого кортежа -- это название группы. Второй элемент -- итератор с двух-элементными кортежами содержащими значение и отображаемое название. Сгруппированные опции могут комбинироваться с не сгруппированными (как `unknown` в примере выше).

source: For each model field that has :attr:`~Field.choices` set, Django will add a method to retrieve the human-readable name for the field's current value. See :meth:`~django.db.models.Model.get_FOO_display` in the database API documentation.
ru: Для каждой модели с полем содержащим :attr:`~Field.choices`, Django добавляет метод для получения названия текущего значения поля. Смотрите :meth:`~django.db.models.Model.get_FOO_display` в документации про API для работы с базой данных.

source: Note that choices can be any iterable object -- not necessarily a list or tuple. This lets you construct choices dynamically. But if you find yourself hacking :attr:`~Field.choices` to be dynamic, you're probably better off using a proper database table with a :class:`ForeignKey`. :attr:`~Field.choices` is meant for static data that doesn't change much, if ever.
ru: Отметим что в качестве списка вариантов значений может быть любой итератор -- не обязательно список или кортеж. Это позволяет определять варианты значений динамически. Но, если вам необходимо использовать динамический :attr:`~Field.choices`, возможно вам следует использовать правильную структуру таблицы базы данных с :class:`ForeignKey`. :attr:`~Field.choices` предназначен для статических данных, которые почти или вообще не изменяются.

source: Unless :attr:`blank=False<Field.blank>` is set on the field along with a :attr:`~Field.default` then a label containing ``"---------"`` will be rendered with the select box. To override this behavior, add a tuple to ``choices`` containing ``None``; e.g. ``(None, 'Your String For Display')``. Alternatively, you can use an empty string instead of ``None`` where this makes sense - such as on a :class:`~django.db.models.CharField`.
ru: Если поле содержит :attr:`blank=False<Field.blank>`, но :attr:`~Field.default` не определен, в поле выбора будет добавлено значение с названием ``"---------"``. Чтобы это изменить, добавьте в ``choices`` элемент с ``None``, например, ``(None, 'Your String For Display')``. Также можно использовать пустую строку вместо ``None``, где это имеет смысл, например, для :class:`~django.db.models.CharField`.

source: The name of the database column to use for this field. If this isn't given, Django will use the field's name.
ru: Имя колонки в базе данных для хранения данных этого поля. Если этот параметр не указан, Django будет использовать название поля.

source: If your database column name is an SQL reserved word, or contains characters that aren't allowed in Python variable names -- notably, the hyphen -- that's OK. Django quotes column and table names behind the scenes.
ru: Если имя колонки это зарезервированное SQL слово, или содержит символы запрещенные в названиях переменной в Python -- в частности, дефис -- все нормально. Django автоматически экранирует название колонок и таблиц.

source: If ``True``, a database index will be created for this field.
ru: При ``True`` для поля будет создан индекс в базе данных.

source: The name of the :doc:`database tablespace </topics/db/tablespaces>` to use for this field's index, if this field is indexed. The default is the project's :setting:`DEFAULT_INDEX_TABLESPACE` setting, if set, or the :attr:`~Options.db_tablespace` of the model, if any. If the backend doesn't support tablespaces for indexes, this option is ignored.
ru: Имя :doc:`"tablespace" базы данных </topics/db/tablespaces>` используемое для индекса поля, если поле имеет индекс. По-умолчанию используется значение настройки :setting:`DEFAULT_INDEX_TABLESPACE` проекта, если оно указано, иначе :attr:`~Options.db_tablespace` модели. Если база данных не поддерживает "tablespace" для индексов, этот параметр будет проигнорирован.

source: The default value for the field. This can be a value or a callable object. If callable it will be called every time a new object is created.
ru: Значение по умолчанию для поля. Это может быть значение или вызываемый(callable) объект. Если это вызываемый объект, он будет вызван при создании нового объекта.

source: For fields like :class:`ForeignKey` that map to model instances, defaults should be the value of the field they reference (``pk`` unless :attr:`~ForeignKey.to_field` is set) instead of model instances.
ru: Для полей типа :class:`ForeignKey`, которые ссылаются на объекты модели, значением по умолчанию должно быть значение поля на которое они ссылаются (``pk``, если не указан :attr:`~ForeignKey.to_field`), а не объект модели.

source: The default value is used when new model instances are created and a value isn't provided for the field. When the field is a primary key, the default is also used when the field is set to ``None``.
ru: Значение по умолчанию используется, если был создан экземпляр модели, а значение для поля не было указано. Если поле является первичным ключом, значение по умолчанию также использует и при указании ``None``.

source: If ``False``, the field will not be displayed in the admin or any other :class:`~django.forms.ModelForm`. They are also skipped during :ref:`model validation <validating-objects>`. Default is ``True``.
ru: При ``False``, поле не будет отображаться в админке или любой другой :class:`~django.forms.ModelForm` для модели. Такие поля также пропускаются при :ref:`валидации модели <validating-objects>`. Значение по умолчанию -- ``True``.

source: The ``error_messages`` argument lets you override the default messages that the field will raise. Pass in a dictionary with keys matching the error messages you want to override.
ru: ``error_messages`` позволяет переопределить сообщения ошибок возвращаемых полем. Используйте словарь с ключами соответствующими необходимым ошибкам.

source: Error message keys include ``null``, ``blank``, ``invalid``, ``invalid_choice``, ``unique``, and ``unique_for_date``. Additional error message keys are specified for each field in the `Field types`_ section below.
ru: Ключи ошибок такие: ``null``, ``blank``, ``invalid``, ``invalid_choice``, ``unique`` и ``unique_for_date`. Дополнительные ошибки указаны для каждого :ref:`типа поля ниже<model-field-types>`.

source: Extra "help" text to be displayed with the form widget. It's useful for documentation even if your field isn't used on a form.
ru: Подсказка, отображаемая под полем в интерфейсе администратора. Это полезно для описания поля, даже если модель не используется в форме.

source: Note that this value is *not* HTML-escaped in automatically-generated forms. This lets you include HTML in :attr:`~Field.help_text` if you so desire. For example::
ru: Заметим, что, при отображении в форме, HTML-символы не экранируются. Это позволяет использовать HTML в :attr:`~Field.help_text` если вам необходимо. Например::

source: Alternatively you can use plain text and ``django.utils.html.escape()`` to escape any HTML special characters. Ensure that you escape any help text that may come from untrusted users to avoid a cross-site scripting attack.
ru: Также вы можете использовать обычный текст и ``django.utils.html.escape()``, чтобы экранировать HTML. Убедитесь, что вы экранируете все подсказки, которые могут определять непроверенные пользователи, чтобы избежать XSS атак.

source: If ``True``, this field is the primary key for the model.
ru: При ``True`` это поле будет первичным ключом.

source: If you don't specify ``primary_key=True`` for any field in your model, Django will automatically add an :class:`AutoField` to hold the primary key, so you don't need to set ``primary_key=True`` on any of your fields unless you want to override the default primary-key behavior. For more, see :ref:`automatic-primary-key-fields`.
ru: Если вы не укажите ``primary_key=True`` для какого-либо поля в модели, Django самостоятельно добавит :class:`AutoField` для хранения первичного ключа, вы не обязаны указывать ``primary_key=True``, если не хотите переопределить первичный ключ по умолчанию. Подробнее смотрите :ref:`automatic-primary-key-fields`.

source: ``primary_key=True`` implies :attr:`null=False <Field.null>` and :attr:`unique=True <Field.unique>`. Only one primary key is allowed on an object.
ru: ``primary_key=True`` подразумевает :attr:`null=False <Field.null>` и :attr:`unique=True <Field.unique>`. Модель может содержать только один первичный ключ.

source: The primary key field is read-only. If you change the value of the primary key on an existing object and then save it, a new object will be created alongside the old one.
ru: Первичный ключ доступен только для чтения. Если вы поменяете значение для существующего объекта и сохраните его, будет создан новый объект.

source: If ``True``, this field must be unique throughout the table.
ru: При ``True`` значение поля должно быть уникальным.

source: This is enforced at the database level and by model validation. If you try to save a model with a duplicate value in a :attr:`~Field.unique` field, a :exc:`django.db.IntegrityError` will be raised by the model's :meth:`~django.db.models.Model.save` method.
ru: Этот параметр учитывается при сохранении в базу данных и при проверке данных в модели. Если вы попытаетесь сохранить повторное значение в поле с :attr:`~Field.unique`, будет вызвана ошибка :exc:`django.db.IntegrityError` методом :meth:`~django.db.models.Model.save`.

source: Note that when ``unique`` is ``True``, you don't need to specify :attr:`~Field.db_index`, because ``unique`` implies the creation of an index.
ru: Заметим что, при ``unique`` равном ``True``, не нужно указывать :attr:`~Field.db_index`, т.к. ``unique`` создает индекс.

source: Set this to the name of a :class:`DateField` or :class:`DateTimeField` to require that this field be unique for the value of the date field.
ru: Этот параметр должен быть равен названию :class:`DateField` или :class:`DateTimeField` поля, для которого значение должно быть уникальным.

source: For example, if you have a field ``title`` that has ``unique_for_date="pub_date"``, then Django wouldn't allow the entry of two records with the same ``title`` and ``pub_date``.
ru: Например, если модель имеет поле ``title`` с ``unique_for_date="pub_date"``, тогда Django позволит сохранять записи только с уникальной комбинацией ``title`` и ``pub_date``.

source: Note that if you set this to point to a :class:`DateTimeField`, only the date portion of the field will be considered. Besides, when :setting:`USE_TZ` is ``True``, the check will be performed in the :ref:`current time zone <default-current-time-zone>` at the time the object gets saved.
ru: Если указать этот параметр для :class:`DateTimeField`, только дата значения будет учитываться. Но при :setting:`USE_TZ` равном ``True``, проверка будет выполнена в :ref:`текущем часовом поясе <default-current-time-zone>` во время сохранения объекта.

source: This is enforced by :meth:`Model.validate_unique()` during model validation but not at the database level. If any :attr:`~Field.unique_for_date` constraint involves fields that are not part of a :class:`~django.forms.ModelForm` (for example, if one of the fields is listed in ``exclude`` or has :attr:`editable=False<Field.editable>`), :meth:`Model.validate_unique()` will skip validation for that particular constraint.
ru: Проверка выполняется методом :meth:`Model.validate_unique()` во время валидации модели, не на уровне базы данных. Если :attr:`~Field.unique_for_date` содержит поля, которые не входят в :class:`~django.forms.ModelForm` (например, поле было указанно в ``exclude`` или содержит :attr:`editable=False<Field.editable>`), :meth:`Model.validate_unique()` не будет выполнять эту валидацию.

source: Like :attr:`~Field.unique_for_date`, but requires the field to be unique with respect to the month.
ru: Аналогично :attr:`~Field.unique_for_date`, но значение будет уникально для месяца.

source: Like :attr:`~Field.unique_for_date` and :attr:`~Field.unique_for_month`.
ru: Аналогично :attr:`~Field.unique_for_date` и :attr:`~Field.unique_for_month`.

source: A human-readable name for the field. If the verbose name isn't given, Django will automatically create it using the field's attribute name, converting underscores to spaces. See :ref:`Verbose field names <verbose-field-names>`.
ru: Отображаемое имя поля. Если параметр не указан, Django самостоятельно создаст его используя имя атрибута поля, заменяя подчеркивание на пробелы. Смотрите раздел про :ref:`отображаемые имена полей <verbose-field-names>`.

source: A list of validators to run for this field. See the :doc:`validators documentation </ref/validators>` for more information.
ru: Список проверок("валидаторов") выполняемых для этого поля. Смотрите :doc:`раздел о "валидаторах" </ref/validators>` для подробной информации.

source: Registering and fetching lookups
ru: Регистрация и загрузка операторов для фильтрации

source: ``Field`` implements the :ref:`lookup registration API <lookup-registration-api>`. The API can be used to customize which lookups are available for a field class, and how lookups are fetched from a field.
ru: ``Field`` предоставляет :ref:`API для регистрации своих операторов фильтрации <lookup-registration-api>`. Этот API позволяет добавить свои варианты фильтрации по полю.

source: Field types
ru: Типы полей

source: An :class:`IntegerField` that automatically increments according to available IDs. You usually won't need to use this directly; a primary key field will automatically be added to your model if you don't specify otherwise. See :ref:`automatic-primary-key-fields`.
ru: Автоинкрементное поле :class:`IntegerField`. Используется для хранения ID. Скорее всего вам не придется использовать это поле, первичный ключ будет автоматически добавлен к модели. Смотрите :ref:`automatic-primary-key-fields`.

source: Abusing ``BinaryField``
ru: Злоупотребление ``BinaryField``

source: Although you might think about storing files in the database, consider that it is bad design in 99% of the cases. This field is *not* a replacement for proper :doc:`static files </howto/static-files/index>` handling.
ru: Помните, хранение файлов в базе данных в 99% случаях - это плохой подход. Это поле *не* замена :doc:`статическим файлам </howto/static-files/index>`.

source: A true/false field.
ru: Поле хранящее значение true/false.

source: The default form widget for this field is a :class:`~django.forms.CheckboxInput`.
ru: Виджет по умолчанию для этого поля :class:`~django.forms.CheckboxInput`.

source: If you need to accept :attr:`~Field.null` values then use :class:`NullBooleanField` instead.
ru: Если вам нужен параметр :attr:`~Field.null`, используйте поле :class:`NullBooleanField`.

source: The default value of ``BooleanField`` is ``None`` when :attr:`Field.default` isn't defined.
ru: Значение по умолчанию для ``BooleanField`` ``None``, если :attr:`Field.default` не указан.

source: A string field, for small- to large-sized strings.
ru: Строковое поле для хранения коротких или длинных строк.

source: For large amounts of text, use :class:`~django.db.models.TextField`.
ru: Для большого количества текстовой информации используйте :class:`~django.db.models.TextField`.

source: The default form widget for this field is a :class:`~django.forms.TextInput`.
ru: Виджет по умолчанию для этого поля :class:`~django.forms.TextInput`.

source: :class:`CharField` has one extra required argument:
ru: :class:`CharField` принимает один дополнительный аргумент:

source: The maximum length (in characters) of the field. The max_length is enforced at the database level and in Django's validation.
ru: Максимальная длинна(в символах) этого поля. ``max_length`` используется для проверки данных на уровне базы данных и форм Django.

source: If you are writing an application that must be portable to multiple database backends, you should be aware that there are restrictions on ``max_length`` for some backends. Refer to the :doc:`database backend notes </ref/databases>` for details.
ru: Если вы создаете независимое приложение, которое должно работать на различных базах данных, помните что существуют некоторые ограничения использования ``max_length`` для некоторых типов баз данных. Смотрите раздел про :doc:`использование различных типов баз данных </ref/databases>`.

source: A field of integers separated by commas. As in :class:`CharField`, the :attr:`~CharField.max_length` argument is required and the note about database portability mentioned there should be heeded.
ru: Поле, содержащее целые числа разделенные запятыми. Как и в :class:`CharField`, необходим параметр :attr:`~CharField.max_length`. Упомянутые особенности работы с различными типами баз данных актуальны.

source: A date, represented in Python by a ``datetime.date`` instance. Has a few extra, optional arguments:
ru: Дата, представленная в виде объекта ``datetime.date`` Python. Принимает несколько дополнительных параметров:

source: Automatically set the field to now every time the object is saved. Useful for "last-modified" timestamps. Note that the current date is *always* used; it's not just a default value that you can override.
ru: Значение поля будет автоматически установлено в текущую дату при каждом сохранении объекта. Полезно для хранения времени последнего изменения. Заметим, что текущее время будет использовано *всегда*; это не просто значение по умолчанию, которое вы можете переопределить.

source: Automatically set the field to now when the object is first created. Useful for creation of timestamps. Note that the current date is *always* used; it's not just a default value that you can override. So even if you set a value for this field when creating the object, it will be ignored. If you want to be able to modify this field, set the following instead of ``auto_now_add=True``:
ru: Значение поля будет автоматически установлено в текущую дату при создании(первом сохранении) объекта. Полезно для хранения времени создания. Заметим, что текущее время будет использовано *всегда*; это не просто значение по-умолчанию, которое вы можете переопределить. По этому, даже если вы укажите значение для этого поля, оно будет проигнорировано. Если вы хотите изменять значения этого поля, используйте следующее вместо ``auto_now_add=True``:

source: For :class:`DateField`: ``default=date.today`` - from :meth:`datetime.date.today`
ru: Для :class:`DateField`: ``default=date.today`` - из :meth:`datetime.date.today`
