Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/ref/models/instances.po
Languages: ru

source: Model instance reference
ru: Объект модели

source: This document describes the details of the ``Model`` API. It builds on the material presented in the :doc:`model </topics/db/models>` and :doc:`database query </topics/db/queries>` guides, so you'll probably want to read and understand those documents before reading this one.
ru: Этот раздел описывает ``Model`` API. Изложенный материал опирается на материал, изложенный в разделах о :doc:`моделях </topics/db/models>` и :doc:`выполнении запросов </topics/db/queries>`, возможно вам следует прочитать их перед прочтением этого раздела.

source: Throughout this reference we'll use the :ref:`example Weblog models <queryset-model-example>` presented in the :doc:`database query guide </topics/db/queries>`.
ru: В примерах будут использованы :ref:` примеры моделей web-блога <queryset-model-example>` представленные в разделе о :doc:`выполнении запросов </topics/db/queries>`.

source: Creating objects
ru: Создание объектов

source: To create a new instance of a model, just instantiate it like any other Python class:
ru: Чтобы создать объект модели, просто создайте ее экземпляр как любого другого класса Python:

source: The keyword arguments are simply the names of the fields you've defined on your model. Note that instantiating a model in no way touches your database; for that, you need to :meth:`~Model.save()`.
ru: Именованные аргументы -- это названия полей определенных в модели. Создание экземпляра модели не выполняет никаких запросов к базе данных; для сохранения вызовите метод :meth:`~Model.save()`.

source: You may be tempted to customize the model by overriding the ``__init__`` method. If you do so, however, take care not to change the calling signature as any change may prevent the model instance from being saved. Rather than overriding ``__init__``, try using one of these approaches:
ru: Возможно, вам захочется переопределить метод ``__init__``. В таком случае не переопределяйте сигнатуру вызова этого метода, иначе объект модели может не сохраняться. Вместо переопределения ``__init__`` лучше используйте один из следующих подходов:

source: Add a classmethod on the model class::
ru: Добавить метод класса в модель::

source: Add a method on a custom manager (usually preferred)::
ru: Добавить метод в менеджер модели(лучший вариант)::

source: Customizing model loading
ru: Настройка загрузки модели

source: The ``from_db()`` method can be used to customize model instance creation when loading from the database.
ru: Метод ``from_db()`` позволяет настроить создания экземпляра модели при загрузке данных из базы данных.

source: In addition to creating the new model, the ``from_db()`` method must set the ``adding`` and ``db`` flags in the new instance's ``_state`` attribute.
ru: Кроме создания экземпляра модели метод ``from_db()`` должен установить флаги ``adding`` и ``db`` атрибута ``_state`` нового объекта модели.

source: Below is an example showing how to record the initial values of fields that are loaded from the database::
ru: В этом примере вы можете увидеть как сохранить начальные загруженные значений полей и проверять их при сохранении::

source: The example above shows a full ``from_db()`` implementation to clarify how that is done. In this case it would of course be possible to just use ``super()`` call in the ``from_db()`` method.
ru: Это оригинальная реализация метода ``from_db()``, чтобы показать как он работает. На самом деле мы бы могли просто вызвать родительский метод через ``super()``.

source: Refreshing objects from database
ru: Обновление объектов из базы данных

source: If you need to reload a model's values from the database, you can use the ``refresh_from_db()`` method. When this method is called without arguments the following is done:
ru: Если вам необходимо обновить значения модели из базы данных, вы можете использовать ``refresh_from_db()``. Если вызвать этот метод без аргументов, произойдет следующее:

source: All non-deferred fields of the model are updated to the values currently present in the database.
ru: Все загруженные поля модели будут обновлены значениями из базы данных.

source: The previously loaded related instances for which the relation's value is no longer valid are removed from the reloaded instance. For example, if you have a foreign key from the reloaded instance to another model with name ``Author``, then if ``obj.author_id != obj.author.id``, ``obj.author`` will be thrown away, and when next accessed it will be reloaded with the value of ``obj.author_id``.
ru: Если ранее загруженные внешние связи уже не верны, они будут удалены. Например, если объект содержит внешнюю связь на модель ``Author``, и ``obj.author_id != obj.author.id``, ``obj.author`` будет очищен и при следующем обращении будет загружен объект со значением ``obj.author_id``.

source: The reloading happens from the database the instance was loaded from, or from the default database if the instance wasn't loaded from the database. The ``using`` argument can be used to force the database used for reloading.
ru: Перезагрузка выполняется из базы данных, из которой объект был изначально загружен, или из базы данных по умолчанию, если база данных не была явно указана. Аргумент ``using`` позволяет явно указать базу данных.

source: It is possible to force the set of fields to be loaded by using the ``fields`` argument.
ru: Вы можете указать какие поля загружать с помощью аргумента ``fields``.

source: For example, to test that an ``update()`` call resulted in the expected update, you could write a test similar to this::
ru: Например, чтобы проверить вызов метода ``update()``, вы можете использовать следующий тест::

source: Note that when deferred fields are accessed, the loading of the deferred field's value happens through this method. Thus it is possible to customize the way deferred loading happens. The example below shows how one can reload all of the instance's fields when a deferred field is reloaded::
ru: Обратите внимание, при доступе к отложенным(deferred) полям они загружаются этим методом. Таким образом вы можете переопределить способ загрузки отложенных полей. В этом примере мы перегружаем все поля, если загружаются отложенные поля::

source: A helper method that returns a set containing the attribute names of all those fields that are currently deferred for this model.
ru: Возвращает список текущих отложенных полей для экземпляра модели.

source: Validating objects
ru: Проверка объектов

source: There are three steps involved in validating a model:
ru: Проверка объектов модели проходив в три этапа:

source: Validate the model fields - :meth:`Model.clean_fields()`
ru: Проверка полей модели - :meth:`Model.clean_fields()`

source: Validate the model as a whole - :meth:`Model.clean()`
ru: Проверка всего объекта - :meth:`Model.clean()`

source: Validate the field uniqueness - :meth:`Model.validate_unique()`
ru: Проверка уникальности полей - :meth:`Model.validate_unique()`

source: All three steps are performed when you call a model's :meth:`~Model.full_clean()` method.
ru: Все три этапа выполняются при вызове метода :meth:`~Model.full_clean()`.

source: When you use a :class:`~django.forms.ModelForm`, the call to :meth:`~django.forms.Form.is_valid()` will perform these validation steps for all the fields that are included on the form. See the :doc:`ModelForm documentation </topics/forms/modelforms>` for more information. You should only need to call a model's :meth:`~Model.full_clean()` method if you plan to handle validation errors yourself, or if you have excluded fields from the :class:`~django.forms.ModelForm` that require validation.
ru: При использовании :class:`~django.forms.ModelForm`, вызов :meth:`~django.forms.Form.is_valid()` выполняет проверку для всех полей, включенных в форму. Подробности смотрите :doc:`раздел о ModelForm </topics/forms/modelforms>`. Вы должны использовать метод :meth:`~Model.full_clean()` модели только если собираетесь самостоятельно обрабатывать ошибки валидности, или если :class:`~django.forms.ModelForm` не содержит поля, которые должны проверяться.

source: This method calls :meth:`Model.clean_fields()`, :meth:`Model.clean()`, and :meth:`Model.validate_unique()` (if ``validate_unique`` is ``True``), in that order and raises a :exc:`~django.core.exceptions.ValidationError` that has a ``message_dict`` attribute containing errors from all three stages.
ru: Этот метод вызывает :meth:`Model.clean_fields()`, :meth:`Model.clean()`, и :meth:`Model.validate_unique()`(если ``validate_unique`` равно ``True``) в указанном порядке и вызывает исключение :exc:`~django.core.exceptions.ValidationError`, которое содержит атрибут ``message_dict`` с ошибками всех трех этапов проверки.

source: The optional ``exclude`` argument can be used to provide a list of field names that can be excluded from validation and cleaning. :class:`~django.forms.ModelForm` uses this argument to exclude fields that aren't present on your form from being validated since any errors raised could not be corrected by the user.
ru: Необязательный аргумент ``exclude`` используется, чтобы исключить часть полей из проверки. :class:`~django.forms.ModelForm` использует этот аргумент для полей не включенных в форму, так как ошибки для этих полей не могут быть исправлены пользователем.

source: Note that ``full_clean()`` will *not* be called automatically when you call your model's :meth:`~Model.save()` method. You'll need to call it manually when you want to run one-step model validation for your own manually created models. For example::
ru: Обратите внимание, ``full_clean()`` *не* вызывается при вызове метода :meth:`~Model.save()`. Если вы хотите выполнить проверку для созданных вами объектов модели, вам необходимо явно вызывать этот метод. Например::

source: The first step ``full_clean()`` performs is to clean each individual field.
ru: Первым делом ``full_clean()`` выполняет проверку каждого поля.

source: This method will validate all fields on your model. The optional ``exclude`` argument lets you provide a list of field names to exclude from validation. It will raise a :exc:`~django.core.exceptions.ValidationError` if any fields fail validation.
ru: Этот метод проверяет все поля модели. Необязательный аргумент ``exclude`` используется, чтобы исключить часть полей из проверки. Если одно из полей не пройдет проверку, будет вызвано исключение :exc:`~django.core.exceptions.ValidationError`.

source: The second step ``full_clean()`` performs is to call :meth:`Model.clean()`. This method should be overridden to perform custom validation on your model.
ru: Следующим этапов проверки в ``full_clean()`` будет вызов метода :meth:`Model.clean()`. Этот метод должен быть переопределен, если вам нужна дополнительная проверка модели.

source: This method should be used to provide custom model validation, and to modify attributes on your model if desired. For instance, you could use it to automatically provide a value for a field, or to do validation that requires access to more than a single field::
ru: Этот метод должен быть переопределен, если вам нужна дополнительная проверка модели или изменить значения атрибутов. Для объектов, вы можете определить его для автоматического определения полей, или для проверки, которая требует значения нескольких полей::

source: Note, however, that like :meth:`Model.full_clean()`, a model's ``clean()`` method is not invoked when you call your model's :meth:`~Model.save()` method.
ru: Обратите внимание, :meth:`Model.full_clean()`, как и метод модели ``clean()``, не вызываются при вызове :meth:`~Model.save()`.

source: In the above example, the :exc:`~django.core.exceptions.ValidationError` exception raised by ``Model.clean()`` was instantiated with a string, so it will be stored in a special error dictionary key, :data:`~django.core.exceptions.NON_FIELD_ERRORS`. This key is used for errors that are tied to the entire model instead of to a specific field::
ru: Любое исключение :exc:`~django.core.exceptions.ValidationError` вызванное в ``Model.clean()`` будет сохранено со специальным ключом в словаре ошибок, :data:`~django.core.exceptions.NON_FIELD_ERRORS`, который используется для ошибок относящихся ко всей модели, а не конкретному полю::

source: To assign exceptions to a specific field, instantiate the :exc:`~django.core.exceptions.ValidationError` with a dictionary, where the keys are the field names. We could update the previous example to assign the error to the ``pub_date`` field::
ru: Чтобы добавить ошибку валидации к определенному полю, создайте экземпляр :exc:`~django.core.exceptions.ValidationError` со словарем, где ключи отображают необходимые поля. Добавим к предыдущему примеру проверку поля ``pub_date``::

source: If you detect errors in multiple fields during ``Model.clean()``, you can also pass a dictionary mapping field names to errors::
ru: Если вы нашли ошибку для нескольких полей в методе ``Model.clean()``, вы можете передать словарь с ошибками, ключи которого являются названиями полей::

source: Finally, ``full_clean()`` will check any unique constraints on your model.
ru: Также ``full_clean()`` выполняет все проверки на уникальность модели.

source: This method is similar to :meth:`~Model.clean_fields`, but validates all uniqueness constraints on your model instead of individual field values. The optional ``exclude`` argument allows you to provide a list of field names to exclude from validation. It will raise a :exc:`~django.core.exceptions.ValidationError` if any fields fail validation.
ru: Этот метод похож на :meth:`~Model.clean_fields`, но проверяет уникальность полей, используя все определенные правила, а не значения полей.Необязательный аргумент ``exclude`` используется, чтобы исключить часть полей из проверки. Вызывает исключение :exc:`~django.core.exceptions.ValidationError`, если поле не прошло проверку.

source: Note that if you provide an ``exclude`` argument to ``validate_unique()``, any :attr:`~django.db.models.Options.unique_together` constraint involving one of the fields you provided will not be checked.
ru: Заметим, при использовании аргумента ``exclude``, все правила определенные в :attr:`~django.db.models.Options.unique_together`, включающие одно из указанных полей, не будет учитываться при проверке.

source: Saving objects
ru: Сохранение объектов

source: To save an object back to the database, call ``save()``:
ru: Чтобы сохранить объект в базе данных, используйте ``save()``:

source: If you want customized saving behavior, you can override this ``save()`` method. See :ref:`overriding-model-methods` for more details.
ru: Если вы хотите изменить процесс сохранения, переопределите метод ``save()``. Подробности в разделе :ref:`overriding-model-methods`.

source: The model save process also has some subtleties; see the sections below.
ru: Процесс сохранения модели имеет ряд особенностей описанных ниже.

source: Auto-incrementing primary keys
ru: Автоинкрементные первичные ключи

source: If a model has an :class:`~django.db.models.AutoField` — an auto-incrementing primary key — then that auto-incremented value will be calculated and saved as an attribute on your object the first time you call ``save()``::
ru: Если модель содержит :class:`~django.db.models.AutoField` — автоинкрементный первичный ключи — его значение будет вычислено и сохранено в атрибут объекта при первом вызове метода ``save()``::

source: There's no way to tell what the value of an ID will be before you call ``save()``, because that value is calculated by your database, not by Django.
ru: Нельзя точно сказать каким будет значение ID до вызова метода ``save()``, так как оно вычисляется базой данных, а не Django.

source: For convenience, each model has an :class:`~django.db.models.AutoField` named ``id`` by default unless you explicitly specify ``primary_key=True`` on a field in your model. See the documentation for :class:`~django.db.models.AutoField` for more details.
ru: Для удобства каждая модель содержит полей :class:`~django.db.models.AutoField` с названием ``id``, если вы не указали параметр ``primary_key=True`` для поля модели. Подробности в описании :class:`~django.db.models.AutoField`.

source: The ``pk`` property
ru: Свойство ``pk``

source: Regardless of whether you define a primary key field yourself, or let Django supply one for you, each model will have a property called ``pk``. It behaves like a normal attribute on the model, but is actually an alias for whichever attribute is the primary key field for the model. You can read and set this value, just as you would for any other attribute, and it will update the correct field in the model.
ru: Независимо от того, определили вы первичный ключ самостоятельно, или позволили Django добавить его, каждая модель содержит свойство ``pk``. Он ведет себя как обычный атрибут, но на самом деле является псевдонимом для атрибута первичного ключа. Вы можете получить или установить его значение, так же как и любого другого атрибута, при этом будет обновлено соответствующее поле модели.

source: Explicitly specifying auto-primary-key values
ru: Явное определение значения первичного ключа

source: If a model has an :class:`~django.db.models.AutoField` but you want to define a new object's ID explicitly when saving, just define it explicitly before saving, rather than relying on the auto-assignment of the ID::
ru: Если модель содержит :class:`~django.db.models.AutoField` но вы хотите явно указать значение ID нового объекта при сохранении, просто укажите его::

source: If you assign auto-primary-key values manually, make sure not to use an already-existing primary-key value! If you create a new object with an explicit primary-key value that already exists in the database, Django will assume you're changing the existing record rather than creating a new one.
ru: Если вы определяете значение первичного автоинкрементного ключа, убедитесь что это значение не существует уже в базе данных! Если вы укажите существующее в базе значение, Django предположит что вы хотите изменить запись в базе данных, а не сохранить новую.

source: Given the above ``'Cheddar Talk'`` blog example, this example would override the previous record in the database::
ru: Учитывая пример с блогом ``'Cheddar Talk'`` выше, этот код перезапишет предыдущий объект в базе данных::

source: See `How Django knows to UPDATE vs. INSERT`_, below, for the reason this happens.
ru: О том, как это определяется, смотрите :ref:`How Django knows to UPDATE vs. INSERT` (FIXME) ниже.

source: Explicitly specifying auto-primary-key values is mostly useful for bulk-saving objects, when you're confident you won't have primary-key collision.
ru: Явное определение первичного ключа в основном полезно при сохранении множества объектов, когда вы уверенны что все значения уникальны.

source: What happens when you save?
ru: Что происходит при сохранении?

source: When you save an object, Django performs the following steps:
ru: При сохранении объекта Django выполняет следующие шаги:

source: For example, :class:`~django.db.models.DateField` fields use a Python ``datetime`` object to store data. Databases don't store ``datetime`` objects, so the field value must be converted into an ISO-compliant date string for insertion into the database.
ru: Например, поле :class:`~django.db.models.DateField` использует объект Python ``datetime`` для хранения значения. База данных не принимает объект ``datetime``, поэтому значение поля должно быть преобразовано в строковое представление даты в соответствии стандарту ISO перед сохранением в базу данных.

source: How Django knows to UPDATE vs. INSERT
ru: Как Django определят использовать UPDATE или INSERT

source: You may have noticed Django database objects use the same ``save()`` method for creating and changing objects. Django abstracts the need to use ``INSERT`` or ``UPDATE`` SQL statements. Specifically, when you call ``save()``, Django follows this algorithm:
ru: Вы уже заметили что объекты модели используют метод ``save()`` как для создания так и для изменения записи в базе данных. Django самостоятельно определяет использовать ``INSERT`` или ``UPDATE``. При вызове ``save()``, Django следует такому алгоритму:

source: If the object's primary key attribute is set to a value that evaluates to ``True`` (i.e., a value other than ``None`` or the empty string), Django executes an ``UPDATE``.
ru: Если атрибут первичного ключа объекта содержи значение равное ``True`` (например, не ``None`` или не пустая строка), Django выполняет ``UPDATE`` запрос.

source: If the object's primary key attribute is *not* set or if the ``UPDATE`` didn't update anything, Django executes an ``INSERT``.
ru: Если первичный ключ *не* указан, или ``UPDATE`` ничего не обновил, Django выполнит ``INSERT``.

source: The one gotcha here is that you should be careful not to specify a primary-key value explicitly when saving new objects, if you cannot guarantee the primary-key value is unused. For more on this nuance, see `Explicitly specifying auto-primary-key values`_ above and `Forcing an INSERT or UPDATE`_ below.
ru: Будьте осторожны, явно указывая значение первичного ключа при сохранении нового объекта, если вы не уверенны, что этот первичный ключ не используется. Более подробно об этом читайте :ref:`Explicitly specifying auto-primary-key values` (FIXME) и :ref:`ref-models-force-insert`.

source: In Django 1.5 and earlier, Django did a ``SELECT`` when the primary key attribute was set. If the ``SELECT`` found a row, then Django did an ``UPDATE``, otherwise it did an ``INSERT``. The old algorithm results in one more query in the ``UPDATE`` case. There are some rare cases where the database doesn't report that a row was updated even if the database contains a row for the object's primary key value. An example is the PostgreSQL ``ON UPDATE`` trigger which returns ``NULL``. In such cases it is possible to revert to the old algorithm by setting the :attr:`~django.db.models.Options.select_on_save` option to ``True``.
ru: В предыдущих версиях Django выполнялся ``SELECT`` запрос, когда первичный ключ был явно указан. Если ``SELECT`` находил строку, Django выполнял ``UPDATE`` запрос, иначе -- ``INSERT``. В результате выполнялся один лишний запрос в случае использования ``UPDATE``. В очень редких случаях база данных не оповещает об обновлении записи, если уже есть с указанным первичным ключом. Например, тригер PostgreSQL ``ON UPDATE``, который возвращает ``NULL``. В таких случаях можно вернуться к старому алгоритму, указав ``True`` в :attr:`~django.db.models.Options.select_on_save`.

source: Forcing an INSERT or UPDATE
ru: Принудительное выполнение INSERT или UPDATE

source: In some rare circumstances, it's necessary to be able to force the :meth:`~Model.save()` method to perform an SQL ``INSERT`` and not fall back to doing an ``UPDATE``. Or vice-versa: update, if possible, but not insert a new row. In these cases you can pass the ``force_insert=True`` or ``force_update=True`` parameters to the :meth:`~Model.save()` method. Obviously, passing both parameters is an error: you cannot both insert *and* update at the same time!
ru: В редких случаях, может понадобиться принудительно заставить метод :meth:`~Model.save()` выполнить ``INSERT`` запрос вместо ``UPDATE``. Или наоборот: обновить, при возможности, но не добавлять новую запись. В этом случае вы можете указать аргумент ``force_insert=True`` или ``force_update=True`` для метода :meth:`~Model.save()`. Очевидно, не правильно использовать оба аргумента вместе: вы не можете добавлять *и* обновлять одновременно!
