Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/ref/models/instances.po
Languages: ru

source: It should be very rare that you'll need to use these parameters. Django will almost always do the right thing and trying to override that will lead to errors that are difficult to track down. This feature is for advanced use only.
ru: Вряд ли вам понадобится использовать эти параметры. Django почти всегда сделает то, что вам нужно, и переопределение такого поведения может привести к ошибкам, которые трудно отследить. Эта функция предназначена для опытных пользователей.

source: Using ``update_fields`` will force an update similarly to ``force_update``.
ru: Использование ``update_fields`` инициирует обновление объекта, как и при вызове ``force_update``.

source: Updating attributes based on existing fields
ru: Обновление значений полей

source: Sometimes you'll need to perform a simple arithmetic task on a field, such as incrementing or decrementing the current value. The obvious way to achieve this is to do something like::
ru: Иногда вам может понадобиться выполнить простые арифметические операции над полями, такие как увеличить или уменьшить текущее значение. Очевидный способ сделать это::

source: If the old ``number_sold`` value retrieved from the database was 10, then the value of 11 will be written back to the database.
ru: Если старое значение ``number_sold``, полученное из базы данных, равно 10, в базу данных будет записано значение 11.

source: The process can be made robust, :ref:`avoiding a race condition <avoiding-race-conditions-using-f>`, as well as slightly faster by expressing the update relative to the original field value, rather than as an explicit assignment of a new value. Django provides :class:`F expressions <django.db.models.F>` for performing this kind of relative update. Using :class:`F expressions <django.db.models.F>`, the previous example is expressed as::
ru: Этот процесс может быть надежным, :ref:`предотвращая состояния гонки <avoiding-race-conditions-using-f>`, и немного быстрее, если выполнить обновление значение поля, а не явное присвоение нового значения. Django предоставляет :class:`объект F <django.db.models.F>` для выполнения обновления. Используя :class:`F() <django.db.models.F>`, следующий пример будет выглядеть таким образом::

source: For more details, see the documentation on :class:`F expressions <django.db.models.F>` and their :ref:`use in update queries <topics-db-queries-update>`.
ru: Подробности смотрите в описании :class:`объекта F <django.db.models.F>` и его :ref:`использование в запросах обновления <topics-db-queries-update>`.

source: Specifying which fields to save
ru: Указываем какие поля сохранять

source: If ``save()`` is passed a list of field names in keyword argument ``update_fields``, only the fields named in that list will be updated. This may be desirable if you want to update just one or a few fields on an object. There will be a slight performance benefit from preventing all of the model fields from being updated in the database. For example::
ru: Если в ``save()`` передать именованный аргумент ``update_fields`` со списком полей модели, только эти поля будут обновлены. Это может пригодиться, если вы хотите обновить одно или несколько полей. Таким образом можно получить небольшой прирост в производительности. Например::

source: The ``update_fields`` argument can be any iterable containing strings. An empty ``update_fields`` iterable will skip the save. A value of None will perform an update on all fields.
ru: ``update_fields`` может принимать любой итератор строк. Пустой ``update_fields`` пропустит сохранение. None сохранит все поля.

source: Specifying ``update_fields`` will force an update.
ru: Указав ``update_fields`` вы инициируете редактирование записи.

source: When saving a model fetched through deferred model loading (:meth:`~django.db.models.query.QuerySet.only()` or :meth:`~django.db.models.query.QuerySet.defer()`) only the fields loaded from the DB will get updated. In effect there is an automatic ``update_fields`` in this case. If you assign or change any deferred field value, the field will be added to the updated fields.
ru: Если модель была загружена не со всеми полями (через :meth:`~django.db.models.query.QuerySet.only()` или :meth:`~django.db.models.query.QuerySet.defer()`), только загруженные поля будут сохранены. В этом случае ``update_fields`` будет определен автоматически. Если значение поля будет изменено, оно будет добавлено в список для обновления.

source: Deleting objects
ru: Удаление объектов

source: Issues an SQL ``DELETE`` for the object. This only deletes the object in the database; the Python instance will still exist and will still have data in its fields. This method returns the number of objects deleted and a dictionary with the number of deletions per object type.
ru: Выполняет SQL ``DELETE`` запрос для объекта. Удаляет объекты только из базы данных; объекты Python будут существовать и содержать данные. Метод возвращает количество удаленных объектов и словарь, который содержит количество удаленных объектов для каждой модели.

source: For more details, including how to delete objects in bulk, see :ref:`topics-db-queries-delete`.
ru: Подробности, включая как удалить множество объектов, смотрите в :ref:`topics-db-queries-delete`.

source: If you want customized deletion behavior, you can override the ``delete()`` method. See :ref:`overriding-model-methods` for more details.
ru: Если вам нужно изменить процесс удаления, переопределите метод ``delete()``. Подробности в :ref:`overriding-model-methods`.

source: Sometimes with :ref:`multi-table inheritance <multi-table-inheritance>` you may want to delete only a child model's data. Specifying ``keep_parents=True`` will keep the parent model's data.
ru: В некоторых случаях при :ref:`multi-table наследовании <multi-table-inheritance>` вам может понадобиться удалить только данные дочерней модели. Передав аргумент ``keep_parents=True``, вы сохраните данные родительской модели.

source: Pickling objects
ru: Сериализация объектов

source: When you :mod:`pickle` a model, its current state is pickled. When you unpickle it, it'll contain the model instance at the moment it was pickled, rather than the data that's currently in the database.
ru: При упаковке объекта модели с помощью :mod:`pickle` сохраняется текущее состояние. При распаковке объекта он содержит объект модели в состоянии на момент упаковки, а не текущее состояние в базе данных.

source: You can't share pickles between versions
ru: Вы не можете использовать объекты, упакованные на разных версиях Django

source: Pickles of models are only valid for the version of Django that was used to generate them. If you generate a pickle using Django version N, there is no guarantee that pickle will be readable with Django version N+1. Pickles should not be used as part of a long-term archival strategy.
ru: Упакованные модели работают только для той версии Django, на которой они были созданы. Если вы упаковали модель на Django версии N, нет гарантии, что вы сомжете распаковать её на Django версии N+1. Упаковка моделей не должна использоваться для долговременного архивирования объектов.

source: Since pickle compatibility errors can be difficult to diagnose, such as silently corrupted objects, a ``RuntimeWarning`` is raised when you try to unpickle a model in a Django version that is different than the one in which it was pickled.
ru: Ошибки несовместимости версий при распаковке объектом тяжело диагностировать, например сломанный объект, поэтому вызывается ``RuntimeWarning`` при попытке распаковать модель на версии Django отличной от той, которая использовалась при упаковке.

source: Other model instance methods
ru: Остальные методы модели

source: A few object methods have special purposes.
ru: Несколько методов имеют специальное назначение.

source: The ``__str__()`` method is called whenever you call ``str()`` on an object. Django uses ``str(obj)`` in a number of places. Most notably, to display an object in the Django admin site and as the value inserted into a template when it displays an object. Thus, you should always return a nice, human-readable representation of the model from the ``__str__()`` method.
ru: Метод ``__str__()`` вызывается когда вы применяете функцию ``str()`` к объекту. Django использует ``str(obj)`` в нескольких местах. В частности, для отображения объектов в интерфейсе администратора Django и в качестве значения, вставляемого в шаблон, при отображении объекта. Поэтому, вы должны всегда возвращать в методе ``__str__()`` красивое и удобное для восприятия представление объекта.

source: For example::
ru: Например::

source: Define a ``get_absolute_url()`` method to tell Django how to calculate the canonical URL for an object. To callers, this method should appear to return a string that can be used to refer to the object over HTTP.
ru: Определите метод ``get_absolute_url()``, чтобы указать Django как вычислить URL для объекта. Метод должен вернуть строку, которая может быть использована в HTTP запросе.

source: One place Django uses ``get_absolute_url()`` is in the admin app. If an object defines this method, the object-editing page will have a "View on site" link that will jump you directly to the object's public view, as given by ``get_absolute_url()``.
ru: Django использует ``get_absolute_url()`` в интерфейсе администратора. Если объект содержит этот метод, страница редактирования объекта будет содержать ссылку "Показать на сайте", которая приведет к странице отображения объекта, ссылку на которую возвращает ``get_absolute_url()``.

source: Similarly, a couple of other bits of Django, such as the :doc:`syndication feed framework </ref/contrib/syndication>`, use ``get_absolute_url()`` when it is defined. If it makes sense for your model's instances to each have a unique URL, you should define ``get_absolute_url()``.
ru: Кроме того, несколько приложений Django также используют этот метод, например :doc:`syndication feed framework </ref/contrib/syndication>`. Если объект модели представляет какой-то уникальный URL, вам стоит определить метод ``get_absolute_url()``.

source: You should avoid building the URL from unvalidated user input, in order to reduce possibilities of link or redirect poisoning::
ru: При создания URL не используйте непроверенные данные от пользователя, чтобы избежать подделки ссылок или перенаправлений::

source: If ``self.name`` is ``'/example.com'`` this returns ``'//example.com/'`` which, in turn, is a valid schema relative URL but not the expected ``'/%2Fexample.com/'``.
ru: Если ``self.name`` равен ``'/example.com'``, будет возвращен ``'//example.com/'``, являющимся правильным URL-ом относительно протокола, вместо ожидаемого ``'/%2Fexample.com/'``.

source: It's good practice to use ``get_absolute_url()`` in templates, instead of hard-coding your objects' URLs. For example, this template code is bad:
ru: Хорошая практика использовать ``get_absolute_url()`` в шаблонах, вместо того, чтобы "хардкодить" URL-ы. Например, это плохой подход:

source: This template code is much better:
ru: Этот шаблон значительно лучше:

source: The logic here is that if you change the URL structure of your objects, even for something simple such as correcting a spelling error, you don't want to have to track down every place that the URL might be created. Specify it once, in ``get_absolute_url()`` and have all your other code call that one place.
ru: Идея в том что, если вы измените структуру URL-а для объекта, или просто исправите опечатку, вам не нужно исправлять его во всех местах, где этот URL используется. Просто определите его один раз в методе ``get_absolute_url()``, и пусть остальной код использует его.

source: The string you return from ``get_absolute_url()`` **must** contain only ASCII characters (required by the URI specification, :rfc:`2396`) and be URL-encoded, if necessary.
ru: Строка, которую возвращает ``get_absolute_url()``, **должна** состоять только из ASCII символов (требуется спецификацией URI, :rfc:`2396`) и быть закодированной для URL, если необходимо.

source: Code and templates calling ``get_absolute_url()`` should be able to use the result directly without any further processing. You may wish to use the ``django.utils.encoding.iri_to_uri()`` function to help with this if you are using unicode strings containing characters outside the ASCII range at all.
ru: Код и шаблоны, использующие ``get_absolute_url()``, должны иметь возможность использовать результат без обработки. Вы можете использовать функцию ``django.utils.encoding.iri_to_uri()``, если используете unicode-строку, которая содержит не ASCII символы.

source: Extra instance methods
ru: Дополнительные методы модели

source: In addition to :meth:`~Model.save()`, :meth:`~Model.delete()`, a model object might have some of the following methods:
ru: В дополнение к методам :meth:`~Model.save()`, :meth:`~Model.delete()`, объект модели может содержать некоторые из этих методов:

source: For every field that has :attr:`~django.db.models.Field.choices` set, the object will have a ``get_FOO_display()`` method, where ``FOO`` is the name of the field. This method returns the "human-readable" value of the field.
ru: Для каждого поля, которое содержит :attr:`~django.db.models.Field.choices`, объект будет иметь метод ``get_FOO_display()``, где ``FOO`` имя поля. Этот метод возвращает удобное для восприятия название для значения поля.

source: For every :class:`~django.db.models.DateField` and :class:`~django.db.models.DateTimeField` that does not have :attr:`null=True <django.db.models.Field.null>`, the object will have ``get_next_by_FOO()`` and ``get_previous_by_FOO()`` methods, where ``FOO`` is the name of the field. This returns the next and previous object with respect to the date field, raising a :exc:`~django.db.models.Model.DoesNotExist` exception when appropriate.
ru: Для каждого поля :class:`~django.db.models.DateField` и :class:`~django.db.models.DateTimeField`, которое не содержит :attr:`null=True <django.db.models.Field.null>`, объект будет иметь методы ``get_next_by_FOO()`` и ``get_previous_by_FOO()``, где ``FOO`` название поля. Они возвращают следующий и предыдущий объект в соответствии со значением этого поля, вызывая соответствующее исключение :exc:`~django.db.models.Model.DoesNotExist`, если объект не существует.

source: Both of these methods will perform their queries using the default manager for the model. If you need to emulate filtering used by a custom manager, or want to perform one-off custom filtering, both methods also accept optional keyword arguments, which should be in the format described in :ref:`Field lookups <field-lookups>`.
ru: Оба метода используют менеджер по умолчанию модели. Если вам необходимо использовать свой менеджер, которые должен выполнить какую-то фильтрацию, или просто добавить дополнительную фильтрацию, в методы можно передать дополнительные аргументы, которые должны соответствовать формату :ref:`операторов фильтрации <field-lookups>`.

source: Note that in the case of identical date values, these methods will use the primary key as a tie-breaker. This guarantees that no records are skipped or duplicated. That also means you cannot use those methods on unsaved objects.
ru: Заметим, что в случае одинаковых значений даты, эти методы будут использовать значение первичного ключа, для определения порядка объектов. Это гарантирует, что записи не будут пропущены или дублированы. Это также означает, что вы не можете использовать эти методы для не сохраненных объектов.

source: Other attributes
ru: Другие атрибуты

source: This exception is raised by the ORM in a couple places, for example by :meth:`QuerySet.get() <django.db.models.query.QuerySet.get>` when an object is not found for the given query parameters.
ru: Это исключение вызывается ORM в нескольких случаях, например методом :meth:`QuerySet.get() <django.db.models.query.QuerySet.get>`, если объект не найден.

source: Django provides a ``DoesNotExist`` exception as an attribute of each model class to identify the class of object that could not be found and to allow you to catch a particular model class with ``try/except``. The exception is a subclass of :exc:`django.core.exceptions.ObjectDoesNotExist`.
ru: Django предоставляет исключение ``DoesNotExist`` как атрибут каждой модели, чтобы можно было обработать ошибку для каждой конкретной модели, используя ``try/except``. Это исключение наследуется от :exc:`django.core.exceptions.ObjectDoesNotExist`.
