Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/ref/models/options.po
Languages: ru

source: Model ``Meta`` options
ru: Параметры модели

source: This document explains all the possible :ref:`metadata options <meta-options>` that you can give your model in its internal ``class Meta``.
ru: Этот раздел описывает все возможные :ref:`настройки модели <meta-options>` которые вы можете определить через ``class Meta``.

source: Available ``Meta`` options
ru: Параметры ``Meta``

source: If ``abstract = True``, this model will be an :ref:`abstract base class <abstract-base-classes>`.
ru: При ``abstract = True``, эта модель будет :ref:`абстрактной моделью <abstract-base-classes>`.

source: If a model is defined outside of an application in :setting:`INSTALLED_APPS`, it must declare which app it belongs to::
ru: Если модель определена вне приложения из :setting:`INSTALLED_APPS`, она должна указать к какому приложению она относится::

source: If you want to represent a model with the format ``app_label.object_name`` or ``app_label.model_name`` you can use ``model._meta.label`` or ``model._meta.label_lower`` respectively.
ru: Если вы хотите представить модель в формате ``app_label.object_name`` или ``app_label.model_name``, вы можете использовать ``model._meta.label`` и ``model._meta.label_lower`` соответственно.

source: The name of the database table to use for the model::
ru: Название таблицы в базе данных для этой модели::

source: Table names
ru: Название таблицы

source: To save you time, Django automatically derives the name of the database table from the name of your model class and the app that contains it. A model's database table name is constructed by joining the model's "app label" -- the name you used in :djadmin:`manage.py startapp <startapp>` -- to the model's class name, with an underscore between them.
ru: Экономя ваше время, Django автоматически создаст название таблицы из названия модели и приложения. Название таблицы состоит из названия приложения("app label") -- название используемое для команды :djadmin:`manage.py startapp <startapp>` -- и названия модели, объединенные нижним подчеркиванием.

source: For example, if you have an app ``bookstore`` (as created by ``manage.py startapp bookstore``), a model defined as ``class Book`` will have a database table named ``bookstore_book``.
ru: Например, есть приложение ``bookstore`` (созданное командой ``manage.py startapp bookstore``), и модель ``class Book``, название таблицы будет ``bookstore_book``.

source: To override the database table name, use the ``db_table`` parameter in ``class Meta``.
ru: Для переопределения названия таблицы используйте атрибут ``db_table`` ``class Meta``.

source: If your database table name is an SQL reserved word, or contains characters that aren't allowed in Python variable names -- notably, the hyphen -- that's OK. Django quotes column and table names behind the scenes.
ru: Если имя колонки это зарезервированное SQL слово, или содержит символы запрещенные в названиях переменной в Python – в частности, дефис – все нормально. Django автоматически экранирует название колонок и таблиц.

source: Use lowercase table names for MySQL
ru: Используйте нижний регистр для названий таблиц в MySQL

source: It is strongly advised that you use lowercase table names when you override the table name via ``db_table``, particularly if you are using the MySQL backend. See the :ref:`MySQL notes <mysql-notes>` for more details.
ru: Настоятельно рекомендуем использовать нижний регистр при переопределении названия таблицы через ``db_table``, особенно при использовании MySQL. Подробности в :ref:`примечания для MySQL <mysql-notes>`.

source: Table name quoting for Oracle
ru: Названия таблиц в кавычках для Oracle

source: In order to meet the 30-char limitation Oracle has on table names, and match the usual conventions for Oracle databases, Django may shorten table names and turn them all-uppercase. To prevent such transformations, use a quoted name as the value for ``db_table``::
ru: Т.к в Oracle есть ограничение в 30 символов на название таблиц, и для соблюдения соглашений работы с Oracle, Django может ограничить название таблицы и преобразовать его в верхний регистр. Чтобы избежать этого, укажите название в кавычках в настройке ``db_table``::

source: Such quoted names can also be used with Django's other supported database backends; except for Oracle, however, the quotes have no effect. See the :ref:`Oracle notes <oracle-notes>` for more details.
ru: Кавычки можно использовать для других типов базы данных, не только Oracle, однако, они не будут иметь никакого эффекта. Смотрите :ref:`заметки о работе с Oracle <oracle-notes>`.

source: The name of the :doc:`database tablespace </topics/db/tablespaces>` to use for this model. The default is the project's :setting:`DEFAULT_TABLESPACE` setting, if set. If the backend doesn't support tablespaces, this option is ignored.
ru: Имя :doc:`“tablespace” базы данных </topics/db/tablespaces>` для этой модели. По умолчанию используется настройка :setting:`DEFAULT_TABLESPACE`, если она определена. Если база данных не поддерживает “tablespace” для индексов, этот параметр будет проигнорирован.

source: The name that will be used by default for the relation from a related object back to this one. The default is ``<model_name>_set``.
ru: Название, которое будет использоваться для обратных связей к этой модели. По умолчанию ``<model_name>_set``.

source: As the reverse name for a field should be unique, be careful if you intend to subclass your model. To work around name collisions, part of the name should contain ``'%(app_label)s'`` and ``'%(model_name)s'``, which are replaced respectively by the name of the application the model is in, and the name of the model, both lowercased. See the paragraph on :ref:`related names for abstract models <abstract-related-name>`.
ru: Т.к. название поля обратной связи должно быть уникальным, будьте осторожны, если собираетесь наследоваться от модели. Чтобы избежать коллизий в названиях, можно добавить ``'%(app_label)s'`` и ``'%(model_name)s'``, которые будут заменены соответственно на название приложения модели и название модели в нижнем регистре. Смотрите :ref:`именование обратных связей для абстрактных моделей <abstract-related-name>`.

source: The name of an orderable field in the model, typically a :class:`DateField`, :class:`DateTimeField`, or :class:`IntegerField`. This specifies the default field to use in your model :class:`Manager`’s :meth:`~django.db.models.query.QuerySet.latest` and :meth:`~django.db.models.query.QuerySet.earliest` methods.
ru: Название сортируемого поля модели, обычно :class:`DateField`, :class:`DateTimeField` или :class:`IntegerField`. Определяет поле по умолчанию, которое будет использовано методами :meth:`~django.db.models.query.QuerySet.latest` и :meth:`~django.db.models.query.QuerySet.earliest` :class:`Manager`-а модели.

source: Example::
ru: Например::

source: See the :meth:`~django.db.models.query.QuerySet.latest` docs for more.
ru: Подробности в разделе о :meth:`~django.db.models.query.QuerySet.latest`.

source: Defaults to ``True``, meaning Django will create the appropriate database tables in :djadmin:`migrate` or as part of migrations and remove them as part of a :djadmin:`flush` management command. That is, Django *manages* the database tables' lifecycles.
ru: По умолчанию ``True``, означает что Django создаст необходимые таблицы в базе данных при выполнении команды :djadmin:`migrate` и удалит их при выполнении :djadmin:`flush`. То есть Django *управляет* таблицами.

source: If ``False``, no database table creation or deletion operations will be performed for this model. This is useful if the model represents an existing table or a database view that has been created by some other means. This is the *only* difference when ``managed=False``. All other aspects of model handling are exactly the same as normal. This includes
ru: При ``False``, таблицы модели не будет создаваться или удаляться. Это полезно, если модель отображает существующую таблицу или "VIEW" в базе данных, которая была создана другим способом. Это *единственная* разница при ``managed=False``. Все остальные этапы работы с моделью не изменяются. Они включают

source: Adding an automatic primary key field to the model if you don't declare it. To avoid confusion for later code readers, it's recommended to specify all the columns from the database table you are modeling when using unmanaged models.
ru: Автоматическое добавление первичного ключа, если он не был определен. Для ясности лучше определить в модели все поля таблицы, которую отображает модель с `managed=False``.

source: If a model with ``managed=False`` contains a :class:`~django.db.models.ManyToManyField` that points to another unmanaged model, then the intermediate table for the many-to-many join will also not be created. However, the intermediary table between one managed and one unmanaged model *will* be created.
ru: Если модель с ``managed=False`` содержит :class:`~django.db.models.ManyToManyField` на другую неуправляемую модель, промежуточная таблица для хранения связи многое-ко-многим не будет создана. Однако, промежуточная таблица между управляемой и не управляемой моделью *будет* создана.

source: If you need to change this default behavior, create the intermediary table as an explicit model (with ``managed`` set as needed) and use the :attr:`ManyToManyField.through` attribute to make the relation use your custom model.
ru: Если вы хотите переопределить такое поведение по умолчанию, создайте модель для промежуточной таблицы (с необходимым ``managed``) и укажите использование этой модели через параметр :attr:`ManyToManyField.through`.

source: For tests involving models with ``managed=False``, it's up to you to ensure the correct tables are created as part of the test setup.
ru: Правильное создание таблиц при тестировании в тестовой базе данных для модели с ``managed=False`` ложится на ваши плечи.

source: If you're interested in changing the Python-level behavior of a model class, you *could* use ``managed=False`` and create a copy of an existing model. However, there's a better approach for that situation: :ref:`proxy-models`.
ru: Если вы хотите переопределить поведение модели на уровне Python, вы *можете* использовать ``managed=False`` и создать копию существующей модели. Однако, есть лучшее решение для такой ситуации: :ref:`proxy-models`.

source: Makes this object orderable with respect to the given field, usually a ``ForeignKey``. This can be used to make related objects orderable with respect to a parent object. For example, if an ``Answer`` relates to a ``Question`` object, and a question has more than one answer, and the order of answers matters, you'd do this::
ru: Объекты модели будут отсортированы относительно указанного поля. Почти всегда используется для ``ForeignKey``. Можно использовать для сортировки связанных объектов по значению из родительского объекта. Например, модель ``Answer``(ответ) связана с моделью ``Question``(вопрос) через ``ForeignKey``, вопрос содержит несколько ответов и порядок этих ответов имеет значение::

source: When ``order_with_respect_to`` is set, two additional methods are provided to retrieve and to set the order of the related objects: ``get_RELATED_order()`` and ``set_RELATED_order()``, where ``RELATED`` is the lowercased model name. For example, assuming that a ``Question`` object has multiple related ``Answer`` objects, the list returned contains the primary keys of the related ``Answer`` objects::
ru: При добавлении ``order_with_respect_to``, будет добавлено два дополнительных метода для получения и установки порядка связанных объектов: ``get_RELATED_order()`` и ``set_RELATED_order()``, где ``RELATED`` название модели в нижнем регистре. Например, предполагая что объект ``Question`` имеет несколько связанных объектов ``Answer``, возвращенный список будет содержать значения первичного ключа объектов ``Answer``::

source: The order of a ``Question`` object's related ``Answer`` objects can be set by passing in a list of ``Answer`` primary keys::
ru: Для определения порядка объектов ``Answer`` передайте список первичных ключей в метод ``set_answer_order``::

source: The related objects also get two methods, ``get_next_in_order()`` and ``get_previous_in_order()``, which can be used to access those objects in their proper order. Assuming the ``Answer`` objects are ordered by ``id``::
ru: К связанным объектам также добавляется два метода, ``get_next_in_order()`` и ``get_previous_in_order()``, для получения объектов в определенном порядке. Предположим что объекты ``Answer`` отсортированы по ``id``::

source: ``order_with_respect_to`` implicitly sets the ``ordering`` option
ru: ``order_with_respect_to`` неявно использует ``ordering``

source: Internally, ``order_with_respect_to`` adds an additional field/database column named ``_order`` and sets the model's :attr:`~Options.ordering` option to this field. Consequently, ``order_with_respect_to`` and ``ordering`` cannot be used together, and the ordering added by ``order_with_respect_to`` will apply whenever you obtain a list of objects of this model.
ru: Внутри ``order_with_respect_to`` добавляет колонку в базе данных ``_order`` и указывает её в опции модели :attr:`~Options.ordering`. Поэтому ``order_with_respect_to`` и ``ordering`` не могут использоваться вместе, и сортировка из ``order_with_respect_to`` будет использоваться при любом получении объектов модели.

source: Changing ``order_with_respect_to``
ru: Изменение ``order_with_respect_to``

source: Because ``order_with_respect_to`` adds a new database column, be sure to make and apply the appropriate migrations if you add or change ``order_with_respect_to`` after your initial :djadmin:`migrate`.
ru: Т.к. ``order_with_respect_to`` добавляет дополнительное поле в таблицу базы данных с названием ``_order``, не забудьте создать и применить миграцию, если вы добавите или поменяете ``order_with_respect_to`` первого запуска после :djadmin:`migrate`.

source: The default ordering for the object, for use when obtaining lists of objects::
ru: Сортировка по умолчанию используемая при получении объектов::

source: This is a tuple or list of strings. Each string is a field name with an optional "-" prefix, which indicates descending order. Fields without a leading "-" will be ordered ascending. Use the string "?" to order randomly.
ru: Это кортеж или список строк. Каждая строка это название поля с необязательным префиксом "-", который указывает на нисходящую сортировку. Поля без "-" будут отсортированы по возрастанию. Используйте "?" для случайной сортировке.

source: For example, to order by a ``pub_date`` field ascending, use this::
ru: Например, для сортировки по возрастанию по полю ``pub_date``::

source: To order by ``pub_date`` descending, use this::
ru: Нисходящая сортировка по полю ``pub_date``::

source: To order by ``pub_date`` descending, then by ``author`` ascending, use this::
ru: Для нисходящей сортировки по ``pub_date`` и восходящей по ``author``, используйте::

source: Ordering is not a free operation. Each field you add to the ordering incurs a cost to your database. Each foreign key you add will implicitly include all of its default orderings as well.
ru: Сортировка не бесплатная операция. Каждое поле влияет на скорость выполнения запроса. Каждый внешний ключ добавит сортировку по умолчанию связанной модели.

source: Extra permissions to enter into the permissions table when creating this object. Add, delete and change permissions are automatically created for each model. This example specifies an extra permission, ``can_deliver_pizzas``::
ru: Дополнительные разрешения(permissions) будут добавлены в таблицу разрешений при создании модели. Разрешения на добавление, удаление и изменение автоматически создаются для каждой модели. Этот пример добавляет разрешение ``can_deliver_pizzas``::

source: This is a list or tuple of 2-tuples in the format ``(permission_code, human_readable_permission_name)``.
ru: Это список 2-х элементных кортежей в формате ``(код разрешения, название разрешения)``.

source: Defaults to ``('add', 'change', 'delete')``. You may customize this list, for example, by setting this to an empty list if your app doesn't require any of the default permissions. It must be specified on the model before the model is created by :djadmin:`migrate` in order to prevent any omitted permissions from being created.
ru: По умолчанию ``('add', 'change', 'delete')``. Вы можете поменять этот список, например, указав пустой список, если ваше приложение не требует никаких прав доступа. Необходимо указать в модели перед тем, как она будет создана командой :djadmin:`migrate`.

source: If ``proxy = True``, a model which subclasses another model will be treated as a :ref:`proxy model <proxy-models>`.
ru: При ``proxy = True``, модель унаследованная от другой модели будет создана как :ref:`proxy-модель <proxy-models>`.

source: List of database features that the current connection should have so that the model is considered during the migration phase. For example, if you set this list to ``['gis_enabled']``, the model will only be synchronized on GIS-enabled databases. It's also useful to skip some models when testing with several database backends. Avoid relations between models that may or may not be created as the ORM doesn't handle this.
ru: Список функций базы данных, который необходимы для работы модели. Учитываются при миграции. Например, если указать ``['gis_enabled']``, таблица для модели будет создана только для базы данных, которая поддерживает GIS. Эта опция также полезна при тестировании на разных базах данных. Избегайте связей между моделями, которые не могут быть созданы в одной базе данных. ORM не умеет обрабатывать такие ситуации.

source: Name of a supported database vendor that this model is specific to. Current built-in vendor names are: ``sqlite``, ``postgresql``, ``mysql``, ``oracle``. If this attribute is not empty and the current connection vendor doesn't match it, the model will not be synchronized.
ru: Список поддерживаемых баз данных. Текущий список: ``sqlite``, ``postgresql``, ``mysql``, ``oracle``. Если эта опция не пустая, и база данных не соответствует указанной, таблица для модели не будет создана при миграции.

source: Determines if Django will use the pre-1.6 :meth:`django.db.models.Model.save()` algorithm. The old algorithm uses ``SELECT`` to determine if there is an existing row to be updated. The new algorithm tries an ``UPDATE`` directly. In some rare cases the ``UPDATE`` of an existing row isn't visible to Django. An example is the PostgreSQL ``ON UPDATE`` trigger which returns ``NULL``. In such cases the new algorithm will end up doing an ``INSERT`` even when a row exists in the database.
ru: Указывает использовать ли старый(до 1.6) алгоритм работы :meth:`django.db.models.Model.save()`. Старый алгоритм использовал ``SELECT`` для определения существует ли запись для обновления. Новый алгоритм сразу пробует обновить запись через ``UPDATE``. В некоторых редких случаях ``UPDATE`` существующей записи не виден для Django. Например, в PostgreSQL срабатывание ``ON UPDATE`` возвращает ``NULL``. В таких случаях новый алгоритм в конце концов попытается выполнить ``INSERT``, даже если запись существует в базе данных.

source: Usually there is no need to set this attribute. The default is ``False``.
ru: Обычно нет надобности менять эту настройку. По умолчанию равно ``False``.

source: See :meth:`django.db.models.Model.save()` for more about the old and new saving algorithm.
ru: Различия работы старого и нового алгоритмов смотрите в описании метода :meth:`django.db.models.Model.save()`.

source: Sets of field names that, taken together, must be unique::
ru: Множество полей, комбинация значений которых должна быть уникальна::

source: This is a tuple of tuples that must be unique when considered together. It's used in the Django admin and is enforced at the database level (i.e., the appropriate ``UNIQUE`` statements are included in the ``CREATE TABLE`` statement).
ru: Кортеж кортежей полей, которые должны быть вместе уникальны. Используется в интерфейсе администратора для проверки данных и на уровне базы данных (то есть соответствующее определение ``UNIQUE`` будет добавлено в ``CREATE TABLE`` запрос).

source: For convenience, unique_together can be a single tuple when dealing with a single set of fields::
ru: Для удобства ``unique_together`` может быть одноуровневым списком, если определяется один набор уникальных полей::

source: A :class:`~django.db.models.ManyToManyField` cannot be included in unique_together. (It's not clear what that would even mean!) If you need to validate uniqueness related to a :class:`~django.db.models.ManyToManyField`, try using a signal or an explicit :attr:`through <ManyToManyField.through>` model.
ru: :class:`~django.db.models.ManyToManyField` не должен быть включен в ``unique_together``. (Не понятно что подразумевается.) Если вам необходимо проверить уникальность связанных через :class:`~django.db.models.ManyToManyField` объектов, попробуйте использовать сигналы или подходящую :attr:`through <ManyToManyField.through>` model.

source: The ``ValidationError`` raised during model validation when the constraint is violated has the ``unique_together`` error code.
ru: Будет вызвано исключение ``ValidationError`` в процессе проверки модели, если проверка ограничений(constraint) вернула ошибку с кодом ``unique_together``.

source: Sets of field names that, taken together, are indexed::
ru: Множество полей, для которых создается один индекс::

source: This list of fields will be indexed together (i.e. the appropriate ``CREATE INDEX`` statement will be issued.)
ru: Будет создан один индекс для группы полей (то есть будет выполнен необходимый ``CREATE INDEX``.)

source: For convenience, ``index_together`` can be a single list when dealing with a single set of fields::
ru: Для удобства ``index_together`` может быть одноуровневым списком, если определяется один набор полей::

source: A human-readable name for the object, singular::
ru: Читабельное название модели, в единственном числе::

source: If this isn't given, Django will use a munged version of the class name: ``CamelCase`` becomes ``camel case``.
ru: Если не указано, Django создаст из названия модели: ``CamelCase`` станет ``camel case``.

source: The plural name for the object::
ru: Название модели в множественном числе::

source: If this isn't given, Django will use :attr:`~Options.verbose_name` + ``"s"``.
ru: Если не указано, Django создаст по правилу :attr:`~Options.verbose_name` + ``"s"``.

source: Read-only ``Meta`` attributes
ru: Неизменяемые атрибуты ``Meta``

source: Representation of the object, returns ``app_label.object_name``, e.g. ``'polls.Question'``.
ru: Представление объекта, возвращает ``app_label.object_name``, например ``'polls.Question'``.

source: Representation of the model, returns ``app_label.model_name``, e.g. ``'polls.question'``.
ru: Представление объекта, возвращает ``app_label.model_name``, например ``'polls.question'``.
