Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/ref/models/querysets.po
Languages: ru

source: Any keyword arguments passed to ``get_or_create()`` — *except* an optional one called ``defaults`` — will be used in a :meth:`get()` call. If an object is found, ``get_or_create()`` returns a tuple of that object and ``False``. If multiple objects are found, ``get_or_create`` raises :exc:`~django.core.exceptions.MultipleObjectsReturned`. If an object is *not* found, ``get_or_create()`` will instantiate and save a new object, returning a tuple of the new object and ``True``. The new object will be created roughly according to this algorithm::
ru: Все именованные аргументы переданные в ``get_or_create()`` — *кроме* одного не обязательного ``defaults`` — будут использованы при вызове :meth:`get()`. Если объект найден, ``get_or_create()`` вернет этот объект и ``False``. Если найдено несколько объектов - будет вызвано исключение :exc:`~django.core.exceptions.MultipleObjectsReturned`. Если объект *не* найден, ``get_or_create()`` создаст и сохранит новый объект, возвращая новый объект и ``True``. Новый объект будет создан примерно за таким алгоритмом::

source: If you have a field named ``defaults`` and want to use it as an exact lookup in ``get_or_create()``, just use ``'defaults__exact'``, like so::
ru: Если модель содержит поле ``defaults`` и вы хотите использовать его в параметрах поиска в ``get_or_create()``, просто используйте ``'defaults__exact'``::

source: The ``get_or_create()`` method has similar error behavior to :meth:`create()` when you're using manually specified primary keys. If an object needs to be created and the key already exists in the database, an :exc:`~django.db.IntegrityError` will be raised.
ru: Метод ``get_or_create()`` использует аналогичное поведение с ошибками что и метод :meth:`create()`, если вы самостоятельно определяете значение первичного ключа. Если объект должен быть создан и значение первичного ключа уже существует в базе данных, будет вызвано исключение :exc:`~django.db.IntegrityError`.

source: This method is atomic assuming correct usage, correct database configuration, and correct behavior of the underlying database. However, if uniqueness is not enforced at the database level for the ``kwargs`` used in a ``get_or_create`` call (see :attr:`~django.db.models.Field.unique` or :attr:`~django.db.models.Options.unique_together`), this method is prone to a race-condition which can result in multiple rows with the same parameters being inserted simultaneously.
ru: Этот метод атомарный при правильном использовании, правильной настройке и работе БД. Однако, если уникальность полей не контролируется на уровне БД(:attr:`~django.db.models.Field.unique` или :attr:`~django.db.models.Options.unique_together`), этот метод склонен к "гонке-состояний" и в БД могут попасть не уникальные данные(прим. пер. - Django то проверить уникальность, но при нескольких процессах запросы могут одновременно отправиться на выполнения к БД, а там уже ничего не проверяется).

source: If you are using MySQL, be sure to use the ``READ COMMITTED`` isolation level rather than ``REPEATABLE READ`` (the default), otherwise you may see cases where ``get_or_create`` will raise an :exc:`~django.db.IntegrityError` but the object won't appear in a subsequent :meth:`~django.db.models.query.QuerySet.get` call.
ru: При использовании MySQL, убедитесь что используете ``READ COMMITTED`` вместо ``REPEATABLE READ`` (по умолчанию), иначе ``get_or_create`` может вызывать :exc:`~django.db.IntegrityError`, но объект не будет возвращен последующим вызовом :meth:`~django.db.models.query.QuerySet.get`.

source: You can use ``get_or_create()`` through :class:`~django.db.models.ManyToManyField` attributes and reverse relations. In that case you will restrict the queries inside the context of that relation. That could lead you to some integrity problems if you don't use it consistently.
ru: Вы можете использовать ``get_or_create()`` с атрибутами :class:`~django.db.models.ManyToManyField` и обратными внешними связями. При это запросы будут ограничены контекстом связи. Это может вызвать некоторые проблемы при создании объектов.

source: Being the following models::
ru: Возьмем следующие модели::

source: You can use ``get_or_create()`` through Book's chapters field, but it only fetches inside the context of that book::
ru: Вы можете использовать ``get_or_create()`` для поля ``chapters`` модели ``Book``, но будут учитывать только объекты связанные с конкретной книгой::

source: This is happening because it's trying to get or create "Chapter 1" through the book "Ulysses", but it can't do any of them: the relation can't fetch that chapter because it isn't related to that book, but it can't create it either because ``title`` field should be unique.
ru: Это произошло, потому что мы пытались получить или создать "Chapter 1" для книги "Ulysses", но ни один объект не был найден, т.к. он не связан с этой книгой, и мы получили ошибку при попытке его создать т.к. поле ``title`` должно быть уникальным.

source: Returns a tuple of ``(object, created)``, where ``object`` is the created or updated object and ``created`` is a boolean specifying whether a new object was created.
ru: Возвращает кортеж ``(object, created)``, где ``object`` полученный или обновленный объект и ``created`` -- булево значение, указывающее был ли создан объект.

source: The ``update_or_create`` method tries to fetch an object from database based on the given ``kwargs``. If a match is found, it updates the fields passed in the ``defaults`` dictionary.
ru: Метод ``update_or_create`` пытается получить объект из базы данных, используя ``kwargs``. Если объект найден, он обновляет поля указанные в ``defaults``.

source: This pattern gets quite unwieldy as the number of fields in a model goes up. The above example can be rewritten using ``update_or_create()`` like so::
ru: Такой способ становится весьма громоздким при увеличении количества полей модели. Пример выше может быть переписан с использованием метода ``update_or_create()``::

source: For detailed description how names passed in ``kwargs`` are resolved see :meth:`get_or_create`.
ru: Подробности о том, как обрабатывается ``kwargs``, смотрите в описании :meth:`get_or_create`.

source: As described above in :meth:`get_or_create`, this method is prone to a race-condition which can result in multiple rows being inserted simultaneously if uniqueness is not enforced at the database level.
ru: Как описано выше в :meth:`get_or_create`, этот метод подвержен состоянию гонки, что может привести к созданию одинаковых строк в базе данных, если уникальность полей не контролируется на уровне базы данных.

source: This method inserts the provided list of objects into the database in an efficient manner (generally only 1 query, no matter how many objects there are)::
ru: Этот метод позволяет сохранить в базе данных множество объектов одним запросом::

source: This has a number of caveats though:
ru: Следует упомянуть ряд оговорок:

source: The model's ``save()`` method will not be called, and the ``pre_save`` and ``post_save`` signals will not be sent.
ru: Метод модели ``save()`` не будет вызван, и сигналы ``pre_save`` и ``post_save`` не будут вызваны.

source: It does not work with child models in a multi-table inheritance scenario.
ru: Не работает с дочерними моделями при multi-table наследовании.

source: It does not work with many-to-many relationships.
ru: Не работает со связями многое-ко-многим.

source: Returns an integer representing the number of objects in the database matching the ``QuerySet``. The ``count()`` method never raises exceptions.
ru: Возвращает количество записей в базе данных отвечающем запросу ``QuerySet``. Метод ``count()`` никогда не вызывает исключение.

source: A ``count()`` call performs a ``SELECT COUNT(*)`` behind the scenes, so you should always use ``count()`` rather than loading all of the record into Python objects and calling ``len()`` on the result (unless you need to load the objects into memory anyway, in which case ``len()`` will be faster).
ru: Метод ``count()`` использует ``SELECT COUNT(*)``, так что всегда используйте метод ``count()`` вместо загрузки всех записей в объекты Python и вызов ``len()`` над результатом (если вам кончено в любом случае не понадобится загружать их далее, в таком случае ``len()`` будет быстрее).

source: Note that if you want the number of items in a ``QuerySet`` and are also retrieving model instances from it (for example, by iterating over it), it's probably more efficient to use ``len(queryset)`` which won't cause an extra database query like ``count()`` would.
ru: Обратите внимание, если вам необходимо количество объектов в ``QuerySet`` и сами объекты (например, цикл по ним), возможно эффективнее использовать ``len(queryset)``, чтобы избежать дополнительного запроса при выполнении ``count()``.

source: If you pass ``in_bulk()`` an empty list, you'll get an empty dictionary.
ru: При передаче в ``in_bulk()`` пустого списка будет получен пустой словарь.

source: Evaluates the ``QuerySet`` (by performing the query) and returns an iterator (see :pep:`234`) over the results. A ``QuerySet`` typically caches its results internally so that repeated evaluations do not result in additional queries. In contrast, ``iterator()`` will read results directly, without doing any caching at the ``QuerySet`` level (internally, the default iterator calls ``iterator()`` and caches the return value). For a ``QuerySet`` which returns a large number of objects that you only need to access once, this can result in better performance and a significant reduction in memory.
ru: Вычисляет ``QuerySet`` (выполняя запрос) и возвращает итератор (смотрите :pep:`234`) по результату. ``QuerySet`` обычно кэширует результат и повторное обращение не вызывает повторное выполнение запросов. Метод ``iterator()`` читает результаты непосредственно из базы данных, без кэширования на уровне ``QuerySet`` (итератор по-умолчанию вызывает ``iterator()`` и кэширует возвращенное значение). Для ``QuerySet``, который возвращает большое количество объектов и который будет использован всего лишь один раз, использование этого метода может увеличить производительность и немного уменьшить потребление памяти.

source: Note that using ``iterator()`` on a ``QuerySet`` which has already been evaluated will force it to evaluate again, repeating the query.
ru: Заметим, что использование ``iterator()`` для ``QuerySet``, который уже был вычислен, приведет к повторному вычислению и выполнению запроса к базе данных.

source: Also, use of ``iterator()`` causes previous ``prefetch_related()`` calls to be ignored since these two optimizations do not make sense together.
ru: Заметим, если вы используете ``iterator()`` для выполнения запроса, вызов ``prefetch_related()`` будет проигнорирован т.к. использование этих двух оптимизаций вместе не имеет смысла.

source: This example returns the latest ``Entry`` in the table, according to the ``pub_date`` field::
ru: Этот пример возвращает последний объект ``Entry`` в таблице по полю ``pub_date``::

source: Like :meth:`get()`, ``earliest()`` and ``latest()`` raise :exc:`~django.db.models.Model.DoesNotExist` if there is no object with the given parameters.
ru: Как и :meth:`get()`, ``earliest()`` и ``latest()`` вызывает исключение :exc:`~django.db.models.Model.DoesNotExist`, если объект не найден.

source: Note that ``earliest()`` and ``latest()`` exist purely for convenience and readability.
ru: Заметим что ``earliest()`` и ``latest()`` существует исключительно для удобства и читаемости.

source: Works otherwise like :meth:`~django.db.models.query.QuerySet.latest` except the direction is changed.
ru: Работает как и :meth:`~django.db.models.query.QuerySet.latest` только наоборот.

source: Note that ``first()`` is a convenience method, the following code sample is equivalent to the above example::
ru: ``first()`` создан просто для удобства и аналогичен следующему коду::

source: Works like :meth:`first()`, but returns the last object in the queryset.
ru: Работает как и :meth:`first()`, но возвращает последний объект из выборки.

source: The aggregation functions that are provided by Django are described in `Aggregation Functions`_ below. Since aggregates are also :doc:`query expressions </ref/models/expressions>`, you may combine aggregates with other aggregates or values to create complex aggregates.
ru: Функции агрегации Django описаны в :ref:`aggregation-functions`. Так как они являются :doc:`выражениями запроса </ref/models/expressions>`, вы можете комбинировать функции агрегации друг с другом или значениями, чтобы создать сложные агрегации.

source: Aggregates specified using keyword arguments will use the keyword as the name for the annotation. Anonymous arguments will have a name generated for them based upon the name of the aggregate function and the model field that is being aggregated. Complex aggregates cannot use anonymous arguments and must specify a keyword argument as an alias.
ru: Агрегация, указанная с помощью именованного аргумента, использует имя аргумента как название ключа в возвращаемом словаре. Для анонимных аргументов названия ключей будут созданы из названия функции агрегации и названия поля модели используемого в агрегации данных. Сложные агрегации не могут использовать анонимные аргументы и вы должны указать именованные.

source: For example, when you are working with blog entries, you may want to know the number of authors that have contributed blog entries::
ru: Например, работая с записями блога, вы возможно захотите узнать сколько записей в выбранных через ``QuerySet`` блогах::

source: By using a keyword argument to specify the aggregate function, you can control the name of the aggregation value that is returned::
ru: Используя именованный аргумент для определения функции агрегации, вы можете указать название возвращаемого значения::

source: Returns ``True`` if the :class:`.QuerySet` contains any results, and ``False`` if not. This tries to perform the query in the simplest and fastest way possible, but it *does* execute nearly the same query as a normal :class:`.QuerySet` query.
ru: Возвращает ``True`` если :class:`.QuerySet` содержит какой-либо результат, иначе - ``False``. Выполняет на столько простой и быстрый запрос, на сколько это возможно, почти идентичный обычному запросу :class:`.QuerySet`.

source: :meth:`~.QuerySet.exists` is useful for searches relating to both object membership in a :class:`.QuerySet` and to the existence of any objects in a :class:`.QuerySet`, particularly in the context of a large :class:`.QuerySet`.
ru: :meth:`~.QuerySet.exists` полезен для определения нахождения объекта в :class:`.QuerySet` и наличия какого-либо объекта в :class:`.QuerySet`, особенно для больших :class:`.QuerySet`.

source: The most efficient method of finding whether a model with a unique field (e.g. ``primary_key``) is a member of a :class:`.QuerySet` is::
ru: Самый эффективный способ определить принадлежит ли объект с уникальным полем (например, ``primary_key``) какому-либо :class:`.QuerySet`::

source: Which will be faster than the following which requires evaluating and iterating through the entire queryset::
ru: Что будет на много быстрее, чем получение и итерация по всему результату::

source: And to find whether a queryset contains any items::
ru: И для определения есть ли какой-либо объект в результате::

source: Which will be faster than::
ru: Это будет быстрее чем::

source: ... but not by a large degree (hence needing a large queryset for efficiency gains).
ru: ... но не на много(разве что результат содержит большое количество записей).

source: Additionally, if a ``some_queryset`` has not yet been evaluated, but you know that it will be at some point, then using ``some_queryset.exists()`` will do more overall work (one query for the existence check plus an extra one to later retrieve the results) than simply using ``bool(some_queryset)``, which retrieves the results and then checks if any were returned.
ru: Если ``some_queryset`` не был еще вычислен, но вы точно знаете что будет вычислен в любом случае, тогда вызов ``some_query_set.exists()`` выполнит больше работы (один запрос для проверки наличия данных и один для получения данных) чем просто ``bool(some_queryset)``, который получит результат и проверит не пустой ли он.

source: Performs an SQL update query for the specified fields, and returns the number of rows matched (which may not be equal to the number of rows updated if some rows already have the new value).
ru: Выполняет SQL запрос, обновляющий данные указанных полей и возвращает количество измененных записей(которое может быть не равно количеству обновленных записей, если некоторые из них уже содержали новое значение).

source: For example, to turn comments off for all blog entries published in 2010, you could do this::
ru: Например, чтобы отключить комментарии для всех записей опубликованных в 2010 годы, нужно выполнить такой запрос::

source: (This assumes your ``Entry`` model has fields ``pub_date`` and ``comments_on``.)
ru: (Пример подразумевает что модель ``Entry`` содержит поля ``pub_date`` и ``comments_on``.)

source: You can update multiple fields — there's no limit on how many. For example, here we update the ``comments_on`` and ``headline`` fields::
ru: Вы можете изменить несколько полей — нет ограничения на количество полей. Например, изменим поля ``comments_on`` и ``headline``::

source: The ``update()`` method is applied instantly, and the only restriction on the :class:`.QuerySet` that is updated is that it can only update columns in the model's main table, not on related models. You can't do this, for example::
ru: Метод ``update()`` выполняет запрос сразу после вызова метода. Единственное ограничение для :class:`.QuerySet` это то, что могут быть изменены поля только главной модели, а не связанной. Вы не можете сделать такое::

source: Filtering based on related fields is still possible, though::
ru: Однако вы можете использовать фильтры по полям связанной модели::

source: You cannot call ``update()`` on a :class:`.QuerySet` that has had a slice taken or can otherwise no longer be filtered.
ru: Метод ``update()`` не может быть вызван для :class:`.QuerySet` с примененным срезом, или который не может быть отфильтрован по какой-либо другой причине.

source: The ``update()`` method returns the number of affected rows::
ru: Метод ``update()`` возвращает количество измененных записей::

source: If you're just updating a record and don't need to do anything with the model object, the most efficient approach is to call ``update()``, rather than loading the model object into memory. For example, instead of doing this::
ru: Если вам нужно всего лишь изменить запись и не нужно ничего делать с объектом модели, более эффективно использовать метод ``update()``, чем загружать объект в память. Например, вместо этого::

source: ...do this::
ru: ...делайте так::

source: Using ``update()`` also prevents a race condition wherein something might change in your database in the short period of time between loading the object and calling ``save()``.
ru: Использование ``update()`` также предотвращает ситуации, когда что-то может быть изменено в базе данных в тот короткий период времени между загрузкой данных и вызовом ``save()``.

source: Finally, realize that ``update()`` does an update at the SQL level and, thus, does not call any ``save()`` methods on your models, nor does it emit the :attr:`~django.db.models.signals.pre_save` or :attr:`~django.db.models.signals.post_save` signals (which are a consequence of calling :meth:`Model.save() <django.db.models.Model.save>`). If you want to update a bunch of records for a model that has a custom :meth:`~django.db.models.Model.save()` method, loop over them and call :meth:`~django.db.models.Model.save()`, like this::
ru: Учтите, что метод ``update()`` использует непосредственно SQL запрос. Метод ``save()`` модели не будет вызван, сигналы :attr:`~django.db.models.signals.pre_save` или :attr:`~django.db.models.signals.post_save` не будут вызваны (которые являются следствием вызова :meth:`Model.save() <django.db.models.Model.save>`). Если вы хотите обновить объекты модели с переопределенным методом :meth:`~django.db.models.Model.save()`, пройдитесь по каждому и вызовите метод :meth:`~django.db.models.Model.save()`, например::

source: Performs an SQL delete query on all rows in the :class:`.QuerySet` and returns the number of objects deleted and a dictionary with the number of deletions per object type.
ru: Выполняет SQL запрос для удаления записей в :class:`.QuerySet` и возвращает количество удаленных объектов, и словарь с количеством удаленных объектов для каждого типа объекта.

source: The ``delete()`` is applied instantly. You cannot call ``delete()`` on a :class:`.QuerySet` that has had a slice taken or can otherwise no longer be filtered.
ru: Метод ``delete()`` выполняют запрос сразу после вызова метода. Метод ``delete()`` не может быть выполнен для :class:`.QuerySet`, к которому был применен срез или который не может быть отфильтрован по любой другой причине.

source: For example, to delete all the entries in a particular blog::
ru: Например, удалим все записи для определенного блога::

source: By default, Django's :class:`~django.db.models.ForeignKey` emulates the SQL constraint ``ON DELETE CASCADE`` — in other words, any objects with foreign keys pointing at the objects to be deleted will be deleted along with them. For example::
ru: По-умолчанию, Django для :class:`~django.db.models.ForeignKey` эмулирует поведение ``ON DELETE CASCADE`` в SQL — другими словами, объекты, имеющие внешние ключи на удаляемый объект, будут удалены. Например::

source: This cascade behavior is customizable via the :attr:`~django.db.models.ForeignKey.on_delete` argument to the :class:`~django.db.models.ForeignKey`.
ru: Такое каскадное поведение можно настроить, используя аргумент :attr:`~django.db.models.ForeignKey.on_delete` для поля :class:`~django.db.models.ForeignKey`.

source: The ``delete()`` method does a bulk delete and does not call any ``delete()`` methods on your models. It does, however, emit the :data:`~django.db.models.signals.pre_delete` and :data:`~django.db.models.signals.post_delete` signals for all deleted objects (including cascaded deletions).
ru: Метод ``delete()`` выполняет массовое удаление и не вызывает метод ``delete()`` модели. Однако, будут вызваны сигналы :data:`~django.db.models.signals.pre_delete` и :data:`~django.db.models.signals.post_delete` для всех удаленных объектов (включая объекты, удаленные каскадным удалением).

source: Django needs to fetch objects into memory to send signals and handle cascades. However, if there are no cascades and no signals, then Django may take a fast-path and delete objects without fetching into memory. For large deletes this can result in significantly reduced memory usage. The amount of executed queries can be reduced, too.
ru: Django необходимо загрузить все объекты в память и послать сигнал для каскадной обработки. Однако, если нет необходимости в посылании сигнала для каскадного поведения, Django может удалить объекты без загрузки в память. При удалении большого количества объектов, можно значительно сократить количество используемой памяти. Также сократится количество запросов.

source: ForeignKeys which are set to :attr:`~django.db.models.ForeignKey.on_delete` ``DO_NOTHING`` do not prevent taking the fast-path in deletion.
ru: Внешние ключи со значением :attr:`~django.db.models.ForeignKey.on_delete` ``DO_NOTHING`` не мешают быстрому удалению.

source: Note that the queries generated in object deletion is an implementation detail subject to change.
ru: Заметим, что запросы, созданные при удалении объектов не обсуждаются т.к. являются деталями реализации Django.
