Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/ref/models/querysets.po
Languages: ru

source: Be careful when using the ``tables`` parameter if you're specifying tables that are already used in the query. When you add extra tables via the ``tables`` parameter, Django assumes you want that table included an extra time, if it is already included. That creates a problem, since the table name will then be given an alias. If a table appears multiple times in an SQL statement, the second and subsequent occurrences must use aliases so the database can tell them apart. If you're referring to the extra table you added in the extra ``where`` parameter this is going to cause errors.
ru: Будьте внимательны при добавлении в параметр ``tables`` таблиц, которые уже используются запросом. В таком случае Django предполагает, что вы хотите добавить их повторно. Это создает проблему, т.к. таблица будет добавлена с псевдонимом(an alias). Если таблица несколько раз используется в запросе, второй и последующие вхождения должны использовать псевдонимы, чтобы база данных могла различить их. При обращении к добавленной таблице в параметре ``where`` вы получите ошибку.

source: Normally you'll only be adding extra tables that don't already appear in the query. However, if the case outlined above does occur, there are a few solutions. First, see if you can get by without including the extra table and use the one already in the query. If that isn't possible, put your ``extra()`` call at the front of the queryset construction so that your table is the first use of that table. Finally, if all else fails, look at the query produced and rewrite your ``where`` addition to use the alias given to your extra table. The alias will be the same each time you construct the queryset in the same way, so you can rely upon the alias name to not change.
ru: Скорее всего вы будете использовать дополнительные таблицы, которые еще не добавлены в запрос. Однако, если все таки возникнет описанная выше ситуация, существует несколько способов ее решить. Первый, посмотрите возможно ли использовать уже добавленную в запрос таблицу. Если это не возможно, используйте вызов ``extra()`` в начале конструкции запроса, чтобы ваша таблица использовалась первой. В конце концов, если каким-то образом все остальное вам не помогло, посмотрите на созданный запрос и перепишите параметр ``where`` таким образом, чтобы использовался псевдоним назначенный дополнительной таблице. При одинаковом способе создать запрос псевдоним будет всегда не измененным.

source: If you need to order the resulting queryset using some of the new fields or tables you have included via ``extra()`` use the ``order_by`` parameter to ``extra()`` and pass in a sequence of strings. These strings should either be model fields (as in the normal :meth:`order_by()` method on querysets), of the form ``table_name.column_name`` or an alias for a column that you specified in the ``select`` parameter to ``extra()``.
ru: Если вам необходимо отсортировать полученный ``QuerySet`` используя новые поля или таблицы, которые вы добавили через ``extra()``, используйте параметр ``order_by`` передав последовательность строк. Эти строки должны быть полями модели (как и в обычном методе :meth:`order_by()`), в формате ``table_name.column_name`` или псевдонимы колонок которые вы указали в параметре ``select`` при вызове ``extra()``.

source: This would sort all the items for which ``is_recent`` is true to the front of the result set (``True`` sorts before ``False`` in a descending ordering).
ru: Это запрос должен отсортировать все записи, у которых ``is_recent`` равен ``True``, перед остальными записями (``True`` следует перед ``False`` при ниспадающей сортировке).

source: This shows, by the way, that you can make multiple calls to ``extra()`` and it will behave as you expect (adding new constraints each time).
ru: Вы можете заметить, между прочим, что можно выполнить несколько вызовов ``extra()`` (добавляя новые параметры каждый раз).

source: The ``where`` parameter described above may use standard Python database string placeholders — ``'%s'`` to indicate parameters the database engine should automatically quote. The ``params`` argument is a list of any extra parameters to be substituted.
ru: Параметр ``where`` описанный выше может использовать стандартный синтаксис Python подстановки параметров в строку — ``'%s'``, чтобы указать какие параметры должны быть экранированы базой данных. Аргумент ``params`` это список дополнительных параметров, которые будут подставлены в условие ``where``.

source: Always use ``params`` instead of embedding values directly into ``where`` because ``params`` will ensure values are quoted correctly according to your particular backend. For example, quotes will be escaped correctly.
ru: Всегда используйте ``params`` вместо добавления значений непосредственно в ``where`` т.к. ``params`` гарантирует, что все значения будут экранированы в соответствиями с синтаксисом используемой базы данных. Например, кавычки будут экранированы правильно.

source: Bad::
ru: Не верно::

source: Good::
ru: Верно::

source: If you are performing queries on MySQL, note that MySQL's silent type coercion may cause unexpected results when mixing types. If you query on a string type column, but with an integer value, MySQL will coerce the types of all values in the table to an integer before performing the comparison. For example, if your table contains the values ``'abc'``, ``'def'`` and you query for ``WHERE mycolumn=0``, both rows will match. To prevent this, perform the correct typecasting before using the value in a query.
ru: Выполняя запрос в MySQL, обратите внимание на преобразование типов. Если вы выполняете запрос по текстовому полю, но используете числовое значение, MySQL преобразует все значения поля в число перед сравнением. Например, если таблица содержит значения ``'abc'``, ``'def'`` и в запросе ``WHERE mycolumn=0``, обе строки попадут в результат. Чтобы избежать этого, используйте значение правильного типа в запросе.

source: In some complex data-modeling situations, your models might contain a lot of fields, some of which could contain a lot of data (for example, text fields), or require expensive processing to convert them to Python objects. If you are using the results of a queryset in some situation where you don't know if you need those particular fields when you initially fetch the data, you can tell Django not to retrieve them from the database.
ru: При сложной структуре данных модели могут содержать большое количество полей, некоторые из которых могут содержать большие объемы данных(например, текстовые поля), или использовать ресурсоемкий процесс преобразования данных в объекты Python. Если вы точно знаете, что данные этих полей не будут использоваться при работе с результатами запроса, вы можете указать Django не выбирать эти поля из базы данных.

source: This is done by passing the names of the fields to not load to ``defer()``::
ru: Это делается передачей названия полей, которые не должны быть загружены, в метод ``defer()``::

source: A queryset that has deferred fields will still return model instances. Each deferred field will be retrieved from the database if you access that field (one at a time, not all the deferred fields at once).
ru: Результат все также будет содержать объекты модели. Каждое не выбранное поле будет получено из базы данных при обращении к нему (одна за раз, не все "отложенные" поля сразу).

source: You can make multiple calls to ``defer()``. Each call adds new fields to the deferred set::
ru: Вы можете выполнить несколько вызовов ``defer()``. Каждый вызов добавит новые поля в список "отложенных"::

source: The order in which fields are added to the deferred set does not matter. Calling ``defer()`` with a field name that has already been deferred is harmless (the field will still be deferred).
ru: Порядок добавления полей не имеет значения. Вызов ``defer()`` с полем, которое уже было добавлено в список "отложенных", ничего не изменит (поле все также не будет выбираться из базы данных).

source: You can defer loading of fields in related models (if the related models are loading via :meth:`select_related()`) by using the standard double-underscore notation to separate related fields::
ru: Вы можете указать поля связанных моделей (если эти модели загружаются через :meth:`select_related()`) используя стандартный синтаксис двух нижних подчеркиваний для разделения полей::

source: If you want to clear the set of deferred fields, pass ``None`` as a parameter to ``defer()``::
ru: Если вы хотите очистить список "отложенных" полей, передайте ``None`` как параметр для ``defer()``::

source: Some fields in a model won't be deferred, even if you ask for them. You can never defer the loading of the primary key. If you are using :meth:`select_related()` to retrieve related models, you shouldn't defer the loading of the field that connects from the primary model to the related one, doing so will result in an error.
ru: Некоторые поля всегда будут выбираться из базы данных, даже если вы их добавите в вызов ``defer()``. Всегда выбирается первичный ключ. Используя :meth:`select_related()` для получения связанных моделей, не "откладывайте" загрузку связывающего поля иначе получите ошибку.

source: The ``defer()`` method (and its cousin, :meth:`only()`, below) are only for advanced use-cases. They provide an optimization for when you have analyzed your queries closely and understand *exactly* what information you need and have measured that the difference between returning the fields you need and the full set of fields for the model will be significant.
ru: Метод ``defer()`` (и его "коллега" :meth:`only()`) предназначены только для опытных пользователей. Они предоставляют возможность оптимизировать запрос. Но для начала вам следует проанализировать его, *точно* определить какие данные вам необходимы и удостовериться, что разница между получением всех полей и получением определенных, будет значительной.

source: Even if you think you are in the advanced use-case situation, **only use defer() when you cannot, at queryset load time, determine if you will need the extra fields or not**. If you are frequently loading and using a particular subset of your data, the best choice you can make is to normalize your models and put the non-loaded data into a separate model (and database table). If the columns *must* stay in the one table for some reason, create a model with ``Meta.managed = False`` (see the :attr:`managed attribute <django.db.models.Options.managed>` documentation) containing just the fields you normally need to load and use that where you might otherwise call ``defer()``. This makes your code more explicit to the reader, is slightly faster and consumes a little less memory in the Python process.
ru: Даже если вы думаете, что у вас сложная ситуация требующая использовать ``defer()``, используйте его только будучи уверенным, что "отложенные" поля не понадобятся далее в коде. Если вы часто загружаете и используете только часть полей, лучшим решением будет нормализировать модели и вынести не загружаемые поля в отдельную модель(и таблицу базы данных). Если поля *должны* по каким-то причинам находится в одной таблице, создайте модель с ``Meta.managed = False`` (смотрите документацию о :attr:`managed attribute <django.db.models.Options.managed>`) содержащую только используемые поля, и используйте ее вместо ``defer()``. Это делает ваш код более читабельным, немного быстрее и экономит немного памяти используемой процессом Python.

source: For example, both of these models use the same underlying database table::
ru: Например, обе эти модели используют одну таблицу в базе данных::

source: If many fields need to be duplicated in the unmanaged model, it may be best to create an abstract model with the shared fields and then have the unmanaged and managed models inherit from the abstract model.
ru: Если необходимо продублировать большое количество полей, возможно лучше создать абстрактную модель со всеми полями, и наследовать обе модели от неё.

source: When calling :meth:`~django.db.models.Model.save()` for instances with deferred fields, only the loaded fields will be saved. See :meth:`~django.db.models.Model.save()` for more details.
ru: При вызове :meth:`~django.db.models.Model.save()` для объектов с отложенными полями, только загруженные поля будут сохранены. Подробности смотрите в описании :meth:`~django.db.models.Model.save()`.

source: The ``only()`` method is more or less the opposite of :meth:`defer()`. You call it with the fields that should *not* be deferred when retrieving a model. If you have a model where almost all the fields need to be deferred, using ``only()`` to specify the complementary set of fields can result in simpler code.
ru: Метод ``only()``-- противоположность метода :meth:`defer()`. Вызывайте его с полями, получение которых *не* должно быть отложено. Если у вас есть модель, почти все поля которой не должны выбираться из базы данных, используйте ``only()``. Это сделает ваш код проще.

source: Suppose you have a model with fields ``name``, ``age`` and ``biography``. The following two querysets are the same, in terms of deferred fields::
ru: Например, у вас есть модель с полями ``name``, ``age`` и ``biography``. Эти два запроса идентичны в плане полученных полей::

source: Whenever you call ``only()`` it *replaces* the set of fields to load immediately. The method's name is mnemonic: **only** those fields are loaded immediately; the remainder are deferred. Thus, successive calls to ``only()`` result in only the final fields being considered::
ru: При вызове ``only()`` будет *заменено* множество загружаемых полей. Название метода говорит само за себя: **только** эти поля должны быть загружены; все остальные -- "отложены". Таким образом при последовательном вызове ``only()`` несколько раз, только поля из последнего вызова будут загружены::

source: Since ``defer()`` acts incrementally (adding fields to the deferred list), you can combine calls to ``only()`` and ``defer()`` and things will behave logically::
ru: Так как ``defer()`` добавляет поля в список "отложенных" при множественном вызове, вы можете совмещать вызовы ``only()`` и ``defer()``, что будет работать вполне логично::

source: All of the cautions in the note for the :meth:`defer` documentation apply to ``only()`` as well. Use it cautiously and only after exhausting your other options.
ru: Все замечания описанные для метода :meth:`defer` применимы и к методу ``only()``. Используйте его с осторожностью и только в отсутствии других вариантов.

source: Using :meth:`only` and omitting a field requested using :meth:`select_related` is an error as well.
ru: При использовании :meth:`only` без полей, указанных в :meth:`select_related`, будет вызвано исключение.

source: This method is for controlling which database the ``QuerySet`` will be evaluated against if you are using more than one database. The only argument this method takes is the alias of a database, as defined in :setting:`DATABASES`.
ru: Этот метод контролирует какую базу данных будет использовать ``QuerySet`` для запроса, если вы используете несколько баз данных. Единственный аргумент это псевдоним базы данных указанный в настройке проекта :setting:`DATABASES`.

source: Returns a queryset that will lock rows until the end of the transaction, generating a ``SELECT ... FOR UPDATE`` SQL statement on supported databases.
ru: Возвращает ``QuerySet``, блокирующий записи до завершения транзакции, используя оператор SQL ``SELECT ... FOR UPDATE`` используемой базы данных.

source: All matched entries will be locked until the end of the transaction block, meaning that other transactions will be prevented from changing or acquiring locks on them.
ru: Все, удовлетворяющие фильтрам, строки будут заблокированы до завершения транзакции, то есть другие транзакции не смогут изменить или заблокировать это строки.

source: Evaluating a queryset with ``select_for_update()`` in autocommit mode on backends which support ``SELECT ... FOR UPDATE`` is a :exc:`~django.db.transaction.TransactionManagementError` error because the rows are not locked in that case. If allowed, this would facilitate data corruption and could easily be caused by calling code that expects to be run in a transaction outside of one.
ru: Выполнение выборки с ``select_for_update()`` в autocommit режиме для бэкенда, который поддерживает ``SELECT ... FOR UPDATE``, вызовет :exc:`~django.db.transaction.TransactionManagementError` т.к. строки не будут заблокированы в этом случае. Если разрешить такое выполнение, это может привести к повреждению данных т.к. код рассчитывает, что будет выполнен в транзакции, хотя это не так.

source: Using ``select_for_update()`` on backends which do not support ``SELECT ... FOR UPDATE`` (such as SQLite) will have no effect. ``SELECT ... FOR UPDATE`` will not be added to the query, and an error isn't raised if ``select_for_update()`` is used in autocommit mode.
ru: Использование ``select_for_update()`` с базой данных, которая не поддерживает ``SELECT ... FOR UPDATE`` (например, SQLite) не будет иметь никакого эффекта. ``SELECT ... FOR UPDATE`` не будет добавлено к запросу, и ошибка не будет вызвана, если ``select_for_update()`` используется в autocommit режиме.

source: Although ``select_for_update()`` normally fails in autocommit mode, since :class:`~django.test.TestCase` automatically wraps each test in a transaction, calling ``select_for_update()`` in a ``TestCase`` even outside an :func:`~django.db.transaction.atomic()` block will (perhaps unexpectedly) pass without raising a ``TransactionManagementError``. To properly test ``select_for_update()`` you should use :class:`~django.test.TransactionTestCase`.
ru: Хотя ``select_for_update()`` вызывает ошибку в autocommit режиме, т.к. :class:`~django.test.TestCase` автоматически использует транзакцию для каждого теста, вызов ``select_for_update()`` в ``TestCase`` даже вне блока :func:`~django.db.transaction.atomic()` будет выполнен без ошибки ``TransactionManagementError``. Для правильного тестирования ``select_for_update()`` используйте :class:`~django.test.TransactionTestCase`.

source: Takes a raw SQL query, executes it, and returns a ``django.db.models.query.RawQuerySet`` instance. This ``RawQuerySet`` instance can be iterated over just like an normal ``QuerySet`` to provide object instances.
ru: Принимает SQL запрос, выполняет его и возвращает объект ``django.db.models.query.RawQuerySet``. Этот объект ``RawQuerySet`` может быть проитерирован как и обычный ``QuerySet`` для получения объектов результата.

source: See the :doc:`/topics/db/sql` for more information.
ru: Смотрите :doc:`/topics/db/sql`.

source: ``raw()`` always triggers a new query and doesn't account for previous filtering. As such, it should generally be called from the ``Manager`` or from a fresh ``QuerySet`` instance.
ru: ``raw()`` всегда выполняет новый запрос к базе данных и игнорирует предыдущую фильтрацию. Поэтому следует вызывать его из ``Manager`` или чистого объекта ``QuerySet``.

source: The following ``QuerySet`` methods evaluate the ``QuerySet`` and return something *other than* a ``QuerySet``.
ru: Следующие методы выполняют ``QuerySet`` и возвращают *не* ``QuerySet``.

source: These methods do not use a cache (see :ref:`caching-and-querysets`). Rather, they query the database each time they're called.
ru: Эти методы не используют кэш (смотрите :ref:`caching-and-querysets`) и выполняют запрос к базе данных при каждом вызове.

source: Returns the object matching the given lookup parameters, which should be in the format described in `Field lookups`_.
ru: Возвращает объект соответствующий параметрам поиска, которые должны быть указанны в формате описанном в :ref:`разделе о параметрах поиска <field-lookups>`

source: ``get()`` raises :exc:`~django.core.exceptions.MultipleObjectsReturned` if more than one object was found. The :exc:`~django.core.exceptions.MultipleObjectsReturned` exception is an attribute of the model class.
ru: ``get()`` вызывает исключение :exc:`~django.core.exceptions.MultipleObjectsReturned`, если найдено более одно объекта. :exc:`~django.core.excpetions.MultipleObjectsReturned` -- атрибут класса модели.

source: ``get()`` raises a :exc:`~django.db.models.Model.DoesNotExist` exception if an object wasn't found for the given parameters. This exception is an attribute of the model class. Example::
ru: ``get()`` вызывает исключение :exc:`~django.db.models.Model.DoesNotExist`, если ни один объект не был найден. Это исключение также атрибут класса модели. Например::

source: The :exc:`~django.db.models.Model.DoesNotExist` exception inherits from :exc:`django.core.exceptions.ObjectDoesNotExist`, so you can target multiple :exc:`~django.db.models.Model.DoesNotExist` exceptions. Example::
ru: Исключение :exc:`~django.db.models.Model.DoesNotExist` унаследовано от :exc:`django.core.exceptions.ObjectDoesNotExist`,таким образом можно обработать несколько исключений :exc:`~django.db.models.Model.DoesNotExist`. Например::

source: A convenience method for creating an object and saving it all in one step. Thus::
ru: Удобный метод чтобы создать и сохранить объект. Таким образом::

source: and::
ru: и::

source: are equivalent.
ru: эквивалентны.

source: The :ref:`force_insert <ref-models-force-insert>` parameter is documented elsewhere, but all it means is that a new object will always be created. Normally you won't need to worry about this. However, if your model contains a manual primary key value that you set and if that value already exists in the database, a call to ``create()`` will fail with an :exc:`~django.db.IntegrityError` since primary keys must be unique. Be prepared to handle the exception if you are using manual primary keys.
ru: Параметр :ref:`force_insert <ref-models-force-insert>` описан в другом разделе, он означает, что всегда будет создаваться новый объект. Обычно вам не нужно беспокоиться об этом. Однако, если ваш объект содержит значение первичного ключа и этот ключ уже существует в базе данных, метод ``create()`` вызовет исключение :exc:`~django.db.IntegrityError` т.к. первичный ключ должен быть уникальным. Будьте готовы обработать исключение, если вы самостоятельно указываете первичный ключ.

source: A convenience method for looking up an object with the given ``kwargs`` (may be empty if your model has defaults for all fields), creating one if necessary.
ru: Удобный метод для поиска объекта по заданным параметрам поиска ``kwargs`` (может быть пустым, если все поля содержат значения по умолчанию), и создания нового при необходимости.

source: Returns a tuple of ``(object, created)``, where ``object`` is the retrieved or created object and ``created`` is a boolean specifying whether a new object was created.
ru: Возвращает кортеж ``(object, created)``, где ``object`` полученный или созданный объект и ``created`` -- булево значение, указывающее был ли создан объект.

source: This is meant as a shortcut to boilerplatish code. For example::
ru: Этот метод удобно использовать для скриптов импорта данных. Например::

source: This pattern gets quite unwieldy as the number of fields in a model goes up. The above example can be rewritten using ``get_or_create()`` like so::
ru: Такой способ становится весьма громоздким при увеличении количества полей модели. Пример выше может быть переписан с использованием метода ``get_or_create()``::
