Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/ref/models/querysets.po
Languages: ru

source: When using ``to_attr`` the prefetched result is stored in a list. This can provide a significant speed improvement over traditional ``prefetch_related`` calls which store the cached result within a ``QuerySet`` instance.
ru: При использовании ``to_attr`` результат сохраняется в списке. Это может ускорить работу ``prefetch_related`` т.к. по умолчанию результат сохраняется в кэше объекта ``QuerySet``.
