Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/ref/models/querysets.po
Languages: ru

source: Class method that returns an instance of :class:`~django.db.models.Manager` with a copy of the ``QuerySet``’s methods. See :ref:`create-manager-with-queryset-methods` for more details.
ru: Метод класса, который возвращает экземпляр :class:`~django.db.models.Manager`, который содержит копию методов ``QuerySet``. Смотрите :ref:`create-manager-with-queryset-methods`.

source: Field lookups are how you specify the meat of an SQL ``WHERE`` clause. They're specified as keyword arguments to the ``QuerySet`` methods :meth:`filter()`, :meth:`exclude()` and :meth:`get()`.
ru: Операторы фильтрации используются для создания оператора ``WHERE`` в SQL. Они используются как именованные аргументы для методов ``QuerySet``: :meth:`filter()`, :meth:`exclude()` и :meth:`get()`.

source: For an introduction, see :ref:`models and database queries documentation <field-lookups-intro>`.
ru: Введение смотрите в разделе о :ref:`моделях и выполнении запросов к базе данных <field-lookups-intro>`.

source: Django's built-in lookups are listed below. It is also possible to write :doc:`custom lookups </howto/custom-lookups>` for model fields.
ru: Встроенные операторы фильтрации представлены ниже. Также можно создать :doc:`собственный фильтр </howto/custom-lookups>` для поля модели.

source: As a convenience when no lookup type is provided (like in ``Entry.objects.get(id=14)``) the lookup type is assumed to be :lookup:`exact`.
ru: По умолчанию, если тип фильтра явно не указан (например, ``Entry.objects.get(id=14)``), подразумевается :lookup:`exact`.

source: Exact match. If the value provided for comparison is ``None``, it will be interpreted as an SQL ``NULL`` (see :lookup:`isnull` for more details).
ru: Точное совпадение. Если передано значение ``None``, оно будет интерпретировано как SQL ``NULL`` (смотрите подробности в описании :lookup:`isnull`).

source: SQL equivalents::
ru: Аналог SQL::

source: MySQL comparisons
ru: Сравнение в MySQL

source: In MySQL, a database table's "collation" setting determines whether ``exact`` comparisons are case-sensitive. This is a database setting, *not* a Django setting. It's possible to configure your MySQL tables to use case-sensitive comparisons, but some trade-offs are involved. For more information about this, see the :ref:`collation section <mysql-collation>` in the :doc:`databases </ref/databases>` documentation.
ru: В MySQL, настройка "collation" таблицы базы данных определяет будет ли использовано регистрозависимое сравнение для ``exact``. Это настройка базы данных, *не* Django. Можно настроить регистрозависимое сравнение для таблиц MySQL. Подробности смотрите в :ref:`разделе о сравнении <mysql-collation>` документации о :doc:`базах данных </ref/databases>`.

source: Case-insensitive exact match. If the value provided for comparison is ``None``, it will be interpreted as an SQL ``NULL`` (see :lookup:`isnull` for more details).
ru: Точное совпадение, регистро-независимое. Если передано значение ``None``, оно будет интерпретировано как SQL ``NULL`` (смотрите подробности в описании :lookup:`isnull`).

source: Note the first query will match ``'Beatles Blog'``, ``'beatles blog'``, ``'BeAtLes BLoG'``, etc.
ru: Обратите внимание, будет найден ``'Beatles Blog'``, ``'beatles blog'``, ``'BeAtLes BLoG'`` и тд.

source: SQLite users
ru: Пользователям SQLite

source: Case-sensitive containment test.
ru: Регистрозависимая проверка на вхождение.

source: SQL equivalent::
ru: Аналог SQL::

source: Note this will match the headline ``'Lennon honored today'`` but not ``'lennon honored today'``.
ru: Заметим, что будет найдена строка ``'Lennon honored today'``, но не ``'lennon honored today'``.

source: SQLite doesn't support case-sensitive ``LIKE`` statements; ``contains`` acts like ``icontains`` for SQLite. See the :ref:`database note <sqlite-string-matching>` for more information.
ru: SQLite не поддерживает регистрозависимый оператор ``LIKE``; ``contains`` работает так же как и ``icontains`` для SQLite. Смотрите :ref:`замечание о сравнении строк в SQLite <sqlite-string-matching>`.

source: Case-insensitive containment test.
ru: Регистронезависимая проверка на вхождение.

source: You can also use a queryset to dynamically evaluate the list of values instead of providing a list of literal values::
ru: Вы можете также передать ``QuerySet`` для получения списка значений::

source: This queryset will be evaluated as subselect statement::
ru: Он будет использован как подзапрос::

source: If you pass in a ``QuerySet`` resulting from ``values()`` or ``values_list()`` as the value to an ``__in`` lookup, you need to ensure you are only extracting one field in the result. For example, this will work (filtering on the blog names)::
ru: Передавая в ``QuerySet``, который является результат вызова ``values()`` или ``values_list()``, как аргумент для фильтра ``__in``, вы должны быть уверенным, что результат содержит данные только одного поля. Например, этот код будет работать (фильтр по названиям блога)::

source: This example will raise an exception, since the inner query is trying to extract two field values, where only one is expected::
ru: Этот пример вызовет исключение т.к. подзапрос выбирает два поля в то время, как ожидается одно::

source: Performance considerations
ru: О производительности

source: Be cautious about using nested queries and understand your database server's performance characteristics (if in doubt, benchmark!). Some database backends, most notably MySQL, don't optimize nested queries very well. It is more efficient, in those cases, to extract a list of values and then pass that into the second query. That is, execute two queries instead of one::
ru: Будьте осторожны при использовании вложенных запросов и учитывайте производительность вышей базы данных (если сомневаетесь, протестируйте его!). Некоторые типы баз данных, особенно MySQL, не очень хорошо оптимизируют вложенные запросы. В таком случае более эффективно получить список значений первым запросом и передать в другой::

source: Note the ``list()`` call around the Blog ``QuerySet`` to force execution of the first query. Without it, a nested query would be executed, because :ref:`querysets-are-lazy`.
ru: Отметим использование ``list()`` с первым ``QuerySet``, чтобы спровоцировать выполнение запроса. Без этого, он будет использован как подзапрос т.к. :ref:`querysets-are-lazy`.

source: Greater than.
ru: Больше чем.

source: Greater than or equal to.
ru: Больше чем или равно.

source: Less than.
ru: Меньше чем.

source: Less than or equal to.
ru: Меньше чем или равно.

source: Case-sensitive starts-with.
ru: Регистрозависимая проверка начинается ли поле с указанного значения.

source: SQLite doesn't support case-sensitive ``LIKE`` statements; ``startswith`` acts like ``istartswith`` for SQLite.
ru: SQLite не поддерживает регистрозависимый оператор ``LIKE``; ``startswith`` работает так же как и ``istartswith`` для SQLite.

source: Case-insensitive starts-with.
ru: Регистронезависимая проверка начинается ли поле с указанного значения.

source: Case-sensitive ends-with.
ru: Регистрозависимая проверка оканчивается ли поле с указанного значения.

source: SQLite doesn't support case-sensitive ``LIKE`` statements; ``endswith`` acts like ``iendswith`` for SQLite. Refer to the :ref:`database note <sqlite-string-matching>` documentation for more.
ru: SQLite не поддерживает регистрозависимый оператор ``LIKE``; ``endswith`` работает так же как и ``iendswith`` для SQLite. Смотрите :ref:`замечание о сравнении строк в SQLite <sqlite-string-matching>`.

source: Case-insensitive ends-with.
ru: Регистронезависимая проверка оканчивается ли поле с указанного значения.

source: Range test (inclusive).
ru: Проверка на вхождение в диапазон (включающий).

source: You can use ``range`` anywhere you can use ``BETWEEN`` in SQL — for dates, numbers and even characters.
ru: Вы можете использовать ``range`` там же, где можно использовать ``BETWEEN`` в SQL — для дат, чисел и даже строк.

source: Filtering a ``DateTimeField`` with dates won't include items on the last day, because the bounds are interpreted as "0am on the given date". If ``pub_date`` was a ``DateTimeField``, the above expression would be turned into this SQL::
ru: Фильтрация ``DateTimeField`` по датам не включит записи последнего дня, так как границы интерпретируются как "00:00 указанного дня". Если ``pub_date`` было ``DateTimeField``, мы бы получили следующий SQL запрос::

source: Generally speaking, you can't mix dates and datetimes.
ru: В общем вы не можете использовать date и datetime вместе.

source: For datetime fields, casts the value as date. Allows chaining additional field lookups. Takes a date value.
ru: Для поля даты и времени преобразует значение в дату. Позволяет использовать дополнительные проверки поля. Принимает дату.

source: (No equivalent SQL code fragment is included for this lookup because implementation of the relevant query varies among different database engines.)
ru: (Аналог SQL не представлен т.к. реализация отличается для различных баз данных.)

source: When :setting:`USE_TZ` is ``True``, fields are converted to the current time zone before filtering.
ru: При :setting:`USE_TZ` равном ``True``, значение поля будет преобразовано в текущий часовой пояс.

source: For date and datetime fields, an exact year match. Allows chaining additional field lookups. Takes an integer year.
ru: Проверка года для полей date/datetime. Позволяет использовать дополнительные проверки поля. Принимает числовое значение года.

source: (The exact SQL syntax varies for each database engine.)
ru: (Точный синтаксис SQL зависит от базы данных.)

source: When :setting:`USE_TZ` is ``True``, datetime fields are converted to the current time zone before filtering.
ru: При :setting:`USE_TZ` равном ``True``, значение поля datetime будет преобразовано в текущий часовой пояс.

source: For date and datetime fields, an exact month match. Allows chaining additional field lookups. Takes an integer 1 (January) through 12 (December).
ru: Проверка месяца для полей date/datetime. Позволяет использовать дополнительные проверки поля. Принимает целое число от 1 (январь) до 12 (декабрь).

source: When :setting:`USE_TZ` is ``True``, datetime fields are converted to the current time zone before filtering. This requires :ref:`time zone definitions in the database <database-time-zone-definitions>`.
ru: При :setting:`USE_TZ` равном ``True``, значение поля datetime будет преобразовано в текущий часовой пояс. Для этого необходимо :ref:`настроить часовые пояса для базы данных <database-time-zone-definitions>`.

source: For date and datetime fields, an exact day match. Allows chaining additional field lookups. Takes an integer day.
ru: Проверка дня месяца для полей date/datetime. Позволяет использовать дополнительные проверки поля. Принимает номер дня месяца.

source: Note this will match any record with a pub_date on the third day of the month, such as January 3, July 3, etc.
ru: Заметим, что будут найдены записи, у которых значение ``pub_date`` это дата 3-го числа любого месяца, такие как 3-го января, 3-го июля и тд.

source: For date and datetime fields, a 'day of the week' match. Allows chaining additional field lookups.
ru: Проверка дня недели для полей date/datetime. Позволяет использовать дополнительные проверки поля.

source: Takes an integer value representing the day of week from 1 (Sunday) to 7 (Saturday).
ru: Принимает номер дня недели от 1 (воскресение) до 7 (суббота).

source: Note this will match any record with a ``pub_date`` that falls on a Monday (day 2 of the week), regardless of the month or year in which it occurs. Week days are indexed with day 1 being Sunday and day 7 being Saturday.
ru: Будут найдены записи, у которых дата в ``pub_date`` -- понедельник (второй день недели), независимо от месяца и года. Дни недели пронумерованы от 1(воскресение) до 7(суббота).

source: For datetime and time fields, an exact hour match. Allows chaining additional field lookups. Takes an integer between 0 and 23.
ru: Проверка часа для полей date/datetime. Позволяет использовать дополнительные проверки поля. Принимает число от 0 до 23.

source: For datetime fields, when :setting:`USE_TZ` is ``True``, values are converted to the current time zone before filtering.
ru: При :setting:`USE_TZ` равном ``True``, значение будет преобразовано в текущий часовой пояс перед фильтрацией.

source: For datetime and time fields, an exact minute match. Allows chaining additional field lookups. Takes an integer between 0 and 59.
ru: Проверка минуты для полей date/datetime. Позволяет использовать дополнительные проверки поля. Принимает целое число от 0 до 59.

source: For datetime fields, When :setting:`USE_TZ` is ``True``, values are converted to the current time zone before filtering.
ru: При :setting:`USE_TZ` равном ``True``, значение будет преобразовано в текущий часовой пояс перед фильтрацией.

source: For datetime and time fields, an exact second match. Allows chaining additional field lookups. Takes an integer between 0 and 59.
ru: Проверка секунды для полей date/datetime. Позволяет использовать дополнительные проверки поля. Принимает целое число от 0 до 59.

source: Takes either ``True`` or ``False``, which correspond to SQL queries of ``IS NULL`` and ``IS NOT NULL``, respectively.
ru: Принимает ``True`` или ``False``, что соответствует SQL запросу ``IS NULL`` и ``IS NOT NULL``, соответственно.

source: Case-sensitive regular expression match.
ru: Регистрозависимая проверка регулярным выражением.

source: The regular expression syntax is that of the database backend in use. In the case of SQLite, which has no built in regular expression support, this feature is provided by a (Python) user-defined REGEXP function, and the regular expression syntax is therefore that of Python's ``re`` module.
ru: Синтаксис регулярных выражений зависит от базы данных. Для SQLite, который не поддерживает регулярные выражения, эта функция обеспечена на уровне Python, поэтому используется синтаксис модуля Python ``re``.

source: Using raw strings (e.g., ``r'foo'`` instead of ``'foo'``) for passing in the regular expression syntax is recommended.
ru: Рекомендуется использовать "raw" строки (например, ``r'foo'`` вместо ``'foo'``) для регулярных выражений.

source: Case-insensitive regular expression match.
ru: Регистронезависимая проверка регулярным выражением.

source: Aggregation functions
ru: Функции агрегации

source: Django provides the following aggregation functions in the ``django.db.models`` module. For details on how to use these aggregate functions, see :doc:`the topic guide on aggregation </topics/db/aggregation>`. See the :class:`~django.db.models.Aggregate` documentation to learn how to create your aggregates.
ru: Django предоставляет ряд функций агрегации в модуле ``django.db.models``. Подробности, как использовать функции агрегации, смотрите в :doc:`разделе об агрегации </topics/db/aggregation>`. В разеделе :class:`~django.db.models.Aggregate` вы можете узнать как создать собственные агрегации.

source: SQLite can't handle aggregation on date/time fields out of the box. This is because there are no native date/time fields in SQLite and Django currently emulates these features using a text field. Attempts to use aggregation on date/time fields in SQLite will raise ``NotImplementedError``.
ru: SQLite не умеет использовать агрегацию для полей даты и времени. Это потому что там нет встроенных полей даты и времени и Django эмулирует их используя текстовое поле. При использовании такой агрегации с SQLite вызовет ``NotImplementedError``.

source: Note
ru: Внимание

source: Aggregation functions return ``None`` when used with an empty ``QuerySet``. For example, the ``Sum`` aggregation function returns ``None`` instead of ``0`` if the ``QuerySet`` contains no entries. An exception is ``Count``, which does return ``0`` if the ``QuerySet`` is empty.
ru: Функция агрегации вернет ``None``, если используется для пустого ``QuerySet``. Например, ``Sum`` вернет ``None`` вместо ``0``, если ``QuerySet`` не содержит записей. Исключением является ``Count``, который вернет ``0`` для пустого ``QuerySet``.

source: All aggregates have the following parameters in common:
ru: Функции агрегации обычно принимают следующие параметры:

source: A string that references a field on the model, or a :doc:`query expression </ref/models/expressions>`.
ru: Строка, которая указывает на поле модели, или :doc:`выражение </ref/models/expressions>`.

source: An optional argument that represents the :doc:`model field </ref/models/fields>` of the return value
ru: Необязательный аргумент, который определяет :doc:`поле модели </ref/models/fields>` результата.

source: When combining multiple field types, Django can only determine the ``output_field`` if all fields are of the same type. Otherwise, you must provide the ``output_field`` yourself.
ru: При использовании нескольких полей Django может определить ``output_field`` в том случае, если все поля одного типа. Иначе необходимо явно указать ``output_field``.

source: Keyword arguments that can provide extra context for the SQL generated by the aggregate.
ru: Именованные аргументы, которая указывают дополнительный контекст для SQL, созданного для агрегации.

source: Returns the mean value of the given expression, which must be numeric unless you specify a different ``output_field``.
ru: Возвращает среднее значение указанного выражения, которое должно быть численным, если только вы не указали другой ``output_field``..

source: Default alias: ``<field>__avg``
ru: Псевдоним по-умолчанию: ``<field>__avg``

source: Return type: ``float`` (or the type of whatever ``output_field`` is specified)
ru: Тип возвращаемого значения: ``float`` (или тип указанного ``output_field``).

source: Returns the number of objects that are related through the provided expression.
ru: Возвращает количество объектов связанных через указанное выражение.

source: Default alias: ``<field>__count``
ru: Псевдоним по-умолчанию: ``<field>__count``

source: Return type: ``int``
ru: Тип возвращаемого значения: ``int``

source: Has one optional argument:
ru: Принимает один не обязательный параметр:

source: If ``distinct=True``, the count will only include unique instances. This is the SQL equivalent of ``COUNT(DISTINCT <field>)``. The default value is ``False``.
ru: При ``distinct=True``, будут подсчитаны только уникальные объекты. SQL эквивалент -- ``COUNT(DISTINCT <field>)``. Значение по-умолчанию ``False``.

source: Returns the maximum value of the given expression.
ru: Возвращает максимальное значение указанного выражения.

source: Default alias: ``<field>__max``
ru: Псевдоним по-умолчанию: ``<field>__max``

source: Return type: same as input field, or ``output_field`` if supplied
ru: Тип возвращаемого значения: тип указанного поля, или ``output_field``.

source: Returns the minimum value of the given expression.
ru: Возвращает минимальное значение указанного выражения.

source: Default alias: ``<field>__min``
ru: Псевдоним по-умолчанию: ``<field>__min``

source: Returns the standard deviation of the data in the provided expression.
ru: Возвращает стандартное отклонение для данных указанного выражения.

source: Default alias: ``<field>__stddev``
ru: Псевдоним по-умолчанию: ``<field>__stddev``

source: Return type: ``float``
ru: Тип возвращаемого значения: ``float``

source: By default, ``StdDev`` returns the population standard deviation. However, if ``sample=True``, the return value will be the sample standard deviation.
ru: По-умолчанию, ``StdDev`` возвращает "population" стандартное отклонение. Однако, если использовать аргумент ``sample=True``, возвращаемое значение будет "sample" стандартное отклонение.

source: SQLite doesn't provide ``StdDev`` out of the box. An implementation is available as an extension module for SQLite. Consult the `SQlite documentation`_ for instructions on obtaining and installing this extension.
ru: SQLite не поддерживает ``StdDev`` из коробки. Реализация доступна в качестве модуля расширения для SQLite. Смотрите инструкцию по установке в `документации SQlite <http://www.sqlite.org/contrib>`_.

source: Computes the sum of all values of the given expression.
ru: Возвращает сумму всех значений указанного выражения.

source: Default alias: ``<field>__sum``
ru: Псевдоним по-умолчанию: ``<field>__sum``

source: Returns the variance of the data in the provided expression.
ru: Возвращает дисперсию значений в указанном выражении.

source: Default alias: ``<field>__variance``
ru: Псевдоним по-умолчанию: ``<field>__variance``

source: By default, ``Variance`` returns the population variance. However, if ``sample=True``, the return value will be the sample variance.
ru: По-умолчанию, ``Variance`` возвращает "population" дисперсию. Однако, если использовать аргумент ``sample=True``, возвращаемое значение будет "sample" дисперсия.

source: SQLite doesn't provide ``Variance`` out of the box. An implementation is available as an extension module for SQLite. Consult the `SQlite documentation`_ for instructions on obtaining and installing this extension.
ru: SQLite не поддерживает ``Variance`` из коробки. Реализация доступна в качестве модуля расширения для SQLite. Смотрите инструкцию по установке в `документации SQlite <http://www.sqlite.org/contrib>`_.

source: This section provides reference material for query-related tools not documented elsewhere.
ru: Этот раздел описывает объекты, которые используются при запросах

source: ``Q()`` objects
ru: Объекты ``Q()``

source: A ``Q()`` object, like an :class:`~django.db.models.F` object, encapsulates a SQL expression in a Python object that can be used in database-related operations.
ru: Объект ``Q()``, как и :class:`~django.db.models.F`, инкапсулирует SQL выражение в Python объекте, который может использоваться для указания операций над базой данных.

source: In general, ``Q() objects`` make it possible to define and reuse conditions. This permits the :ref:`construction of complex database queries <complex-lookups-with-q>` using ``|`` (``OR``) and ``&`` (``AND``) operators; in particular, it is not otherwise possible to use ``OR`` in ``QuerySets``.
ru: Объекты ``Q()`` позволяют определить условия и использовать их повторно. Это позволяет :ref:`создавать сложные запросы к базе данных <complex-lookups-with-q>`, используя операторы ``|`` (``OR``) и ``&`` (``AND``); в частности, это единственный способ использовать ``OR`` в ``QuerySets``.

source: ``Prefetch()`` objects
ru: Объекты ``Prefetch()``

source: The ``Prefetch()`` object can be used to control the operation of :meth:`~django.db.models.query.QuerySet.prefetch_related()`.
ru: Объект ``Prefetch()`` может использоваться для управления операцией :meth:`~django.db.models.query.QuerySet.prefetch_related()`.

source: The ``lookup`` argument describes the relations to follow and works the same as the string based lookups passed to :meth:`~django.db.models.query.QuerySet.prefetch_related()`. For example:
ru: Аргумент ``lookup`` указывает на связь и работает аналогично аргументу :meth:`~django.db.models.query.QuerySet.prefetch_related()`. Например:

source: The ``queryset`` argument supplies a base ``QuerySet`` for the given lookup. This is useful to further filter down the prefetch operation, or to call :meth:`~django.db.models.query.QuerySet.select_related()` from the prefetched relation, hence reducing the number of queries even further:
ru: Аргумент ``queryset`` указывает ``QuerySet`` для ``lookup``. Он позволяет выполнить дополнительную фильтрацию, или использовать :meth:`~django.db.models.query.QuerySet.select_related()`, дополнительно уменьшая количество запросов:

source: The ``to_attr`` argument sets the result of the prefetch operation to a custom attribute:
ru: Аргумент ``to_attr`` указывает в каком атрибуте будет сохранен результат:
