Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/ref/models/querysets.po
Languages: ru

source: This document describes the details of the ``QuerySet`` API. It builds on the material presented in the :doc:`model </topics/db/models>` and :doc:`database query </topics/db/queries>` guides, so you'll probably want to read and understand those documents before reading this one.
ru: Этот раздел описывает ``QuerySet`` API. Изложенный материал опирается на материал, изложенный в разделах о :doc:`моделях </topics/db/models>` и :doc:`выполнении запросов </topics/db/queries>`, возможно вам следует прочитать их перед прочтением этого раздела.

source: Throughout this reference we'll use the :ref:`example Weblog models <queryset-model-example>` presented in the :doc:`database query guide </topics/db/queries>`.
ru: В примерах будут использованы :ref:`примеры моделей web-блога <queryset-model-example>` представленные в разделе о :doc:`выполнении запросов </topics/db/queries>`.

source: Internally, a ``QuerySet`` can be constructed, filtered, sliced, and generally passed around without actually hitting the database. No database activity actually occurs until you do something to evaluate the queryset.
ru: ``QuerySet`` может быть создан, отфильтрован, ограничен и использован фактически без выполнения запросов к базе данных. База данных не будет затронута, пока вы не спровоцируете выполнение QuerySet.

source: You can evaluate a ``QuerySet`` in the following ways:
ru: ``QuerySet`` будет вычислен при таких действиях:

source: **Iteration.** A ``QuerySet`` is iterable, and it executes its database query the first time you iterate over it. For example, this will print the headline of all entries in the database::
ru: **Итерация.** ``QuerySet`` -- это итератор, и при первом выполнении итерации будет произведен запрос к базе данных. Например, этот код выводит заголовки статей из базы данных::

source: Note: Don't use this if all you want to do is determine if at least one result exists. It's more efficient to use :meth:`~QuerySet.exists`.
ru: Заметка: *не используйте* такой подход, если необходимо всего лишь узнать содержит ли результат запроса хотя бы один объект, и вам не нужен сам результат. Эффективнее использовать метод :meth:`~QuerySet.exists`.

source: **Slicing.** As explained in :ref:`limiting-querysets`, a ``QuerySet`` can be sliced, using Python's array-slicing syntax. Slicing an unevaluated ``QuerySet`` usually returns another unevaluated ``QuerySet``, but Django will execute the database query if you use the "step" parameter of slice syntax, and will return a list. Slicing a ``QuerySet`` that has been evaluated also returns a list.
ru: **Ограничение выборки.** Как описано в :ref:`limiting-querysets`, выборка ``QuerySet`` может быть ограничена, используя синтаксис срезов в Python. Срез не вычисленного ``QuerySet`` обычно возвращает новый не вычисленный ``QuerySet``, но Django выполнит запрос, если будет указан шаг среза и вернет список. Срез ``QuerySet``, который был вычислен(частично или полностью), также вернет список.

source: Also note that even though slicing an unevaluated ``QuerySet`` returns another unevaluated ``QuerySet``, modifying it further (e.g., adding more filters, or modifying ordering) is not allowed, since that does not translate well into SQL and it would not have a clear meaning either.
ru: Обратите внимание, хотя срез не вычисленного ``QuerySet`` вернет новый не вычисленный ``QuerySet``, вы не можете изменять (например, добавлять фильтры, менять сортировку) его дальше, т.к. это не транслируется в SQL и не имеет определенного смысла.

source: **Pickling/Caching.** See the following section for details of what is involved when `pickling QuerySets`_. The important thing for the purposes of this section is that the results are read from the database.
ru: **Pickling/кэширование.** Смотрите соответствующий раздел о `pickling QuerySets`_. Основное замечание это то, что при этих операциях будет выполнен запрос к базе данных.

source: **repr().** A ``QuerySet`` is evaluated when you call ``repr()`` on it. This is for convenience in the Python interactive interpreter, so you can immediately see your results when using the API interactively.
ru: **repr().** ``QuerySet`` будет вычислен при вызове ``repr()``. Это сделано для удобства использования в консоли Python, вы можете сразу увидеть результат работая с ``QuerySet`` в консоли.

source: **len().** A ``QuerySet`` is evaluated when you call ``len()`` on it. This, as you might expect, returns the length of the result list.
ru: **len().** ``QuerySet`` будет вычислен при выполнении ``len()`` над ним. Как вы и ожидаете будет возвращено количество объектов в результате выборки.

source: Note: If you only need to determine the number of records in the set (and don't need the actual objects), it's much more efficient to handle a count at the database level using SQL's ``SELECT COUNT(*)``. Django provides a :meth:`~QuerySet.count` method for precisely this reason.
ru: Заметка: *Не используйте* ``len()`` с ``QuerySet`` если вам нужно узнать только количество записей в выборке. Эффективнее использовать подсчет на уровне базы данных, используя оператор SQL ``SELECT COUNT(*)``, и Django предоставляет метод :meth:`~QuerySet.count` для этого.

source: **list().** Force evaluation of a ``QuerySet`` by calling ``list()`` on it. For example::
ru: **list().** ``QuerySet`` будет вычислен при использовании ``list()`` над ним. Например::

source: **bool().** Testing a ``QuerySet`` in a boolean context, such as using ``bool()``, ``or``, ``and`` or an ``if`` statement, will cause the query to be executed. If there is at least one result, the ``QuerySet`` is ``True``, otherwise ``False``. For example::
ru: **bool().** При вычислении булевого значения ``QuerySet``, например выполнении ``bool()``, использовании с ``or``, ``and`` или ``if``. Если ``QuerySet`` содержит хотя бы один элемент, результат будет ``True``, иначе -- ``False``. Например::

source: Note: If you only want to determine if at least one result exists (and don't need the actual objects), it's more efficient to use :meth:`~QuerySet.exists`.
ru: Заметка: *не используйте* такой подход, если необходимо всего лишь узнать содержит ли результат запроса хотя бы один объект, и вам не нужен сам результат. Эффективнее использовать метод :meth:`~QuerySet.exists`.

source: If you :mod:`pickle` a ``QuerySet``, this will force all the results to be loaded into memory prior to pickling. Pickling is usually used as a precursor to caching and when the cached queryset is reloaded, you want the results to already be present and ready for use (reading from the database can take some time, defeating the purpose of caching). This means that when you unpickle a ``QuerySet``, it contains the results at the moment it was pickled, rather than the results that are currently in the database.
ru: Используя :mod:`pickle` для ``QuerySet``, будет выполнен запрос к базе данных, чтобы загрузить данные в память для сериализации. Сериализация обычно используется перед кэшированием ``QuerySet`` или загрузкой из кэша, необходимо, чтобы результат был доступен для использования сразу после загрузки (чтение с базы данных занимает некоторое время, что свело бы всю пользу кэширования к нулю). Это означает что после восстановления сериализованного ``QuerySet``, он будет содержать результат на момент сериализации, а не тот, который хранится в базе данных на текущий момент.

source: If you only want to pickle the necessary information to recreate the ``QuerySet`` from the database at a later time, pickle the ``query`` attribute of the ``QuerySet``. You can then recreate the original ``QuerySet`` (without any results loaded) using some code like this::
ru: Если вам необходимо сохранить запрос выполняемый ``QuerySet``, чтобы получить данные позже, сериализируйте атрибут ``query`` ``QuerySet``. Позже вы можете воссоздать первоначальный ``QuerySet`` (без загрузки результата) используя такой код::

source: The ``query`` attribute is an opaque object. It represents the internals of the query construction and is not part of the public API. However, it is safe (and fully supported) to pickle and unpickle the attribute's contents as described here.
ru: Атрибут ``query`` не является частью публичного API, и является частью внутреннего механизма создания запросов. Однако, поддерживает использование ``pickle`` и ``unpickle`` как показано в примере выше.

source: You can't share pickles between versions
ru: нельзя переносить "pickles" между версиями

source: Pickles of ``QuerySets`` are only valid for the version of Django that was used to generate them. If you generate a pickle using Django version N, there is no guarantee that pickle will be readable with Django version N+1. Pickles should not be used as part of a long-term archival strategy.
ru: Сериализация ``QuerySets`` возможна только для версии Django, которая была использована при сохранении объекта. При сериализации объекта в версии Django N, нет гарантии что, его можно будет восстановить в версии Django N+1. Сериализация не должна быть использована для долговременного хранения данных.

source: Since pickle compatibility errors can be difficult to diagnose, such as silently corrupted objects, a ``RuntimeWarning`` is raised when you try to unpickle a queryset in a Django version that is different than the one in which it was pickled.
ru: Так как ошибки совместимости "pickle" тяжело диагностировать, если вы попытаетесь распаковать ``QuerySet`` в версии Django, которая отличается от версии при упаковке объекта, будет вызвано ``RuntimeWarning``.

source: Here's the formal declaration of a ``QuerySet``:
ru: Вот документированное объявление ``QuerySet``:

source: Usually when you'll interact with a ``QuerySet`` you'll use it by :ref:`chaining filters <chaining-filters>`. To make this work, most ``QuerySet`` methods return new querysets. These methods are covered in detail later in this section.
ru: Обычно работа с ``QuerySet`` состоит в использовании :ref:`цепочек фильтров <chaining-filters>`. Для этого большинство методов ``QuerySet`` возвращает новый "queryset". Эти методы описаны далее.

source: The ``QuerySet`` class has two public attributes you can use for introspection:
ru: Класс ``QuerySet`` имеет два публичных атрибута:

source: ``True`` if the ``QuerySet`` is ordered — i.e. has an :meth:`order_by()` clause or a default ordering on the model. ``False`` otherwise.
ru: ``True`` если ``QuerySet`` использует сортировку — то есть использован метод :meth:`order_by()` или модель содержит сортировку по-умолчанию. Иначе ``False``.

source: The database that will be used if this query is executed now.
ru: База данных, которая будет использована для выполнения запроса.

source: Django provides a range of ``QuerySet`` refinement methods that modify either the types of results returned by the ``QuerySet`` or the way its SQL query is executed.
ru: Django предоставляет набор методов ``QuerySet``, которые изменяют возвращаемый результат или выполнение SQL запроса.

source: Returns a new ``QuerySet`` containing objects that match the given lookup parameters.
ru: Возвращает новый ``QuerySet`` содержащий объекты отвечающие параметрам фильтрации.

source: The lookup parameters (``**kwargs``) should be in the format described in `Field lookups`_ below. Multiple parameters are joined via ``AND`` in the underlying SQL statement.
ru: Параметры фильтрации (``**kwargs``) должны отвечать формату описанному в :ref:`соответствующем разделе <field-lookups>`. Несколько параметров объединяются оператором SQL ``AND``.

source: If you need to execute more complex queries (for example, queries with ``OR`` statements), you can use :class:`Q objects <django.db.models.Q>`.
ru: Если вам необходимо выполнить более сложные вопросы (например, запросы с ``OR``), вы можете использовать :class:`объект Q <django.db.models.Q>`.

source: Returns a new ``QuerySet`` containing objects that do *not* match the given lookup parameters.
ru: Возвращает новый ``QuerySet`` содержащий объекты *не* отвечающие параметрам фильтрации.

source: The lookup parameters (``**kwargs``) should be in the format described in `Field lookups`_ below. Multiple parameters are joined via ``AND`` in the underlying SQL statement, and the whole thing is enclosed in a ``NOT()``.
ru: Параметры фильтрации (``**kwargs``) должны отвечать формату описанному в :ref:`соответствующем разделе <field-lookups>`. Несколько параметров объединяются оператором SQL ``AND`` и все это замыкается оператором ``NOT()``.

source: This example excludes all entries whose ``pub_date`` is later than 2005-1-3 AND whose ``headline`` is "Hello"::
ru: Этот пример исключает все записи с ``pub_date`` раньше 3.01.2005 И с ``headline`` равным "Hello"::

source: In SQL terms, that evaluates to::
ru: Это эквивалентно запросу SQL::

source: This example excludes all entries whose ``pub_date`` is later than 2005-1-3 OR whose headline is "Hello"::
ru: Этот пример исключает все записи с ``pub_date`` раньше 3.01.2005 ИЛИ с ``headline`` равным "Hello"::

source: Note the second example is more restrictive.
ru: Обратите внимание на второй пример, который больше ограничивает выборку.

source: Each argument to ``annotate()`` is an annotation that will be added to each object in the ``QuerySet`` that is returned.
ru: Каждый аргумент ``annotate()`` добавит аннотацию для каждого объекта, возвращаемого ``QuerySet``.

source: The aggregation functions that are provided by Django are described in `Aggregation Functions`_ below.
ru: Функции агрегации описаны в :ref:`соответствующем разделе <aggregation-functions>` ниже.

source: Annotations specified using keyword arguments will use the keyword as the alias for the annotation. Anonymous arguments will have an alias generated for them based upon the name of the aggregate function and the model field that is being aggregated. Only aggregate expressions that reference a single field can be anonymous arguments. Everything else must be a keyword argument.
ru: Аннотация, определенная именованными аргументами, будет использовать имя аргумента, как название аннотации. Для позиционного аргумента будет использовано имя, созданное с названия функции агрегации и используемого поля модели. В позиционных аргументах можно указывать агрегирующее выражение, которое использует только одно поле. Все остальные должны передаваться через именованные аргументы.

source: For example, if you were manipulating a list of blogs, you may want to determine how many entries have been made in each blog::
ru: Например, получая список блогов, вы захотите получить и количество записей в каждом блоге::

source: The ``Blog`` model doesn't define an ``entry__count`` attribute by itself, but by using a keyword argument to specify the aggregate function, you can control the name of the annotation::
ru: Модель ``Blog`` не определяет атрибут ``entry__count``, используя именованный аргументы вы можете переопределить название этого атрибута::

source: For an in-depth discussion of aggregation, see :doc:`the topic guide on Aggregation </topics/db/aggregation>`.
ru: Для углубленного изучения агрегации смотрите :doc:`раздел про агрегацию </topics/db/aggregation>`.

source: By default, results returned by a ``QuerySet`` are ordered by the ordering tuple given by the ``ordering`` option in the model's ``Meta``. You can override this on a per-``QuerySet`` basis by using the ``order_by`` method.
ru: По-умолчанию, результат возвращаемый ``QuerySet``, отсортирован по полям указанным в аргументе ``ordering`` класса ``Meta`` модели. Вы можете переопределить сортировку используя метод ``order_by``.

source: Example::
ru: Например::

source: The result above will be ordered by ``pub_date`` descending, then by ``headline`` ascending. The negative sign in front of ``"-pub_date"`` indicates *descending* order. Ascending order is implied. To order randomly, use ``"?"``, like so::
ru: Результат выше будет отсортирован в обратном порядке по полю ``pub_date``, далее по полю ``headline``. Знак "минус" в ``"-pub_date"`` указывает на "нисходящую" сортировку. Сортировка по возрастанию подразумевается по-умолчанию. Чтобы отсортировать случайно используйте ``"?"``, например::

source: Note: ``order_by('?')`` queries may be expensive and slow, depending on the database backend you're using.
ru: Заметка: запрос с ``order_by('?')`` может быть медленным и сильно нагружать базу данных, зависит от типа базы данных, которую вы используете.

source: To order by a field in a different model, use the same syntax as when you are querying across model relations. That is, the name of the field, followed by a double underscore (``__``), followed by the name of the field in the new model, and so on for as many models as you want to join. For example::
ru: Для сортировки по полю из другой модели, используйте синтаксис аналогичный тому, который используется при фильтрации по полям связанной модели. То есть, название поля, далее два нижних подчеркивания (``__``), и имя поля в новой модели, и так далее. Например::

source: If you try to order by a field that is a relation to another model, Django will use the default ordering on the related model, or order by the related model's primary key if there is no :attr:`Meta.ordering <django.db.models.Options.ordering>` specified. For example, since the ``Blog`` model has no default ordering specified::
ru: Если вы пытаетесь отсортировать по полю, которое является связью на другую модель, Django будет использовать сортировку по-умолчанию связанной модели (или же сортировку по первичному ключу связанной модели если :attr:`Meta.ordering <django.db.models.Options.ordering>` не указан). Например, так как в модели ``Blog`` не указана сортировка по умолчанию::

source: ...is identical to::
ru: ...идентично::

source: If ``Blog`` had ``ordering = ['name']``, then the first queryset would be identical to::
ru: Если ``Blog`` содержит ``ordering = ['name']``, первый запрос будет аналогичен::

source: You can also order by :doc:`query expressions </ref/models/expressions>` by calling ``asc()`` or ``desc()`` on the expression::
ru: Вы можете также сортировать по :doc:`выражению </ref/models/expressions>`, вызвав ``asc()`` или ``desc()`` для выражения::

source: Be cautious when ordering by fields in related models if you are also using :meth:`distinct()`. See the note in :meth:`distinct` for an explanation of how related model ordering can change the expected results.
ru: Будьте осторожны используя по полю из связанной модели и метод :meth:`distinct()`. Смотрите описание метода :meth:`distinct` для информации как сортировка по связанной модели может повлиять на ожидаемый результат.

source: It is permissible to specify a multi-valued field to order the results by (for example, a :class:`~django.db.models.ManyToManyField` field, or the reverse relation of a :class:`~django.db.models.ForeignKey` field).
ru: Можно использовать поля с множеством значений для фильтрации результатов (например, поле :class:`~django.db.models.ManyToManyField`, или обратную связь для поля :class:`~django.db.models.ForeignKey`).

source: Consider this case::
ru: Возьмем такой код::

source: Here, there could potentially be multiple ordering data for each ``Event``; each ``Event`` with multiple ``children`` will be returned multiple times into the new ``QuerySet`` that ``order_by()`` creates. In other words, using ``order_by()`` on the ``QuerySet`` could return more items than you were working on to begin with - which is probably neither expected nor useful.
ru: В таком случае может быть несколько значений указывающих порядок для объекта ``Event``. ``Event`` с несколькими ``children`` будет возвращен несколько раз в ``QuerySet`` созданном ``order_by()``. Другими словами, использование ``order_by()`` больше объектов чем вы изначальном ``QuerySet``.

source: Thus, take care when using multi-valued field to order the results. **If** you can be sure that there will only be one ordering piece of data for each of the items you're ordering, this approach should not present problems. If not, make sure the results are what you expect.
ru: Будьте внимательны, когда используете поля с множеством значений для сортировки. **Если** вы уверенны, что существует только одно значение для объекта определяющее порядок сортировки, у вас не должно быть проблем. Иначе убедитесь что полученный результат - это то, что вам нужно.

source: There's no way to specify whether ordering should be case sensitive. With respect to case-sensitivity, Django will order results however your database backend normally orders them.
ru: Нет способа указать должна ли сортировка учитывать регистр. Поэтому Django возвращает результат в таком порядке, в каком его вернула используемая база данных.

source: You can order by a field converted to lowercase with :class:`~django.db.models.functions.Lower` which will achieve case-consistent ordering::
ru: Вы можете отсортировать по полю преобразовав значение в нижний регистр, используя :class:`~django.db.models.functions.Lower`::

source: If you don't want any ordering to be applied to a query, not even the default ordering, call :meth:`order_by()` with no parameters.
ru: Если вы не хотите использовать сортировку, даже указанную по-умолчанию, выполните метод :meth:`order_by()` без аргументов.

source: You can tell if a query is ordered or not by checking the :attr:`.QuerySet.ordered` attribute, which will be ``True`` if the ``QuerySet`` has been ordered in any way.
ru: Вы можете определить используется сортировка или нет проверив атрибут :attr:`.QuerySet.ordered`, который будет равен ``True``, если сортировка была применена для ``QuerySet`` каким-либо образом.

source: Each ``order_by()`` call will clear any previous ordering. For example, this query will be ordered by ``pub_date`` and not ``headline``::
ru: Каждый последующий вызов ``order_by()`` сбросит предыдущую сортировку. Например, следующий запрос будет отсортирован по ``pub_date``, а не ``headline``::

source: Ordering is not a free operation. Each field you add to the ordering incurs a cost to your database. Each foreign key you add will implicitly include all of its default orderings as well.
ru: Сортировка не бесплатная операция. Каждое поле влияет на скорость выполнения запроса. Каждый внешний ключ добавит сортировку по умолчанию связанной модели.

source: Use the ``reverse()`` method to reverse the order in which a queryset's elements are returned. Calling ``reverse()`` a second time restores the ordering back to the normal direction.
ru: Используйте метод ``reverse()``, чтобы изменить порядок сортировки на обратный. Вызов ``reverse()`` повторно восстановит изначальную сортировку.

source: To retrieve the "last" five items in a queryset, you could do this::
ru: Чтобы получить "последние" пять объектов выполните::

source: Note that this is not quite the same as slicing from the end of a sequence in Python. The above example will return the last item first, then the penultimate item and so on. If we had a Python sequence and looked at ``seq[-5:]``, we would see the fifth-last item first. Django doesn't support that mode of access (slicing from the end), because it's not possible to do it efficiently in SQL.
ru: Обратите внимание, что это не совсем аналог среза Python с конца. Этот пример вернет сначала последний элемент, потом предпоследний и так далее. Используя список Python и сделав срез ``seq[-5:]``, мы увидим пятый элемент с конца первым. Django не поддерживает подобное (срез с конца), т.к. нет способа интерпретировать это в эффективный SQL.
