Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/ref/models/querysets.po
Languages: ru

source: This has a similar purpose to ``select_related``, in that both are designed to stop the deluge of database queries that is caused by accessing related objects, but the strategy is quite different.
ru: Смысл такой же, как и у ``select_related``, избежать нарастающего количества запросов при обращении к связанным объектам, но принцип работы немного другой.

source: ``select_related`` works by creating an SQL join and including the fields of the related object in the ``SELECT`` statement. For this reason, ``select_related`` gets the related objects in the same database query. However, to avoid the much larger result set that would result from joining across a 'many' relationship, ``select_related`` is limited to single-valued relationships - foreign key and one-to-one.
ru: ``select_related`` создает запрос SQL, объединяющий связанные таблицы и включающий дополнительные поля в ``SELECT``. По этой причине, ``select_related`` получает связанные объекты в том же запросе. Однако, чтобы избежать большого количества возвращаемых данных при обработке "множественных" связей, ``select_related`` работает только со связями возвращающими один объект - внешний ключ и связь один-к-одному.

source: ``prefetch_related``, on the other hand, does a separate lookup for each relationship, and does the 'joining' in Python. This allows it to prefetch many-to-many and many-to-one objects, which cannot be done using ``select_related``, in addition to the foreign key and one-to-one relationships that are supported by ``select_related``. It also supports prefetching of :class:`~django.contrib.contenttypes.fields.GenericRelation` and :class:`~django.contrib.contenttypes.fields.GenericForeignKey`, however, it must be restricted to a homogeneous set of results. For example, prefetching objects referenced by a ``GenericForeignKey`` is only supported if the query is restricted to one ``ContentType``.
ru: ``prefetch_related``, с другой стороны, выбирает данные для каждой связи отдельно, и выполняет "объединение" на уровне Python. Благодаря этому могут быть обработаны связи многое-ко-многим и многое-к-одному, которые не обрабатывает ``select_related``, в том числе и внешние ключи и связь один-к-одному поддерживаемые ``select_related``. Также поддерживается предварительная выборка для :class:`~django.contrib.contenttypes.fields.GenericRelation` и :class:`~django.contrib.contenttypes.fields.GenericForeignKey`, однако, можно выбирать только однородные данные. Например, Подгружать объекты из ``GenericForeignKey`` можно только одного ``ContentType``.

source: For example, suppose you have these models::
ru: Например, у вас есть две модели::

source: and run::
ru: и выполняется такой код::

source: The problem with this is that every time ``Pizza.__str__()`` asks for ``self.toppings.all()`` it has to query the database, so ``Pizza.objects.all()`` will run a query on the Toppings table for **every** item in the Pizza ``QuerySet``.
ru: Проблема в том, что ``Pizza.__str__()``, вызывая ``self.toppings.all()`` выполняет запрос к базе данных, и ``Pizza.objects.all()`` выполнит запрос к таблице Topping для **каждого** объекта Pizza в ``QuerySet``.

source: We can reduce to just two queries using ``prefetch_related``:
ru: Мы можем уменьшить количество запросов до двух, используя ``prefetch_related``:

source: This implies a ``self.toppings.all()`` for each ``Pizza``; now each time ``self.toppings.all()`` is called, instead of having to go to the database for the items, it will find them in a prefetched ``QuerySet`` cache that was populated in a single query.
ru: Этот код аналогичен выполнению ``self.toppings.all()`` для каждого объекта ``Pizza`` . При вызове ``self.toppings.all()`` будут использоваться подгруженные данные, вместо запроса к БД. Django найдет их в кэше ``QuerySet``, который был заполнен одним запросом.

source: That is, all the relevant toppings will have been fetched in a single query, and used to make ``QuerySets`` that have a pre-filled cache of the relevant results; these ``QuerySets`` are then used in the ``self.toppings.all()`` calls.
ru: Все соответствующие начинки(toppings) будут получены одним запросом, чтобы создать ``QuerySets``, который имеет предварительно заполненный кэш соответствующих результатов. Этот ``QuerySets`` будет использован при вызове ``self.toppings.all()``.

source: The additional queries in ``prefetch_related()`` are executed after the ``QuerySet`` has begun to be evaluated and the primary query has been executed.
ru: Запрос для загрузки данных, указанных в ``prefetch_related()`` будет выполнен после выполнения основного запроса.

source: Note that the result cache of the primary ``QuerySet`` and all specified related objects will then be fully loaded into memory. This changes the typical behavior of ``QuerySets``, which normally try to avoid loading all objects into memory before they are needed, even after a query has been executed in the database.
ru: Обратите внимание, что будет "закэширован" также результат выполнения основного ``QuerySet``, а также будут загружены все связанные объекты. Это отличается от стандартного поведения ``QuerySets``, при котором Django старается не загружать связанные данные как можно дольше.

source: Remember that, as always with ``QuerySets``, any subsequent chained methods which imply a different database query will ignore previously cached results, and retrieve data using a fresh database query. So, if you write the following:
ru: Помните, для всех ``QuerySets`` любой последующий метод, который изменяет запрос, проигнорирует ранее загруженный кэш и получит данные, выполнив новый запрос. Итак, используя такой код:

source: ...then the fact that ``pizza.toppings.all()`` has been prefetched will not help you. The ``prefetch_related('toppings')`` implied ``pizza.toppings.all()``, but ``pizza.toppings.filter()`` is a new and different query. The prefetched cache can't help here; in fact it hurts performance, since you have done a database query that you haven't used. So use this feature with caution!
ru: ...тот факт, что ``pizza.toppings.all()`` предварительно загружает данные, не поможет вам. ``prefetch_related('toppings')`` применяется к ``pizza.toppings.all()``, а ``pizza.toppings.filter()`` совершенно другой запрос. Загруженный кэш не будет использоваться и будут выполнены дополнительные запросы. Пользуйтесь этим методом осторожно!

source: You can also use the normal join syntax to do related fields of related fields. Suppose we have an additional model to the example above::
ru: Вы можете использовать стандартный синтаксис для обращения к связанным моделям. Например, добавим еще одну модель в пример выше::

source: The following are all legal:
ru: Можно использовать такой запрос:

source: This will prefetch all pizzas belonging to restaurants, and all toppings belonging to those pizzas. This will result in a total of 3 database queries - one for the restaurants, one for the pizzas, and one for the toppings.
ru: Этот запрос выполнит предварительную загрузку всех пицц(Pizza) для ресторанов(Restaurant) и всех ингредиентов(Topping) для пицц. В результате будет выполнено 3 запроса - один для Restaurant, один для Pizza, и один для Topping.

source: Of course, the ``best_pizza`` relationship could also be fetched using ``select_related`` to reduce the query count to 2:
ru: Конечно, связь ``best_pizza`` может быть получена через ``select_related``, чтобы уменьшить количество запросов до двух:

source: Since the prefetch is executed after the main query (which includes the joins needed by ``select_related``), it is able to detect that the ``best_pizza`` objects have already been fetched, and it will skip fetching them again.
ru: Так как предварительная загрузка выполняется после основного запроса (который включает все необходимые объединения таблиц для обработки ``select_related``), она способна определить что объекты ``best_pizza`` уже получены и не выполнит их загрузку снова.

source: Chaining ``prefetch_related`` calls will accumulate the lookups that are prefetched. To clear any ``prefetch_related`` behavior, pass ``None`` as a parameter:
ru: Использование нескольких вызовов ``prefetch_related`` соберет вместе все предварительно загружаемые поля. Чтобы их обнулить, вызовите метод ``prefetch_related`` с аргументом ``None``::

source: One difference to note when using ``prefetch_related`` is that objects created by a query can be shared between the different objects that they are related to i.e. a single Python model instance can appear at more than one point in the tree of objects that are returned. This will normally happen with foreign key relationships. Typically this behavior will not be a problem, and will in fact save both memory and CPU time.
ru: Одна особенность вызова ``prefetch_related``, про которую следует упомянуть: объекты созданные в результате выполнения запроса могут быть использованы различными связанными объектами, то есть один экземпляр модели может оказаться более чем в одной точке в дереве возвращенных объектов. Это обычно случается с внешними ключами. Скорее всего это не вызовет никаких проблем, и даже сохранит память и время CPU.

source: While ``prefetch_related`` supports prefetching ``GenericForeignKey`` relationships, the number of queries will depend on the data. Since a ``GenericForeignKey`` can reference data in multiple tables, one query per table referenced is needed, rather than one query for all the items. There could be additional queries on the ``ContentType`` table if the relevant rows have not already been fetched.
ru: Так как ``prefetch_related`` поддерживает предварительную загрузку ``GenericForeignKey``, количество запросов зависит от данных. Так как ``GenericForeignKey`` может ссылаться на данные из разных таблиц, необходим один запрос на одну таблицу, вместо одного запроса для всех данных. Также может понадобится дополнительный запрос к таблице ``ContentType``, если соответствующие данные еще не загружены.

source: ``prefetch_related`` in most cases will be implemented using an SQL query that uses the 'IN' operator. This means that for a large ``QuerySet`` a large 'IN' clause could be generated, which, depending on the database, might have performance problems of its own when it comes to parsing or executing the SQL query. Always profile for your use case!
ru: ``prefetch_related`` в основном использует оператор 'IN' SQL запроса. Это означает, что для больших ``QuerySet`` может быть создано сложное условие 'IN', что, в зависимости от базы данных, может привести к проблемам с производительностью при разборе и выполнении SQL запроса. Всегда анализируйте(profile) ваш запрос!

source: Note that if you use ``iterator()`` to run the query, ``prefetch_related()`` calls will be ignored since these two optimizations do not make sense together.
ru: Заметим, если вы используете ``iterator()`` для выполнения запроса, вызов ``prefetch_related()`` будет проигнорирован т.к. использование этих двух оптимизаций вместе не имеет смысла.

source: You can use the :class:`~django.db.models.Prefetch` object to further control the prefetch operation.
ru: Вы можете использовать объект :class:`~django.db.models.Prefetch` для большего контроля предварительной загрузкой.

source: In its simplest form ``Prefetch`` is equivalent to the traditional string based lookups:
ru: В самом простом варианте ``Prefetch`` аналогичен обычному строковому аргументу:

source: You can provide a custom queryset with the optional ``queryset`` argument. This can be used to change the default ordering of the queryset:
ru: Вы можете указать свой ``QuerySet`` в необязательном аргументе ``queryset``. Это позволяет переопределить сортировку по умолчанию:

source: Or to call :meth:`~django.db.models.query.QuerySet.select_related()` when applicable to reduce the number of queries even further:
ru: Или вызывать при возможности :meth:`~django.db.models.query.QuerySet.select_related()`, чтобы уменьшить количество запросов еще больше:

source: You can also assign the prefetched result to a custom attribute with the optional ``to_attr`` argument. The result will be stored directly in a list.
ru: Можно также результат сохранить другом атрибуте, указав название в аргументе ``to_attr``. Результат будет сохранен непосредственно в списке.

source: This allows prefetching the same relation multiple times with a different ``QuerySet``; for instance:
ru: Это позволяет выполнить предварительную загрузку несколько раз для одной связи, используя разные ``QuerySet``. Например:

source: Lookups created with custom ``to_attr`` can still be traversed as usual by other lookups:
ru: Результат с собственным ``to_attr`` может использоваться в аргументах запроса:

source: Using ``to_attr`` is recommended when filtering down the prefetch result as it is less ambiguous than storing a filtered result in the related manager's cache:
ru: Использование ``to_attr`` рекомендуется при фильтрации результата предварительной загрузки т.к. это менее двусмысленно, чем сохранение результата фильтрации в кэше связывающего менеджера:

source: Custom prefetching also works with single related relations like forward ``ForeignKey`` or ``OneToOneField``. Generally you'll want to use :meth:`select_related()` for these relations, but there are a number of cases where prefetching with a custom ``QuerySet`` is useful:
ru: Предварительная загрузка работает и для связей один ко многим, таких как ``ForeignKey`` или ``OneToOneField``. Обычно для них используется :meth:`select_related()`, но есть несколько случаев, когда может быть полезна предварительная загрузка с собственным ``QuerySet``:

source: You want to use a ``QuerySet`` that performs further prefetching on related models.
ru: Вы хотите использовать ``QuerySet``, который выполняет предварительную загрузку для связанной модели.

source: You want to prefetch only a subset of the related objects.
ru: Вы хотите загрузить только часть связанных объектов.

source: You want to use performance optimization techniques like :meth:`deferred fields <defer()>`:
ru: Вы хотите оптимизировать запрос, :meth:`отфильтровав часть полей <defer()>`:

source: The ordering of lookups matters.
ru: Порядок аргументов имеет значение.

source: Take the following examples:
ru: Возьмем следующие примеры::

source: This works even though it's unordered because ``'pizzas__toppings'`` already contains all the needed information, therefore the second argument ``'pizzas'`` is actually redundant.
ru: В это примере ``'pizzas__toppings'`` уже получает всю необходимую информацию, поэтому ``'pizzas'`` лишний. (FIXME)

source: This will raise a ``ValueError`` because of the attempt to redefine the queryset of a previously seen lookup. Note that an implicit queryset was created to traverse ``'pizzas'`` as part of the ``'pizzas__toppings'`` lookup.
ru: Вызовет ``ValueError`` при попытке подменить ``QuerySet`` предыдущей перезагрузки. Обратите внимание, неявно был создан ``QuerySet`` ``'pizzas'`` для ``'pizzas__toppings'``.

source: This will trigger an ``AttributeError`` because ``'pizza_list'`` doesn't exist yet when ``'pizza_list__toppings'`` is being processed.
ru: Вызовет ``AttributeError`` т.к. ``'pizza_list'`` еще не существует при обработке ``'pizza_list__toppings'``.

source: This consideration is not limited to the use of ``Prefetch`` objects. Some advanced techniques may require that the lookups be performed in a specific order to avoid creating extra queries; therefore it's recommended to always carefully order ``prefetch_related`` arguments.
ru: Эти замечания относятся не только к использованию объектов ``Prefetch``. Продвинутые запросы требуют внимания, чтобы избежать лишних запросов. Но особенно внимательно следует относится к порядку аргументов для ``prefetch_related``.

source: Sometimes, the Django query syntax by itself can't easily express a complex ``WHERE`` clause. For these edge cases, Django provides the ``extra()`` ``QuerySet`` modifier — a hook for injecting specific clauses into the SQL generated by a ``QuerySet``.
ru: Иногда, стандартных возможностей Django не хватает для создания сложного условия ``WHERE`` запроса. Для таких случаев, Django предоставляет метод ``extra()`` ``QuerySet`` — метод позволяющий изменять SQL сгенерированный ``QuerySet``.

source: Use this method as a last resort
ru: Используйте этот метод в крайнем случае

source: This is an old API that we aim to deprecate at some point in the future. Use it only if you cannot express your query using other queryset methods. If you do need to use it, please `file a ticket <https://code.djangoproject.com/newticket>`_ using the `QuerySet.extra keyword <https://code.djangoproject.com/query?status=assigned&status=new&keywords=~QuerySet.extra>`_ with your use case (please check the list of existing tickets first) so that we can enhance the QuerySet API to allow removing ``extra()``. We are no longer improving or fixing bugs for this method.
ru: Это старый API, который мы собираемся удалить в будущем. Используйте его, только если другие методы ``QuerySet`` вам не помогают. Если вам пришлось использовать этот метод, просим `создать "тикет" <https://code.djangoproject.com/newticket>`_, используя `тег QuerySet.extra <https://code.djangoproject.com/query?status=assigned&status=new&keywords=~QuerySet.extra>`_, и описать ваш случай (просим для начала ознакомиться с существующим списком случаев), чтобы мы могли улучшить QuerySet API, и удалить ``extra()``. Мы больше не улучшаем и не исправляем ошибки для этого метода.

source: For example, this use of ``extra()``::
ru: Например, это использование ``extra()``::

source: is equivalent to::
ru: аналогично::

source: The main benefit of using :class:`~django.db.models.expressions.RawSQL` is that you can set ``output_field`` if needed. The main downside is that if you refer to some table alias of the queryset in the raw SQL, then it is possible that Django might change that alias (for example, when the queryset is used as a subquery in yet another query).
ru: Главный плюс использования :class:`~django.db.models.expressions.RawSQL` в том, что вы можете указать ``output_field`` при необходимости. Главный минус -- если вы будете использовать метку какой-то таблицы из ``QuerySet`` в SQL, возможен случай, когда Django может изменить эту метку (например, если ``QuerySet`` используется как под-запрос в другом запросе).

source: By definition, these extra lookups may not be portable to different database engines (because you're explicitly writing SQL code) and violate the DRY principle, so you should avoid them if possible.
ru: По определению, дополнительные параметры поиска определенные в ``extra()`` не переносимы между различными типами данных(потому что вы используете непосредственно SQL) и нарушает принцип DRY, поэтому вы должны избегать использование этого метода.

source: Specify one or more of ``params``, ``select``, ``where`` or ``tables``. None of the arguments is required, but you should use at least one of them.
ru: Укажите одни или несколько параметров ``params``, ``select``, ``where`` или ``tables``. Ни один из аргументов не обязателен, но вы должны указать хотя бы один.

source: The ``select`` argument lets you put extra fields in the ``SELECT`` clause. It should be a dictionary mapping attribute names to SQL clauses to use to calculate that attribute.
ru: Параметр ``select`` позволяет добавить дополнительные поля в ``SELECT``. Это должен быть словарь отображающий названия атрибутов и выражение SQL для вычисления значения этого атрибута.

source: As a result, each ``Entry`` object will have an extra attribute, ``is_recent``, a boolean representing whether the entry's ``pub_date`` is greater than Jan. 1, 2006.
ru: В результате, каждый объект ``Entry`` будет содержать дополнительный атрибут, ``is_recent``, булево значение определяющее больше ли значение ``pub_date`` чем 1 января 2006.

source: Django inserts the given SQL snippet directly into the ``SELECT`` statement, so the resulting SQL of the above example would be something like::
ru: Django вставит добавленный кусок SQL непосредственно в оператор ``SELECT``, полученный SQL выглядит таким образом::

source: The next example is more advanced; it does a subquery to give each resulting ``Blog`` object an ``entry_count`` attribute, an integer count of associated ``Entry`` objects::
ru: Следующий пример сложнее. Он добавляет подзапрос, чтобы добавить каждому объекту ``Blog`` атрибут ``entry_count``, который равен количеству связанных объектов ``Entry``::

source: In this particular case, we're exploiting the fact that the query will already contain the ``blog_blog`` table in its ``FROM`` clause.
ru: В это примере, мы используем тот факт, что запрос уже будет содержать таблицу ``blog_blog`` в операторе ``FROM``.

source: The resulting SQL of the above example would be::
ru: Полученный SQL запрос выглядит таким образом::

source: Note that the parentheses required by most database engines around subqueries are not required in Django's ``select`` clauses. Also note that some database backends, such as some MySQL versions, don't support subqueries.
ru: Заметим, что скобки вокруг подзапроса, обязательные для некоторых баз данных, не обязательны для параметра ``select`` в Django. Также заметим, что некоторые типы баз данных, такие как некоторые версии MySQL, не поддерживают подзапросы.

source: In some rare cases, you might wish to pass parameters to the SQL fragments in ``extra(select=...)``. For this purpose, use the ``select_params`` parameter. Since ``select_params`` is a sequence and the ``select`` attribute is a dictionary, some care is required so that the parameters are matched up correctly with the extra select pieces. In this situation, you should use a :class:`collections.OrderedDict` for the ``select`` value, not just a normal Python dictionary.
ru: В некоторых редких случаях, вам понадобится передать параметры в фрагмент SQL из ``extra(select=...)``. Для этого, используйте параметр ``select_params``. Так как ``select_params`` это последовательность, а атрибут ``select`` словарь, необходима некоторая внимательность, чтобы параметры корректно были добавлены в оператор ``SELECT``. В этом случае следует использовать a :class:`collections.OrderedDict` для значения ``select``, вместо обычного словаря Python.

source: This will work, for example::
ru: Например::

source: If you need to use a literal ``%s`` inside your select string, use the sequence ``%%s``.
ru: Если вам необходимо использовать ``%s`` в запрашиваемой строке, используйте ``%%s``.

source: You can define explicit SQL ``WHERE`` clauses — perhaps to perform non-explicit joins — by using ``where``. You can manually add tables to the SQL ``FROM`` clause by using ``tables``.
ru: Вы можете добавить оператор SQL ``WHERE`` — возможно для выполнения не явного объединения таблиц — by using ``where``. Используя параметр ``tables`` можно добавить таблицы в оператор SQL ``FROM``.

source: ``where`` and ``tables`` both take a list of strings. All ``where`` parameters are "AND"ed to any other search criteria.
ru: ``where`` и ``tables`` принимают список строк. Все параметры ``where`` будут добавлены к остальным критериям через оператор "AND" .

source: ...translates (roughly) into the following SQL::
ru: ...будет переведено (примерно) в следующий SQL::
