Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/ref/models/querysets.po
Languages: ru

source: Also, note that ``reverse()`` should generally only be called on a ``QuerySet`` which has a defined ordering (e.g., when querying against a model which defines a default ordering, or when using :meth:`order_by()`). If no such ordering is defined for a given ``QuerySet``, calling ``reverse()`` on it has no real effect (the ordering was undefined prior to calling ``reverse()``, and will remain undefined afterward).
ru: Метод ``reverse()`` должен быть вызван для ``QuerySet`` с определенной сортировкой (например, при запросе модели с сортировкой по-умолчанию или после использования метода :meth:`order_by()`). Если сортировка не определена , вызов ``reverse()`` не будет иметь никакого эффекта.

source: Returns a new ``QuerySet`` that uses ``SELECT DISTINCT`` in its SQL query. This eliminates duplicate rows from the query results.
ru: Возвращает ``QuerySet`` с добавленным ``SELECT DISTINCT`` в SQL запрос. Повторяющиеся записи будут исключены из результатов запроса.

source: By default, a ``QuerySet`` will not eliminate duplicate rows. In practice, this is rarely a problem, because simple queries such as ``Blog.objects.all()`` don't introduce the possibility of duplicate result rows. However, if your query spans multiple tables, it's possible to get duplicate results when a ``QuerySet`` is evaluated. That's when you'd use ``distinct()``.
ru: По-умолчанию, ``QuerySet`` не исключает повторяющиеся записи. На практике, это редко является проблемой, простые запросы вроде ``Blog.objects.all()`` не создают повторяющиеся записи. Однако, если запрос использует несколько таблиц, возможно что ``QuerySet`` вернет повторяющиеся записи. И здесь вам пригодится ``distinct()``.

source: Any fields used in an :meth:`order_by` call are included in the SQL ``SELECT`` columns. This can sometimes lead to unexpected results when used in conjunction with ``distinct()``. If you order by fields from a related model, those fields will be added to the selected columns and they may make otherwise duplicate rows appear to be distinct. Since the extra columns don't appear in the returned results (they are only there to support ordering), it sometimes looks like non-distinct results are being returned.
ru: Любое поле используемое в :meth:`order_by` будет добавлено в список выбираемых колонок в части ``SELECT`` SQL запроса. Это может привести к непредвиденным результатам если вы используете ``distinct()``. При сортировке по колонке из связанной таблицы, эти колонки будет включены в список выбираемых колонок, что может сделать одинаковые строки результата уникальными. Т.к. эти дополнительные колонки не будет включены в результат(они используются только для определения сортировки), будет выглядеть так, вроде бы ``distinct()`` возвращает не уникальные элементы результатов.

source: Similarly, if you use a :meth:`values()` query to restrict the columns selected, the columns used in any :meth:`order_by()` (or default model ordering) will still be involved and may affect uniqueness of the results.
ru: Также, если вы используете метод :meth:`values()`, чтобы ограничить выбираемые поля, поля из :meth:`order_by()` (или сортировки по-умолчанию модели) так же будут включены и могут повлиять на уникальность результатов.

source: The moral here is that if you are using ``distinct()`` be careful about ordering by related models. Similarly, when using ``distinct()`` and :meth:`values()` together, be careful when ordering by fields not in the :meth:`values()` call.
ru: Мораль всего этого -- будьте осторожны при использовании ``distinct()`` и сортировки по полям из связанных моделей. Также, при использовании ``distinct()`` и :meth:`values()` вместе, будьте осторожны сортируя по полям не включенным в :meth:`values()`.

source: On PostgreSQL only, you can pass positional arguments (``*fields``) in order to specify the names of fields to which the ``DISTINCT`` should apply. This translates to a ``SELECT DISTINCT ON`` SQL query. Here's the difference. For a normal ``distinct()`` call, the database compares *each* field in each row when determining which rows are distinct. For a ``distinct()`` call with specified field names, the database will only compare the specified field names.
ru: Только для PostgreSQL можно указать позиционный аргумент (``*fields``) определяющий для каких полей применять ``DISTINCT``. Они будут добавлены в ``SELECT DISTINCT ON`` часть SQL запроса. Вот в чем разница. При обычном вызове ``distinct()``, база данных сравнивает *каждое* поле каждой строки для определения уникальности записи. При передаче полей в ``distinct()``, база данных будет сравнивать только указанные поля.

source: When you specify field names, you *must* provide an ``order_by()`` in the ``QuerySet``, and the fields in ``order_by()`` must start with the fields in ``distinct()``, in the same order.
ru: Если вы указываете поля, вы *должны* определить и ``order_by()`` для ``QuerySet``, и поля в ``order_by()`` должны начинаться с полей указанных в ``distinct()``, в том же порядке.

source: For example, ``SELECT DISTINCT ON (a)`` gives you the first row for each value in column ``a``. If you don't specify an order, you'll get some arbitrary row.
ru: Например, ``SELECT DISTINCT ON (a)`` возвращает вам первую запись для каждого уникального значения колонки ``a``. Если вы не определите сортировку, будут возвращены случайные записи для каждого уникального значения.

source: Examples (those after the first will only work on PostgreSQL)::
ru: Примеры (все, кроме первого, будут работать только в PostgreSQL)::

source: Keep in mind that :meth:`order_by` uses any default related model ordering that has been defined. You might have to explicitly order by the relation ``_id`` or referenced field to make sure the ``DISTINCT ON`` expressions match those at the beginning of the ``ORDER BY`` clause. For example, if the ``Blog`` model defined an :attr:`~django.db.models.Options.ordering` by ``name``::
ru: Обратите внимание, :meth:`order_by` используется сортировку, которая указана в связанной модели. Возможно вам понадобится явно отсортировать по внешнему ключу, или полю связанной модели, чтобы ``DISTINCT ON`` использовал поле аналогичное первому полю в ``ORDER BY``. Например, если модель ``Blog`` определена с :attr:`~django.db.models.Options.ordering` равным ``name``::

source: ...wouldn't work because the query would be ordered by ``blog__name`` thus mismatching the ``DISTINCT ON`` expression. You'd have to explicitly order by the relation `_id` field (``blog_id`` in this case) or the referenced one (``blog__pk``) to make sure both expressions match.
ru: ...не будет работать т.к. запрос отсортирует по ``blog__name``, что не соответствует полю в ``DISTINCT ON``. Вам необходимо явно отсортировать по внешнему ключу (``blog_id`` в этому случае), или полю связанной модели (``blog__pk``), чтобы поля совпадали.

source: Returns a ``QuerySet`` that returns dictionaries, rather than model instances, when used as an iterable.
ru: Возвращает ``QuerySet`` , который возвращает словари с результатом вместо объектов моделей.

source: Each of those dictionaries represents an object, with the keys corresponding to the attribute names of model objects.
ru: Каждый словарь представляет объект, ключи которого соответствуют полям модели.

source: This example compares the dictionaries of ``values()`` with the normal model objects::
ru: Этот пример показывает разницу между результатом возвращаемым ``values()`` и объектами модели::

source: The ``values()`` method takes optional positional arguments, ``*fields``, which specify field names to which the ``SELECT`` should be limited. If you specify the fields, each dictionary will contain only the field keys/values for the fields you specify. If you don't specify the fields, each dictionary will contain a key and value for every field in the database table.
ru: Метод ``values()`` принимает дополнительные позиционные аргументы, ``*fields``, которые определяют какие поля будут получены через ``SELECT``. Каждый словарь будет содержать только указанные поля. Если поля не указаны, каждый словарь будет содержать все данные из таблицы в базе данных.

source: A few subtleties that are worth mentioning:
ru: Следует упомянуть несколько тонкостей:

source: If you have a field called ``foo`` that is a :class:`~django.db.models.ForeignKey`, the default ``values()`` call will return a dictionary key called ``foo_id``, since this is the name of the hidden model attribute that stores the actual value (the ``foo`` attribute refers to the related model). When you are calling ``values()`` and passing in field names, you can pass in either ``foo`` or ``foo_id`` and you will get back the same thing (the dictionary key will match the field name you passed in).
ru: Если модель содержит поле ``foo`` типа :class:`~django.db.models.ForeignKey`, по-умолчанию ``values()`` вернет словарь с ключом ``foo_id``, т.к. это названия скрытого поля, которое на самом деле хранит значение (атрибут ``foo`` отображает связанную модель). Вызывая ``values()`` вы можете передать ``foo`` или ``foo_id`` и получите тот же результат (ключ словаря будет равен переданному значению).

source: For example::
ru: Например::

source: When using ``values()`` together with :meth:`distinct()`, be aware that ordering can affect the results. See the note in :meth:`distinct` for details.
ru: Используя ``values()`` с :meth:`distinct()`, обратите внимание, что сортировка может повлиять на результат. Подробности в описании метода :meth:`distinct`.

source: If you use a ``values()`` clause after an :meth:`extra()` call, any fields defined by a ``select`` argument in the :meth:`extra()` must be explicitly included in the ``values()`` call. Any :meth:`extra()` call made after a ``values()`` call will have its extra selected fields ignored.
ru: Используя ``values()`` после вызова :meth:`extra()`, добавьте в ``values()`` все поля указанные в аргументе ``select`` использованном при вызове :meth:`extra()`. При вызове :meth:`extra()` после ``values()`` все указанные дополнительные поля будут проигнорированы.

source: Calling :meth:`only()` and :meth:`defer()` after ``values()`` doesn't make sense, so doing so will raise a ``NotImplementedError``.
ru: Вызов :meth:`only()` или :meth:`defer()` после ``values()`` не имеет смысла. В таком случае будет вызвано исключение ``NotImplementedError``.

source: It is useful when you know you're only going to need values from a small number of the available fields and you won't need the functionality of a model instance object. It's more efficient to select only the fields you need to use.
ru: Полезен, если вам нужны только данные некоторых полей и не нужен функционал объектов моделей. Более эффективно получить только необходимые данные.

source: Finally, note that you can call ``filter()``, ``order_by()``, etc. after the ``values()`` call, that means that these two calls are identical::
ru: Обратите внимание, при вызове ``filter()``, ``order_by()`` и других методов после вызова ``values()``, означает, что следующие объекты одинаковы::

source: The people who made Django prefer to put all the SQL-affecting methods first, followed (optionally) by any output-affecting methods (such as ``values()``), but it doesn't really matter. This is your chance to really flaunt your individualism.
ru: Разработчики Django предпочитают использовать в первую очередь методы влияющие на SQL-запрос, далее методы влияющие на вывод данных (такие как ``values()``), хотя это и не имеет значения. Это ваш шанс проявить индивидуальность.

source: You can also refer to fields on related models with reverse relations through ``OneToOneField``, ``ForeignKey`` and ``ManyToManyField`` attributes::
ru: Вы также можете обратиться к обратно связанным моделям через поля ``OneToOneField``, ``ForeignKey`` и ``ManyToManyField``::

source: Because :class:`~django.db.models.ManyToManyField` attributes and reverse relations can have multiple related rows, including these can have a multiplier effect on the size of your result set. This will be especially pronounced if you include multiple such fields in your ``values()`` query, in which case all possible combinations will be returned.
ru: Так как :class:`~django.db.models.ManyToManyField` и обратная связь может содержать множество связанных записей, выбор этих данных может многократно увеличить размер возвращаемых данных. Это будет особенно заметно, если вы включите несколько таких полей в ``values()``, в таком случае будут возвращены все возможные комбинации значений.

source: If you only pass in a single field, you can also pass in the ``flat`` parameter. If ``True``, this will mean the returned results are single values, rather than one-tuples. An example should make the difference clearer::
ru: Если вы указали одно поле, можете указать аргумент ``flat``. При ``True``, каждая запись будет возвращена как отдельное значение, а не одноэлементный кортеж. Например::

source: It is an error to pass in ``flat`` when there is more than one field.
ru: Если вы указали больше одного поля, использование ``flat`` будет ошибкой.

source: If you don't pass any values to ``values_list()``, it will return all the fields in the model, in the order they were declared.
ru: Если поля не будут указаны при вызове ``values_list()``, будут возвращены все поля модели в порядке, в котором они были объявлены.

source: A common need is to get a specific field value of a certain model instance. To achieve that, use ``values_list()`` followed by a ``get()`` call::
ru: Распространенная задача получить значение поля из определенной записи. Для этого используйте ``values_list()`` и ``get()``::

source: Returns a ``QuerySet`` that evaluates to a list of :class:`datetime.date` objects representing all available dates of a particular kind within the contents of the ``QuerySet``.
ru: Возвращает ``QuerySet``, который возвращает список объектов :class:`datetime.date`, отображающих возможные даты в контексте ``QuerySet``.

source: ``field`` should be the name of a ``DateField`` of your model. ``kind`` should be either ``"year"``, ``"month"`` or ``"day"``. Each ``datetime.date`` object in the result list is "truncated" to the given ``type``.
ru: ``field`` должен быть названием поля ``DateField`` вашей модели. ``kind`` должен быть ``"year"``, ``"month"`` или ``"day"``. Каждый объект ``datetime.date`` - результат "урезания" данных в соответствии с указанным ``type``.

source: ``"year"`` returns a list of all distinct year values for the field.
ru: ``"year"`` возвращает список уникальных значений года из всех дат указанного поля.

source: ``"month"`` returns a list of all distinct year/month values for the field.
ru: ``"month"`` возвращает список уникальных значений года/месяца из всех дат указанного поля.

source: ``"day"`` returns a list of all distinct year/month/day values for the field.
ru: ``"day"`` возвращает список уникальных значений года/месяца/дня из всех дат указанного поля.

source: ``order``, which defaults to ``'ASC'``, should be either ``'ASC'`` or ``'DESC'``. This specifies how to order the results.
ru: ``order`` -- сортировка значений. По-умолчанию ``'ASC'``, должна быть ``'ASC'`` или ``'DESC'``.

source: Examples::
ru: Например::

source: Returns a ``QuerySet`` that evaluates to a list of :class:`datetime.datetime` objects representing all available dates of a particular kind within the contents of the ``QuerySet``.
ru: Возвращает ``QuerySet``, который возвращает список объектов :class:`datetime.datetime`, отображающих возможные даты в контексте ``QuerySet``.

source: ``field_name`` should be the name of a ``DateTimeField`` of your model.
ru: ``field_name`` -- название поля модели типа ``DateTimeField``.

source: ``kind`` should be either ``"year"``, ``"month"``, ``"day"``, ``"hour"``, ``"minute"`` or ``"second"``. Each ``datetime.datetime`` object in the result list is "truncated" to the given ``type``.
ru: ``kind`` должен быть ``"year"``, ``"month"``, ``"day"``, ``"hour"``, ``"minute"`` или ``"second"``. Каждый объект ``datetime.datetime`` результат "урезания" данных в соответствии с указанным ``kind``.

source: ``tzinfo`` defines the time zone to which datetimes are converted prior to truncation. Indeed, a given datetime has different representations depending on the time zone in use. This parameter must be a :class:`datetime.tzinfo` object. If it's ``None``, Django uses the :ref:`current time zone <default-current-time-zone>`. It has no effect when :setting:`USE_TZ` is ``False``.
ru: ``tzinfo`` указывает часовой пояс используемый при создании объектов datetime. Принимает объект :class:`datetime.tzinfo`. Если передать ``None``, Django использует :ref:`текущий часовой пояс <default-current-time-zone>`. Не используется при :setting:`USE_TZ` равном ``False``.

source: This function performs time zone conversions directly in the database. As a consequence, your database must be able to interpret the value of ``tzinfo.tzname(None)``. This translates into the following requirements:
ru: Функция выполняет преобразование даты на уровне базы данных. Поэтому ваша база данных должна понимать значение вида ``tzinfo.tzname(None)``. Для этого необходимо:

source: PostgreSQL: no requirements (see `Time Zones`_).
ru: PostgreSQL: нет дополнительных требований (смотрите `Time Zones`_).

source: Oracle: no requirements (see `Choosing a Time Zone File`_).
ru: Oracle: нет дополнительных требований (смотрите `Choosing a Time Zone File`_).

source: Calling none() will create a queryset that never returns any objects and no query will be executed when accessing the results. A qs.none() queryset is an instance of ``EmptyQuerySet``.
ru: Вызов none() вернет queryset, который никогда не возвращает объекты и не выполняет запросы. qs.none() возвращает экземпляр ``EmptyQuerySet``.

source: Returns a *copy* of the current ``QuerySet`` (or ``QuerySet`` subclass). This can be useful in situations where you might want to pass in either a model manager or a ``QuerySet`` and do further filtering on the result. After calling ``all()`` on either object, you'll definitely have a ``QuerySet`` to work with.
ru: Возвращает *копию* текущего ``QuerySet`` (или подкласса ``QuerySet``). Это может быть полезно, если вам нужно передать в функцию менеджер модели или ``QuerySet`` и выполнить дальнейшую фильтрацию результата. После вызова ``all()`` вы получите копию ``QuerySet``, которую можно передать в функцию не боясь, что она изменит текущий ``QuerySet``.

source: When a ``QuerySet`` is :ref:`evaluated <when-querysets-are-evaluated>`, it typically caches its results. If the data in the database might have changed since a ``QuerySet`` was evaluated, you can get updated results for the same query by calling ``all()`` on a previously evaluated ``QuerySet``.
ru: Если ``QuerySet`` был :ref:`выполнен <when-querysets-are-evaluated>`, он кэширует результат. Если данные в базе данных поменялись после выполнения ``QuerySet``, вы можете получить обновленный результат запроса, вызывав ``all()`` уже выполненного ``QuerySet``.

source: Returns a ``QuerySet`` that will "follow" foreign-key relationships, selecting additional related-object data when it executes its query. This is a performance booster which results in a single more complex query but means later use of foreign-key relationships won't require database queries.
ru: Возвращает ``QuerySet`` который автоматически включает в выборку данные связанных объектов при выполнении запроса. Повышает производительность, т.к. при доступе к связанным объектам через модель не потребуются дополнительные запросы в базу данных.

source: The following examples illustrate the difference between plain lookups and ``select_related()`` lookups. Here's standard lookup::
ru: Этот пример отображает разницу между обычной выборкой и с ``select_related()``. Обычная выборка::

source: And here's ``select_related`` lookup::
ru: И с ``select_related``::

source: You can use ``select_related()`` with any queryset of objects::
ru: Вы можете использовать ``select_related()`` с любым "queryset"::

source: The order of ``filter()`` and ``select_related()`` chaining isn't important. These querysets are equivalent::
ru: Порядок использования ``filter()`` и ``select_related()`` не важен. Эти экземпляры ``QuerySet`` одинаковы::

source: You can follow foreign keys in a similar way to querying them. If you have the following models::
ru: Можно указывать поля связанных моделей как и при запросе. Например, у нас есть такие модели::

source: ... then a call to ``Book.objects.select_related('author__hometown').get(id=4)`` will cache the related ``Person`` *and* the related ``City``::
ru: ...тогда вызов ``Book.objects.select_related('person__hometown').get(id=4)`` получит данные связанных ``Person`` *и* связанных ``City``::

source: You can refer to any :class:`~django.db.models.ForeignKey` or :class:`~django.db.models.OneToOneField` relation in the list of fields passed to ``select_related()``.
ru: Вы можете указать любое :class:`~django.db.models.ForeignKey` или :class:`~django.db.models.OneToOneField` поле в ``select_related()``.

source: You can also refer to the reverse direction of a :class:`~django.db.models.OneToOneField` in the list of fields passed to ``select_related`` — that is, you can traverse a :class:`~django.db.models.OneToOneField` back to the object on which the field is defined. Instead of specifying the field name, use the :attr:`related_name <django.db.models.ForeignKey.related_name>` for the field on the related object.
ru: Вы можете указать обратную связь для :class:`~django.db.models.OneToOneField` в списке полей — то есть, вы можете получить объект в котором определено поле :class:`~django.db.models.OneToOneField`. Вместо названия поля используйте значение параметра :attr:`related_name <django.db.models.ForeignKey.related_name>`.

source: There may be some situations where you wish to call ``select_related()`` with a lot of related objects, or where you don't know all of the relations. In these cases it is possible to call ``select_related()`` with no arguments. This will follow all non-null foreign keys it can find - nullable foreign keys must be specified. This is not recommended in most cases as it is likely to make the underlying query more complex, and return more data, than is actually needed.
ru: В некоторых ситуациях вам может понадобится указать большое количество полей в ``select_related()``, или вы просто не знаете всех связей. В таком случае можно использовать ``select_related()`` без аргументов. Будут использовать все связи кроме связей с ``null=True``, такие связи необходимо указывать явно. Такой способ не рекомендуется т.к. может привести к очень сложному запросу и получению большого количества ненужных данных.

source: If you need to clear the list of related fields added by past calls of ``select_related`` on a ``QuerySet``, you can pass ``None`` as a parameter::
ru: Чтобы очистить список полей указанных ранее ``select_related`` для ``QuerySet``, предайте ``None``::

source: Chaining ``select_related`` calls works in a similar way to other methods - that is that ``select_related('foo', 'bar')`` is equivalent to ``select_related('foo').select_related('bar')``.
ru: Несколько вызовов ``select_related`` теперь работает как и для других методов -- то есть ``select_related('foo', 'bar')`` аналогично ``select_related('foo').select_related('bar')``.

source: Returns a ``QuerySet`` that will automatically retrieve, in a single batch, related objects for each of the specified lookups.
ru: Возвращает ``QuerySet``, который получает "за один подход" связанные объекты для каждого из указанных параметров поиска.
