Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/ref/models/relations.po
Languages: ru

source: Related objects reference
ru: Работа со связанными объектами

source: A "related manager" is a manager used in a one-to-many or many-to-many related context. This happens in two cases:
ru: "Менеджер связанных объектов" -- это менеджер, который используется для связей один-ко-многим и многие-ко-многим. Это происходит в двух случаях:

source: The "other side" of a :class:`~django.db.models.ForeignKey` relation. That is::
ru: "Обратная связь" для :class:`~django.db.models.ForeignKey`. Например::

source: In the above example, the methods below will be available on the manager ``reporter.article_set``.
ru: В этом примере, методы описанные ниже будут доступны через менеджер ``reporter.article_set``.

source: Both sides of a :class:`~django.db.models.ManyToManyField` relation::
ru: Для обоих сторон связи через :class:`~django.db.models.ManyToManyField`::

source: In this example, the methods below will be available both on ``topping.pizza_set`` and on ``pizza.toppings``.
ru: В этом примере, методы описанные ниже будут доступны для менеджеров ``topping.pizza_set`` и ``pizza.toppings``.

source: Adds the specified model objects to the related object set.
ru: Добавляет указанный объект модели к множеству связанных объектов.

source: Example::
ru: Например::

source: In the example above, in the case of a :class:`~django.db.models.ForeignKey` relationship, :meth:`QuerySet.update() <django.db.models.query.QuerySet.update>` is used to perform the update. This requires the objects to already be saved.
ru: В примере выше, при связи через :class:`~django.db.models.ForeignKey` используется :meth:`QuerySet.update() <django.db.models.query.QuerySet.update>`. Для этого объекты должны быть сохранены.

source: You can use the ``bulk=False`` argument to instead have the related manager perform the update by calling ``e.save()``.
ru: Вы можете указать аргумент ``bulk=False``, чтобы менеджер связанных объектов использовал ``e.save()``.

source: Using ``add()`` with a many-to-many relationship, however, will not call any ``save()`` methods (the ``bulk`` argument doesn't exist), but rather create the relationships using :meth:`QuerySet.bulk_create() <django.db.models.query.QuerySet.bulk_create>`. If you need to execute some custom logic when a relationship is created, listen to the :data:`~django.db.models.signals.m2m_changed` signal, which will trigger ``pre_add`` and ``post_add`` actions.
ru: Использование ``add()`` для связей многие-ко-многим не вызывает метод ``save()`` (аргумент ``bulk`` отсутствует), а создает связывающие объекты с помощью :meth:`QuerySet.bulk_create() <django.db.models.query.QuerySet.bulk_create>`. Если вам необходима дополнительная логика при обновлении связей, обрабатывайте сигнал :data:`~django.db.models.signals.m2m_changed`, который сработает при действиях ``pre_add`` и ``post_add``.

source: Using ``add()`` on a relation that already exists won't duplicate the relation, but it will still trigger signals.
ru: Использование ``add()`` для уже уже существующих связей не будет вызывать их дублирования, но сигнал все равно будет срабатывать.

source: Creates a new object, saves it and puts it in the related object set. Returns the newly created object::
ru: Создает новый объект, сохраняет его и добавляет к связанным объектам. Возвращает созданный объект::

source: This is equivalent to (but much simpler than)::
ru: Аналогично (но значительно проще)::

source: Note that there's no need to specify the keyword argument of the model that defines the relationship. In the above example, we don't pass the parameter ``blog`` to ``create()``. Django figures out that the new ``Entry`` object's ``blog`` field should be set to ``b``.
ru: Заметим, что не обязательно указывать аргумент для поля, которое определяет связь. В примере выше, мы не передавали аргумент ``blog`` для ``create()``. Django самостоятельно определит, что поле ``blog`` нового объекта ``Entry`` должно содержать объект ``b``.

source: Removes the specified model objects from the related object set::
ru: Удаляет указанный объект из списка связанных объектов::

source: Similar to :meth:`add()`, ``e.save()`` is called in the example above to perform the update. Using ``remove()`` with a many-to-many relationship, however, will delete the relationships using :meth:`QuerySet.delete()<django.db.models.query.QuerySet.delete>` which means no model ``save()`` methods are called; listen to the :data:`~django.db.models.signals.m2m_changed` signal if you wish to execute custom code when a relationship is deleted.
ru: Как и :meth:`add()`, для обновления данных вызывается метод ``e.save()``. При использовании ``remove()`` для связей многое-ко-многим связи удаляются с помощью метода :meth:`QuerySet.delete()<django.db.models.query.QuerySet.delete>`, метод модели ``save()`` не вызывается. Если вам необходима дополнительная логика при обновлении связей, обрабатывайте сигнал :data:`~django.db.models.signals.m2m_changed`.

source: For :class:`~django.db.models.ForeignKey` objects, this method only exists if ``null=True``. If the related field can't be set to ``None`` (``NULL``), then an object can't be removed from a relation without being added to another. In the above example, removing ``e`` from ``b.entry_set()`` is equivalent to doing ``e.blog = None``, and because the ``blog`` :class:`~django.db.models.ForeignKey` doesn't have ``null=True``, this is invalid.
ru: Метод существует только для :class:`~django.db.models.ForeignKey` с ``null=True``. Если внешний ключ не может быть установлен в ``None`` (``NULL``), объект не может быть удален из связи без добавления нового объекта. В примере выше, удаление ``e`` из ``b.entry_set()`` аналогично ``e.blog = None``, и так как :class:`~django.db.models.ForeignKey` в ``blog`` не содержит ``null=True``, это невозможно.

source: For :class:`~django.db.models.ForeignKey` objects, this method accepts a ``bulk`` argument to control how to perform the operation. If ``True`` (the default), ``QuerySet.update()`` is used. If ``bulk=False``, the ``save()`` method of each individual model instance is called instead. This triggers the :data:`~django.db.models.signals.pre_save` and :data:`~django.db.models.signals.post_save` signals and comes at the expense of performance.
ru: Для объектов :class:`~django.db.models.ForeignKey` метод принимает аргумент ``bulk``, который определяет работу сохранения. Если указать ``True`` (по умолчанию), будет использоваться ``QuerySet.update()``. При ``bulk=False`` будет вызван метод ``save()`` для каждого объекта. Это вызывает сигналы :data:`~django.db.models.signals.pre_save` и :data:`~django.db.models.signals.post_save`, что работает немного медленне.

source: For many-to-many relationships, the ``bulk`` keyword argument doesn't exist.
ru: Для связей многие-ко-многим ключевой аргумент ``bulk`` отсутствует.

source: Removes all objects from the related object set::
ru: Удаляет все объекты из списка связанных::

source: Note this doesn't delete the related objects -- it just disassociates them.
ru: Заметим, что связанные объекты не удаляются -- просто разрывается связь.

source: Just like ``remove()``, ``clear()`` is only available on :class:`~django.db.models.ForeignKey`\s where ``null=True`` and it also accepts the ``bulk`` keyword argument.
ru: Так же как и ``remove()``, ``clear()`` доступен только для :class:`~django.db.models.ForeignKey` с ``null=True`` и принимает аргумент ``bulk``.

source: Replace the set of related objects::
ru: Удаляет все объекты из списка связанных::

source: This method accepts a ``clear`` argument to control how to perform the operation. If ``False`` (the default), the elements missing from the new set are removed using ``remove()`` and only the new ones are added. If ``clear=True``, the ``clear()`` method is called instead and the whole set is added at once.
ru: Этот метод принимает аргумент ``clear``, чтобы управлять выполнение операции. При ``False`` (по умолчанию), объекты, которые отсутствуют в новом множестве, будут удалены с помощью команды ``remove()``, и только новые объекты будут добавлены. При ``clear=True``, вызывается метод ``clear()`` и все множество добавляет за раз.

source: For :class:`~django.db.models.ForeignKey` objects, the ``bulk`` argument is passed on to :meth:`add` and :meth:`remove`.
ru: Для объектов класса :class:`~django.db.models.ForeignKey` аргумент ``bulk`` передается в методах :meth:`add` и :meth:`remove`.

source: Note that since ``set()`` is a compound operation, it is subject to race conditions. For instance, new objects may be added to the database in between the call to ``clear()`` and the call to ``add()``.
ru: Обратите внимание, т.к. ``set()`` составная операция, она подвержена состоянию гонки. Например, в базу данных могут быть добавлены новые объекты между вызовами ``clear()`` и ``add()``.

source: Note that ``add()``, ``create()``, ``remove()``, ``clear()``, and ``set()`` all apply database changes immediately for all types of related fields. In other words, there is no need to call ``save()`` on either end of the relationship.
ru: Обратите внимание, ``add()``, ``create()``, ``remove()`` и ``clear()`` сразу сохраняют изменения для всех типов связей. Другими словами, нет необходимости вызывать ``save()``.

source: Also, if you are using :ref:`an intermediate model <intermediary-manytomany>` for a many-to-many relationship, then the ``add()``, ``create()``, ``remove()``, and ``set()`` methods are disabled.
ru: Также, если вы используете :ref:`промежуточную модель <intermediary-manytomany>` для связи многое ко многим, методы ``add()``, ``create()``, ``remove()`` и ``set()`` могут быть не доступны.

source: If you use :meth:`~django.db.models.query.QuerySet.prefetch_related`, the ``add()``, ``remove()``, ``clear()``, and ``set()`` methods clear the prefetched cache.
ru: Если вы используете :meth:`~django.db.models.query.QuerySet.prefetch_related`, методы ``add()``, ``remove()``, ``clear()`` и ``set()`` очистят кэш.
