Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/index.po
Languages: ru

source: Django documentation
ru: Документация Django

source: Everything you need to know about Django.
ru: Все, что вам нужно знать о Django.

source: Getting help
ru: Получение помощи

source: Having trouble? We'd like to help!
ru: Проблемы? Мы готовы помочь!

source: Try the :doc:`FAQ <faq/index>` -- it's got answers to many common questions.
ru: Попробуйте :doc:`FAQ <faq/index>` -- там есть ответы на множество стандартных вопросов.

source: Looking for specific information? Try the :ref:`genindex`, :ref:`modindex` or the :doc:`detailed table of contents <contents>`.
ru: Ищете специализированную информацию? Попробуйте :ref:`genindex`, :ref:`modindex` или the :doc:`detailed table of contents <contents>`.

source: Search for information in the archives of the |django-users| mailing list, or `post a question`_.
ru: Ищите инормацию в архиве |django-users| или `задайте вопрос <https://groups.google.com/forum/#!forum/django-users>`_.

source: Ask a question in the `#django IRC channel`_, or search the `IRC logs`_ to see if it's been asked before.
ru: Задавайте вопросы в `#django IRC channel`_ или ищите в `IRC logs`_ вдруг они были заданы ранее.

source: Report bugs with Django in our `ticket tracker`_.
ru: Сообщайте о проблемах в Django с помощью нашего `ticket tracker`_.

source: How the documentation is organized
ru: Как организована документация

source: Django has a lot of documentation. A high-level overview of how it's organized will help you know where to look for certain things:
ru: Документация Django очень обширна. Это описание поможет вам понять как она организована и подскажет где искать необходимую информацию:

source: :doc:`Tutorials </intro/index>` take you by the hand through a series of steps to create a Web application. Start here if you're new to Django or Web application development. Also look at the ":ref:`index-first-steps`" below.
ru: :doc:`Учебник </intro/index>` расскажет вам как создать веб-приложение. Начните с него, если вы новичок в Django или разработке веб-приложений. Также обратите внимание на ":ref:`index-first-steps`" ниже.

source: :doc:`Topic guides </topics/index>` discuss key topics and concepts at a fairly high level and provide useful background information and explanation.
ru: :doc:`Список тем </topics/index>` содержит основные концепции и разделы, которые предоставляют базовую информацию для понимания.

source: :doc:`Reference guides </ref/index>` contain technical reference for APIs and other aspects of Django's machinery. They describe how it works and how to use it but assume that you have a basic understanding of key concepts.
ru: :doc:`Описание API </ref/index>` содержит техническое описание API и других механизмов Django. Рассказывает как работает Django и предполагает, что вы знакомы с базовыми концепциями.

source: :doc:`How-to guides </howto/index>` are recipes. They guide you through the steps involved in addressing key problems and use-cases. They are more advanced than tutorials and assume some knowledge of how Django works.
ru: :doc:`Практические руководства </howto/index>` содержат рецепты. Они описывают как решить конкретные задачи и проблемы. Они более продвинуты чем учебник и предполагают знания Django.

source: First steps
ru: Первые шаги

source: Are you new to Django or to programming? This is the place to start!
ru: Вы новичок в Django или программировании? Вам сюда!

source: **From scratch:** :doc:`Overview <intro/overview>` | :doc:`Installation <intro/install>`
ru: **Начало:** :doc:`Обзор <intro/overview>` | :doc:`Установка <intro/install>`

source: **Tutorial:** :doc:`Part 1: Requests and responses <intro/tutorial01>` | :doc:`Part 2: Models and the admin site <intro/tutorial02>` | :doc:`Part 3: Views and templates <intro/tutorial03>` | :doc:`Part 4: Forms and generic views <intro/tutorial04>` | :doc:`Part 5: Testing <intro/tutorial05>` | :doc:`Part 6: Static files <intro/tutorial06>` | :doc:`Part 7: Customizing the admin site <intro/tutorial07>`
ru: **Учебник:** :doc:`Часть 1: Запросы и ответы <intro/tutorial01>` | :doc:`Часть 2: Модели и интерфейс администратора <intro/tutorial02>` | :doc:`Часть 3: Представления и шаблоны <intro/tutorial03>` | :doc:`Часть 4: Формы и общие представления <intro/tutorial04>` | :doc:`Часть 5: Тестирование <intro/tutorial05>` | :doc:`Часть 6: Статические файлы <intro/tutorial06>` | :doc:`Part 7: Настройка интерфейса администратора <intro/tutorial07>`

source: **Advanced Tutorials:** :doc:`How to write reusable apps <intro/reusable-apps>` | :doc:`Writing your first patch for Django <intro/contributing>`
ru: **Для продвинутых:** :doc:`Как создавать приложения для Django <intro/reusable-apps>` | :doc:`Writing your first patch for Django <intro/contributing>`

source: The model layer
ru: ORM и работа с базой данных

source: Django provides an abstraction layer (the "models") for structuring and manipulating the data of your Web application. Learn more about it below:
ru: Django предоставляет абстрактный уровень ("модели") для создания структуры и управления данными вашего приложения. Прочитать об это вы можете в следующих разделах:

source: **Models:** :doc:`Introduction to models <topics/db/models>` | :doc:`Field types <ref/models/fields>` | :doc:`Indexes <ref/models/indexes>` | :doc:`Meta options <ref/models/options>` | :doc:`Model class <ref/models/class>`
ru: **Модели:** :doc:`Введение в модели <topics/db/models>` | :doc:`Типы полей <ref/models/fields>` | :doc:`Индексы <ref/models/indexes>` | :doc:`Настройки модели <ref/models/options>` | :doc:`Класс модели <ref/models/class>`

source: **QuerySets:** :doc:`Making queries <topics/db/queries>` | :doc:`QuerySet method reference <ref/models/querysets>` | :doc:`Lookup expressions <ref/models/lookups>`
ru: **QuerySet:** :doc:`Выполнение запросов <topics/db/queries>` | :doc:`Методы QuerySet <ref/models/querysets>` | :doc:`Lookup expressions <ref/models/lookups>`

source: **Model instances:** :doc:`Instance methods <ref/models/instances>` | :doc:`Accessing related objects <ref/models/relations>`
ru: **Объекты модели:** :doc:`Методы модели <ref/models/instances>` | :doc:`Работа со связанными объектами <ref/models/relations>`

source: **Migrations:** :doc:`Introduction to Migrations<topics/migrations>` | :doc:`Operations reference <ref/migration-operations>` | :doc:`SchemaEditor <ref/schema-editor>` | :doc:`Writing migrations <howto/writing-migrations>`
ru: **Миграции:** :doc:`Введение в миграции <topics/migrations>` | :doc:`Operations reference <ref/migration-operations>` | :doc:`SchemaEditor <ref/schema-editor>` | :doc:`Writing migrations <howto/writing-migrations>`

source: **Advanced:** :doc:`Managers <topics/db/managers>` | :doc:`Raw SQL <topics/db/sql>` | :doc:`Transactions <topics/db/transactions>` | :doc:`Aggregation <topics/db/aggregation>` | :doc:`Search <topics/db/search>` | :doc:`Custom fields <howto/custom-model-fields>` | :doc:`Multiple databases <topics/db/multi-db>` | :doc:`Custom lookups <howto/custom-lookups>` | :doc:`Query Expressions <ref/models/expressions>` | :doc:`Conditional Expressions <ref/models/conditional-expressions>` | :doc:`Database Functions <ref/models/database-functions>`
ru: **Продвинутый:** :doc:`Менеджеры <topics/db/managers>` | :doc:`Чистый SQL <topics/db/sql>` | :doc:`Транзакции <topics/db/transactions>` | :doc:`Агрегация <topics/db/aggregation>` | :doc:`Search <topics/db/search>` | :doc:`Создание собственных полей <howto/custom-model-fields>` | :doc:`Несколько баз данных <topics/db/multi-db>` | :doc:`Custom lookups <howto/custom-lookups>` | :doc:`Query Expressions <ref/models/expressions>` | :doc:`Conditional Expressions <ref/models/conditional-expressions>` | :doc:`Database Functions <ref/models/database-functions>`

source: **Other:** :doc:`Supported databases <ref/databases>` | :doc:`Legacy databases <howto/legacy-databases>` | :doc:`Providing initial data <howto/initial-data>` | :doc:`Optimize database access <topics/db/optimization>` | :doc:`PostgreSQL specific features <ref/contrib/postgres/index>`
ru: **Остальное:** :doc:`Supported databases <ref/databases>` | :doc:`Унаследованные базы данных <howto/legacy-databases>` | :doc:`Заполнение начальными данными <howto/initial-data>` | :doc:`Оптимизация работы с базой данных <topics/db/optimization>` | :doc:`Возможности PostgreSQL <ref/contrib/postgres/index>`

source: The view layer
ru: Представления

source: Django has the concept of "views" to encapsulate the logic responsible for processing a user's request and for returning the response. Find all you need to know about views via the links below:
ru: Django использует "представления" для инкапсуляции логики обработки запроса и ответа на этот запрос. Всю необходимую информацию о представлениях вы можете найти ниже:

source: **The basics:** :doc:`URLconfs <topics/http/urls>` | :doc:`View functions <topics/http/views>` | :doc:`Shortcuts <topics/http/shortcuts>` | :doc:`Decorators <topics/http/decorators>`
ru: **Основа:** :doc:`Конфигурация URL-ов <topics/http/urls>` | :doc:`Функции представления <topics/http/views>` | :doc:`Вспомогательные функции <topics/http/shortcuts>` | :doc:`Декораторы <topics/http/decorators>`

source: **Reference:** :doc:`Built-in Views <ref/views>` | :doc:`Request/response objects <ref/request-response>` | :doc:`TemplateResponse objects <ref/template-response>`
ru: **Справка:** :doc:`Built-in Views <ref/views>` | :doc:`Объекты запроса и ответа <ref/request-response>` | :doc:`TemplateResponse objects <ref/template-response>`

source: **File uploads:** :doc:`Overview <topics/http/file-uploads>` | :doc:`File objects <ref/files/file>` | :doc:`Storage API <ref/files/storage>` | :doc:`Managing files <topics/files>` | :doc:`Custom storage <howto/custom-file-storage>`
ru: **Загрузка файлов:** :doc:`Основы <topics/http/file-uploads>` | :doc:`File objects <ref/files/file>` | :doc:`Storage API <ref/files/storage>` | :doc:`Управление файлами <topics/files>` | :doc:`Custom storage <howto/custom-file-storage>`

source: **Class-based views:** :doc:`Overview <topics/class-based-views/index>` | :doc:`Built-in display views <topics/class-based-views/generic-display>` | :doc:`Built-in editing views <topics/class-based-views/generic-editing>` | :doc:`Using mixins <topics/class-based-views/mixins>` | :doc:`API reference <ref/class-based-views/index>` | :doc:`Flattened index<ref/class-based-views/flattened-index>`
ru: **Преставления-классы:** :doc:`Введение <topics/class-based-views/index>` | :doc:`Общие представления-классы <topics/class-based-views/generic-display>` | :doc:`Обработка форм <topics/class-based-views/generic-editing>` | :doc:`Using mixins <topics/class-based-views/mixins>` | :doc:`API представлений <ref/class-based-views/index>` | :doc:`Список классов <ref/class-based-views/flattened-index>`

source: **Advanced:** :doc:`Generating CSV <howto/outputting-csv>` | :doc:`Generating PDF <howto/outputting-pdf>`
ru: **Для продвинутых:** :doc:`Генерация CSV <howto/outputting-csv>` | :doc:`Генерация PDF <howto/outputting-pdf>`

source: **Middleware:** :doc:`Overview <topics/http/middleware>` | :doc:`Built-in middleware classes <ref/middleware>`
ru: **Промежуточный слой(Middleware):** :doc:`Введение <topics/http/middleware>` | :doc:`Встроенные промежуточные слои <ref/middleware>`

source: The template layer
ru: Шаблоны

source: The template layer provides a designer-friendly syntax for rendering the information to be presented to the user. Learn how this syntax can be used by designers and how it can be extended by programmers:
ru: Шаблоны предоставляют удобный для дизайнера синтаксис для управления отображением информации пользователю. Узнайте как использовать этот синтаксис и как дополнять его:

source: **The basics:** :doc:`Overview <topics/templates>`
ru: **Основы:** :doc:`Введение <topics/templates>`

source: **For designers:** :doc:`Language overview <ref/templates/language>` | :doc:`Built-in tags and filters <ref/templates/builtins>` | :doc:`Humanization <ref/contrib/humanize>`
ru: **Для дизайнеров:** :doc:`Синтаксис <ref/templates/language>` | :doc:`Встроенные теги и фильтры <ref/templates/builtins>` | :doc:`Повышение читабельности <ref/contrib/humanize>`

source: **For programmers:** :doc:`Template API <ref/templates/api>` | :doc:`Custom tags and filters <howto/custom-template-tags>`
ru: **Для программистов:** :doc:`API шаблонов<ref/templates/api>` | :doc:`Собственные теги и фильтры <howto/custom-template-tags>`

source: Forms
ru: Формы

source: Django provides a rich framework to facilitate the creation of forms and the manipulation of form data.
ru: Django предоставляет инструмент для создания форм.

source: **The basics:** :doc:`Overview <topics/forms/index>` | :doc:`Form API <ref/forms/api>` | :doc:`Built-in fields <ref/forms/fields>` | :doc:`Built-in widgets <ref/forms/widgets>`
ru: **Основы:** :doc:`Введение <topics/forms/index>` | :doc:`API форм <ref/forms/api>` | :doc:`Встроенные поля <ref/forms/fields>` | :doc:`Встроенные виджеты <ref/forms/widgets>`

source: **Advanced:** :doc:`Forms for models <topics/forms/modelforms>` | :doc:`Integrating media <topics/forms/media>` | :doc:`Formsets <topics/forms/formsets>` | :doc:`Customizing validation <ref/forms/validation>`
ru: **Опытным:** :doc:`Модельные формы <topics/forms/modelforms>` | :doc:`Дополнительный JS и CSS <topics/forms/media>` | :doc:`Наборы форм <topics/forms/formsets>` | :doc:`Проверка форм <ref/forms/validation>`

source: The development process
ru: Процесс разработки

source: Learn about the various components and tools to help you in the development and testing of Django applications:
ru: Узнайте о множестве инструментов и библиотек, которые могут вам помочь при разработке и тестировании приложений для Django:

source: **Settings:** :doc:`Overview <topics/settings>` | :doc:`Full list of settings <ref/settings>`
ru: **Настройки проекта:** :doc:`Обзор <topics/settings>` | :doc:`Полный список настроек <ref/settings>`

source: **Applications:** :doc:`Overview <ref/applications>`
ru: **Приложения:** :doc:`Обзор <ref/applications>`

source: **Exceptions:** :doc:`Overview <ref/exceptions>`
ru: **Исключения:** :doc:`Введение <ref/exceptions>`

source: **django-admin and manage.py:** :doc:`Overview <ref/django-admin>` | :doc:`Adding custom commands <howto/custom-management-commands>`
ru: **django-admin и manage.py:** :doc:`Введение <ref/django-admin>` | :doc:`Добавление собственных команд <howto/custom-management-commands>`

source: **Testing:** :doc:`Introduction <topics/testing/index>` | :doc:`Writing and running tests <topics/testing/overview>` | :doc:`Included testing tools <topics/testing/tools>` | :doc:`Advanced topics <topics/testing/advanced>`
ru: **Тестирование:** :doc:`Введение <topics/testing/index>` | :doc:`Создание и запуск тестов <topics/testing/overview>` | :doc:`Инструменты для тестирования <topics/testing/tools>` | :doc:`Advanced topics <topics/testing/advanced>`

source: **Deployment:** :doc:`Overview <howto/deployment/index>` | :doc:`WSGI servers <howto/deployment/wsgi/index>` | :doc:`Deploying static files <howto/static-files/deployment>` | :doc:`Tracking code errors by email <howto/error-reporting>`
ru: **Развертывание:** :doc:`Введение <howto/deployment/index>` | :doc:`WSGI серверы <howto/deployment/wsgi/index>` | :doc:`Настройка статики <howto/static-files/deployment>` | :doc:`Отчёты об ошибках <howto/error-reporting>`

source: The admin
ru: Интерфейс администратора

source: Find all you need to know about the automated admin interface, one of Django's most popular features:
ru: Узнайте все что вам нужно об интерфейсе администратора, одной из самых популярных особенностей Django:

source: :doc:`Admin site <ref/contrib/admin/index>`
ru: :doc:`Интерфейс администратора <ref/contrib/admin/index>`

source: :doc:`Admin actions <ref/contrib/admin/actions>`
ru: :doc:`Пакетные действия <ref/contrib/admin/actions>`

source: Security
ru: Безопасность

source: Security is a topic of paramount importance in the development of Web applications and Django provides multiple protection tools and mechanisms:
ru: Безопасность очень важна при разработке веб-приложений и Django предоставляет ряд необходимых инструментов и механизмов:

source: :doc:`Security overview <topics/security>`
ru: :doc:`Безопасность <topics/security>`

source: :doc:`Cross Site Request Forgery protection <ref/csrf>`
ru: :doc:`Защита от CSRF <ref/csrf>`

source: :doc:`Cryptographic signing <topics/signing>`
ru: :doc:`Криптографическая подпись <topics/signing>`

source: :ref:`Security Middleware <security-middleware>`
ru: :doc:`Промежуточный слой безопасности <topics/security>`

source: Internationalization and localization
ru: Интернационализация и локализация

source: Django offers a robust internationalization and localization framework to assist you in the development of applications for multiple languages and world regions:
ru: Django позволяет создавать многоязычные приложения:

source: :doc:`Overview <topics/i18n/index>` | :doc:`Internationalization <topics/i18n/translation>` | :ref:`Localization <how-to-create-language-files>` | :doc:`Localized Web UI formatting and form input <topics/i18n/formatting>`
ru: :doc:`Введение <topics/i18n/index>` | :doc:`Интернационализация <topics/i18n/translation>` | :ref:`Локализация <how-to-create-language-files>` | :doc:`Локализация Web UI и ввода форм <topics/i18n/formatting>`

source: :doc:`Time zones </topics/i18n/timezones>`
ru: :doc:`Часовые пояса </topics/i18n/timezones>`

source: Performance and optimization
ru: Производительность и оптимизация

source: There are a variety of techniques and tools that can help get your code running more efficiently - faster, and using fewer system resources.
ru: Существуют различные техники и инструменты, которые могут оптимизировать выполнение вашего кода -- ускорить, использовать меньше системных ресурсов.

source: Geographic framework
ru: Фреймворк геоданных

source: :doc:`GeoDjango <ref/contrib/gis/index>` intends to be a world-class geographic Web framework. Its goal is to make it as easy as possible to build GIS Web applications and harness the power of spatially enabled data.
ru: :doc:`GeoDjango <ref/contrib/gis/index>` претендует на место популярного веб-фреймверка для работы с геоданными. Его цель позволить быстро создавать GIS веб-приложения и использовать мощность пространственных данных.

source: Common Web application tools
ru: Стандартные инструменты для веб-приложения

source: Django offers multiple tools commonly needed in the development of Web applications:
ru: Django предоставляет библиотеки необходимые для создания стандартного функционала веб-приложений

source: **Authentication:** :doc:`Overview <topics/auth/index>` | :doc:`Using the authentication system <topics/auth/default>` | :doc:`Password management <topics/auth/passwords>` | :doc:`Customizing authentication <topics/auth/customizing>` | :doc:`API Reference <ref/contrib/auth>`
ru: **Аутентификация:** :doc:`Обзор <topics/auth/index>` | :doc:`Использование аутентификации <topics/auth/default>` | :doc:`Управление паролями <topics/auth/passwords>` | :doc:`Customizing authentication <topics/auth/customizing>` | :doc:`API Reference <ref/contrib/auth>`

source: :doc:`Caching <topics/cache>`
ru: :doc:`Кэширование <topics/cache>`

source: :doc:`Logging <topics/logging>`
ru: :doc:`Логирование <topics/logging>`

source: :doc:`Sending emails <topics/email>`
ru: :doc:`Отправка электронной почты <topics/email>`

source: :doc:`Pagination <topics/pagination>`
ru: :doc:`Постраничный вывод <topics/pagination>`

source: :doc:`Static files management <ref/contrib/staticfiles>`
ru: :doc:`Работа со статикой <ref/contrib/staticfiles>`

source: :doc:`Data validation <ref/validators>`
ru: :doc:`Проверка данных <ref/validators>`

source: Other core functionalities
ru: Разные инструменты

source: Learn about some other core functionalities of the Django framework:
ru: Прочитайте про остальные важные инструменты в Django:

source: :doc:`Content types and generic relations <ref/contrib/contenttypes>`
ru: :doc:`Фреймворк contenttypes и обобщенные связи <ref/contrib/contenttypes>`

source: :doc:`Signals <topics/signals>`
ru: :doc:`Сигналы <topics/signals>`

source: :doc:`The sites framework <ref/contrib/sites>`
ru: :doc:`Фреймворк для сайтов <ref/contrib/sites>`

source: :doc:`Unicode in Django <ref/unicode>`
ru: :doc:`Unicode в Django <ref/unicode>`

source: The Django open-source project
ru: Django -- проект с открытым исходным кодом

source: Learn about the development process for the Django project itself and about how you can contribute:
ru: Прочитайте о процессе разработки Django и о том, как вы можете помочь:

source: **Design philosophies:** :doc:`Overview <misc/design-philosophies>`
ru: **Дизайн фреймворка:** :doc:`Обзор <misc/design-philosophies>`
