Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/ref/contrib/admin/actions.po
Languages: ru

source: Admin actions
ru: Действия администратора

source: The basic workflow of Django's admin is, in a nutshell, "select an object, then change it." This works well for a majority of use cases. However, if you need to make the same change to many objects at once, this workflow can be quite tedious.
ru: Повседневный алгоритм работы с административным интерфейсом Django выглядит как "выделить объект, затем изменить его." Он подходит для большинства случаев. Тем не менее, когда потребуется выполнить одно и то же действие над множеством объектов, то такое поведение интерфейса начинает напрягать.

source: In these cases, Django's admin lets you write and register "actions" -- simple functions that get called with a list of objects selected on the change list page.
ru: В таких случаях административный интерфейс Django позволяет вам создать и зарегистрировать "действия" -- простые функции, которые вызываются для выполнения неких действий над списком объектов, выделенных на странице интерфейса.

source: If you look at any change list in the admin, you'll see this feature in action; Django ships with a "delete selected objects" action available to all models. For example, here's the user module from Django's built-in :mod:`django.contrib.auth` app:
ru: Если вы взгляните на любой список изменений на интерфейсе администратора, вы увидите эту возможность в действии. Django поставляется с действием "удалить выделенные объекты", которое доступно для всех моделей. Например, рассмотрим пользовательский модуль из встроенного в Django приложения :mod:`django.contrib.auth`:

source: The "delete selected objects" action uses :meth:`QuerySet.delete() <django.db.models.query.QuerySet.delete>` for efficiency reasons, which has an important caveat: your model's ``delete()`` method will not be called.
ru: Действие "удалить выделенные объекты" использует метод :meth:`QuerySet.delete() <django.db.models.query.QuerySet.delete>` по соображениям эффективности, который имеет важный недостаток: метод ``delete()`` вашей модели не будет вызван.

source: For more background on bulk deletion, see the documentation on :ref:`object deletion <topics-db-queries-delete>`.
ru: Подробности по пакетному удалению смотрите в документации по :ref:`удалению объектов <topics-db-queries-delete>`.

source: Read on to find out how to add your own actions to this list.
ru: Читайте дальше о том, как создавать собственные действия для списка объектов.

source: Writing actions
ru: Создание действий

source: The easiest way to explain actions is by example, so let's dive in.
ru: Простейшим способом понять работу действий является их изучение на примерах. Значит, пришло время изучить их внимательнее.

source: A common use case for admin actions is the bulk updating of a model. Imagine a simple news application with an ``Article`` model::
ru: Общим способом использования действий в интерфейсе администратора является пакетное изменение модели. Представим простое приложение для работы с новостями, которое обладает моделью ``Article``::

source: A common task we might perform with a model like this is to update an article's status from "draft" to "published". We could easily do this in the admin one article at a time, but if we wanted to bulk-publish a group of articles, it'd be tedious. So, let's write an action that lets us change an article's status to "published."
ru: Стандартной задачей, которую мы возможно будем выполнять с подобной моделью, будет изменение состояний статьи с "черновик" на "опубликовано". Мы легко сможем выполнить это действие в интерфейсе администратора для одной статьи за раз, но если потребуется выполнить массовую публикацию группы статей, то вы столкнётесь с нудной работой. Таким образом, следует написать действие, которое позволит нам изменять состояние статьи на "опубликовано."

source: Writing action functions
ru: Создание функций для действий

source: First, we'll need to write a function that gets called when the action is triggered from the admin. Action functions are just regular functions that take three arguments:
ru: Сначала нам потребуется написать функцию, которая вызывается при выполнении действия в интерфейсе администратора. Функции действий - это обычные функции, которые принимают три аргумента:

source: The current :class:`ModelAdmin`
ru: Экземпляр класса :class:`ModelAdmin`,

source: An :class:`~django.http.HttpRequest` representing the current request,
ru: Экземпляр класса :class:`~django.http.HttpRequest`, представляющий текущий запрос,

source: A :class:`~django.db.models.query.QuerySet` containing the set of objects selected by the user.
ru: Экземпляр класса :class:`~django.db.models.query.QuerySet`, содержащий набор объектов, которые выделил пользователь.

source: Our publish-these-articles function won't need the :class:`ModelAdmin` or the request object, but we will use the queryset::
ru: Наша функция "опубликовать-эти-статьи" не нуждается в экземпляре :class:`ModelAdmin` или в объекте реквеста, но использует выборку::

source: For the best performance, we're using the queryset's :ref:`update method <topics-db-queries-update>`. Other types of actions might need to deal with each object individually; in these cases we'd just iterate over the queryset::
ru: В целях улучшения производительности, мы используем метод выборки :ref:`update method <topics-db-queries-update>`. Другие типы действий могут обрабатывать каждый объект индивидуально. В таких случаях мы просто выполняем итерацию по выборке::

source: That's actually all there is to writing an action! However, we'll take one more optional-but-useful step and give the action a "nice" title in the admin. By default, this action would appear in the action list as "Make published" -- the function name, with underscores replaced by spaces. That's fine, but we can provide a better, more human-friendly name by giving the ``make_published`` function a ``short_description`` attribute::
ru: В общем-то мы рассмотрели всё, что требуется для создания действия" Однако, мы сделаем ещё один необязательный, но полезный шаг и обеспечим действие "красивым" заголовком, который будет отображаться в интерфейсе администратора. По умолчанию, это действие будет отображено в списке действий как "Make published", т.е. по имени функции, где символы подчёркивания будут заменены пробелами. Неплохо, но мы можем сделать лучше, по человечески, предоставив функции ``make_published`` атрибут ``short_description``::

source: This might look familiar; the admin's ``list_display`` option uses the same technique to provide human-readable descriptions for callback functions registered there, too.
ru: Вы уже встречались с этим. Опция ``list_display`` интерфейса администратора использует подобный подход для предоставления читаемых описаний для функций-обработчиков.

source: Adding actions to the :class:`ModelAdmin`
ru: Добавление действий в класс :class:`ModelAdmin`

source: Next, we'll need to inform our :class:`ModelAdmin` of the action. This works just like any other configuration option. So, the complete ``admin.py`` with the action and its registration would look like::
ru: Затем мы должны проинформировать наш класс :class:`ModelAdmin` о новом действии. Это действие аналогично применению любой другой опции конфигурации. Таким образом, полный пример ``admin.py`` с определением действия и его регистрации будет выглядеть так::

source: That code will give us an admin change list that looks something like this:
ru: Этот код предоставит нам список моделей в интерфейсе администратора, который выгладит примерно так:

source: That's really all there is to it! If you're itching to write your own actions, you now know enough to get started. The rest of this document just covers more advanced techniques.
ru: Вот и всё! Если вам хочется поскорее создать свои действия, приступайте, у вас есть необходимые знания. Остальная часть документа просто описывает более продвинутые вещи.

source: Handling errors in actions
ru: Обработка ошибок в действиях

source: If there are foreseeable error conditions that may occur while running your action, you should gracefully inform the user of the problem. This means handling exceptions and using :meth:`django.contrib.admin.ModelAdmin.message_user` to display a user friendly description of the problem in the response.
ru: При наличии предполагаемых условий возникновения ошибки, которая может возникнуть во время работы вашего действия, вы должны аккуратно проинформировать пользователя о проблеме. Это подразумевает обработку исключений и использование метода :meth:`django.contrib.admin.ModelAdmin.message_user` для отображения описания проблемы в отклике.

source: Advanced action techniques
ru: Продвинутые методики работы с действиями

source: There's a couple of extra options and possibilities you can exploit for more advanced options.
ru: Существует ряд дополнительных опций и возможностей, которые вы можете использовать в своём коде.

source: Actions as :class:`ModelAdmin` methods
ru: Действия как методы :class:`ModelAdmin`

source: The example above shows the ``make_published`` action defined as a simple function. That's perfectly fine, but it's not perfect from a code design point of view: since the action is tightly coupled to the ``Article`` object, it makes sense to hook the action to the ``ArticleAdmin`` object itself.
ru: Вышеприведённый пример показывает действие ``make_published``, определённое в виде обычной функции. Это нормальный подход, но к нему есть претензии с точки зрения дизайна кода: так как действия связано с объектом ``Article``, то правильнее будет внедрить это действие в сам объект ``ArticleAdmin``.

source: That's easy enough to do::
ru: Это достаточно просто сделать::

source: Notice first that we've moved ``make_published`` into a method and renamed the ``modeladmin`` parameter to ``self``, and second that we've now put the string ``'make_published'`` in ``actions`` instead of a direct function reference. This tells the :class:`ModelAdmin` to look up the action as a method.
ru: Следует отметить, что сначала мы переместили ``make_published`` в метод и переименовали параметр ``modeladmin`` в ``self``, а затем поместили строку ``make_published`` в атрибут ``actions`` вместо прямой ссылки на функцию. Всё это указывает классу :class:`ModelAdmin` искать действие среди своих методов.

source: Defining actions as methods gives the action more straightforward, idiomatic access to the :class:`ModelAdmin` itself, allowing the action to call any of the methods provided by the admin.
ru: Определение действий в виде методов предоставляет действиям более прямолинейный, идеоматический доступ к самому объекту :class:`ModelAdmin`, позволяя вызывать любой метод, предоставляемый интерфейсом администратора.

source: For example, we can use ``self`` to flash a message to the user informing her that the action was successful::
ru: Например, мы можем использовать ``self`` для вывода сообщения для пользователя в целях его информирования об успешном завершении действия::

source: This make the action match what the admin itself does after successfully performing an action:
ru: Это обеспечивает действие функционалом, аналогичным встроенным возможностям интерфейса администратора:

source: Actions that provide intermediate pages
ru: Действия, у которых есть промежуточные страницы

source: By default, after an action is performed the user is simply redirected back to the original change list page. However, some actions, especially more complex ones, will need to return intermediate pages. For example, the built-in delete action asks for confirmation before deleting the selected objects.
ru: По умолчанию, после выполнения действия пользователя просто перебрасывают обратно на страницу со списком объектов. Однако, некоторые действия, обычно наиболее сложные из них, могут отображать промежуточные страницы. Например, встроенное действие по удалению запрашивает подтверждение перед выполнением удаления выделенных объектов.

source: To provide an intermediary page, simply return an :class:`~django.http.HttpResponse` (or subclass) from your action. For example, you might write a simple export function that uses Django's :doc:`serialization functions </topics/serialization>` to dump some selected objects as JSON::
ru: Чтобы предоставить такую промежуточную страницу следует просто вернуть объект класса :class:`~django.http.HttpResponse` (или его потомка) в вашем действии. Например, вы можете создать простую функцию экспорта, которая использует :doc:`функции сериализации </topics/serialization>` для дампа указанных объектов в виде JSON::

source: Generally, something like the above isn't considered a great idea. Most of the time, the best practice will be to return an :class:`~django.http.HttpResponseRedirect` and redirect the user to a view you've written, passing the list of selected objects in the GET query string. This allows you to provide complex interaction logic on the intermediary pages. For example, if you wanted to provide a more complete export function, you'd want to let the user choose a format, and possibly a list of fields to include in the export. The best thing to do would be to write a small action that simply redirects to your custom export view::
ru: В общем случае, показанное выше не рассматривается в качестве хорошей идеи. В большинстве случаев лучшим вариантом будет вернуть объект класса :class:`~django.http.HttpResponseRedirect` для перенаправления пользователя на представление, которое вы напишете, передав список выбранных объектов в GET параметрах. Это позволит вам реализовать логику сложного взаимодействия на промежуточных страницах. Например, если вам потребуется реализовать более сложную функцию экспорта, вам понадобится позволить пользователю выбирать формат, и возможно список полей, которые следует включать в экспорт. Наилучшим вариантом будет создание небольшого действия, которое просто перенаправляет пользователя на ваше представление, в котором реализован экспорт::

source: As you can see, the action is the simple part; all the complex logic would belong in your export view. This would need to deal with objects of any type, hence the business with the ``ContentType``.
ru: Как вы можете видеть, код самого действия очень прост. Вся сложная логика будет располагаться в вашем представлении экспорта. Здесь потребуется работать с объектами любого типа, следовательно тут надо работать через ``ContentType``.

source: Writing this view is left as an exercise to the reader.
ru: Написание самого представления оставлено читателю в качестве домашнего задания.

source: Making actions available site-wide
ru: Делаем действия видимыми всему сайту

source: Some actions are best if they're made available to *any* object in the admin site -- the export action defined above would be a good candidate. You can make an action globally available using :meth:`AdminSite.add_action()`. For example::
ru: Некоторые действия настолько хороши, что их следует сделать доступными для *любого* объекта в интерфейсе администратора. Действие экспорта, определённое выше, будет хорошим кандидатом для этого. Вы можете сделать действие видимым глобально, воспользуйтесь методом :meth:`AdminSite.add_action()`. Например::

source: This makes the ``export_selected_objects`` action globally available as an action named "export_selected_objects". You can explicitly give the action a name -- good if you later want to programmatically :ref:`remove the action <disabling-admin-actions>` -- by passing a second argument to :meth:`AdminSite.add_action()`::
ru: Действие ``export_selected_objects`` станет доступным глобально под именем "export_selected_objects". Вы можете явно дать имя этому действию, например, вам потребуется затем программно :ref:`удалить действие <disabling-admin-actions>`, передав второй аргумент в метод :meth:`AdminSite.add_action()`::

source: Disabling actions
ru: Отключение действий

source: Sometimes you need to disable certain actions -- especially those :ref:`registered site-wide <adminsite-actions>` -- for particular objects. There's a few ways you can disable actions:
ru: Иногда требуется отключать определённые действия, особенно :ref:`зарегистрированные глобально <adminsite-actions>`, для определённых объектов. Существует несколько способов для этого:

source: Disabling a site-wide action
ru: Отключение глобального действия

source: If you need to disable a :ref:`site-wide action <adminsite-actions>` you can call :meth:`AdminSite.disable_action()`.
ru: Если требуется отключить :ref:`глобальное действие <adminsite-actions>`, вы можете вызвать метод :meth:`AdminSite.disable_action()`.

source: For example, you can use this method to remove the built-in "delete selected objects" action::
ru: Например, вы можете использовать данный метод для удаления встроенного действия "delete selected objects"::

source: Once you've done the above, that action will no longer be available site-wide.
ru: После этого действие больше не будет доступно глобально.

source: If, however, you need to re-enable a globally-disabled action for one particular model, simply list it explicitly in your ``ModelAdmin.actions`` list::
ru: Тем не менее, если вам потребуется вернуть глобально отключенное действия для одной конкретной модели, просто укажите это действия явно в списке ``ModelAdmin.actions``::

source: Disabling all actions for a particular :class:`ModelAdmin`
ru: Отключение всех действия для определённого экземпляра :class:`ModelAdmin`

source: If you want *no* bulk actions available for a given :class:`ModelAdmin`, simply set :attr:`ModelAdmin.actions` to ``None``::
ru: Если вам требуется *запретить* пакетные действия для определённого экземпляра :class:`ModelAdmin`, просто установите атрибут :attr:`ModelAdmin.actions` в ``None``::

source: This tells the :class:`ModelAdmin` to not display or allow any actions, including any :ref:`site-wide actions <adminsite-actions>`.
ru: Это укажет экземпляру :class:`ModelAdmin` не показывать и не позволять выполнения никаких действий, включая :ref:`зарегистрированные глобально <adminsite-actions>`.

source: Conditionally enabling or disabling actions
ru: Условное включение и отключение действий

source: Finally, you can conditionally enable or disable actions on a per-request (and hence per-user basis) by overriding :meth:`ModelAdmin.get_actions`.
ru: Наконец, вы можете включать или отключать действия по некоему условию на уровне запроса (и, следовательно, на уровне каждого пользователя), просто переопределив метод :meth:`ModelAdmin.get_actions`.

source: This returns a dictionary of actions allowed. The keys are action names, and the values are ``(function, name, short_description)`` tuples.
ru: Он возвращает словарь разрешённых действий. Ключами являются имена действий, а значениями являются кортежи вида ``(function, name, short_description)``.

source: Most of the time you'll use this method to conditionally remove actions from the list gathered by the superclass. For example, if I only wanted users whose names begin with 'J' to be able to delete objects in bulk, I could do the following::
ru: Чаще всего вы будете использовать данный метод для условного удаления действия из списка, полученного в родительском классе. Например, если мне надо разрешить пакетное удаление объектов только для пользователей с именами, начинающимися с буквы 'J', то я сделаю так::
