Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/ref/contrib/admin/index.po
Languages: ru

source: The Django admin site
ru: Интерфейс администратора Django

source: Overview
ru: Обзор

source: The admin is enabled in the default project template used by :djadmin:`startproject`.
ru: Интерфейс администратора по умолчанию включен, если вы создавали проект командой :djadmin:`startproject`.

source: For reference, here are the requirements:
ru: Если необходимо самостоятельно его включить, вот требования:

source: Add ``'django.contrib.admin'`` to your :setting:`INSTALLED_APPS` setting.
ru: Добавьте ``'django.contrib.admin'`` в настройку :setting:`INSTALLED_APPS`.

source: The admin has four dependencies - :mod:`django.contrib.auth`, :mod:`django.contrib.contenttypes`, :mod:`django.contrib.messages` and :mod:`django.contrib.sessions`. If these applications are not in your :setting:`INSTALLED_APPS` list, add them.
ru: Интерфейс администратора имеет четыре зависимости - :mod:`django.contrib.auth`, :mod:`django.contrib.contenttypes`, :mod:`django.contrib.messages` and :mod:`django.contrib.sessions`. Если эти приложения не входят в список :setting:`INSTALLED_APPS`, добавьте их.

source: Determine which of your application's models should be editable in the admin interface.
ru: Определите, какие модели будут редактироваться через интерфейс администратора.

source: For each of those models, optionally create a ``ModelAdmin`` class that encapsulates the customized admin functionality and options for that particular model.
ru: Для каждой модели вы можете создать класс ``ModelAdmin``, который инкапсулирует настройки интерфейса администратора для конкретной модели.

source: Instantiate an ``AdminSite`` and tell it about each of your models and ``ModelAdmin`` classes.
ru: Создайте экземпляр ``AdminSite`` и добавьте в него ваши модели с соответствующими классами ``ModelAdmin``.

source: Hook the ``AdminSite`` instance into your URLconf.
ru: Добавьте ``AdminSite`` в URLconf.

source: Other topics
ru: Другие разделы

source: For information about serving the static files (images, JavaScript, and CSS) associated with the admin in production, see :ref:`serving-files`.
ru: Информацию о настройке статических файлов (изображений, JavaScript и CSS) для интерфейса администратора на "боевом" сервере можно найти в разделе :ref:`serving-files`.

source: Having problems? Try :doc:`/faq/admin`.
ru: Вопросы? Обратитесь к :doc:`/faq/admin`.

source: ``ModelAdmin`` objects
ru: Объект ``ModelAdmin``

source: The ``ModelAdmin`` class is the representation of a model in the admin interface. Usually, these are stored in a file named ``admin.py`` in your application. Let's take a look at a very simple example of the ``ModelAdmin``::
ru: Класс ``ModelAdmin`` -- это отображение модели в интерфейсе администратора. Его код добавляют обычно в файл ``admin.py`` вашего приложения. Давайте рассмотрим простой пример ``ModelAdmin``::

source: Do you need a ``ModelAdmin`` object at all?
ru: Нужен ли вообще вам объект ``ModelAdmin``?

source: In the preceding example, the ``ModelAdmin`` class doesn't define any custom values (yet). As a result, the default admin interface will be provided. If you are happy with the default admin interface, you don't need to define a ``ModelAdmin`` object at all -- you can register the model class without providing a ``ModelAdmin`` description. The preceding example could be simplified to::
ru: В этом примере, класс ``ModelAdmin`` не определяет никаких настроек (пока).В результате мы получим интерфейс предоставляемый по умолчанию. Если он вас устраивает, вы можете не определять ``ModelAdmin`` совсем и зарегистрировать модель без ``ModelAdmin``. Пример выше может выглядеть таким образом::

source: There is also a decorator for registering your ``ModelAdmin`` classes::
ru: Существует также декоратор для регистрации ваших классов ``ModelAdmin``::

source: Discovery of admin files
ru: Изучаем файлы админки

source: When you put ``'django.contrib.admin'`` in your :setting:`INSTALLED_APPS` setting, Django automatically looks for an ``admin`` module in each application and imports it.
ru: При добавлении ``'django.contrib.admin'`` в :setting:`INSTALLED_APPS` setting, Django автоматически ищет модуль ``admin`` в каждом приложении и импортирует его.

source: This is the default :class:`~django.apps.AppConfig` class for the admin. It calls :func:`~django.contrib.admin.autodiscover()` when Django starts.
ru: Стандартный класс :class:`~django.apps.AppConfig` для админки. Вызывает :func:`~django.contrib.admin.autodiscover()` при запуске Django.

source: This class works like :class:`~django.contrib.admin.apps.AdminConfig`, except it doesn't call :func:`~django.contrib.admin.autodiscover()`.
ru: Аналогичен :class:`~django.contrib.admin.apps.AdminConfig`, но не вызывает :func:`~django.contrib.admin.autodiscover()`.

source: This function attempts to import an ``admin`` module in each installed application. Such modules are expected to register models with the admin.
ru: Эта функция пытается импортировать модуль ``admin`` каждого установленного приложения. Предполагается, что в этом модуле выполняется регистрация моделей в админке.

source: Typically you won't need to call this function directly as :class:`~django.contrib.admin.apps.AdminConfig` calls it when Django starts.
ru: Обычно вам не нужно вызывать эту функцию самостоятельно, :class:`~django.contrib.admin.apps.AdminConfig` вызывает её при запуске Django.

source: If you are using a custom ``AdminSite``, it is common to import all of the ``ModelAdmin`` subclasses into your code and register them to the custom ``AdminSite``. In that case, in order to disable auto-discovery, you should put ``'django.contrib.admin.apps.SimpleAdminConfig'`` instead of ``'django.contrib.admin'`` in your :setting:`INSTALLED_APPS` setting.
ru: Если вы используете собственный ``AdminSite``, вам необходимо импортировать все подклассы ``ModelAdmin`` и зарегистрировать их в вашем ``AdminSite``. В этом случае, чтобы отключить их добавление в стандартную админку, используйте ``'django.contrib.admin.apps.SimpleAdminConfig'`` вместо ``'django.contrib.admin'`` в :setting:`INSTALLED_APPS`.

source: ``ModelAdmin`` options
ru: Настройки ``ModelAdmin``

source: The ``ModelAdmin`` is very flexible. It has several options for dealing with customizing the interface. All options are defined on the ``ModelAdmin`` subclass::
ru: ``ModelAdmin`` очень гибкий. Он содержит ряд параметров для настройки интерфейса администратора. Все настройки определяются в подклассе ``ModelAdmin``::

source: A list of actions to make available on the change list page. See :doc:`/ref/contrib/admin/actions` for details.
ru: Список действий, которые будут включены на странице списка объектов. Подробности смотрите в разделе :doc:`/ref/contrib/admin/actions`.

source: Controls where on the page the actions bar appears. By default, the admin changelist displays actions at the top of the page (``actions_on_top = True; actions_on_bottom = False``).
ru: Определяет где на странице будет расположены панели с действиями. По умолчанию эта панель расположена сверху (``actions_on_top = True; actions_on_bottom = False``).

source: Controls whether a selection counter is displayed next to the action dropdown. By default, the admin changelist will display it (``actions_selection_counter = True``).
ru: Указывает отображать ли счетчик выбранных объектов после списка действий. По умолчанию он отображается (``actions_selection_counter = True``).

source: Set ``date_hierarchy`` to the name of a ``DateField`` or ``DateTimeField`` in your model, and the change list page will include a date-based drilldown navigation by that field.
ru: Укажите в ``date_hierarchy`` название ``DateField`` или ``DateTimeField`` поля вашей модели, и страница списка объектов будет содержать навигацию по датам из этого поля.

source: Example::
ru: Например::

source: This will intelligently populate itself based on available data, e.g. if all the dates are in one month, it'll show the day-level drill-down only.
ru: Навигация учитывает значения поля, например, если все значения будут датами из одного месяца, будут отображаться только дни этого месяца.

source: ``date_hierarchy`` uses :meth:`QuerySet.datetimes() <django.db.models.query.QuerySet.datetimes>` internally. Please refer to its documentation for some caveats when time zone support is enabled (:setting:`USE_TZ = True <USE_TZ>`).
ru: ``date_hierarchy`` использует внутри :meth:`QuerySet.datetimes() <django.db.models.query.QuerySet.datetimes>`. Обратитесь к описанию, чтобы узнать некоторые нюансы при использовании часовых поясов (:setting:`USE_TZ = True <USE_TZ>`).

source: This attribute overrides the default display value for record's fields that are empty (``None``, empty string, etc.). The default value is ``-`` (a dash). For example::
ru: Этот атрибут переопределяет отображение пустого значения записи (``None``, пустая строка и т.д.). По умолчанию ``-`` (дефис). Например::

source: You can also override ``empty_value_display`` for all admin pages with :attr:`AdminSite.empty_value_display`, or for specific fields like this::
ru: Вы также можете переопределить ``empty_value_display`` для всех страниц, указав :attr:`AdminSite.empty_value_display`, или для одного поля::

source: This attribute, if given, should be a list of field names to exclude from the form.
ru: Этот атрибут должен содержать список полей, которые не будут включены в форму редактирования.

source: For example, let's consider the following model::
ru: Например, у нас есть следующая модель::

source: If you want a form for the ``Author`` model that includes only the ``name`` and ``title`` fields, you would specify ``fields`` or ``exclude`` like this::
ru: Если вам необходима форма для модели ``Author``, которая содержит только поля ``name`` и ``title``, вы можете определить параметр ``fields`` или ``exclude`` следующим образом::

source: Since the Author model only has three fields, ``name``, ``title``, and ``birth_date``, the forms resulting from the above declarations will contain exactly the same fields.
ru: Так как модель содержит только три поля, ``name``, ``title`` и ``birth_date``, полученные формы будут содержать одинаковые поля.

source: Use the ``fields`` option to make simple layout changes in the forms on the "add" and "change" pages such as showing only a subset of available fields, modifying their order, or grouping them into rows. For example, you could define a simpler version of the admin form for the :class:`django.contrib.flatpages.models.FlatPage` model as follows::
ru: Если вам необходимо внести небольшие изменения форму на странице редактирования и добавления, например, изменить список отображаемых полей, их порядок или сгруппировать их, вы можете использовать настройку ``fields``. Например, необходимо изменить форму модели из приложения ``django.contrib.flatpages.models.FlatPage``::

source: In the above example, only the fields ``url``, ``title`` and ``content`` will be displayed, sequentially, in the form. ``fields`` can contain values defined in :attr:`ModelAdmin.readonly_fields` to be displayed as read-only.
ru: В примере выше будут отображаться только поля ``url``, ``title`` и ``content``. ``fields`` может содержать поля указанные в :attr:`ModelAdmin.readonly_fields`, они не будут доступны для редактирования.

source: For more complex layout needs, see the :attr:`~ModelAdmin.fieldsets` option.
ru: Для более сложных настроек используйте :attr:`~ModelAdmin.fieldsets`.

source: The ``fields`` option, unlike :attr:`~ModelAdmin.list_display`, may only contain names of fields on the model or the form specified by :attr:`~ModelAdmin.form`. It may contain callables only if they are listed in :attr:`~ModelAdmin.readonly_fields`.
ru: Параметр ``fields``, в отличии от :attr:`~ModelAdmin.list_display`, может содержать только названия полей модели или полей определенных в :attr:`~ModelAdmin.form`. Можно указать названия функций, если они указаны в :attr:`~ModelAdmin.readonly_fields`.

source: To display multiple fields on the same line, wrap those fields in their own tuple. In this example, the ``url`` and ``title`` fields will display on the same line and the ``content`` field will be displayed below them on its own line::
ru: Чтобы поля отображались в одной строке, укажите их в кортеже вместе. В этом примере, поля ``url`` и ``title`` будут отображаться в одном ряду, поле ``content`` будет расположено ниже::

source: Note
ru: Примечание

source: This ``fields`` option should not be confused with the ``fields`` dictionary key that is within the :attr:`~ModelAdmin.fieldsets` option, as described in the next section.
ru: Настройку ``fields`` не следует путать с ключом словаря ``fields`` в настройке :attr:`~ModelAdmin.fieldsets`, описанной ниже.

source: If neither ``fields`` nor :attr:`~ModelAdmin.fieldsets` options are present, Django will default to displaying each field that isn't an ``AutoField`` and has ``editable=True``, in a single fieldset, in the same order as the fields are defined in the model.
ru: Если не определен ни атрибут ``fields``, ни :attr:`~ModelAdmin.fieldsets`, Django покажет все поля с ``editable=True`` кроме ``AutoField``, в одном наборе полей в порядке, в котором они указанные в модели.

source: Set ``fieldsets`` to control the layout of admin "add" and "change" pages.
ru: Позволяет изменить макет страниц добавления и редактирования объекта.

source: ``fieldsets`` is a list of two-tuples, in which each two-tuple represents a ``<fieldset>`` on the admin form page. (A ``<fieldset>`` is a "section" of the form.)
ru: ``fieldsets`` -- это список двух-элементных кортежей, каждый представляет ``<fieldset>`` в форме редактирования объекта. (``<fieldset>`` -- группа полей в форме.)

source: The two-tuples are in the format ``(name, field_options)``, where ``name`` is a string representing the title of the fieldset and ``field_options`` is a dictionary of information about the fieldset, including a list of fields to be displayed in it.
ru: Кортеж должен быть в формате ``(name, options полей)``, где ``name`` это название группы полей, а ``field_options`` -- словарь с информацией о группе полей, включая список полей для отображения.

source: A full example, taken from the :class:`django.contrib.flatpages.models.FlatPage` model::
ru: Полный пример для модели :class:`django.contrib.flatpages.models.FlatPage`::

source: This results in an admin page that looks like:
ru: Этот пример будет выглядеть следующим образом:

source: If neither ``fieldsets`` nor :attr:`~ModelAdmin.fields` options are present, Django will default to displaying each field that isn't an ``AutoField`` and has ``editable=True``, in a single fieldset, in the same order as the fields are defined in the model.
ru: Если не определен ни атрибут ``fields``, ни :attr:`~ModelAdmin.fieldsets`, Django покажет все поля с ``editable=True`` кроме ``AutoField``, в одном наборе полей в порядке, в котором они указанные в модели.

source: The ``field_options`` dictionary can have the following keys:
ru: Словарь ``field_options`` может содержать следующие ключи:

source: A tuple of field names to display in this fieldset. This key is required.
ru: Кортеж с названиями полей. Этот ключ обязателен.

source: As with the :attr:`~ModelAdmin.fields` option, to display multiple fields on the same line, wrap those fields in their own tuple. In this example, the ``first_name`` and ``last_name`` fields will display on the same line::
ru: Как и в атрибуте :attr:`~ModelAdmin.fields`, чтобы отобразить поля в одной строке, добавьте их в один кортеж. В этом примере, поля ``first_name`` и ``last_name`` будут показаны в одной строке::

source: ``fields`` can contain values defined in :attr:`~ModelAdmin.readonly_fields` to be displayed as read-only.
ru: ``fields`` может содержать значения из :attr:`ModelAdmin.readonly_fields`, чтобы отображать поля без возможности их редактирования.

source: If you add the name of a callable to ``fields``, the same rule applies as with the :attr:`~ModelAdmin.fields` option: the callable must be listed in :attr:`~ModelAdmin.readonly_fields`.
ru: Добавление функции в ``fields`` аналогично добавлению в параметр :attr:`~ModelAdmin.fields` - функция должна быть указанна в :attr:`~ModelAdmin.readonly_fields`.

source: A list or tuple containing extra CSS classes to apply to the fieldset.
ru: Список содержащий CSS классы, которые будут добавлены в группу полей.

source: Two useful classes defined by the default admin site stylesheet are ``collapse`` and ``wide``. Fieldsets with the ``collapse`` style will be initially collapsed in the admin and replaced with a small "click to expand" link. Fieldsets with the ``wide`` style will be given extra horizontal space.
ru: Django предоставляет два класса для использования: ``collapse`` и ``wide``. Группа полей с классом ``collapse`` будет показа в свернутом виде с кнопкой "развернуть". Группа полей с классом ``wide`` будет шире по горизонтали.

source: A string of optional extra text to be displayed at the top of each fieldset, under the heading of the fieldset. This string is not rendered for :class:`~django.contrib.admin.TabularInline` due to its layout.
ru: Необязательный текст, который будет отображаться под названием группы полей. Этот текст не отображается для :class:`~django.contrib.admin.TabularInline`.

source: Note that this value is *not* HTML-escaped when it's displayed in the admin interface. This lets you include HTML if you so desire. Alternatively you can use plain text and ``django.utils.html.escape()`` to escape any HTML special characters.
ru: Заметим, что этот текст *не* будет экранирован. Это позволяет добавить вам HTML на страницу. Вы можете использовать обычный текст экранировав его функцией ``django.utils.html.escape()``.

source: By default, a :class:`~django.db.models.ManyToManyField` is displayed in the admin site with a ``<select multiple>``. However, multiple-select boxes can be difficult to use when selecting many items. Adding a :class:`~django.db.models.ManyToManyField` to this list will instead use a nifty unobtrusive JavaScript "filter" interface that allows searching within the options. The unselected and selected options appear in two boxes side by side. See :attr:`~ModelAdmin.filter_vertical` to use a vertical interface.
ru: По умолчанию, поле :class:`~django.db.models.ManyToManyField` отображается как ``<select multiple>``. Однако, это поле тяжело использовать при большом количестве объектов. Добавив :class:`~django.db.models.ManyToManyField` в этот атрибут, будет использоваться "виджет" с JavaScript фильтром для поиска. Смотрите описание :attr:`~ModelAdmin.filter_vertical` про использование вертикального "виджета".

source: Same as :attr:`~ModelAdmin.filter_horizontal`, but uses a vertical display of the filter interface with the box of unselected options appearing above the box of selected options.
ru: Аналогичен :attr:`~ModelAdmin.filter_horizontal`, но использует вертикальный "виджет".

source: By default a ``ModelForm`` is dynamically created for your model. It is used to create the form presented on both the add/change pages. You can easily provide your own ``ModelForm`` to override any default form behavior on the add/change pages. Alternatively, you can customize the default form rather than specifying an entirely new one by using the :meth:`ModelAdmin.get_form` method.
ru: По умолчанию ``ModelForm`` создается динамически для модели. Этот атрибут используется для определения формы на страницах добавления и редактирования. Вы можете указать собственный подкласс ``ModelForm`` для переопределения этих страниц. Вы можете модифицировать форму, а не создавать с нуля свою, переопределив метод :meth:`ModelAdmin.get_form`.

source: For an example see the section :ref:`admin-custom-validation`.
ru: Пример смотрите в разделе :ref:`admin-custom-validation`.

source: If you define the ``Meta.model`` attribute on a :class:`~django.forms.ModelForm`, you must also define the ``Meta.fields`` attribute (or the ``Meta.exclude`` attribute). However, since the admin has its own way of defining fields, the ``Meta.fields`` attribute will be ignored.
ru: Если вы указали атрибут ``Meta.model`` для :class:`~django.forms.ModelForm`, необходимо также указать ``Meta.fields`` (или ``Meta.exclude``). Однако, если поля указаны при определении настроек интерфейса администратора, атрибут ``Meta.fields`` будет проигнорирован.

source: If the ``ModelForm`` is only going to be used for the admin, the easiest solution is to omit the ``Meta.model`` attribute, since ``ModelAdmin`` will provide the correct model to use. Alternatively, you can set ``fields = []`` in the ``Meta`` class to satisfy the validation on the ``ModelForm``.
ru: Если ``ModelForm`` используется только для интерфейса администратора, проще всего не указывать атрибут ``Meta.model``, т.к. ``ModelAdmin`` укажет правильную модель. Вы можете указать ``fields = []`` в ``Meta`` чтобы ``ModelForm`` была правильной.

source: If your ``ModelForm`` and ``ModelAdmin`` both define an ``exclude`` option then ``ModelAdmin`` takes precedence::
ru: Если и ``ModelForm`` и ``ModelAdmin`` определяют опцию ``exclude``, ``ModelAdmin`` будет иметь больший приоритет::

source: In the above example, the "age" field will be excluded but the "name" field will be included in the generated form.
ru: В этом примере, поле "age" не будет добавлено в форму в отличии от поля "name".

source: This provides a quick-and-dirty way to override some of the :class:`~django.forms.Field` options for use in the admin. ``formfield_overrides`` is a dictionary mapping a field class to a dict of arguments to pass to the field at construction time.
ru: Позволяет быстро изменить настройки отображения различных типов :class:`~django.forms.Field` в интерфейсе администратора. ``formfield_overrides`` -- словарь указывающий параметры для классов полей, которые будут передаваться в конструкторы указанных полей.

source: Since that's a bit abstract, let's look at a concrete example. The most common use of ``formfield_overrides`` is to add a custom widget for a certain type of field. So, imagine we've written a ``RichTextEditorWidget`` that we'd like to use for large text fields instead of the default ``<textarea>``. Here's how we'd do that::
ru: Все это звучит немного абстрактно, так что давайте рассмотрим пример. Самое распространенное применение ``formfield_overrides`` это переопределить "виджет" поля формы. Предположим у нас есть ``RichTextEditorWidget``, который использует расширенное поля редактирования вместо ``<textarea>``. Вот как мы может использовать его::

source: Note that the key in the dictionary is the actual field class, *not* a string. The value is another dictionary; these arguments will be passed to the form field's ``__init__()`` method. See :doc:`/ref/forms/api` for details.
ru: Заметим что ключ словаря класс поля, а *не* строка. Значение это словарь с аргументами. Это аргументы будут переданы в ``__init__()``. Подробности смотрите в разделе :doc:`/ref/forms/api`.

source: See :class:`InlineModelAdmin` objects below as well as :meth:`ModelAdmin.get_formsets_with_inlines`.
ru: Смотрите описание ниже :class:`InlineModelAdmin`, а также :meth:`ModelAdmin.get_formsets_with_inlines`.

source: Set ``list_display`` to control which fields are displayed on the change list page of the admin.
ru: ``list_display`` указывает какие поля отображать на странице списка объектов.

source: You have four possible values that can be used in ``list_display``:
ru: Вы можете указать четыре варианта значений в ``list_display``:

source: A field of the model. For example::
ru: Поле модели. Например::

source: A callable that accepts one parameter for the model instance. For example::
ru: Функция, которая принимает один аргумент - объект модели. Например::
