Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/ref/contrib/admin/index.po
Languages: ru

source: If you'd like to set up your own admin site with custom behavior, you're free to subclass ``AdminSite`` and override or add anything you like. Then, simply create an instance of your ``AdminSite`` subclass (the same way you'd instantiate any other Python class) and register your models and ``ModelAdmin`` subclasses with it instead of with the default site. Finally, update :file:`myproject/urls.py` to reference your :class:`AdminSite` subclass.
ru: Если вам необходимо изменить поведение интерфейса администратора, вы можете создать подкласс ``AdminSite`` и переопределить все что вам нужно. Затем создайте экземпляр вашего подкласса ``AdminSite`` (как и любого другого класса Python), и зарегистрируйте в нем ваши модели вместе с подклассами ``ModelAdmin``. Затем добавьте ваш подкласс :class:`AdminSite` в :file:`myproject/urls.py`.

source: Note that you may not want autodiscovery of ``admin`` modules when using your own ``AdminSite`` instance since you will likely be importing all the per-app ``admin`` modules in your ``myproject.admin`` module. This means you need to put ``'django.contrib.admin.apps.SimpleAdminConfig'`` instead of ``'django.contrib.admin'`` in your :setting:`INSTALLED_APPS` setting.
ru: Обратите внимание, при использовании своего экземпляра ``AdminSite``, возможно, вы не захотите отключить автоматический поиск модулей ``admin`` и регистрацию их в стандартной админке. Для этого укажите ``'django.contrib.admin.apps.SimpleAdminConfig'`` вместо ``'django.contrib.admin'`` в настройке :setting:`INSTALLED_APPS`. Скорее всего в этом случае вы будете импортировать модули ``admin`` в вашем модуле ``myproject.admin``.

source: Multiple admin sites in the same URLconf
ru: Несколько интерфейсов администратора в одном URLconf

source: It's easy to create multiple instances of the admin site on the same Django-powered website. Just create multiple instances of ``AdminSite`` and root each one at a different URL.
ru: Django позволяет легко создать несколько интерфейсов администратора для одного сайта. Просто создайте несколько экземпляров ``AdminSite`` и добавьте его к различным URL-ам.

source: In this example, the URLs ``/basic-admin/`` and ``/advanced-admin/`` feature separate versions of the admin site -- using the ``AdminSite`` instances ``myproject.admin.basic_site`` and ``myproject.admin.advanced_site``, respectively::
ru: В этом примере, URL-ы ``/basic-admin/`` и ``/advanced-admin/`` ведут к различным экземплярам ``AdminSite`` -- ``myproject.admin.basic_site`` и ``myproject.admin.advanced_site`` соответственно::

source: ``AdminSite`` instances take a single argument to their constructor, their name, which can be anything you like. This argument becomes the prefix to the URL names for the purposes of :ref:`reversing them<admin-reverse-urls>`. This is only necessary if you are using more than one ``AdminSite``.
ru: Конструктор ``AdminSite`` принимает единственный аргумент -- название экземпляра, которое может быть любым. Это значение будет использоваться как префикс для названий URL при их :ref:`поиске<admin-reverse-urls>`. Это необходимо если вы используете несколько экземпляров ``AdminSite``.

source: Adding views to admin sites
ru: Добавление представлений в интерфейс администратора

source: Just like :class:`ModelAdmin`, :class:`AdminSite` provides a :meth:`~django.contrib.admin.ModelAdmin.get_urls()` method that can be overridden to define additional views for the site. To add a new view to your admin site, extend the base :meth:`~django.contrib.admin.ModelAdmin.get_urls()` method to include a pattern for your new view.
ru: Как и :class:`ModelAdmin` :class:`AdminSite` содержит метод :meth:`~django.contrib.admin.ModelAdmin.get_urls()`, который можно переопределить и добавить собственные представления в интерфейс администратора. Переопределите метод :meth:`~django.contrib.admin.ModelAdmin.get_urls()` и добавьте URL-шаблоны с вашими представлениями.

source: Any view you render that uses the admin templates, or extends the base admin template, should set ``request.current_app`` before rendering the template. It should be set to either ``self.name`` if your view is on an ``AdminSite`` or ``self.admin_site.name`` if your view is on a ``ModelAdmin``.
ru: Каждое представление, которое использует шаблоны интерфейса администратора или унаследованные шаблоны, должно указать ``request.current_app`` перед рендерингом шаблона. Он должен быть равен ``self.name``, если представление определенно в ``AdminSite``, или ``self.admin_site.name``, если определено в ``ModelAdmin``.

source: (This assumes you've added the admin at ``admin/`` and requires that you put the URLs starting with ``^admin/`` before the line that includes the admin app itself).
ru: (Предполагается что вы уже добавили приложения интерфейса администратора к ``admin/`` и что оно указано после всех URL-шаблонов начинающихся с ``^admin/`` ).

source: The presence of the ``admin_password_reset`` named URL will cause a "forgotten your password?" link to appear on the default admin log-in page under the password box.
ru: Наличие URL-шаблона с названием ``admin_password_reset`` приведет к появлению ссылки "забыли ваш пароль?" на странице входа в интерфейсе администратора.

source: ``LogEntry`` objects
ru: Объекты ``LogEntry``

source: The ``LogEntry`` class tracks additions, changes, and deletions of objects done through the admin interface.
ru: Класс ``LogEntry`` следит за добавлением, изменение и удалением объектов, которые выполняются через админку.

source: ``LogEntry`` attributes
ru: Атрибуты ``LogEntry``

source: The date and time of the action.
ru: Дата и время действия.

source: The user (an :setting:`AUTH_USER_MODEL` instance) who performed the action.
ru: Пользователь (объект :setting:`AUTH_USER_MODEL`), который выполнил действие.

source: The :class:`~django.contrib.contenttypes.models.ContentType` of the modified object.
ru: :class:`~django.contrib.contenttypes.models.ContentType` измененного объекта.

source: The textual representation of the modified object's primary key.
ru: Текстовое представление первичного ключа измененного объекта.

source: The object`s ``repr()`` after the modification.
ru: Результат ``repr()`` над объектом после изменения.

source: The type of action logged: ``ADDITION``, ``CHANGE``, ``DELETION``.
ru: Тип действия: ``ADDITION``, ``CHANGE``, ``DELETION``.

source: For example, to get a list of all additions done through the admin::
ru: Например, чтобы получить все добавления через админку::

source: ``LogEntry`` methods
ru: Методы ``LogEntry``

source: A shortcut that returns the referenced object.
ru: Возвращает связанный объект.

source: Reversing admin URLs
ru: Поиск URL-ов интерфейса администратора

source: When an :class:`AdminSite` is deployed, the views provided by that site are accessible using Django's :ref:`URL reversing system <naming-url-patterns>`.
ru: После установки :class:`AdminSite` можно указывать ссылки к представлениям интерфейса администратора используя :ref:`систему поиска URL-ов <naming-url-patterns>`.

source: The :class:`AdminSite` provides the following named URL patterns:
ru: :class:`AdminSite` предоставляет следующие именованные URL-шаблоны:

source: Page
ru: Страница

source: URL name
ru: Название URL-а

source: Parameters
ru: Параметры

source: Index
ru: Главная

source: Logout
ru: Выхода

source: Password change
ru: Смена пароля

source: Password change done
ru: Завершения смены пароля

source: Application index page
ru: Главная страница приложения

source: Redirect to object's page
ru: Редирект на страницу объекта

source: Each :class:`ModelAdmin` instance provides an additional set of named URLs:
ru: Каждый экземпляр :class:`ModelAdmin` предоставляет дополнительные именованные URL-шаблоны:

source: Changelist
ru: Список объектов

source: Add
ru: Добавления объекта

source: History
ru: Истории

source: Delete
ru: Удаления объекта

source: Change
ru: Изменения объекта

source: The ``UserAdmin`` provides a named URL:
ru: ``UserAdmin`` предоставляет следующие именованные URL-шаблоны:

source: These named URLs are registered with the application namespace ``admin``, and with an instance namespace corresponding to the name of the Site instance.
ru: Эти именованные URL-шаблоны зарегистрированы с названием экземпляра приложения ``admin`` и названием экземпляра приложения, указанным при создании ``AdminSite``.

source: So - if you wanted to get a reference to the Change view for a particular ``Choice`` object (from the polls application) in the default admin, you would call::
ru: Например, нам необходимо получить ссылку на страницу изменения объекта модели ``Choice`` (из приложения ``polls``) в стандартном интерфейсе администратора. Для этого необходимо выполнить следующий код::

source: This will find the first registered instance of the admin application (whatever the instance name), and resolve to the view for changing ``poll.Choice`` instances in that instance.
ru: Этот код найдет первый зарегистрированный экземпляр приложения ``admin`` (не зависимо от определенного названия экземпляра) и найдет ссылку на представление для редактирования объекта ``poll.Choice``.

source: If you want to find a URL in a specific admin instance, provide the name of that instance as a ``current_app`` hint to the reverse call. For example, if you specifically wanted the admin view from the admin instance named ``custom``, you would need to call::
ru: Если необходимо найти URL в определенном экземпляре приложения, укажите значение ``current_app``. Например, если необходимо получить ссылку на представление в экземпляре приложения с названием ``custom``, выполните следующий код::

source: For more details, see the documentation on :ref:`reversing namespaced URLs <topics-http-reversing-url-namespaces>`.
ru: Подробности смотрите в разделе о :ref:`пространстве имен в конфигурации URL-ов <topics-http-reversing-url-namespaces>`.

source: To allow easier reversing of the admin urls in templates, Django provides an ``admin_urlname`` filter which takes an action as argument:
ru: Для более удобного поиска URL-ов в шаблонах, Django предоставляет фильтр ``admin_urlname``, который принимает название действия в качестве аргумента:

source: The action in the examples above match the last part of the URL names for :class:`ModelAdmin` instances described above. The ``opts`` variable can be any object which has an ``app_label`` and ``model_name`` attributes and is usually supplied by the admin views for the current model.
ru: Название действия совпадает с последней частью названия URL-шаблона в :class:`ModelAdmin`, которые описаны выше. Значение ``opts`` может быть любым объектом содержащим ``app_label`` и ``model_name``, эта переменная обычно указывается представлением в интерфейсе администратора для текущей модели.

source: The ``staff_member_required`` decorator
ru: Декоратор ``staff_member_required``

source: This decorator is used on the admin views that require authorization. A view decorated with this function will having the following behavior:
ru: Декоратор используется для представлений админки, чтобы проверять авторизацию. Представления с этим декоратором будут работать следующим образом:

source: If the user is logged in, is a staff member (``User.is_staff=True``), and is active (``User.is_active=True``), execute the view normally.
ru: Если пользователь авторизирован, и он администратор (``User.is_staff=True``), и активен (``User.is_active=True``), выполнить представление.

source: Otherwise, the request will be redirected to the URL specified by the ``login_url`` parameter, with the originally requested path in a query string variable specified by ``redirect_field_name``. For example: ``/admin/login/?next=/admin/polls/question/3/``.
ru: Иначе запросе будет перенаправлен на URL, указанный в параметре ``login_url``, который по умолчанию равен значению аргумента с названием из ``redirect_field_name``. Например: ``/admin/login/?next=/admin/polls/question/3/``.

source: Example usage::
ru: Пример использования::
