Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/ref/contrib/admin/index.po
Languages: ru

source: Override this method to programmatically determine the minimum number of inline forms. For example, this may be based on the model instance (passed as the keyword argument ``obj``).
ru: Вы можете переопределить метод и добавить логику для определения минимального количества форм. Например, учитывать данные объекта модели(передается как именованный аргумент ``obj``).

source: Working with a model with two or more foreign keys to the same parent model
ru: Работа с моделью с несколькими внешними ключами к одной модели

source: It is sometimes possible to have more than one foreign key to the same model. Take this model for instance::
ru: Модель может содержать несколько внешних ключей к одной модели, например::

source: If you wanted to display an inline on the ``Person`` admin add/change pages you need to explicitly define the foreign key since it is unable to do so automatically::
ru: Если вы хотите использовать "inline" для этой модели на странице редактирования/добавления объектов ``Person``, вам необходимо указать какой внешний ключ использовать::

source: Working with many-to-many models
ru: Работа со связями многие-ко-многим

source: By default, admin widgets for many-to-many relations will be displayed on whichever model contains the actual reference to the :class:`~django.db.models.ManyToManyField`. Depending on your ``ModelAdmin`` definition, each many-to-many field in your model will be represented by a standard HTML ``<select multiple>``, a horizontal or vertical filter, or a ``raw_id_admin`` widget. However, it is also possible to replace these widgets with inlines.
ru: По умолчанию, для полей :class:`~django.db.models.ManyToManyField` используется виджет определенный интерфейсом администратора. В зависимости от параметров ``ModelAdmin``может использоваться стандартное HTML поле ``<select multiple>``, горизонтальный или вертикальный фильтр, или виджет ``raw_id_admin``. Однако вместо этого можно использовать "inline".

source: Suppose we have the following models::
ru: Предположим у нас есть следующие модели::

source: If you want to display many-to-many relations using an inline, you can do so by defining an ``InlineModelAdmin`` object for the relationship::
ru: Необходимо определить объект ``InlineModelAdmin`` для связи многое-ко-многим::

source: There are two features worth noting in this example.
ru: Есть две вещи в этом примере, которые следует отметить.

source: Firstly - the ``MembershipInline`` class references ``Group.members.through``. The ``through`` attribute is a reference to the model that manages the many-to-many relation. This model is automatically created by Django when you define a many-to-many field.
ru: Первая - класс ``MembershipInline`` ссылается на ``Group.members.through``. Атрибут ``through`` указывает на модель управляющую связью многое-ко-многим. Эта модель автоматически создается Django при определении связи.

source: Secondly, the ``GroupAdmin`` must manually exclude the ``members`` field. Django displays an admin widget for a many-to-many field on the model that defines the relation (in this case, ``Group``). If you want to use an inline model to represent the many-to-many relationship, you must tell Django's admin to *not* display this widget - otherwise you will end up with two widgets on your admin page for managing the relation.
ru: Вторая -- класс ``GroupAdmin`` должен явно исключить поле ``members``. Django отображает поле для связи многое-ко-многим (в нашем случае с моделью ``Group``). Если вы хотите использовать "inline", необходимо указать Django, что поле *не* нужно отображать - иначе мы получим два виджета для редактирования связи.

source: Note that when using this technique the :data:`~django.db.models.signals.m2m_changed` signals aren't triggered. This is because as far as the admin is concerned, ``through`` is just a model with two foreign key fields rather than a many-to-many relation.
ru: Обратите внимание, при использовании такого подхода сигнал :data:`~django.db.models.signals.m2m_changed` не вызывается. Это вызвано тем, что для админки ``through`` просто модель с двумя внешними ключами, а не связь много-ко-многим.

source: In all other respects, the ``InlineModelAdmin`` is exactly the same as any other. You can customize the appearance using any of the normal ``ModelAdmin`` properties.
ru: Во всем остальном ``InlineModelAdmin`` работает так же, как и всегда. Вы можете управлять отображением используя параметры ``ModelAdmin``.

source: Working with many-to-many intermediary models
ru: Работа с промежуточной моделью связи многое-ко-многим

source: When you specify an intermediary model using the ``through`` argument to a :class:`~django.db.models.ManyToManyField`, the admin will not display a widget by default. This is because each instance of that intermediary model requires more information than could be displayed in a single widget, and the layout required for multiple widgets will vary depending on the intermediate model.
ru: Если указать аргумент ``through`` для поля :class:`~django.db.models.ManyToManyField`, интерфейс администратора не отобразит поле для редактирования. Это связано с тем, что промежуточная модель требует больше данных, чем позволяет ввести стандартное поле.

source: However, we still want to be able to edit that information inline. Fortunately, this is easy to do with inline admin models. Suppose we have the following models::
ru: Однако, нам необходимо редактировать информацию промежуточной модели. К счастью это можно сделать используя "inline" в интерфейсе администратора. Предположим у нас есть следующие модели::

source: The first step in displaying this intermediate model in the admin is to define an inline class for the ``Membership`` model::
ru: Для начала определим отображение модели ``Membership`` в интерфейсе администратора::

source: This simple example uses the default ``InlineModelAdmin`` values for the ``Membership`` model, and limits the extra add forms to one. This could be customized using any of the options available to ``InlineModelAdmin`` classes.
ru: В этом простом примере используются стандартные значения параметров ``InlineModelAdmin``, кроме количества дополнительных форм. Вы можете изменить любые параметры класса ``InlineModelAdmin``.

source: Now create admin views for the ``Person`` and ``Group`` models::
ru: Теперь определим отображение моделей ``Person`` и ``Group``::

source: Finally, register your ``Person`` and ``Group`` models with the admin site::
ru: Теперь зарегистрируем модели ``Person`` и ``Group`` в интерфейсе администратора::

source: Now your admin site is set up to edit ``Membership`` objects inline from either the ``Person`` or the ``Group`` detail pages.
ru: Теперь вы можете редактировать объекты ``Membership`` на странице объектов ``Person`` и ``Group``.

source: Using generic relations as an inline
ru: Использование связей с несколькими моделями в интерфейсе администратора

source: It is possible to use an inline with generically related objects. Let's say you have the following models::
ru: Вы можете использовать "inline" для связей с несколькими моделями(generic relations). Предположим, у вас есть следующие модели::

source: If you want to allow editing and creating an ``Image`` instance on the ``Product``, add/change views you can use :class:`~django.contrib.contenttypes.admin.GenericTabularInline` or :class:`~django.contrib.contenttypes.admin.GenericStackedInline` (both subclasses of :class:`~django.contrib.contenttypes.admin.GenericInlineModelAdmin`) provided by :mod:`~django.contrib.contenttypes.admin`. They implement tabular and stacked visual layouts for the forms representing the inline objects, respectively, just like their non-generic counterparts. They behave just like any other inline. In your ``admin.py`` for this example app::
ru: Если вы хотите редактировать и добавлять объекты ``Image`` на странице добавления/редактирования объектов ``Product``, вы можете использовать :class:`~django.contrib.contenttypes.admin.GenericTabularInline` или :class:`~django.contrib.contenttypes.admin.GenericStackedInline` (подклассы :class:`~django.contrib.contenttypes.admin.GenericInlineModelAdmin`) из модуля :mod:`~django.contrib.contenttypes.admin`. Они отображают группы форм для добавления и редактирования связанных объектов, как и аналогичные классы из приложения интерфейса администратора. Пример ``admin.py`` для наших моделей::

source: See the :doc:`contenttypes documentation </ref/contrib/contenttypes>` for more specific information.
ru: Подробности смотрите в :doc:`разделе о contenttypes </ref/contrib/contenttypes>`.

source: Overriding admin templates
ru: Переопределение шаблонов в интерфейсе администратора

source: It is relatively easy to override many of the templates which the admin module uses to generate the various pages of an admin site. You can even override a few of these templates for a specific app, or a specific model.
ru: Переопределить шаблоны, которые использует интерфейс администратора, очень легко. Вы можете переопределить шаблон для конкретного приложения или модели.

source: Set up your projects admin template directories
ru: Настройка каталогов в шаблонами

source: The admin template files are located in the ``contrib/admin/templates/admin`` directory.
ru: Шаблоны интерфейса администратора находятся в каталоге ``contrib/admin/templates/admin``.

source: In order to override one or more of them, first create an ``admin`` directory in your project's ``templates`` directory. This can be any of the directories you specified in the :setting:`DIRS <TEMPLATES-DIRS>` option of the ``DjangoTemplates`` backend in the :setting:`TEMPLATES` setting. If you have customized the ``'loaders'`` option, be sure ``'django.template.loaders.filesystem.Loader'`` appears before ``'django.template.loaders.app_directories.Loader'`` so that your custom templates will be found by the template loading system before those that are included with :mod:`django.contrib.admin`.
ru: Чтобы переопределить шаблоны, для начала создайте каталог ``admin`` в каталоге ``templates`` проекта. Это может быть любой каталог, указанный в опции :setting:`DIRS <TEMPLATES-DIRS>` бэкенда `DjangoTemplates`` в настройке :setting:`TEMPLATES`. Если вы изменили опцию ``'loaders'``, убедитесь, что ``'django.template.loaders.filesystem.Loader'`` стоит перед ``'django.template.loaders.app_directories.Loader'``. Таким образом ваши шаблоны будет найдены до того, как Django найдет шаблоны из :mod:`django.contrib.admin`.

source: Within this ``admin`` directory, create sub-directories named after your app. Within these app subdirectories create sub-directories named after your models. Note, that the admin app will lowercase the model name when looking for the directory, so make sure you name the directory in all lowercase if you are going to run your app on a case-sensitive filesystem.
ru: В каталоге ``admin`` создайте подкаталоги с названием приложений. В этих подкаталогах создайте подкаталоги для моделей. Заметим, что интерфейс администратора преобразует название модели в нижний регистр, так что убедитесь что название каталогов в нижнем регистре, если вы использует файловую систему учитывающую регистр названий каталог.

source: To override an admin template for a specific app, copy and edit the template from the ``django/contrib/admin/templates/admin`` directory, and save it to one of the directories you just created.
ru: Чтобы переопределить шаблон для определенного приложения, скопируйте и отредактируйте необходимый шаблон из каталога ``django/contrib/admin/templates/admin`` и сохраните его в созданном подкаталоге.

source: For example, if we wanted to add a tool to the change list view for all the models in an app named ``my_app``, we would copy ``contrib/admin/templates/admin/change_list.html`` to the ``templates/admin/my_app/`` directory of our project, and make any necessary changes.
ru: Например, если необходимо изменить шаблон для представления списка объектов для всех моделей в приложении ``my_app``, скопируйте ``contrib/admin/templates/admin/change_list.html`` в каталог ``templates/admin/my_app/`` проекта и выполните необходимые изменения.

source: If we wanted to add a tool to the change list view for only a specific model named 'Page', we would copy that same file to the ``templates/admin/my_app/page`` directory of our project.
ru: Если необходимо изменить шаблон только для модели 'Page', скопируйте тот же файл в каталог ``templates/admin/my_app/page`` проекта.

source: Overriding vs. replacing an admin template
ru: Переопределение или замена шаблона в интерфейсе администратора

source: Because of the modular design of the admin templates, it is usually neither necessary nor advisable to replace an entire template. It is almost always better to override only the section of the template which you need to change.
ru: Учитывая модульную структуру шаблонов в интерфейсе администратора, как правило нет необходимости заменять весь шаблон. Целесообразней переопределить только необходимый блок шаблона.

source: To continue the example above, we want to add a new link next to the ``History`` tool for the ``Page`` model. After looking at ``change_form.html`` we determine that we only need to override the ``object-tools-items`` block. Therefore here is our new ``change_form.html`` :
ru: Продолжим пример выше. Например, необходимо добавить ссылку после ссылки ``History`` для модели ``Page``. Изучив ``change_form.html`` можно увидеть, что нам необходимо переопределить только блок ``object-tools-items``. Вот наш новый шаблон ``change_form.html`` :

source: And that's it! If we placed this file in the ``templates/admin/my_app`` directory, our link would appear on the change form for all models within my_app.
ru: Вот и все! Добавим шаблон в каталог ``templates/admin/my_app`` и ссылка появится на странице редактирования объекта для всех моделей приложения my_app.

source: Templates which may be overridden per app or model
ru: Шаблоны, которые можно переопределить для приложения или модели

source: Not every template in ``contrib/admin/templates/admin`` may be overridden per app or per model. The following can:
ru: Не каждый шаблон в ``contrib/admin/templates/admin`` можно переопределить для приложения или модели. Вот список переопределяемых шаблонов:

source: For those templates that cannot be overridden in this way, you may still override them for your entire project. Just place the new version in your ``templates/admin`` directory. This is particularly useful to create custom 404 and 500 pages.
ru: Остальные шаблоны вы можете все еще переопределить для всего проекта. Просто добавьте новую версию шаблона в каталог ``templates/admin``. Это особенно полезно для переопределения страниц для 404 и 500 ошибки.

source: Some of the admin templates, such as ``change_list_results.html`` are used to render custom inclusion tags. These may be overridden, but in such cases you are probably better off creating your own version of the tag in question and giving it a different name. That way you can use it selectively.
ru: Некоторые шаблоны, такие как ``change_list_request.html`` используются для отображения включаемых тегов(inclusion tags). Вы можете переопределить их, но лучше создать собственную версию тега, которая будет использовать новый шаблон. В этом случае вы сможете использовать оба шаблона.

source: Root and login templates
ru: Главный шаблон и шаблон страницы входа

source: If you wish to change the index, login or logout templates, you are better off creating your own ``AdminSite`` instance (see below), and changing the :attr:`AdminSite.index_template` , :attr:`AdminSite.login_template` or :attr:`AdminSite.logout_template` properties.
ru: Чтобы переопределить шаблоны главной страницы и страниц входа/выхода, лучше создать собственный экземпляр ``AdminSite`` (смотрите ниже), и изменить свойства :attr:`AdminSite.index_template` , :attr:`AdminSite.login_template` и :attr:`AdminSite.logout_template`.

source: ``AdminSite`` objects
ru: Объект ``AdminSite``

source: A Django administrative site is represented by an instance of ``django.contrib.admin.sites.AdminSite``; by default, an instance of this class is created as ``django.contrib.admin.site`` and you can register your models and ``ModelAdmin`` instances with it.
ru: Интерфейс администратора Django представлен экземпляром ``django.contrib.admin.sites.AdminSite``. По умолчанию, экземпляр этого класса находится в ``django.contrib.admin.site`` и вы можете зарегистрировать модели с подклассами ``ModelAdmin`` в нем.

source: When constructing an instance of an ``AdminSite``, you can provide a unique instance name using the ``name`` argument to the constructor. This instance name is used to identify the instance, especially when :ref:`reversing admin URLs <admin-reverse-urls>`. If no instance name is provided, a default instance name of ``admin`` will be used. See :ref:`customizing-adminsite` for an example of customizing the :class:`AdminSite` class.
ru: При создании экземпляра ``AdminSite``, вы можете указать уникальное название экземпляра приложения передав аргумент ``name`` в конструктор. Это название используется для идентификации экземпляра что важно при :ref:`поиске URL-ов интерфейса администратора <admin-reverse-urls>`. Если этот аргумент не указан, будет использовано значение по умолчанию ``admin``. Смотрите раздел :ref:`customizing-adminsite` о том, как настраивать класс :class:`AdminSite`.

source: ``AdminSite`` attributes
ru: Атрибуты ``AdminSite``

source: Templates can override or extend base admin templates as described in :ref:`admin-overriding-templates`.
ru: Можно переопределить или заменить основные шаблоны в интерфейсе администратора как это описано в разделе :ref:`admin-overriding-templates`.

source: The text to put at the top of each admin page, as an ``<h1>`` (a string). By default, this is "Django administration".
ru: Текст, который отображается в заголовке каждой страницы, в ``<h1>``. По умолчанию "Django administration".

source: The text to put at the end of each admin page's ``<title>`` (a string). By default, this is "Django site admin".
ru: Текст, который добавляется в ``<title>`` каждой страницы. По умолчанию "Django site admin".

source: The URL for the "View site" link at the top of each admin page. By default, ``site_url`` is ``/``. Set it to ``None`` to remove the link.
ru: URL для ссылки "View site" на верху каждой страницы админки. По умолчанию ``site_url`` равен ``/``. Чтобы убрать эту ссылку, укажите ``None``.

source: The text to put at the top of the admin index page (a string). By default, this is "Site administration".
ru: Текст, который отображается в верху главной странице админки. По умолчанию "Site administration".

source: Path to a custom template that will be used by the admin site main index view.
ru: Шаблон, который будет использоваться для главной страницы.

source: Path to a custom template that will be used by the admin site app index view.
ru: Шаблон, который будет использоваться для главной страницей приложения.

source: The string to use for displaying empty values in the admin site's change list. Defaults to a dash. The value can also be overridden on a per ``ModelAdmin`` basis and on a custom field within a ``ModelAdmin`` by setting an ``empty_value_display`` attribute on the field. See :attr:`ModelAdmin.empty_value_display` for examples.
ru: Строка, которая используется при отображении пустых значений на странице списка объектов. По умолчанию равна ``"-"``. Значение можно переопределить для ``ModelAdmin`` и для каждого поля ``ModelAdmin``, указав атрибут ``empty_value_display`` для поля. Примеры смотрите в :attr:`ModelAdmin.empty_value_display`.

source: Path to a custom template that will be used by the admin site login view.
ru: Шаблон, который будет использоваться для страницы входа.

source: Subclass of :class:`~django.contrib.auth.forms.AuthenticationForm` that will be used by the admin site login view.
ru: Подкласс :class:`~django.contrib.auth.forms.AuthenticationForm` который будет использовать для представления авторизации в интерфейсе администратора.

source: Path to a custom template that will be used by the admin site logout view.
ru: Шаблон, который будет использоваться для страницы выхода.

source: Path to a custom template that will be used by the admin site password change view.
ru: Шаблон, который будет использоваться для страницы смены пароля.

source: Path to a custom template that will be used by the admin site password change done view.
ru: Шаблон, который будет использоваться для страницы завершения смены пароля.

source: ``AdminSite`` methods
ru: Методы ``AdminSite``

source: Returns a dictionary of variables to put in the template context for every page in the admin site.
ru: Возвращает словарь переменных, которые будут добавлены в контекст шаблона для каждой странице этой админки.

source: Includes the following variables and values by default:
ru: По умолчанию содержит следующие переменны:

source: ``available_apps``: a list of applications from the :doc:`application registry </ref/applications/>` available for the current user. Each entry in the list is a dict representing an application with the following keys:
ru: ``available_apps``: список приложений из :doc:`регистра приложений </ref/applications/>`, которые доступны для текущего пользователя. Каждый элемент списка содержит словарь, который представляет приложение, со следующими ключами:

source: ``app_label``: the application label
ru: ``app_label``: название приложения

source: ``app_url``: the URL of the application index in the admin
ru: ``app_url``: URL главное страницы приложения в админке

source: ``has_module_perms``: a boolean indicating if displaying and accessing of the module's index page is permitted for the current user
ru: ``has_module_perms``: булево, которые указывает есть ли у пользователя права к главной странице приложения в админке

source: ``models``: a list of the models available in the application
ru: ``models``: список моделей прилоджения

source: Each model is a dict with the following keys:
ru: Каждая модель представлена словарем со следующими ключами:

source: ``object_name``: class name of the model
ru: ``object_name``: название класса модели

source: ``name``: plural name of the model
ru: ``name``: множественное название модели

source: ``perms``: a ``dict`` tracking ``add``, ``change``, and ``delete`` permissions
ru: ``perms``: ``dict`` со значениями прав ``add``, ``change`` и ``delete``

source: ``admin_url``: admin changelist URL for the model
ru: ``admin_url``: URL к странице списка объектов модели в админке

source: ``add_url``: admin URL to add a new model instance
ru: ``add_url``: URL к странице добавления объекта модели в админке

source: Returns ``True`` if the user for the given ``HttpRequest`` has permission to view at least one page in the admin site. Defaults to requiring both :attr:`User.is_active <django.contrib.auth.models.User.is_active>` and :attr:`User.is_staff <django.contrib.auth.models.User.is_staff>` to be ``True``.
ru: Возвращает ``True``, если пользователь из переданного ``HttpRequest`` имеет доступ хотя бы к одной странице админки. По умолчанию проверяется равны ли :attr:`User.is_active <django.contrib.auth.models.User.is_active>` и :attr:`User.is_staff <django.contrib.auth.models.User.is_staff>` ``True``.

source: Hooking ``AdminSite`` instances into your URLconf
ru: Добавление экземпляра ``AdminSite`` в URLconf

source: In this example, we register the default ``AdminSite`` instance ``django.contrib.admin.site`` at the URL ``/admin/`` ::
ru: В этом примере мы добавляем экземпляр по умолчанию ``AdminSite``, который находится в ``django.contrib.admin.site``, для URL ``/admin/`` ::

source: Customizing the :class:`AdminSite` class
ru: Настройка класса :class:`AdminSite`
