Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/ref/contrib/admin/index.po
Languages: ru

source: For example, if you have a blog entry with an author, the following definition would enable searching blog entries by the email address of the author::
ru: Например, у нас есть модель записи в блоге с полем автора. Следующая настройка позволит искать записи по email адресу автора::

source: When somebody does a search in the admin search box, Django splits the search query into words and returns all objects that contain each of the words, case insensitive, where each word must be in at least one of ``search_fields``. For example, if ``search_fields`` is set to ``['first_name', 'last_name']`` and a user searches for ``john lennon``, Django will do the equivalent of this SQL ``WHERE`` clause::
ru: При поиске Django разбивает поисковый запрос на слова и возвращает объекты, которые содержат эти слова в одном из указанных в ``search_fields`` полей. Поиск регистронезависимый. Например, если ``search_fields`` равен ``['first_name', 'last_name']`` и пользователь выполняет поиск по ``john lennon``, Django создаст такое SQL условие ``WHERE``::

source: For faster and/or more restrictive searches, prefix the field name with an operator:
ru: Для определения более конкретных условий поиска используйте следующие префиксы:

source: Use the '^' operator to match starting at the beginning of the field. For example, if ``search_fields`` is set to ``['^first_name', '^last_name']`` and a user searches for ``john lennon``, Django will do the equivalent of this SQL ``WHERE`` clause::
ru: Оператор '^' указывает на начало строки. Например, если ``search_fields`` установить в ``['^first_name', '^last_name']`` и пользователь ищет ``john lennon``, Django создаст следующее SQL условие ``WHERE``::

source: This query is more efficient than the normal ``'%john%'`` query, because the database only needs to check the beginning of a column's data, rather than seeking through the entire column's data. Plus, if the column has an index on it, some databases may be able to use the index for this query, even though it's a ``LIKE`` query.
ru: Этот запрос более эффективный чем ``'%john%'``, так как база данных будет проверять только начало значения поля. К тому же, если поле содержит индекс, некоторые базы данных могут использовать его при поиске, даже для поиска через ``LIKE``.

source: Use the '=' operator for case-insensitive exact matching. For example, if ``search_fields`` is set to ``['=first_name', '=last_name']`` and a user searches for ``john lennon``, Django will do the equivalent of this SQL ``WHERE`` clause::
ru: Оператор '=' указывает полное совпадение, регистронезависимое. Например, если ``search_fields`` равно ``['=first_name', '=last_name']`` и пользователь ищет ``john lennon``, Django создаст следующее SQL условие ``WHERE``::

source: Note that the query input is split by spaces, so, following this example, it's currently not possible to search for all records in which ``first_name`` is exactly ``'john winston'`` (containing a space).
ru: Поисковый запрос разбивается по пробелам, поэтому, исходя из примера выше, нельзя найти записи с полем ``first_name`` равным ``'john winston'``(содержащим пробел).

source: Using the '@' operator to perform a full text match. This is like the default search method but uses an index. Currently this is only available for MySQL.
ru: Оператор '@' выполняет полнотекстовый поиск. Работает как и обычный поиск, но использует индекс. На данный момент это работает только в MySQL.

source: If you need to customize search you can use :meth:`ModelAdmin.get_search_results` to provide additional or alternate search behavior.
ru: Вы можете переопределить метод :meth:`ModelAdmin.get_search_results`, чтобы указать дополнительные параметры при поиске, или переопределить механизм поиска.

source: Set ``show_full_result_count`` to control whether the full count of objects should be displayed on a filtered admin page (e.g. ``99 results (103 total)``). If this option is set to ``False``, a text like ``99 results (Show all)`` is displayed instead.
ru: ``show_full_result_count`` указывает показывать ли количество всех объектов при фильтрации (например ``99 results (103 total)``). Если опция равна ``False``, будет показан подобный текст: ``99 results (Show all)``.

source: The default of ``show_full_result_count=True`` generates a query to perform a full count on the table which can be expensive if the table contains a large number of rows.
ru: По умолчанию ``show_full_result_count=True`` выполняет запрос, чтобы получить количество всех объектов, что может работать очень медленно для таблиц с большим количеством данных.

source: Set ``view_on_site`` to control whether or not to display the "View on site" link. This link should bring you to a URL where you can display the saved object.
ru: ``view_on_site`` определять показывать ли ссылку "Посмотреть на сайте". Эта ссылка должна вести на страницу сохраненного объекта.

source: This value can be either a boolean flag or a callable. If ``True`` (the default), the object's :meth:`~django.db.models.Model.get_absolute_url` method will be used to generate the url.
ru: Можно указать булево или функцию. При ``True`` (по умолчанию) будет использоваться метод :meth:`~django.db.models.Model.get_absolute_url` объекта для получения ссылки.

source: If your model has a :meth:`~django.db.models.Model.get_absolute_url` method but you don't want the "View on site" button to appear, you only need to set ``view_on_site`` to ``False``::
ru: Если модель содержит метод :meth:`~django.db.models.Model.get_absolute_url`, но вы не хотите показывать кнопку "Посмотреть на сайте", укажите ``False`` в ``view_on_site``::

source: In case it is a callable, it accepts the model instance as a parameter. For example::
ru: Можно указать функцию, которая принимает один аргумент - объект модели. Например::

source: Custom template options
ru: Настройки шаблонов

source: The :ref:`admin-overriding-templates` section describes how to override or extend the default admin templates. Use the following options to override the default templates used by the :class:`ModelAdmin` views:
ru: Раздел :ref:`admin-overriding-templates` описывает как переопределить или расширить шаблоны интерфейса администратора. Используйте следующие настройки, чтобы переопределить шаблоны, которые используются представлениями :class:`ModelAdmin`:

source: Path to a custom template, used by :meth:`add_view`.
ru: Путь к шаблону, который используется :meth:`add_view`.

source: Path to a custom template, used by :meth:`change_view`.
ru: Путь к шаблону, который используется :meth:`change_view`.

source: Path to a custom template, used by :meth:`changelist_view`.
ru: Путь к шаблону, который используется :meth:`changelist_view`.

source: Path to a custom template, used by :meth:`delete_view` for displaying a confirmation page when deleting one or more objects.
ru: Путь к шаблону, который используется :meth:`delete_view` для отображения страницы подтверждения удаления одного или нескольких объектов.

source: Path to a custom template, used by the ``delete_selected`` action method for displaying a confirmation page when deleting one or more objects. See the :doc:`actions documentation</ref/contrib/admin/actions>`.
ru: Путь к шаблону, который используется ``delete_selected`` для отображения страницы подтверждения удаления одного или нескольких объектов. Подробности смотрите в разделе о :doc:`действиях в интерфейсе администратора </ref/contrib/admin/actions>`.

source: Path to a custom template, used by :meth:`history_view`.
ru: Путь к шаблону, который используется :meth:`history_view`.

source: ``ModelAdmin`` methods
ru: Методы ``ModelAdmin``

source: For example to attach ``request.user`` to the object prior to saving::
ru: Например, добавление ``request.user`` к объекту перед сохранением объекта::

source: The ``save_formset`` method is given the ``HttpRequest``, the parent ``ModelForm`` instance and a boolean value based on whether it is adding or changing the parent object.
ru: Метод ``save_formset`` принимает объект ``HttpRequest``, ``ModelForm`` родительского объекта, "formset" связанных объектов и булево значение указывающее создан родительский объект или изменяется.

source: For example, to attach ``request.user`` to each changed formset model instance::
ru: Например, добавление ``request.user`` к каждому объекту, измененному в наборе форм::

source: See also :ref:`saving-objects-in-the-formset`.
ru: Смотрите также :ref:`saving-objects-in-the-formset`.

source: The ``get_ordering`` method takes a ``request`` as parameter and is expected to return a ``list`` or ``tuple`` for ordering similar to the :attr:`ordering` attribute. For example::
ru: Метод ``get_ordering`` принимает объект ``request`` и должен вернуть ``list`` или ``tuple`` с параметрами сортировки аналогично атрибуту :attr:`ordering`. Например::

source: The ``get_search_results`` method modifies the list of objects displayed into those that match the provided search term. It accepts the request, a queryset that applies the current filters, and the user-provided search term. It returns a tuple containing a queryset modified to implement the search, and a boolean indicating if the results may contain duplicates.
ru: Метод ``get_search_results`` фильтрует список объектов в соответствии с параметрами поиска. Он принимает запрос, ``queryset`` объектов, и параметры поиска указанные пользователем. Возвращает кортеж содержащий полученный ``queryset`` и булево указывающее может ли результат содержать одинаковые значения.

source: The default implementation searches the fields named in :attr:`ModelAdmin.search_fields`.
ru: По умолчанию выполняется поиск по полям из :attr:`ModelAdmin.search_fields`.

source: This method may be overridden with your own custom search method. For example, you might wish to search by an integer field, or use an external tool such as Solr or Haystack. You must establish if the queryset changes implemented by your search method may introduce duplicates into the results, and return ``True`` in the second element of the return value.
ru: Вы можете переопределить это метод поменяв механизм поиска. Например, вы можете искать по численным полям, или использовать поисковый движок, такой как Solr или Haystack. Вы должны определять наличие дубликатов в результате поиска и возвращать ``True`` вторым элементом результата.

source: The ``save_related`` method is given the ``HttpRequest``, the parent ``ModelForm`` instance, the list of inline formsets and a boolean value based on whether the parent is being added or changed. Here you can do any pre- or post-save operations for objects related to the parent. Note that at this point the parent object and its form have already been saved.
ru: Метод ``save_related`` принимает объект ``HttpRequest``, родительскую форму ``ModelForm``, список "inline formsets" и булево значение указывающее создан родительский объект или изменяется. Вы можете выполнить дополнительные операции перед и после сохранения объектов. Заметим, что к этому моменту родительский объект и его формы уже будут сохранены.

source: The ``get_readonly_fields`` method is given the ``HttpRequest`` and the ``obj`` being edited (or ``None`` on an add form) and is expected to return a ``list`` or ``tuple`` of field names that will be displayed as read-only, as described above in the :attr:`ModelAdmin.readonly_fields` section.
ru: Метод ``get_readonly_fields`` принимает объект ``HttpRequest`` и редактируемый объект ``obj`` (или ``None`` для формы создания нового объекта) и должен вернуть ``list`` или ``tuple`` содержащий список полей, которые будут отображаться только для чтения как описано в разделе :attr:`ModelAdmin.readonly_fields`.

source: The ``get_prepopulated_fields`` method is given the ``HttpRequest`` and the ``obj`` being edited (or ``None`` on an add form) and is expected to return a ``dictionary``, as described above in the :attr:`ModelAdmin.prepopulated_fields` section.
ru: Метод ``get_prepopulated_fields`` принимает объект ``HttpRequest`` и редактируемый объект ``obj`` (или ``None`` для формы создания нового объекта) и должен вернуть словарь полей аналогичный :attr:`ModelAdmin.prepopulated_fields`.

source: The ``get_list_display`` method is given the ``HttpRequest`` and is expected to return a ``list`` or ``tuple`` of field names that will be displayed on the changelist view as described above in the :attr:`ModelAdmin.list_display` section.
ru: Метод ``get_list_display`` принимает объект ``HttpRequest`` и редактируемый объект ``obj`` (или ``None`` для формы создания нового объекта) и должен вернуть ``list`` или ``tuple`` содержащий список полей, которые будут отображаться на странице списка объектов как описано в разделе :attr:`ModelAdmin.list_display`.

source: The ``get_list_display_links`` method is given the ``HttpRequest`` and the ``list`` or ``tuple`` returned by :meth:`ModelAdmin.get_list_display`. It is expected to return either ``None`` or a ``list`` or ``tuple`` of field names on the changelist that will be linked to the change view, as described in the :attr:`ModelAdmin.list_display_links` section.
ru: Метод ``get_list_display_links`` принимает объект ``HttpRequest`` и ``list`` или ``tuple`` указанный в :meth:`ModelAdmin.get_list_display`. Должен вернуть ``None``, ``list`` или ``tuple`` содержащий список полей, который будут ссылками на странице списка объектов к странице редактирования. Смотрите описание :attr:`ModelAdmin.list_display_links`.

source: The ``get_fields`` method is given the ``HttpRequest`` and the ``obj`` being edited (or ``None`` on an add form) and is expected to return a list of fields, as described above in the :attr:`ModelAdmin.fields` section.
ru: Метод ``get_fields`` принимает объект ``HttpRequest`` и редактируемый объект ``obj`` (или ``None`` для формы создания нового объекта) и должен вернуть список полей аналогичный :attr:`ModelAdmin.fields`.

source: The ``get_fieldsets`` method is given the ``HttpRequest`` and the ``obj`` being edited (or ``None`` on an add form) and is expected to return a list of two-tuples, in which each two-tuple represents a ``<fieldset>`` on the admin form page, as described above in the :attr:`ModelAdmin.fieldsets` section.
ru: Метод ``get_fieldsets`` принимает объект ``HttpRequest`` и редактируемый объект ``obj`` (или ``None`` для формы создания нового объекта) и должен вернуть список двухэлементных кортежей, которые определяют ``<fieldset>`` формы, как было описано выше в разделе про :attr:`ModelAdmin.fieldsets`.

source: The ``get_list_filter`` method is given the ``HttpRequest`` and is expected to return the same kind of sequence type as for the :attr:`~ModelAdmin.list_filter` attribute.
ru: Метод ``get_list_filter`` принимает ``HttpRequest`` должен вернуть значение формата, соответствующего параметру :attr:`~ModelAdmin.list_filter`.

source: The ``get_list_select_related`` method is given the ``HttpRequest`` and should return a boolean or list as :attr:`ModelAdmin.list_select_related` does.
ru: Метод ``get_list_select_related`` принимает ``HttpRequest`` должен вернуть значение формата, соответствующего параметру :attr:`~ModelAdmin.list_filter`.

source: The ``get_search_fields`` method is given the ``HttpRequest`` and is expected to return the same kind of sequence type as for the :attr:`~ModelAdmin.search_fields` attribute.
ru: Метод ``get_search_fields`` принимает ``HttpRequest`` должен вернуть значение формата, соответствующего параметру :attr:`~ModelAdmin.search_fields`.

source: The ``get_inline_instances`` method is given the ``HttpRequest`` and the ``obj`` being edited (or ``None`` on an add form) and is expected to return a ``list`` or ``tuple`` of :class:`~django.contrib.admin.InlineModelAdmin` objects, as described below in the :class:`~django.contrib.admin.InlineModelAdmin` section. For example, the following would return inlines without the default filtering based on add, change, and delete permissions::
ru: Метод ``get_inline_instances`` принимает объект ``HttpRequest`` и редактируемый объект ``obj`` (или ``None`` для формы создания нового объекта) и должен вернуть ``list`` или ``tuple`` содержащий объекты :class:`~django.contrib.admin.InlineModelAdmin`, как описано в разделе о :class:`~django.contrib.admin.InlineModelAdmin`. Например, следующий метод вернет все "inlines" без проверки прав на добавление, изменение или удаление связанных объектов.

source: If you override this method, make sure that the returned inlines are instances of the classes defined in :attr:`inlines` or you might encounter a "Bad Request" error when adding related objects.
ru: Если вы переопределяете этот метод, убедитесь, что возвращаемы объекты являются экземплярами одного из классов из :attr:`inlines`, иначе можете получить ошибку "Bad Request" при добавлении связанного объекта.

source: The ``get_urls`` method on a ``ModelAdmin`` returns the URLs to be used for that ModelAdmin in the same way as a URLconf. Therefore you can extend them as documented in :doc:`/topics/http/urls`::
ru: Метод ``get_urls`` класса ``ModelAdmin`` возвращает URL-ы, которые используются для ModelAdmin в URLconf. Вы можете дополнить их как описано в :doc:`/topics/http/urls`::

source: If you want to use the admin layout, extend from ``admin/base_site.html``:
ru: Вы можете использовать базовый шаблон админки ``admin/base_site.html``:

source: Notice that the custom patterns are included *before* the regular admin URLs: the admin URL patterns are very permissive and will match nearly anything, so you'll usually want to prepend your custom URLs to the built-in ones.
ru: Заметим, что собственные URL-шаблоны включаются *перед* URL-шаблонами интерфейса администратора, которые удовлетворяют почти всем URL-ам. Поэтому желательно добавлять собственные URL-шаблоны перед встроенными.

source: In this example, ``my_view`` will be accessed at ``/admin/myapp/mymodel/my_view/`` (assuming the admin URLs are included at ``/admin/``.)
ru: В этом примере, представление ``my_view`` будет доступно по ссылке ``/admin/myapp/mymodel/my_view/`` (предполагается что вы добавили URL-ы интерфейса администратора к ``/admin/``.)

source: However, the ``self.my_view`` function registered above suffers from two problems:
ru: Однако, есть несколько проблем, связанных с функцией ``self.my_view``:

source: It will *not* perform any permission checks, so it will be accessible to the general public.
ru: *Не* выполняются никакие проверки прав, каждый может выполнить запрос к этому представлению.

source: It will *not* provide any header details to prevent caching. This means if the page retrieves data from the database, and caching middleware is active, the page could show outdated information.
ru: *Не* отправляются заголовки управляющие кэшированием. Это означает, если включен кэширующий функциональный слой, данные из базы данных на странице могут быть неверными.

source: Since this is usually not what you want, Django provides a convenience wrapper to check permissions and mark the view as non-cacheable. This wrapper is ``AdminSite.admin_view()`` (i.e. ``self.admin_site.admin_view`` inside a ``ModelAdmin`` instance); use it like so::
ru: Обычно это не то, что вам нужно, Django предоставляет функцию-обертку для проверки прав и отключения кэширования. Эта функция -- :meth:`AdminSite.admin_view` (или ``self.admin_site.admin_view`` в методе ``ModelAdmin``). Используйте ее следующим образом::

source: Notice the wrapped view in the fifth line above::
ru: Обратите внимание на следующую строку::

source: This wrapping will protect ``self.my_view`` from unauthorized access and will apply the :func:`django.views.decorators.cache.never_cache` decorator to make sure it is not cached if the cache middleware is active.
ru: Функция-обертка защищает ``self.my_view`` от несанкционированного доступа и применяет декоратор ``django.views.decorators.cache.never_cache`` для предотвращения кэширования, если промежуточный слой кэширования активирован.

source: If the page is cacheable, but you still want the permission check to be performed, you can pass a ``cacheable=True`` argument to ``AdminSite.admin_view()``::
ru: Если страницу необходимо кэшировать, но необходимо проверять авторизацию, вы можете использовать аргумент ``cacheable=True`` для ``AdminSite.admin_view``::

source: ``ModelAdmin`` views have ``model_admin`` attributes. Other ``AdminSite`` views have ``admin_site`` attributes.
ru: Представления ``ModelAdmin`` содержат атрибуты ``model_admin``. Другие представления ``AdminSite`` содержат атрибут ``admin_site``.

source: Returns a :class:`~django.forms.ModelForm` class for use in the admin add and change views, see :meth:`add_view` and :meth:`change_view`.
ru: Возвращает класс :class:`~django.forms.ModelForm` используемый при добавлении и редактировании объектов, смотрите описание :meth:`add_view` и :meth:`change_view`.

source: The base implementation uses :func:`~django.forms.models.modelform_factory` to subclass :attr:`~form`, modified by attributes such as :attr:`~fields` and :attr:`~exclude`. So, for example, if you wanted to offer additional fields to superusers, you could swap in a different base form like so::
ru: Базовая реализация использует :func:`~django.forms.models.modelform_factory` для создания :attr:`~form` с измененными параметрами :attr:`~fields` и :attr:`~exclude`. Поэтому, если вы, например, захотите добавить поля форме для суперпользователя, вы можете изменить базовый класс формы::

source: You may also simply return a custom :class:`~django.forms.ModelForm` class directly.
ru: Вы также можете вернуть собственный класс :class:`~django.forms.ModelForm`.

source: Yields (``FormSet``, :class:`InlineModelAdmin`) pairs for use in admin add and change views.
ru: Выполняет yield по парам (``FormSet``, :class:`InlineModelAdmin`), чтобы вернуть набор форм для страницы создания и изменения.

source: For example if you wanted to display a particular inline only in the change view, you could override ``get_formsets_with_inlines`` as follows::
ru: Например, если некоторый "inline" необходимо отображать только при редактировании, можно переопределить метод ``get_formsets_with_inlines``::

source: The ``formfield_for_foreignkey`` method on a ``ModelAdmin`` allows you to override the default formfield for a foreign keys field. For example, to return a subset of objects for this foreign key field based on the user::
ru: Метод ``formfield_for_foreignkey`` позволяет вам переопределить поле для внешнего ключа. Например, изменить выбор объектов в зависимости от пользователя::

source: This uses the ``HttpRequest`` instance to filter the ``Car`` foreign key field to only display the cars owned by the ``User`` instance.
ru: Объект ``HttpRequest`` используется, чтобы отфильтровать для выбора объекты модели ``Car`` по текущему пользователю.

source: Like the ``formfield_for_foreignkey`` method, the ``formfield_for_manytomany`` method can be overridden to change the default formfield for a many to many field. For example, if an owner can own multiple cars and cars can belong to multiple owners -- a many to many relationship -- you could filter the ``Car`` foreign key field to only display the cars owned by the ``User``::
ru: Как и метод ``formfield_for_foreignkey``, ``formfield_for_manytomany`` позволяет переопределить поле формы для связей многое-ко-многим. Например, если пользователь может владеть несколькими машинами и машина может принадлежать нескольким пользователям, вы можете отфильтровать модель ``Car``, чтобы отображать машины только текущего пользователя::
