Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/ref/contrib/admin/index.po
Languages: ru

source: A string representing an attribute on the ``ModelAdmin``. This behaves same as the callable. For example::
ru: Название атрибута ``ModelAdmin``. Работает так же, как и функция. Например::

source: A string representing an attribute on the model. This behaves almost the same as the callable, but ``self`` in this context is the model instance. Here's a full model example::
ru: Название атрибута модели. Работает так же, как и функция, но ``self`` в этом контексте объект модели. Например::

source: A few special cases to note about ``list_display``:
ru: Несколько особенностей ``list_display``:

source: ``ManyToManyField`` fields aren't supported, because that would entail executing a separate SQL statement for each row in the table. If you want to do this nonetheless, give your model a custom method, and add that method's name to ``list_display``. (See below for more on custom methods in ``list_display``.)
ru: ``ManyToManyField`` не поддерживается, так как это влечет к созданию SQL запроса для каждого объекта. Если вам необходимо сделать это в любом случае, создайте метод модели и используйте его в ``list_display``. (Смотрите ниже подробности про использование методов в ``list_display``.)

source: If the field is a ``BooleanField`` or ``NullBooleanField``, Django will display a pretty "on" or "off" icon instead of ``True`` or ``False``.
ru: Если поле ``BooleanField`` или ``NullBooleanField``, Django покажет красивую "on" или "off" иконку вместо ``True`` или ``False``.

source: If the string given is a method of the model, ``ModelAdmin`` or a callable, Django will HTML-escape the output by default. To escape user input and allow your own unescaped tags, use :func:`~django.utils.html.format_html`.
ru: Если используется метод модели, ``ModelAdmin`` или функция, Django по умолчанию экранирует результат. Если вам нужно экранировать данные, вводимые пользователем, и не экранировать собственные теги, используйте :func:`~django.utils.html.format_html`.

source: Here's a full example model::
ru: Пример::

source: If the value of a field is ``None``, an empty string, or an iterable without elements, Django will display ``-`` (a dash). You can override this with :attr:`AdminSite.empty_value_display`::
ru: Если значение поля ``None``, пустая строка, или пустой итератор, Django покажет ``-`` (дефис). Вы можете переопределить это значение с помощью параметра :attr:`AdminSite.empty_value_display`::

source: Or on a field level::
ru: Или для поля::

source: If the string given is a method of the model, ``ModelAdmin`` or a callable that returns True or False Django will display a pretty "on" or "off" icon if you give the method a ``boolean`` attribute whose value is ``True``.
ru: Если используется метод модели, ``ModelAdmin`` или функция, которая возвращает True или False, Django покажет "on" или "off" иконки, если вы добавите атрибут ``boolean`` методу или функции со значением ``True``.

source: Usually, elements of ``list_display`` that aren't actual database fields can't be used in sorting (because Django does all the sorting at the database level).
ru: Обычно элементы ``list_display``, которые не являются полями модели, не могу быть использованы при сортировке (так как Django выполняет сортировку на уровне базы данных).

source: However, if an element of ``list_display`` represents a certain database field, you can indicate this fact by setting the ``admin_order_field`` attribute of the item.
ru: Однако, если элемент ``list_display`` представляет определенное поле в базе данных, вы можете указать это добавив атрибут ``admin_order_field`` к элементу.

source: For example::
ru: Например::

source: The above will tell Django to order by the ``first_name`` field when trying to sort by ``colored_first_name`` in the admin.
ru: В этом примере Django будет использовать поле ``first_name`` при сортировке по ``colored_first_name``.

source: To indicate descending order with ``admin_order_field`` you can use a hyphen prefix on the field name. Using the above example, this would look like::
ru: Для обратной сортировки в ``admin_model_field`` можно использовать префикс ``-``. Например::

source: ``admin_order_field`` supports query lookups to sort by values on related models. This example includes an "author first name" column in the list display and allows sorting it by first name::
ru: ``admin_order_field`` позволяет добавить сортировку по значению из связанных моделей. Этот пример содержит колонку "имя автора" и позволяет выполнить сортировку по ней::

source: Elements of ``list_display`` can also be properties. Please note however, that due to the way properties work in Python, setting ``short_description`` on a property is only possible when using the ``property()`` function and **not** with the ``@property`` decorator.
ru: В ``list_display`` можно указать свойства. Однако, учитывая как свойства работают в Python, параметр ``short_description`` свойства можно указать используя функцию ``property()``, а **не** декоратор ``@property``.

source: The field names in ``list_display`` will also appear as CSS classes in the HTML output, in the form of ``column-<field_name>`` on each ``<th>`` element. This can be used to set column widths in a CSS file for example.
ru: Названия полей из ``list_display`` будут использованы в CSS классах, форма будет содержать класс ``column-<field_name>`` для каждого элемента ``<th>``. Так можно определить ширину полей через CSS стили.

source: Django will try to interpret every element of ``list_display`` in this order:
ru: Django попытается интерпретировать каждый элемент ``list_display`` в следующем порядке:

source: A field of the model.
ru: Поле модели.

source: A callable.
ru: Метод или любой другой вызываемый объект.

source: A string representing a ``ModelAdmin`` attribute.
ru: Строка, представляющая атрибут ``ModelAdmin``.

source: A string representing a model attribute.
ru: Строка, представляющая атрибут модели.

source: For example if you have ``first_name`` as a model field and as a ``ModelAdmin`` attribute, the model field will be used.
ru: Например, если существует поле модели ``first_name`` и атрибут ``ModelAdmin``, будет использоваться поле модели.

source: Use ``list_display_links`` to control if and which fields in :attr:`list_display` should be linked to the "change" page for an object.
ru: Используйте ``list_display_links``, чтобы указать какие поля в :attr:`list_display` будут ссылками на страницу редактирования объекта.

source: By default, the change list page will link the first column -- the first field specified in ``list_display`` -- to the change page for each item. But ``list_display_links`` lets you change this:
ru: По умолчанию, на страницу редактирования объекта будет вести ссылка в первой колонке -- первое поле в ``list_display``. Но ``list_display_links`` позволяет изменить это поведение:

source: Set it to ``None`` to get no links at all.
ru: Можно указать ``None``, чтобы убрать ссылки.

source: Set it to a list or tuple of fields (in the same format as ``list_display``) whose columns you want converted to links.
ru: Укажите список или кортеж полей (так же как и в ``list_display``) чьи колонки должны быть ссылками на страницу редактирования.

source: You can specify one or many fields. As long as the fields appear in ``list_display``, Django doesn't care how many (or how few) fields are linked. The only requirement is that if you want to use ``list_display_links`` in this fashion, you must define ``list_display``.
ru: Вы можете указывать одно или несколько полей. Пока указанные поля входят в ``list_display``, Django безразлично сколько их. Единственное требование: для использования ``list_display_links`` вы должны указать ``list_display``.

source: In this example, the ``first_name`` and ``last_name`` fields will be linked on the change list page::
ru: В этом примере поля ``first_name`` и ``last_name`` будут отображаться как ссылки на страницу редактирования объекта::

source: In this example, the change list page grid will have no links::
ru: В этом примере список объектов будет без ссылок::

source: Set ``list_editable`` to a list of field names on the model which will allow editing on the change list page. That is, fields listed in ``list_editable`` will be displayed as form widgets on the change list page, allowing users to edit and save multiple rows at once.
ru: Укажите в ``list_editable`` список полей, которые можно будет редактировать на странице списка объектов. То есть, поля из ``list_editable`` будут отображаться как поля формы позволяя пользователям изменять значения и сохранять изменения для всех строк сразу.

source: ``list_editable`` interacts with a couple of other options in particular ways; you should note the following rules:
ru: ``list_editable`` взаимодействует с другими настройками следующим образом:

source: Any field in ``list_editable`` must also be in ``list_display``. You can't edit a field that's not displayed!
ru: Поле из ``list_editable`` должно входить в ``list_display``. Вы не можете редактировать поле, которое не отображается!

source: The same field can't be listed in both ``list_editable`` and ``list_display_links`` -- a field can't be both a form and a link.
ru: Поле не может быть в ``list_editable`` и ``list_display_links`` вместе -- поле не может быть ссылкой и полем формы.

source: You'll get a validation error if either of these rules are broken.
ru: Вы получите ошибку проверки если нарушите эти правила.

source: Set ``list_filter`` to activate filters in the right sidebar of the change list page of the admin, as illustrated in the following screenshot:
ru: Укажите ``list_filter``, чтобы определить фильтры данных в правой панели страницы списка объектов, как показано на изображении:

source: ``list_filter`` should be a list or tuple of elements, where each element should be of one of the following types:
ru: ``list_filter`` - это список элементов, которые могу быть одного из следующих типов:

source: a field name, where the specified field should be either a ``BooleanField``, ``CharField``, ``DateField``, ``DateTimeField``, ``IntegerField``, ``ForeignKey`` or ``ManyToManyField``, for example::
ru: название поля следующего типа: ``BooleanField``, ``CharField``, ``DateField``, ``DateTimeField``, ``IntegerField``, ``ForeignKey`` или ``ManyToManyField``. Например::

source: Field names in ``list_filter`` can also span relations using the ``__`` lookup, for example::
ru: Поле в ``list_filter`` может указывать и на связанный объект используя ``__``, например::

source: a class inheriting from ``django.contrib.admin.SimpleListFilter``, which you need to provide the ``title`` and ``parameter_name`` attributes to and override the ``lookups`` and ``queryset`` methods, e.g.::
ru: подкласс ``django.contrib.admin.SimpleListFilter``, в котором необходимо определить атрибуты ``title`` и ``parameter_name`` и переопределить методы ``lookups`` и ``queryset``, например::

source: As a convenience, the ``HttpRequest`` object is passed to the ``lookups`` and ``queryset`` methods, for example::
ru: Для удобства объект ``HttpRequest`` передается в методы ``lookups`` и ``queryset``, например::

source: Also as a convenience, the ``ModelAdmin`` object is passed to the ``lookups`` method, for example if you want to base the lookups on the available data::
ru: Также объект ``ModelAdmin`` передается в метод ``lookups``. Например, вы можете использовать существующие данные при создании фильтра::

source: a tuple, where the first element is a field name and the second element is a class inheriting from ``django.contrib.admin.FieldListFilter``, for example::
ru: кортеж, где первый элемент название поля, а второй - подкласс ``django.contrib.admin.FieldListFilter``, например::

source: Assuming ``author`` is a ``ForeignKey`` to a ``User`` model, this will limit the ``list_filter`` choices to the users who have written a book instead of listing all users.
ru: Предположим ``author`` это ``ForeignKey`` к модели ``User``, это ограничит выбор в ``list_filter`` пользователями, которые написали книгу, вместо всех пользователей.

source: The ``FieldListFilter`` API is considered internal and might be changed.
ru: API ``FieldListFilter`` считается внутренним и может быть изменено.

source: It is possible to specify a custom template for rendering a list filter::
ru: Вы можете указать собственный шаблон для отображения фильтра::

source: Set ``list_max_show_all`` to control how many items can appear on a "Show all" admin change list page. The admin will display a "Show all" link on the change list only if the total result count is less than or equal to this setting. By default, this is set to ``200``.
ru: Используйте ``list_max_show_all``, чтобы указать количество объектов на странице списка объектов при выборе "Показать все". Интерфейс администратора покажет ссылку "Показать все" только если общее количество объектов меньше или равно этому значению. По умолчанию равно ``200``.

source: Set ``list_per_page`` to control how many items appear on each paginated admin change list page. By default, this is set to ``100``.
ru: Используйте ``list_per_page``, чтобы определить количество объектов на одной странице при отображении списка объектов. По умолчанию равно ``100``.

source: Set ``list_select_related`` to tell Django to use :meth:`~django.db.models.query.QuerySet.select_related` in retrieving the list of objects on the admin change list page. This can save you a bunch of database queries.
ru: Используйте ``list_select_related``, чтобы указать Django использовать :meth:`~django.db.models.query.QuerySet.select_related` при выборе объектов для страницы отображения объектов. Это может сократить количество запросов на этой странице.

source: The value should be either a boolean, a list or a tuple. Default is ``False``.
ru: Значение должно быть булево, список или кортеж. По умолчанию равно ``False``.

source: When value is ``True``, ``select_related()`` will always be called. When value is set to ``False``, Django will look at ``list_display`` and call ``select_related()`` if any ``ForeignKey`` is present.
ru: При ``True``, ``select_related()`` всегда будет использоваться. При ``False``, Django найдет в ``list_display`` все ``ForeignKey`` и будет использовать их с ``select_related()``.

source: If you need more fine-grained control, use a tuple (or list) as value for ``list_select_related``. Empty tuple will prevent Django from calling ``select_related`` at all. Any other tuple will be passed directly to ``select_related`` as parameters. For example::
ru: Если вам нужен больший контроль, используйте список или кортеж для ``list_select_related``. Пустой кортеж укажет не использовать ``select_related``. Не пустой кортеж будет передан как параметр для ``select_related``. Например::

source: will call ``select_related('author', 'category')``.
ru: вызовет ``select_related('author', 'category')``.

source: If you need to specify a dynamic value based on the request, you can implement a :meth:`~ModelAdmin.get_list_select_related` method.
ru: Если вам необходимы динамические значения, которые зависят от текущего запроса, вы можете определить метод :meth:`~ModelAdmin.get_list_select_related`.

source: Set ``ordering`` to specify how lists of objects should be ordered in the Django admin views. This should be a list or tuple in the same format as a model's :attr:`~django.db.models.Options.ordering` parameter.
ru: ``ordering`` позволяет определить сортировку на странице списка объектов. Это должен быть список или кортеж в формате аналогичном параметру :attr:`~django.db.models.Options.ordering`.

source: If this isn't provided, the Django admin will use the model's default ordering.
ru: Если атрибут не указана, Django будет использовать сортировку по умолчанию модели.

source: If you need to specify a dynamic order (for example depending on user or language) you can implement a :meth:`~ModelAdmin.get_ordering` method.
ru: Если вам необходима динамическая сортировка (например, в зависимости от пользователя или текущего языка) вы можете определить метод :meth:`~ModelAdmin.get_ordering`.

source: The paginator class to be used for pagination. By default, :class:`django.core.paginator.Paginator` is used. If the custom paginator class doesn't have the same constructor interface as :class:`django.core.paginator.Paginator`, you will also need to provide an implementation for :meth:`ModelAdmin.get_paginator`.
ru: Класс, используемый для создания постраничного отображения. По умолчанию используется :class:`django.core.paginator.Paginator`. Если конструктор вашего класса принимает параметры отличные от :class:`django.core.paginator.Paginator`, вам необходимо также переопределить метод :meth:`ModelAdmin.get_paginator`.

source: Set ``prepopulated_fields`` to a dictionary mapping field names to the fields it should prepopulate from::
ru: ``prepopulated_fields`` позволяет определить поля, которые получают значение основываясь на значениях других полей::

source: When set, the given fields will use a bit of JavaScript to populate from the fields assigned. The main use for this functionality is to automatically generate the value for ``SlugField`` fields from one or more other fields. The generated value is produced by concatenating the values of the source fields, and then by transforming that result into a valid slug (e.g. substituting dashes for spaces).
ru: Указанные поля будут использовать код JavaScript для заполнения поля значением на основе значений полей-источников. Основное применение - это генерировать значение для полей ``SlugField`` из значений другого поля или полей. Процесс генерирования состоит в объединении значений полей-источников и преобразованию результата в правильный "slug" (например, заменой пробелов на дефисы).

source: The admin now preserves filters on the list view after creating, editing or deleting an object. You can restore the previous behavior of clearing filters by setting this attribute to ``False``.
ru: Интерфейс администратора сохраняет состояние фильтров после создания, редактирования и удаления объектов. Чтобы отключить это поведение, используйте ``False``.

source: By default, Django's admin uses a select-box interface (<select>) for fields that are ``ForeignKey`` or have ``choices`` set. If a field is present in ``radio_fields``, Django will use a radio-button interface instead. Assuming ``group`` is a ``ForeignKey`` on the ``Person`` model::
ru: По умолчанию Django использует <select> для полей ``ForeignKey`` или тех, которые содержат ``choices``. Ели поле указанно в ``radio_fields``, Django будет использовать радио кнопки. Предположим что ``group`` поле ``ForeignKey`` в модели ``Person``::

source: You have the choice of using ``HORIZONTAL`` or ``VERTICAL`` from the ``django.contrib.admin`` module.
ru: Вы можете использовать ``HORIZONTAL`` или ``VERTICAL`` из модуля ``django.contrib.admin``.

source: Don't include a field in ``radio_fields`` unless it's a ``ForeignKey`` or has ``choices`` set.
ru: Не добавляйте в ``radio_fields`` поля, которые не являются ``ForeignKey`` или не содержат ``choices``.

source: By default, Django's admin uses a select-box interface (<select>) for fields that are ``ForeignKey``. Sometimes you don't want to incur the overhead of having to select all the related instances to display in the drop-down.
ru: По умолчанию Django использует <select> для полей ``ForeignKey``. Если связанных объектов очень много, создание <select> может быть очень затратным процессом.

source: ``raw_id_fields`` is a list of fields you would like to change into an ``Input`` widget for either a ``ForeignKey`` or ``ManyToManyField``::
ru: ``raw_id_fields`` содержит список полей, которые будут использовать поле ``Input`` для ``ForeignKey`` или ``ManyToManyField``::

source: The ``raw_id_fields`` ``Input`` widget should contain a primary key if the field is a ``ForeignKey`` or a comma separated list of values if the field is a ``ManyToManyField``. The ``raw_id_fields`` widget shows a magnifying glass button next to the field which allows users to search for and select a value:
ru: Виджет поля для ``raw_id_fields`` будет содержать значение первичного ключа для ``ForeignKey`` или список ключей для ``ManyToManyField``. Возле поля есть кнопка поиска и выбора связанных объектов:

source: By default the admin shows all fields as editable. Any fields in this option (which should be a ``list`` or ``tuple``) will display its data as-is and non-editable; they are also excluded from the :class:`~django.forms.ModelForm` used for creating and editing. Note that when specifying :attr:`ModelAdmin.fields` or :attr:`ModelAdmin.fieldsets` the read-only fields must be present to be shown (they are ignored otherwise).
ru: По умолчанию интерфейс администратора отображает все поля как редактируемые. Поля указанные в этой настройке (которая является ``list`` или ``tuple``) будут отображаться значение без возможности редактировать, они также будут исключены из :class:`~django.forms.ModelForm` используемой для создания и редактирования объектов. Однако, если вы определяете аргумент :attr:`ModelAdmin.fields` или :attr:`ModelAdmin.fieldsets` поля для чтения должны быть в них указаны (иначе они будут проигнорированы).

source: If ``readonly_fields`` is used without defining explicit ordering through :attr:`ModelAdmin.fields` or :attr:`ModelAdmin.fieldsets` they will be added last after all editable fields.
ru: Если ``readonly_fields`` используется без определения порядка полей через атрибуты :attr:`ModelAdmin.fields` или :attr:`ModelAdmin.fieldsets`, поля из этой настройки будут отображаться после редактируемых полей.

source: A read-only field can not only display data from a model's field, it can also display the output of a model's method or a method of the ``ModelAdmin`` class itself. This is very similar to the way :attr:`ModelAdmin.list_display` behaves. This provides an easy way to use the admin interface to provide feedback on the status of the objects being edited, for example::
ru: Read-only поле может показывать данные не только поля модели, но и метода, а также метода определенного в подклассе ``ModelAdmin``. Работает как :attr:`ModelAdmin.list_display`. Это позволяет отображать различную информацию о редактируемом объекте, например::

source: By default, ``save_as`` is set to ``False``.
ru: По умолчанию ``save_as`` равен ``False``.

source: Set ``save_on_top`` to add save buttons across the top of your admin change forms.
ru: Укажите ``save_on_top``, чтобы добавить кнопки сохранения в верхней части страницы редактирования объекта.

source: Normally, the save buttons appear only at the bottom of the forms. If you set ``save_on_top``, the buttons will appear both on the top and the bottom.
ru: По умолчанию кнопки сохранения отображаются под формой. Если указать ``save_on_top``, кнопки будут отображаться и сверху и снизу.

source: By default, ``save_on_top`` is set to ``False``.
ru: По умолчанию ``save_on_top`` равен ``False``.

source: Set ``search_fields`` to enable a search box on the admin change list page. This should be set to a list of field names that will be searched whenever somebody submits a search query in that text box.
ru: ``search_fields`` позволяет добавить поиск на страницу списка объектов. Этот атрибут должен содержать список полей, которые будут использоваться при поиске.

source: These fields should be some kind of text field, such as ``CharField`` or ``TextField``. You can also perform a related lookup on a ``ForeignKey`` or ``ManyToManyField`` with the lookup API "follow" notation::
ru: Эти поля должны быть текстовыми, таким как ``CharField`` или ``TextField``. Вы можете указать поля из связанных объектов используя ``__``::
