Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/ref/contrib/admin/index.po
Languages: ru

source: Like the ``formfield_for_foreignkey`` and ``formfield_for_manytomany`` methods, the ``formfield_for_choice_field`` method can be overridden to change the default formfield for a field that has declared choices. For example, if the choices available to a superuser should be different than those available to regular staff, you could proceed as follows::
ru: Как и методы ``formfield_for_foreignkey`` и ``formfield_for_manytomany``, ``formfield_for_choice_field`` позволяет переопределить поле формы для поля модели, которое содержит ``choices``. Например, если главному администратору необходимо отображать варианты значений отличные от вариантов ответов для остальных пользователей::

source: Any ``choices`` attribute set on the formfield will be limited to the form field only. If the corresponding field on the model has choices set, the choices provided to the form must be a valid subset of those choices, otherwise the form submission will fail with a :exc:`~django.core.exceptions.ValidationError` when the model itself is validated before saving.
ru: Атрибут ``choices``, указанный в поле форме, влияет только на проверку поля формы. Если соответствующее поле модели содержит ``choices``, ``choices`` в поле формы должен быть его подмножеством, иначе вы получите :exc:`~django.core.exceptions.ValidationError` при проверке модели.

source: Returns the ``Changelist`` class to be used for listing. By default, ``django.contrib.admin.views.main.ChangeList`` is used. By inheriting this class you can change the behavior of the listing.
ru: Возвращает класс ``Changelist``, который используется для отображения списка объекта. По умолчанию, используется ``django.contrib.admin.views.main.ChangeList``. Унаследовав этот класс вы можете переопределить поведение этой страницы.

source: Returns a :class:`~django.forms.ModelForm` class for use in the ``Formset`` on the changelist page. To use a custom form, for example::
ru: Возвращает подкласс :class:`~django.forms.ModelForm` для ``Formset``, который будет использоваться на странице списка объектов. Например::

source: If you define the ``Meta.model`` attribute on a :class:`~django.forms.ModelForm`, you must also define the ``Meta.fields`` attribute (or the ``Meta.exclude`` attribute). However, ``ModelAdmin`` ignores this value, overriding it with the :attr:`ModelAdmin.list_editable` attribute. The easiest solution is to omit the ``Meta.model`` attribute, since ``ModelAdmin`` will provide the correct model to use.
ru: ``Meta.model``

source: Returns a :ref:`ModelFormSet <model-formsets>` class for use on the changelist page if :attr:`~ModelAdmin.list_editable` is used. To use a custom formset, for example::
ru: Возвращает :ref:`ModelFormSet <model-formsets>`, который будет использоваться на странице списка объектов, если включен :attr:`~ModelAdmin.list_editable`. Например::

source: Should return ``True`` if adding an object is permitted, ``False`` otherwise.
ru: Должен возвращать ``True``, если пользователю позволено добавлять новый объект, иначе ``False``.

source: Should return ``True`` if displaying the module on the admin index page and accessing the module's index page is permitted, ``False`` otherwise. Uses :meth:`User.has_module_perms() <django.contrib.auth.models.User.has_module_perms>` by default. Overriding it does not restrict access to the add, change or delete views, :meth:`~ModelAdmin.has_add_permission`, :meth:`~ModelAdmin.has_change_permission`, and :meth:`~ModelAdmin.has_delete_permission` should be used for that.
ru: Должен возвращать ``True``, если модуль можно показывать на главной странице и у пользователя есть доступ к главной странице модуля, иначе ``False``. По умолчанию использует :meth:`User.has_module_perms() <django.contrib.auth.models.User.has_module_perms>`. Не ограничивает доступ к представлениям добавления, изменения и удаления, для этого используются методы :meth:`~ModelAdmin.has_add_permission`, :meth:`~ModelAdmin.has_change_permission` и :meth:`~ModelAdmin.has_delete_permission`.

source: The ``get_queryset`` method on a ``ModelAdmin`` returns a :class:`~django.db.models.query.QuerySet` of all model instances that can be edited by the admin site. One use case for overriding this method is to show objects owned by the logged-in user::
ru: Метод ``get_queryset`` возвращает :class:`~django.db.models.query.QuerySet` всех объектов модели, которые можно редактировать в интерфейсе администратора. Этот метод можно использовать для отображения объектов принадлежащих текущему пользователю::

source: Sends a message to the user using the :mod:`django.contrib.messages` backend. See the :ref:`custom ModelAdmin example <custom-admin-action>`.
ru: Отправляет сообщение пользователю используя :mod:`django.contrib.messages`. Смотрите :ref:`пример переопределения ModelAdmin <custom-admin-action>`.

source: Keyword arguments allow you to change the message level, add extra CSS tags, or fail silently if the ``contrib.messages`` framework is not installed. These keyword arguments match those for :func:`django.contrib.messages.add_message`, see that function's documentation for more details. One difference is that the level may be passed as a string label in addition to integer/constant.
ru: Аргументы позволят изменить тип сообщения, добавить дополнительные CSS теги, или указать игнорировать ошибку, если ``contrib.messages`` не установлен. Эти аргументы совпадают с аргументами :func:`django.contrib.messages.add_message`. Единственное отличие - тип сообщения можно указать строкой, а не только числом или константой.

source: Returns an instance of the paginator to use for this view. By default, instantiates an instance of :attr:`paginator`.
ru: Возвращает объект для постраничного отображения. По умолчанию возвращает объект :attr:`paginator`.

source: Determines the :class:`~django.http.HttpResponse` for the :meth:`add_view` stage.
ru: Указывает :class:`~django.http.HttpResponse` для :meth:`add_view`.

source: ``response_add`` is called after the admin form is submitted and just after the object and all the related instances have been created and saved. You can override it to change the default behavior after the object has been created.
ru: ``response_add`` вызывается поле отправки формы и после сохранения объекта и всех связанных объектов. Вы можете переопределить этот метод, чтобы изменить работу админки после создания объекта.

source: Determines the :class:`~django.http.HttpResponse` for the :meth:`change_view` stage.
ru: Создает :class:`~django.http.HttpResponse` для :meth:`change_view`.

source: ``response_change`` is called after the admin form is submitted and just after the object and all the related instances have been saved. You can override it to change the default behavior after the object has been changed.
ru: ``response_change`` вызывается после отправки формы, сохранения объекта и всех связанных объектов. Вы можете переопределить это метод, чтобы добавить дополнительную логику, выполняемую после изменения объекта.

source: Determines the :class:`~django.http.HttpResponse` for the :meth:`delete_view` stage.
ru: Создает :class:`~django.http.HttpResponse` для :meth:`delete_view`.

source: ``response_delete`` is called after the object has been deleted. You can override it to change the default behavior after the object has been deleted.
ru: ``response_delete`` вызывается после удаления объекта. Вы можете переопределить это метод, чтобы добавить дополнительную логику, выполняемую после удаления объекта.

source: ``obj_display`` is a string with the name of the deleted object.
ru: ``obj_display`` - строка с названием удаленного объекта.

source: ``obj_id`` is the serialized identifier used to retrieve the object to be deleted.
ru: ``obj_id`` -- сериализированный идентификатор, который использовался для получения удаленного объекта.

source: A hook for the initial data on admin change forms. By default, fields are given initial values from ``GET`` parameters. For instance, ``?name=initial_value`` will set the ``name`` field's initial value to be ``initial_value``.
ru: Позволяет добавить начальные данные для формы изменения объекта. По умолчанию используются параметры из ``GET``. Например, ``?name=initial_value`` для поля ``name`` установит начальное значение в ``initial_value``.

source: This method should return a dictionary in the form ``{'fieldname': 'fieldval'}``::
ru: Этот метод должен вернуть словарь вида ``{'fieldname': 'fieldval'}``::

source: Other methods
ru: Остальные методы

source: Django view for the model instance addition page. See note below.
ru: Представление Django для страницы добавления объекта модели. Смотрите описание ниже.

source: Django view for the model instances change list/actions page. See note below.
ru: Представление Django для страницы отображения всех объектов модели. Смотрите описание ниже.

source: Django view for the model instance(s) deletion confirmation page. See note below.
ru: Представление Django для страницы подтверждения удаления объектов. Смотрите описание ниже.

source: Django view for the page that shows the modification history for a given model instance.
ru: Представление Django для страницы истории изменений объекта модели.

source: Unlike the hook-type ``ModelAdmin`` methods detailed in the previous section, these five methods are in reality designed to be invoked as Django views from the admin application URL dispatching handler to render the pages that deal with model instances CRUD operations. As a result, completely overriding these methods will significantly change the behavior of the admin application.
ru: В отличии от методов ``ModelAdmin`` описанных выше, которые позволяют изменять поведение интерфейса администратора, эти пять методов используются как представления Django для выполнения CRUD-операций над объектами модели. В результате, полностью переопределив эти методы можно радикально изменить интерфейс администратора.

source: One common reason for overriding these methods is to augment the context data that is provided to the template that renders the view. In the following example, the change view is overridden so that the rendered template is provided some extra mapping data that would not otherwise be available::
ru: Одна из причин переопределить эти методы -- добавить данные в контекст шаблона. В этом примере представление для изменения объекта добавляет дополнительные данные в контекст, чтобы отобразить их в шаблоне::

source: These views return :class:`~django.template.response.TemplateResponse` instances which allow you to easily customize the response data before rendering. For more details, see the :doc:`TemplateResponse documentation </ref/template-response>`.
ru: Эти представления возвращают объект :class:`~django.template.response.TemplateResponse`, что позволяет легко изменить данные ответа перед выполнением шаблона. Подробности смотрите в :doc:`разделе о TemplateResponse </ref/template-response>`.

source: ``ModelAdmin`` asset definitions
ru: Добавление статических файлов в ``ModelAdmin``

source: There are times where you would like add a bit of CSS and/or JavaScript to the add/change views. This can be accomplished by using a ``Media`` inner class on your ``ModelAdmin``::
ru: В некоторых ситуациях вам может понадобиться добавить CSS и/или JavaScript файлы в представления добавления или изменения объектов. Вы можете выполнить это добавив класс ``Media`` в ``ModelAdmin``::

source: The :doc:`staticfiles app </ref/contrib/staticfiles>` prepends :setting:`STATIC_URL` (or :setting:`MEDIA_URL` if :setting:`STATIC_URL` is ``None``) to any asset paths. The same rules apply as :ref:`regular asset definitions on forms <form-asset-paths>`.
ru: :doc:`Приложение staticfiles </ref/contrib/staticfiles>` добавляет :setting:`STATIC_URL` (или :setting:`MEDIA_URL` если :setting:`STATIC_URL` равно ``None``) к указанным путям. Это же правильно применяется и к :ref:`определению статических файлов для форм <form-asset-paths>`.

source: Django admin JavaScript makes use of the `jQuery`_ library.
ru: Javascript интерфейса администратора использует библиотеку `jQuery`_.

source: The :class:`ModelAdmin` class requires jQuery by default, so there is no need to add jQuery to your ``ModelAdmin``’s list of media resources unless you have a specific need. For example, if you require the jQuery library to be in the global namespace (for example when using third-party jQuery plugins) or if you need a newer version of jQuery, you will have to include your own copy.
ru: Класс :class:`ModelAdmin` использует jQuery по умолчанию, так что вам не нужно добавлять jQuery в список media-файлов ``ModelAdmin``. Если вам необходима библиотека jQuery в глобальном пространстве имен, например при использовании плагинов jQuery, или более новая версия jQuery, вам необходимо добавить собственную копию jQuery.

source: Django provides both uncompressed and 'minified' versions of jQuery, as ``jquery.js`` and ``jquery.min.js`` respectively.
ru: Django содержит сжатую и 'minified' версию jQuery, как ``jquery.js`` и ``jquery.min.js`` соответственно.

source: :class:`ModelAdmin` and :class:`InlineModelAdmin` have a ``media`` property that returns a list of ``Media`` objects which store paths to the JavaScript files for the forms and/or formsets. If :setting:`DEBUG` is ``True`` it will return the uncompressed versions of the various JavaScript files, including ``jquery.js``; if not, it will return the 'minified' versions.
ru: :class:`ModelAdmin` и :class:`InlineModelAdmin` содержат свойство ``media``, которое возвращает список объектов ``Media``, которые содержат путь к JavaScript файлам для форм и наборов форм. Если :setting:`DEBUG` равна ``True``, будет использована несжатая версия ``jquery.js``, иначе сжатая версия.

source: Adding custom validation to the admin
ru: Дополнительная проверка данных в интерфейсе администратора

source: Adding custom validation of data in the admin is quite easy. The automatic admin interface reuses :mod:`django.forms`, and the ``ModelAdmin`` class gives you the ability define your own form::
ru: Добавить дополнительную проверку данных в интерфейсе администратора очень легко. Интерфейс администратора использует :mod:`django.forms`, и класс ``ModelAdmin`` позволяет указать вашу собственную форму::

source: ``MyArticleAdminForm`` can be defined anywhere as long as you import where needed. Now within your form you can add your own custom validation for any field::
ru: Вы можете определить форму ``MyArticleAdminForm`` где угодно, просто импортируйте ее. В собственной форме вы можете добавить дополнительную проверку данных для любого поля::

source: It is important you use a ``ModelForm`` here otherwise things can break. See the :doc:`forms </ref/forms/index>` documentation on :doc:`custom validation </ref/forms/validation>` and, more specifically, the :ref:`model form validation notes <overriding-modelform-clean-method>` for more information.
ru: Важно использовать ``ModelForm``, чтобы избежать проблем и ошибок. Подробности смотрите в документации о :doc:`формах </ref/forms/index>` раздел про :doc:`проверку полей </ref/forms/validation>` и, особенно, раздел о :ref:`переопределении метода clean() в ModelForm <overriding-modelform-clean-method>`.

source: ``InlineModelAdmin`` objects
ru: Объект ``InlineModelAdmin``

source: The admin interface has the ability to edit models on the same page as a parent model. These are called inlines. Suppose you have these two models::
ru: Интерфейс администратора позволяет редактировать связанные объекты на одной странице с родительским объектом. Это называется "inlines". Например, у нас есть две модели::

source: You can edit the books authored by an author on the author page. You add inlines to a model by specifying them in a ``ModelAdmin.inlines``::
ru: Вы можете редактировать книги автора на странице редактирования автора. Вы добавляете "inlines" к модели добавив их в ``ModelAdmin.inlines``::

source: Django provides two subclasses of ``InlineModelAdmin`` and they are:
ru: Django предоставляет два подкласса ``InlineModelAdmin``:

source: The difference between these two is merely the template used to render them.
ru: Разница между ними только в используемом шаблоне.

source: ``InlineModelAdmin`` options
ru: Параметры ``InlineModelAdmin``

source: ``InlineModelAdmin`` shares many of the same features as ``ModelAdmin``, and adds some of its own (the shared features are actually defined in the ``BaseModelAdmin`` superclass). The shared features are:
ru: ``InlineModelAdmin`` содержит некоторые возможности ``ModelAdmin`` и собственные. Общие методы и атрибуты определены в классе ``BaseModelAdmin``, вот они:

source: The ``InlineModelAdmin`` class adds:
ru: Параметры класса ``InlineModelAdmin``:

source: The model which the inline is using. This is required.
ru: Модель используемая в "inline". Обязательный параметр.

source: The name of the foreign key on the model. In most cases this will be dealt with automatically, but ``fk_name`` must be specified explicitly if there are more than one foreign key to the same parent model.
ru: Название внешнего ключа модели. В большинстве случаев он определяется автоматически, но вы должны указать ``fk_name``, если модель содержит несколько внешних ключей к родительской модели.

source: This defaults to :class:`~django.forms.models.BaseInlineFormSet`. Using your own formset can give you many possibilities of customization. Inlines are built around :ref:`model formsets <model-formsets>`.
ru: По умолчанию -- :class:`~django.forms.models.BaseInlineFormSet`. Использование собственного класса предоставляет большие возможности для переопределения поведения по умолчанию. Смотрите раздел о :ref:`наборах модельных форм <model-formsets>`.

source: The value for ``form`` defaults to ``ModelForm``. This is what is passed through to :func:`~django.forms.models.inlineformset_factory` when creating the formset for this inline.
ru: Значение ``form`` по умолчанию -- ``ModelForm``. Это значение передается в :func:`~django.forms.models.inlineformset_factory` при создании набора форм.

source: When writing custom validation for ``InlineModelAdmin`` forms, be cautious of writing validation that relies on features of the parent model. If the parent model fails to validate, it may be left in an inconsistent state as described in the warning in :ref:`validation-on-modelform`.
ru: При добавлении собственной валидации в форму ``InlineModelAdmin``, учитывайте состояние родительской модели. Если родительская форма не пройдет валидацию, она может содержать не консистентные данные. Смотрите предупреждение в :ref:`validation-on-modelform`.

source: This controls the number of extra forms the formset will display in addition to the initial forms. See the :doc:`formsets documentation </topics/forms/formsets>` for more information.
ru: Указывает количество пустых форм для добавления объектов в наборе форм. Подробности смотрите в :doc:`разделе о наборе форм </topics/forms/formsets>`.

source: For users with JavaScript-enabled browsers, an "Add another" link is provided to enable any number of additional inlines to be added in addition to those provided as a result of the ``extra`` argument.
ru: Если JavaScript включен в браузере, ссылка "Add another" позволит добавить новую пустую форму в дополнение к формам указанным параметром ``extra``.

source: The dynamic link will not appear if the number of currently displayed forms exceeds ``max_num``, or if the user does not have JavaScript enabled.
ru: Ссылка не появится если количество отображаемых форм превышает значение в параметре ``max_num``, или если у пользователя отключен JavaScript.

source: :meth:`InlineModelAdmin.get_extra` also allows you to customize the number of extra forms.
ru: :meth:`InlineModelAdmin.get_extra` позволяет указать количество дополнительных форм.

source: This controls the maximum number of forms to show in the inline. This doesn't directly correlate to the number of objects, but can if the value is small enough. See :ref:`model-formsets-max-num` for more information.
ru: Указывает максимальное количество форм. Этот параметр не определяет количество связанных объектов. Подробности смотрите в разделе :ref:`model-formsets-max-num`.

source: :meth:`InlineModelAdmin.get_max_num` also allows you to customize the maximum number of extra forms.
ru: :meth:`InlineModelAdmin.get_max_num` позволяет указать максимальное количество дополнительных форм.

source: This controls the minimum number of forms to show in the inline. See :func:`~django.forms.models.modelformset_factory` for more information.
ru: Указывает минимальное количество отображаемых форм. Смотрите :func:`~django.forms.models.modelformset_factory`.

source: :meth:`InlineModelAdmin.get_min_num` also allows you to customize the minimum number of displayed forms.
ru: :meth:`InlineModelAdmin.get_min_num` позволяет указать минимальное количество отображаемых форм.

source: The template used to render the inline on the page.
ru: Шаблон для отображения.

source: An override to the ``verbose_name`` found in the model's inner ``Meta`` class.
ru: Позволяет переопределить значение ``verbose_name`` класса ``Meta`` модели.

source: An override to the ``verbose_name_plural`` found in the model's inner ``Meta`` class.
ru: Позволяет переопределить значение ``verbose_name_plural`` класса ``Meta`` модели.

source: Specifies whether or not inline objects can be deleted in the inline. Defaults to ``True``.
ru: Определяет можно ли удалять связанные объекты. По умолчанию равно ``True``.

source: Specifies whether or not inline objects that can be changed in the admin have a link to the change form. Defaults to ``False``.
ru: Определяет показывать ли ссылку на форму изменения для связанных объектов, которые можно изменять. По умолчанию равно ``False``.

source: Returns a :class:`~django.forms.models.BaseInlineFormSet` class for use in admin add/change views. See the example for :class:`ModelAdmin.get_formsets_with_inlines`.
ru: Возвращает :class:`~django.forms.models.BaseInlineFormSet`, который будет использоваться на странице создания/редактирования. Смотрите :class:`ModelAdmin.get_formsets_with_inlines`.

source: Returns the number of extra inline forms to use. By default, returns the :attr:`InlineModelAdmin.extra` attribute.
ru: Возвращает количество форм. По умолчанию возвращает значение атрибута :attr:`InlineModelAdmin.extra`.

source: Override this method to programmatically determine the number of extra inline forms. For example, this may be based on the model instance (passed as the keyword argument ``obj``)::
ru: Вы можете переопределить метод и добавить логику для определения количества форм. Например, учитывать данные объекта модели(передается как именованный аргумент ``obj``)::

source: Returns the maximum number of extra inline forms to use. By default, returns the :attr:`InlineModelAdmin.max_num` attribute.
ru: Возвращает максимальное количество дополнительных форм. По умолчанию возвращает значение атрибута :attr:`InlineModelAdmin.max_num`.

source: Override this method to programmatically determine the maximum number of inline forms. For example, this may be based on the model instance (passed as the keyword argument ``obj``)::
ru: Вы можете переопределить метод и добавить логику для определения максимального количества форм. Например, учитывать данные объекта модели(передается как именованный аргумент ``obj``)::

source: Returns the minimum number of inline forms to use. By default, returns the :attr:`InlineModelAdmin.min_num` attribute.
ru: Возвращает минимальное количество дополнительных форм. По умолчанию возвращает значение атрибута :attr:`InlineModelAdmin.min_num`.
