Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/releases/1.4.po
Languages: ru

source: Then, in the template, any number of arguments may be passed to the template tag. For example:
ru: Тогда в шаблоне любое число аргументов может быть передано в тег:

source: No wrapping of exceptions in ``TEMPLATE_DEBUG`` mode
ru: Обёртывание исключений в режиме ``TEMPLATE_DEBUG``

source: ``truncatechars`` template filter
ru: Фильтр шаблона ``truncatechars``

source: This new filter truncates a string to be no longer than the specified number of characters. Truncated strings end with a translatable ellipsis sequence ("..."). See the documentation for :tfilter:`truncatechars` for more details.
ru: Новый фильтр урезает строку до определённого количества символов. Обрезанная строка заканчивается последовательностью "...". Подробнее в документации по :tfilter:`truncatechars`.

source: ``static`` template tag
ru: Тег шаблона ``static``

source: ``CachedStaticFilesStorage`` storage backend
ru: Поддержка бэкенда ``CachedStaticFilesStorage``

source: The :mod:`staticfiles<django.contrib.staticfiles>` contrib app now has a :class:`~django.contrib.staticfiles.storage.CachedStaticFilesStorage` backend that caches the files it saves (when running the :djadmin:`collectstatic` management command) by appending the MD5 hash of the file's content to the filename. For example, the file ``css/styles.css`` would also be saved as ``css/styles.55e7cbb9ba48.css``
ru: В модуль :mod:`staticfiles<django.contrib.staticfiles>` добавлен класс бэкенда :class:`~django.contrib.staticfiles.storage.CachedStaticFilesStorage`, который кэширует файлы при сохранении (при запуске команды :djadmin:`collectstatic`), добавляя MD5 к имени файла. Например, файл ``css/styles.css`` будет сохранён как ``css/styles.55e7cbb9ba48.css``.

source: See the :class:`~django.contrib.staticfiles.storage.CachedStaticFilesStorage` docs for more information.
ru: Подробнее описано здесь :class:`~django.contrib.staticfiles.storage.CachedStaticFilesStorage`.

source: Simple clickjacking protection
ru: Простая защита от кликджекинга

source: CSRF improvements
ru: Улучшение CSRF

source: Error report filtering
ru: Фильтрации отчётов об ошибках

source: We added two function decorators, :func:`~django.views.decorators.debug.sensitive_variables` and :func:`~django.views.decorators.debug.sensitive_post_parameters`, to allow designating the local variables and POST parameters that may contain sensitive information and should be filtered out of error reports.
ru: Мы добавили два декоратора функций (:func:`~django.views.decorators.debug.sensitive_variables` и :func:`~django.views.decorators.debug.sensitive_post_parameters`) для обработки переменных и POST-параметров с целью исключения какой-либо персонализированной информации из отчётов об ошибках.

source: All POST parameters are now systematically filtered out of error reports for certain views (``login``, ``password_reset_confirm``, ``password_change`` and ``add_view`` in :mod:`django.contrib.auth.views`, as well as ``user_change_password`` in the admin app) to prevent the leaking of sensitive information such as user passwords.
ru: Все POST-параметры теперь постоянно фильтруют вывод отчёта для определённых представлений (``login``, ``password_reset_confirm``, ``password_change`` и ``add_view`` в модуле :mod:`django.contrib.auth.views`, известном также как ``user_change_password`` в админке) для предотвращения утечки информации, например, паролей.

source: You can override or customize the default filtering by writing a :ref:`custom filter<custom-error-reports>`. For more information see the docs on :ref:`Filtering error reports<filtering-error-reports>`.
ru: Вы можете перекрыть поведение по умолчанию, написав свой фильтр :ref:`custom filter<custom-error-reports>`. Подробнее можно прочитать в :ref:`Filtering error reports<filtering-error-reports>`.

source: Extended IPv6 support
ru: Расширена поддержка IPv6

source: Django 1.4 can now better handle IPv6 addresses with the new :class:`~django.db.models.GenericIPAddressField` model field, :class:`~django.forms.GenericIPAddressField` form field and the validators :data:`~django.core.validators.validate_ipv46_address` and :data:`~django.core.validators.validate_ipv6_address`.
ru: В Django 1.4 улучшена поддержка IPv6 с помощью нового класса поля модели :class:`~django.db.models.GenericIPAddressField`, поля формы :class:`~django.forms.GenericIPAddressField` и валидаторов :data:`~django.core.validators.validate_ipv46_address` и :data:`~django.core.validators.validate_ipv6_address`.

source: HTML comparisons in tests
ru: Сравнение HTML в тестах

source: The base classes in :mod:`django.test` now have some helpers to compare HTML without tripping over irrelevant differences in whitespace, argument quoting/ordering and closing of self-closing tags. You can either compare HTML directly with the new :meth:`~django.test.SimpleTestCase.assertHTMLEqual` and :meth:`~django.test.SimpleTestCase.assertHTMLNotEqual` assertions, or use the ``html=True`` flag with :meth:`~django.test.SimpleTestCase.assertContains` and :meth:`~django.test.SimpleTestCase.assertNotContains` to test whether the client's response contains a given HTML fragment. See the :ref:`assertions documentation <assertions>` for more.
ru: В базовый класс тестов :mod:`django.test` добавлены хелперы для нестрого сравнения HTML, исключающие несовпадение пробелов, кавычки аргументов, их порядок. Вы можете сравнить непосредственно два HTML-документа через новые методы :meth:`~django.test.SimpleTestCase.assertHTMLEqual` и :meth:`~django.test.SimpleTestCase.assertHTMLNotEqual` или использовать флаг ``html=True`` в методе :meth:`~django.test.SimpleTestCase.assertContains` и :meth:`~django.test.SimpleTestCase.assertNotContains` для проверки что же отдаётся клиенту. Смотрите документацию по :ref:`assertions documentation <assertions>`.

source: Two new date format strings
ru: Два новых формата даты

source: ``e`` -- the name of the timezone of the given datetime object
ru: ``e`` -- название временной зоны у объекта даты/времени

source: ``o`` -- the ISO 8601 year number
ru: ``o`` -- номер года по ISO 8601

source: Please make sure to update your :ref:`custom format files <custom-format-files>` if they contain either ``e`` or ``o`` in a format string. For example a Spanish localization format previously only escaped the ``d`` format character::
ru: Если вы используете ``e`` или ``o``, обновитесь согласно :ref:`custom format files <custom-format-files>`. Например, для локализации на испанский экранируйте аналогично ``d``::

source: But now it needs to also escape ``e`` and ``o``::
ru: Теперь же нужно экранировать и ``e`` с ``o``::

source: For more information, see the :tfilter:`date` documentation.
ru: Подробнее можно посмотреть в документации к :tfilter:`date`.

source: Minor features
ru: Минорные изменения

source: Django 1.4 also includes several smaller improvements worth noting:
ru: Django 1.4 включает в себя также несколько небольших изменений:

source: A more usable stacktrace in the technical 500 page. Frames in the stack trace that reference Django's framework code are dimmed out, while frames in application code are slightly emphasized. This change makes it easier to scan a stacktrace for issues in application code.
ru: Улучшенная техническая страница ошибки 500. Фреймы стека, которые относятся к коду Django, затемнены, а код приложения подсвечен. Это облегчит разбор ошибок приложения.

source: :doc:`Tablespace support </topics/db/tablespaces>` in PostgreSQL.
ru: :doc:`Tablespace support </topics/db/tablespaces>` в PostgreSQL.

source: Customizable names for :meth:`~django.template.Library.simple_tag`.
ru: Настраиваемые имена для :meth:`~django.template.Library.simple_tag`.

source: In the documentation, a helpful :doc:`security overview </topics/security>` page.
ru: Посмотрите раздел :doc:`security overview </topics/security>` в документации.

source: The ``django.contrib.auth.models.check_password`` function has been moved to the :mod:`django.contrib.auth.hashers` module. Importing it from the old location will still work, but you should update your imports.
ru: Функция ``django.contrib.auth.models.check_password`` перемещена в модуль :mod:`django.contrib.auth.hashers`. Старый импорт всё ещё работает, но рекомендуется его обновить.

source: The :djadmin:`collectstatic` management command now has a ``--clear`` option to delete all files at the destination before copying or linking the static files.
ru: Команда :djadmin:`collectstatic` обзавелась опцией ``--clear``, при указании которой перед копированием все старые файлы будут удалены.

source: It's now possible to load fixtures containing forward references when using MySQL with the InnoDB database engine.
ru: Стало возможным использовать для MySQL/InnoDB фикстуры со сложными зависимостями.

source: A new 403 response handler has been added as ``'django.views.defaults.permission_denied'``. You can set your own handler by setting the value of :data:`django.conf.urls.handler403`. See the documentation about :ref:`the 403 (HTTP Forbidden) view<http_forbidden_view>` for more information.
ru: Новый обработчик ошибки 403 добавлен как ``'django.views.defaults.permission_denied'``. Вы можете указать свой обработчик в :data:`django.conf.urls.handler403`. Подробнее можно посмотреть в документации по :ref:`the 403 (HTTP Forbidden) view<http_forbidden_view>`.

source: The :djadmin:`makemessages` command uses a new and more accurate lexer, `JsLex`_, for extracting translatable strings from JavaScript files.
ru: Команда :djadmin:`makemessages` использует новый более точный лексер `JsLex`_ для получения строк для локализации из файлов JavaScript.

source: The :ttag:`trans` template tag now takes an optional ``as`` argument to be able to retrieve a translation string without displaying it but setting a template context variable instead.
ru: Тег шаблонизатора :ttag:`trans` теперь принимает опциональный аргумент ``as``, чтобы получить строку перевода без её отображения, а вместо этого настроить какую-либо контекстную переменную.

source: The :ttag:`if` template tag now supports ``{% elif %}`` clauses.
ru: Тег шаблонизатора :ttag:`if` теперь поддерживает ``{% elif %}``.

source: If your Django app is behind a proxy, you might find the new :setting:`SECURE_PROXY_SSL_HEADER` setting useful. It solves the problem of your proxy "eating" the fact that a request came in via HTTPS. But only use this setting if you know what you're doing.
ru: Если вы используете Django за прокси, то вам может пригодиться новая настройка :setting:`SECURE_PROXY_SSL_HEADER`. Она решает проблему, когда прокси отбрасывает тот факт, что запрос пришёл через HTTPS. Используёте её только когда точно понимаете, что вы делаете.

source: A new, plain-text, version of the HTTP 500 status code internal error page served when :setting:`DEBUG` is ``True`` is now sent to the client when Django detects that the request has originated in JavaScript code. (:meth:`~django.http.HttpRequest.is_ajax` is used for this.)
ru: Новая, текстовая, версия HTTP ошибки 500, которая показывается при :setting:`DEBUG` равным ``True``, теперь отсылает код JavaScript, в том случае, если Django узнает, что ошибка произошла в AJAX-запросе (метод :meth:`~django.http.HttpRequest.is_ajax`).

source: Like its HTML counterpart, it contains a collection of different pieces of information about the state of the application.
ru: Как и в случае HTML, там будет содержаться ряд полезной информации о состоянии приложения.

source: This should make it easier to read when debugging interaction with client-side JavaScript.
ru: Это должно помочь при отладке взаимодействия клиентского JavaScript и серверной части.

source: Changed the ``locmem`` cache backend to use ``pickle.HIGHEST_PROTOCOL`` for better compatibility with the other cache backends.
ru: Вместо бэкенда кэша ``locmem`` следует использовать ``pickle.HIGHEST_PROTOCOL`` для лучшей совместимости с остальными кэширующими бэкендами.

source: Added support in the ORM for generating ``SELECT`` queries containing ``DISTINCT ON``.
ru: В ORM добавлена поддержка ``DISTINCT ON`` для запросов ``SELECT``.

source: The ``distinct()`` ``QuerySet`` method now accepts an optional list of model field names. If specified, then the ``DISTINCT`` statement is limited to these fields. This is only supported in PostgreSQL.
ru: Метод ``distinct()`` у ``QuerySet`` теперь может опционально принимать список полей модели. Если он указан, то выражение ``DISTINCT`` действует только на эти поля. Поддерживается пока только в PostgreSQL.

source: For more details, see the documentation for :meth:`~django.db.models.query.QuerySet.distinct`.
ru: Подробнее в документации :meth:`~django.db.models.query.QuerySet.distinct`.

source: The admin login page will add a password reset link if you include a URL with the name `'admin_password_reset'` in your urls.py, so plugging in the built-in password reset mechanism and making it available is now much easier. For details, see :ref:`auth_password_reset`.
ru: В страницу входа в админку добавлена ссылка на восстановление пароля, если в urls.py добавлена `'admin_password_reset'`. Теперь подключить встроенный механизм сброса пароля стало ещё проще. За подробностями обратитесь к :ref:`auth_password_reset`.

source: The MySQL database backend can now make use of the savepoint feature implemented by MySQL version 5.0.3 or newer with the InnoDB storage engine.
ru: В поддержку MySQL добавлена функциональность по работе с точками сохранения, которые были реализованы в версии 5.0.3 для движка InnoDB.

source: It's now possible to pass initial values to the model forms that are part of both model formsets and inline model formsets as returned from factory functions ``modelformset_factory`` and ``inlineformset_factory`` respectively just like with regular formsets. However, initial values only apply to extra forms, i.e. those which are not bound to an existing model instance.
ru: Стало возможным передавать начальные значение в форму модели, которая представляет из себя набор форм, построенных с помощью ``modelformset_factory`` или ``inlineformset_factory``. Тем не менее, начальные значения применяются только к дополнительным формам, то есть те, которые не связаны с существующего экземпляра модели.

source: The sitemaps framework can now handle HTTPS links using the new :attr:`Sitemap.protocol <django.contrib.sitemaps.Sitemap.protocol>` class attribute.
ru: В поддержку карты сайта добавлена возможность работы с HTTPS-ссылками, которая реализована с помощью атрибута :attr:`Sitemap.protocol <django.contrib.sitemaps.Sitemap.protocol>`.

source: A new :class:`django.test.SimpleTestCase` subclass of :class:`unittest.TestCase` that's lighter than :class:`django.test.TestCase` and company. It can be useful in tests that don't need to hit a database. See :ref:`testcase_hierarchy_diagram`.
ru: Новый класс :class:`django.test.SimpleTestCase`, потомок :class:`unittest.TestCase`, который легче, чем :class:`django.test.TestCase` и прочие. Его следует применять, когда не требуется подключение к БД, подробнее в :ref:`testcase_hierarchy_diagram`.

source: Backwards incompatible changes in 1.4
ru: Обратная несовместимость в 1.4

source: SECRET_KEY setting is required
ru: SECRET_KEY теперь обязателен

source: Running Django with an empty or known :setting:`SECRET_KEY` disables many of Django's security protections and can lead to remote-code-execution vulnerabilities. No Django site should ever be run without a :setting:`SECRET_KEY`.
ru: Работа сайта с пустой или известной злоумышленнику настройкой :setting:`SECRET_KEY` сразу нивелирует многие средства защиты вплоть до выполнения чужого кода. Ни один сайт на Django не должен запускаться без этой настройки.

source: In Django 1.4, starting Django with an empty :setting:`SECRET_KEY` will raise a `DeprecationWarning`. In Django 1.5, it will raise an exception and Django will refuse to start. This is slightly accelerated from the usual deprecation path due to the severity of the consequences of running Django with no :setting:`SECRET_KEY`.
ru: В Django 1.4 запуск сайта без :setting:`SECRET_KEY` вызовет `DeprecationWarning`. В Django 1.5 будет исключение, что приведёт к отказу выполнения. Этот ускоренный путь устаревания поведения был выбран из-за серьёзности последствий при работе без :setting:`SECRET_KEY`.

source: The included administration app ``django.contrib.admin`` has for a long time shipped with a default set of static files such as JavaScript, images and stylesheets. Django 1.3 added a new contrib app ``django.contrib.staticfiles`` to handle such files in a generic way and defined conventions for static files included in apps.
ru: Включаемое по умолчанию приложение ``django.contrib.admin`` долгое время поставлялось с набором статики: JavaScript, CSS, картинки... В Django 1.3 Добавлено новое приложение ``django.contrib.staticfiles`` для обработки этих файлов в общем виде и определения соглашений для всех включённых приложений.

source: Starting in Django 1.4, the admin's static files also follow this convention, to make the files easier to deploy. In previous versions of Django, it was also common to define an ``ADMIN_MEDIA_PREFIX`` setting to point to the URL where the admin's static files live on a Web server. This setting has now been deprecated and replaced by the more general setting :setting:`STATIC_URL`. Django will now expect to find the admin static files under the URL ``<STATIC_URL>/admin/``.
ru: Начиная с Django 1.4, файлы статики для админки следуют этому соглашению, что должно упростить развертывание проекта. В предыдущей версии была добавлена настройка ``ADMIN_MEDIA_PREFIX``, которая указывала на местоположение этих файлов. На данный момент она считается устаревшей и заменена на более общую :setting:`STATIC_URL`. Django будет искать файлы для админки по адресу ``<STATIC_URL>/admin/``.

source: If you've previously used a URL path for ``ADMIN_MEDIA_PREFIX`` (e.g. ``/media/``) simply make sure :setting:`STATIC_URL` and :setting:`STATIC_ROOT` are configured and your Web server serves those files correctly. The development server continues to serve the admin files just like before. Read the :doc:`static files howto </howto/static-files/index>` for more details.
ru: Если у вас используется ``ADMIN_MEDIA_PREFIX`` (например, ``/media/``) убедитесь, что настройки :setting:`STATIC_URL` и :setting:`STATIC_ROOT` заданы верно. Встроенный веб-сервер продолжает работать также, как и раньше. Подробности можно подсмотреть здесь :doc:`static files howto </howto/static-files/index>`.

source: If your ``ADMIN_MEDIA_PREFIX`` is set to an specific domain (e.g. ``http://media.example.com/admin/``), make sure to also set your :setting:`STATIC_URL` setting to the correct URL -- for example, ``http://media.example.com/``.
ru: Если ``ADMIN_MEDIA_PREFIX`` указывает на какой-либо домен (например, ``http://media.example.com/admin/``), убедитесь, что в :setting:`STATIC_URL` правильный путь -- например, ``http://media.example.com/``.

source: If you're implicitly relying on the path of the admin static files within Django's source code, you'll need to update that path. The files were moved from :file:`django/contrib/admin/media/` to :file:`django/contrib/admin/static/admin/`.
ru: Если вы использовали знание внутреннего расположения файлов статики для админки, то вам нужно обновить пути: эти объекты были перемещены из :file:`django/contrib/admin/media/` в :file:`django/contrib/admin/static/admin/`.

source: Supported browsers for the admin
ru: Поддерживаемые браузеры для админки

source: Django hasn't had a clear policy on which browsers are supported by the admin app. Our new policy formalizes existing practices: `YUI's A-grade`_ browsers should provide a fully-functional admin experience, with the notable exception of Internet Explorer 6, which is no longer supported.
ru: Django не следует какой-либо чёткой политике поддержки браузеров в админке. На практике же это сводится к следующему: браузеры из `YUI's A-grade`_ должны поддерживаться полностью, за исключением IE 6, который снят с поддержки.

source: Released over 10 years ago, IE6 imposes many limitations on modern Web development. The practical implications of this policy are that contributors are free to improve the admin without consideration for these limitations.
ru: IE 6, выпущенный более 10 лет назад, накладывает значительные ограничения на веб-разработку. Если их отбросить, то развивать Django становится гораздо легче.

source: Obviously, this new policy **has no impact** on sites you develop using Django. It only applies to the Django admin. Feel free to develop apps compatible with any range of browsers.
ru: Эта решение относится только к панели администратора, так что вы можете сами определять какие браузеры должен поддерживать ваш сайт.

source: Removed admin icons
ru: Иконки для админки

source: As part of an effort to improve the performance and usability of the admin's change-list sorting interface and :attr:`horizontal <django.contrib.admin.ModelAdmin.filter_horizontal>` and :attr:`vertical <django.contrib.admin.ModelAdmin.filter_vertical>` "filter" widgets, some icon files were removed and grouped into two sprite files.
ru: В рамках улучшения быстродействия и юзабилити админки иконки виджетов для фильтров :attr:`horizontal <django.contrib.admin.ModelAdmin.filter_horizontal>` и :attr:`vertical <django.contrib.admin.ModelAdmin.filter_vertical>` были перемещены и сгруппированы в два файла класса.

source: Specifically: ``selector-add.gif``, ``selector-addall.gif``, ``selector-remove.gif``, ``selector-removeall.gif``, ``selector_stacked-add.gif`` and ``selector_stacked-remove.gif`` were combined into ``selector-icons.gif``; and ``arrow-up.gif`` and ``arrow-down.gif`` were combined into ``sorting-icons.gif``.
ru: А именно: ``selector-add.gif``, ``selector-addall.gif``, ``selector-remove.gif``, ``selector-removeall.gif``, ``selector_stacked-add.gif`` и ``selector_stacked-remove.gif`` слиты в ``selector-icons.gif``; ``arrow-up.gif`` и ``arrow-down.gif`` в ``sorting-icons.gif``.

source: If you used those icons to customize the admin, then you'll need to replace them with your own icons or get the files from a previous release.
ru: Если вы использовали эти файлы для модификации админки, вам нужно заменить их своими или взять из предыдущей версии.

source: CSS class names in admin forms
ru: Имена классов CSS в панели администратора

source: To avoid conflicts with other common CSS class names (e.g. "button"), we added a prefix ("field-") to all CSS class names automatically generated from the form field names in the main admin forms, stacked inline forms and tabular inline cells. You'll need to take that prefix into account in your custom style sheets or JavaScript files if you previously used plain field names as selectors for custom styles or JavaScript transformations.
ru: Дабы избежать конфликтов с остальными именами классов CSS (например, "button"), мы добавили префикс ("field-") ко всем иенам классов, которые генерируются автоматически из имён полей формы, встраиваемых форм и ячеек таблиц. Адаптируйте ваши таблицы стилей и JavaScript код для учёта этого факта.

source: Compatibility with old signed data
ru: Совместимость с ранее подписанными данными

source: Django 1.3 changed the cryptographic signing mechanisms used in a number of places in Django. While Django 1.3 kept fallbacks that would accept hashes produced by the previous methods, these fallbacks are removed in Django 1.4.
ru: В Django 1.3 изменился механизм криптографической подписи данных, который использовался в ряде мест. Для обеспечения совместимости Django 1.3 поддерживал оба метода - и старый, и новый, однако в Django 1.4 обратная совместимость удалена.
