Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/releases/1.4.po
Languages: ru

source: So, if you upgrade to Django 1.4 directly from 1.2 or earlier, you may lose/invalidate certain pieces of data that have been cryptographically signed using an old method. To avoid this, use Django 1.3 first for a period of time to allow the signed data to expire naturally. The affected parts are detailed below, with 1) the consequences of ignoring this advice and 2) the amount of time you need to run Django 1.3 for the data to expire or become irrelevant.
ru: Так что, если вы обновляетесь до 1.4 с версии 1.2 или меньшей, вы можете потерять некоторые части данных, которые были подписаны с помощью старого криптографического метода. В данном случае рекомендуется какое-то время использовать Django 1.3, чтобы срок хранения подписанных данных истёк, и они бы шифровались новым алгоритмом. Подверженные этой проблеме данные описаны ниже, где 1) последствия при игнорировании рекомендации 2) время, необходимое для новой подписи данных.

source: ``contrib.sessions`` data integrity check
ru: проверка целостности данных в ``contrib.sessions``

source: Consequences: The user will be logged out, and session data will be lost.
ru: Последствия: Пользователь будет разлогинен, и данные сессии потеряются.

source: Time period: Defined by :setting:`SESSION_COOKIE_AGE`.
ru: Срок перевалидации: Определён в :setting:`SESSION_COOKIE_AGE`.

source: ``contrib.auth`` password reset hash
ru: Хеш восстановления пароля в ``contrib.auth``

source: Consequences: Password reset links from before the upgrade will not work.
ru: Последствия: Старые ссылки для восстановления пароля перестанут работать.

source: Time period: Defined by :setting:`PASSWORD_RESET_TIMEOUT_DAYS`.
ru: Срок перевалидации: Определён в :setting:`PASSWORD_RESET_TIMEOUT_DAYS`.

source: Form-related hashes: these have a are much shorter lifetime and are relevant only for the short window where a user might fill in a form generated by the pre-upgrade Django instance and try to submit it to the upgraded Django instance:
ru: Хеши для форм: они имеют очень короткое время жизни. Так что это актуально только когда пользователь заполняет форму, сгенерированную Django до обновления, а отправляет уже в обновлённую версию:

source: ``contrib.comments`` form security hash
ru: Хеш безопасности ``contrib.comments``

source: Consequences: The user will see the validation error "Security hash failed."
ru: Последствия: Пользователь увидит ошибку валидации "Security hash failed."

source: Time period: The amount of time you expect users to take filling out comment forms.
ru: Срок перевалидации: Всё время, пока пользователь пишет комментарий.

source: ``FormWizard`` security hash
ru: Хеш безопасности ``FormWizard``

source: Time period: The amount of time you expect users to take filling out the affected forms.
ru: Срок перевалидации: Всё время, пока пользователь заполняет форму.

source: CSRF check
ru: Проверка CSRF

source: Note: This is actually a Django 1.1 fallback, not Django 1.2, and it applies only if you're upgrading from 1.1.
ru: Замечание: Это актуально для совместимости с Django 1.1 (не Django 1.2), и имеет значение только при обновлении с версии 1.1.

source: Consequences: The user will see a 403 error with any CSRF-protected POST form.
ru: Последствия: Пользователь увидит ошибку 403 с сообщением о том, что сработала CSRF-защита.

source: Time period: The amount of time you expect user to take filling out such forms.
ru: Срок перевалидации: Всё время, пока пользователь заполняет форму.

source: ``contrib.auth`` user password hash-upgrade sequence
ru: Обновление паролей пользователей через ``contrib.auth``

source: Consequences: Each user's password will be updated to a stronger password hash when it's written to the database in 1.4. This means that if you upgrade to 1.4 and then need to downgrade to 1.3, version 1.3 won't be able to read the updated passwords.
ru: Последствия: При записи в БД пароль пользователя будет обновлён с помощью нового криптостойкого алгоритма. Так что если вы обновитесь до 1.4, а потом откатитесь на 1.3, некоторые пользователи не смогут войти.

source: Remedy: Set :setting:`PASSWORD_HASHERS` to use your original password hashing when you initially upgrade to 1.4. After you confirm your app works well with Django 1.4 and you won't have to roll back to 1.3, enable the new password hashes.
ru: Лекарство: Установите :setting:`PASSWORD_HASHERS`

source: Starting in 1.4, the :class:`~django.contrib.flatpages.middleware.FlatpageFallbackMiddleware` only adds a trailing slash and redirects if the resulting URL refers to an existing flatpage. For example, requesting ``/notaflatpageoravalidurl`` in a previous version would redirect to ``/notaflatpageoravalidurl/``, which would subsequently raise a 404. Requesting ``/notaflatpageoravalidurl`` now will immediately raise a 404.
ru: Начиная с версии 1.4 класс :class:`~django.contrib.flatpages.middleware.FlatpageFallbackMiddleware` только добавляет конечный слэш и перенаправляет на получившийся URL, если такая страница есть в приложении. Например, при запросе ``/notaflatpageoravalidurl`` в предыдущей версии шло перенаправление на ``/notaflatpageoravalidurl/``, что порождало исключение, теперь же уже ``/notaflatpageoravalidurl`` будет вызывать ошибку 404.

source: Also, redirects returned by flatpages are now permanent (with 301 status code), to match the behavior of :class:`~django.middleware.common.CommonMiddleware`.
ru: К тому же перенаправление таким образом считается перманентным (с кодом 301) в соответствии с поведением класса :class:`~django.middleware.common.CommonMiddleware`.

source: Serialization of :class:`~datetime.datetime` and :class:`~datetime.time`
ru: Сериализация :class:`~datetime.datetime` и :class:`~datetime.time`

source: As a consequence of time-zone support, and according to the ECMA-262 specification, we made changes to the JSON serializer:
ru: В следствии поддержки часовых поясов и согласно спецификации ECMA-262, мы внесли изменения в сериализатор JSON:

source: It includes the time zone for aware datetime objects. It raises an exception for aware time objects.
ru: Для datetime-объектов добавляется временная зона, в случае с time-объектами генерируется исключение.

source: It includes milliseconds for datetime and time objects. There is still some precision loss, because Python stores microseconds (6 digits) and JSON only supports milliseconds (3 digits). However, it's better than discarding microseconds entirely.
ru: Для datetime- и time-объектов добавлена поддержка миллисекунд. Немного теряется точность, потому что Python хранит микросекунды (6 знаков), а JSON миллисекунды (3 знака). Однако, это всё равно лучше, чем простое их игнорирование в предыдущих версиях.

source: We changed the XML serializer to use the ISO8601 format for datetimes. The letter ``T`` is used to separate the date part from the time part, instead of a space. Time zone information is included in the ``[+-]HH:MM`` format.
ru: Мы добавили в XML-сериализатор поддержку формата ISO8601 для даты со временем. Для разделения части даты от части времени используется буква ``T`` вместо пробела. Информация по временной зоне включает в себя формат ``[+-]HH:MM``.

source: Though the serializers now use these new formats when creating fixtures, they can still load fixtures that use the old format.
ru: Хотя сериализаторы теперь используют новые форматы при создании фикстур, они все еще могут загрузить фикстуры, созданные ранее.

source: ``supports_timezone`` changed to ``False`` for SQLite
ru: Для SQLite ``supports_timezone`` установлен в ``False``

source: The database feature ``supports_timezone`` used to be ``True`` for SQLite. Indeed, if you saved an aware datetime object, SQLite stored a string that included an UTC offset. However, this offset was ignored when loading the value back from the database, which could corrupt the data.
ru: Для SQLite поддержка временных зон может быть включена, однако, если вы сохраняете datetime-объект, SQLite представляет его как строку с указанием UTC. При загрузке же из базы эта информация отбрасывается, что может привести к порче данных.

source: In the context of time-zone support, this flag was changed to ``False``, and datetimes are now stored without time-zone information in SQLite. When :setting:`USE_TZ` is ``False``, if you attempt to save an aware datetime object, Django raises an exception.
ru: В контексте поддержки временных зон этот флаг изменён на ``False``, и дата-время сохраняется без этой информации. Когда настройка :setting:`USE_TZ` установлена в ``False``, при попытке сохранения со сведениями UTC произойдёт исключение.

source: ``MySQLdb``-specific exceptions
ru: Специфические исключения ``MySQLdb``

source: The MySQL backend historically has raised ``MySQLdb.OperationalError`` when a query triggered an exception. We've fixed this bug, and we now raise :exc:`django.db.DatabaseError` instead. If you were testing for ``MySQLdb.OperationalError``, you'll need to update your ``except`` clauses.
ru: Исторически MySQL-бэкенд вызывал ``MySQLdb.OperationalError``, если в запросе происходило исключение. Мы исправили этот баг, теперь вызывается :exc:`django.db.DatabaseError`. Если у вас были завязки на ``MySQLdb.OperationalError``, адаптируйте блок ``except``.

source: Database connection's thread-locality
ru: Потокобезопасные соединения с БД

source: ``DatabaseWrapper`` objects (i.e. the connection objects referenced by ``django.db.connection`` and ``django.db.connections["some_alias"]``) used to be thread-local. They are now global objects in order to be potentially shared between multiple threads. While the individual connection objects are now global, the ``django.db.connections`` dictionary referencing those objects is still thread-local. Therefore if you just use the ORM or ``DatabaseWrapper.cursor()`` then the behavior is still the same as before. Note, however, that ``django.db.connection`` does not directly reference the default ``DatabaseWrapper`` object anymore and is now a proxy to access that object's attributes. If you need to access the actual ``DatabaseWrapper`` object, use ``django.db.connections[DEFAULT_DB_ALIAS]`` instead.
ru: Объекты ``DatabaseWrapper`` (включая соединения типа ``django.db.connection`` и ``django.db.connections["что_то_там"]``) потокобезопасны. Сейчас они представляют из себя глобальные объекты, дабы имелся доступ из разных потоков. В то время как собственно объекты соединений глобальны, словарь ``django.db.connections`` остаётся потокобезопасным. Однако, если вы используете ORM или ``DatabaseWrapper.cursor()``, то заметите некоторое изменение в поведении. Теперь ``django.db.connection`` не ссылается напрямую на ``DatabaseWrapper``, а использует прокси для доступа к атрибутам объекта. Если вам всё-таки нужен непосредственно текущий ``DatabaseWrapper``, используйте ``django.db.connections[DEFAULT_DB_ALIAS]``.

source: As part of this change, all underlying SQLite connections are now enabled for potential thread-sharing (by passing the ``check_same_thread=False`` attribute to pysqlite). ``DatabaseWrapper`` however preserves the previous behavior by disabling thread-sharing by default, so this does not affect any existing code that purely relies on the ORM or on ``DatabaseWrapper.cursor()``.
ru: Как часть изменений все основные соединения SQLite теперь могут быть потенциально доступны из других потоков (передав атрибут ``check_same_thread=False`` в pysqlite), однако ``DatabaseWrapper`` следует предыдущему поведению, где такой доступ запрещён. Это изменение не затронет тех пользователей, которые работали только с ORM или ``DatabaseWrapper.cursor()``.

source: Finally, while it's now possible to pass connections between threads, Django doesn't make any effort to synchronize access to the underlying backend. Concurrency behavior is defined by the underlying backend implementation. Check their documentation for details.
ru: Наконец, т.к. стало возможным передавать соединения между потоками, Django не предпринимает никаких усилий для организации синхронизации с основным бэкендом. Параллельное поведение определяется базовой реализацией бэкендов. Загляните в документацию для выяснения подробностей.

source: `COMMENTS_BANNED_USERS_GROUP` setting
ru: Настройка `COMMENTS_BANNED_USERS_GROUP`

source: If you rely on the feature and want to restore the old behavior, use a custom comment model manager to exclude the user group, like this::
ru: Если вам всё-таки нужно старое поведение, используйте свой менеджер моделей для исключения групп пользователей, например::

source: `IGNORABLE_404_STARTS` and `IGNORABLE_404_ENDS` settings
ru: Настройки `IGNORABLE_404_STARTS` и `IGNORABLE_404_ENDS`

source: Until Django 1.3, it was possible to exclude some URLs from Django's :doc:`404 error reporting</howto/error-reporting>` by adding prefixes to ``IGNORABLE_404_STARTS`` and suffixes to ``IGNORABLE_404_ENDS``.
ru: До Django 1.4 было возможным исключить из обработки некоторые URL (:doc:`404 error reporting</howto/error-reporting>`) путём добавления префикса в ``IGNORABLE_404_STARTS`` и суффикса в ``IGNORABLE_404_ENDS``.

source: In Django 1.4, these two settings are superseded by :setting:`IGNORABLE_404_URLS`, which is a list of compiled regular expressions. Django won't send an email for 404 errors on URLs that match any of them.
ru: Теперь же обе эти настройки переместились в :setting:`IGNORABLE_404_URLS`, в котором хранится список скомпилированных регулярных выражений. Django не будет генерировать ошибку 404 для любого из них.

source: Furthermore, the previous settings had some rather arbitrary default values::
ru: Однако, ``IGNORABLE_404_STARTS`` и ``IGNORABLE_404_ENDS`` имели настройки по умолчанию::

source: It's not Django's role to decide if your website has a legacy ``/cgi-bin/`` section or a ``favicon.ico``. As a consequence, the default values of :setting:`IGNORABLE_404_URLS`, ``IGNORABLE_404_STARTS``, and ``IGNORABLE_404_ENDS`` are all now empty.
ru: Django не будет определять остались ли у вас всякие ``/cgi-bin/`` или ``favicon.ico``.Теперь по умолчанию списки :setting:`IGNORABLE_404_URLS`, ``IGNORABLE_404_STARTS`` и ``IGNORABLE_404_ENDS`` пусты.

source: If you have customized ``IGNORABLE_404_STARTS`` or ``IGNORABLE_404_ENDS``, or if you want to keep the old default value, you should add the following lines in your settings file::
ru: Если вы настраивали ``IGNORABLE_404_STARTS`` или ``IGNORABLE_404_ENDS``, или если хотите сохранить старое поведение по умолчанию, добавьте в файл настроек следующие строки::

source: Don't forget to escape characters that have a special meaning in a regular expression, such as periods.
ru: Не забудьте экранировать символы, которые имеют специальное значение в регулярных выражениях.

source: CSRF protection extended to PUT and DELETE
ru: CSRF-защита распространена на запросы PUT и DELETE

source: If you're using PUT or DELETE methods in AJAX applications, please see the :ref:`instructions about using AJAX and CSRF <csrf-ajax>`.
ru: Если вы используете методы PUT или DELETE в AJAX-приложениях, изучите :ref:`instructions about using AJAX and CSRF <csrf-ajax>`.

source: Password reset view now accepts ``subject_template_name``
ru: Представление сброса пароля теперь принимает ``subject_template_name``

source: The ``password_reset`` view in ``django.contrib.auth`` now accepts a ``subject_template_name`` parameter, which is passed to the password save form as a keyword argument. If you are using this view with a custom password reset form, then you will need to ensure your form's ``save()`` method accepts this keyword argument.
ru: Представление ``password_reset`` в ``django.contrib.auth`` теперь принимает параметр ``subject_template_name``, который передаёт форму пароля как аргумент. Если вы используете это представление со своей формой сброса пароля, то убедитесь, что метод ``save()`` принимает этот аргумент.

source: This was an alias to ``django.template.loader`` since 2005, and we've removed it without emitting a warning due to the length of the deprecation. If your code still referenced this, please use ``django.template.loader`` instead.
ru: Начиная с 2005 года это была ссылка на ``django.template.loader``, и теперь мы наконец-то удалили её. Замените в коде ``django.core.template_loaders`` на ``django.template.loader``.

source: This functionality has been removed due to intractable performance and security issues. Any existing usage of ``verify_exists`` should be removed.
ru: Эта функциональность была удалена в следствии ошибок безопасности и падения производительности. Все вызовы ``verify_exists`` должны быть удалены.

source: The ``open`` method of the base Storage class used to take an obscure parameter ``mixin`` that allowed you to dynamically change the base classes of the returned file object. This has been removed. In the rare case you relied on the ``mixin`` parameter, you can easily achieve the same by overriding the ``open`` method, like this::
ru: Метод ``open`` базового класса Storage принимал непонятный параметр ``mixin``, который позволял динамически менять класс возвращаемого файлового объекта. Теперь он удалён. В тех редких случаях, когда он всё же использовался, вы можете адаптировать код, переопределив метод ``open``::

source: YAML deserializer now uses ``yaml.safe_load``
ru: Десериализатор YAML теперь использует ``yaml.safe_load``

source: ``yaml.load`` is able to construct any Python object, which may trigger arbitrary code execution if you process a YAML document that comes from an untrusted source. This feature isn't necessary for Django's YAML deserializer, whose primary use is to load fixtures consisting of simple objects. Even though fixtures are trusted data, the YAML deserializer now uses ``yaml.safe_load`` for additional security.
ru: ``yaml.load`` может построить любой объект Python, который может выполнить любой код из ненадёжного источника. Это функция не нужна непосредственно десериализатору YAML для Django, которой использует загрузку фикстур только примитивных объектов. Так что для обеспечения безопасности теперь используется ``yaml.safe_load``.

source: Session cookies now have the ``httponly`` flag by default
ru: По умолчанию сессионные куки имеют флаг ``httponly``

source: Session cookies now include the ``httponly`` attribute by default to help reduce the impact of potential XSS attacks. As a consequence of this change, session cookie data, including sessionid, is no longer accessible from JavaScript in many browsers. For strict backwards compatibility, use ``SESSION_COOKIE_HTTPONLY = False`` in your settings file.
ru: Сессионные куки теперь идут по умолчанию вместе с атрибутом ``httponly`` для избежания потенциальных XSS атак. Вследствие этого некоторые вещи (например, sessionid) более недоступны для JavaScript для большинства браузеров. Для совместимости вы можете вернуть старое поведение, указав в настройках ``SESSION_COOKIE_HTTPONLY = False``.

source: The :tfilter:`urlize` filter no longer escapes every URL
ru: Фильтр :tfilter:`urlize` более не экранирует каждый URL

source: When a URL contains a ``%xx`` sequence, where ``xx`` are two hexadecimal digits, :tfilter:`urlize` now assumes that the URL is already escaped and doesn't apply URL escaping again. This is wrong for URLs whose unquoted form contains a ``%xx`` sequence, but such URLs are very unlikely to happen in the wild, because they would confuse browsers too.
ru: Если URL содержит ``%xx``, где ``xx`` - числа, то :tfilter:`urlize` понимает, что этот URL уже экранирован и не пытается проделать это ещё раз. Такое поведение неверно для URL, которые содержат последовательность ``%xx``, но вряд ли они появятся в реальном окружении, к тому же браузеры не смогут правильно понять куда же им идти.

source: ``assertTemplateUsed`` and ``assertTemplateNotUsed`` as context manager
ru: ``assertTemplateUsed`` и ``assertTemplateNotUsed`` как менеджеры контекстов

source: It's now possible to check whether a template was used within a block of code with :meth:`~django.test.SimpleTestCase.assertTemplateUsed` and :meth:`~django.test.SimpleTestCase.assertTemplateNotUsed`. And they can be used as a context manager::
ru: Теперь стало возможным проверить используется ли шаблон в блоке кода с помощью методов :meth:`~django.test.SimpleTestCase.assertTemplateUsed` и :meth:`~django.test.SimpleTestCase.assertTemplateNotUsed`. Эти методы можно использовать как менеджеры контекстов::

source: See the :ref:`assertion documentation<assertions>` for more.
ru: Подробнее здесь :ref:`assertion documentation<assertions>`.

source: Database connections after running the test suite
ru: Соединения к БД после запуска тестов

source: The default test runner no longer restores the database connections after tests' execution. This prevents the production database from being exposed to potential threads that would still be running and attempting to create new connections.
ru: Исполнитель тестов более не восстанавливает соединение с БД после выполнения тестов. Это предотвращает боевую базу от потенциального воздействия потоков, которые будут висеть и порождать новые соединения.

source: If your code relied on connections to the production database being created after tests' execution, then you can restore the previous behavior by subclassing ``DjangoTestRunner`` and overriding its ``teardown_databases()`` method.
ru: Если в коде у вас были завязки на это, то вы можете восстановить прежнее поведение перекрыв метод ``teardown_databases()`` у ``DjangoTestRunner``.

source: Output of :djadmin:`manage.py help <help>`
ru: Вывод :djadmin:`manage.py help <help>`

source: :djadmin:`manage.py help <help>` now groups available commands by application. If you depended on the output of this command -- if you parsed it, for example -- then you'll need to update your code. To get a list of all available management commands in a script, use :djadmin:`manage.py help --commands <help>` instead.
ru: :djadmin:`manage.py help <help>` теперь группирует доступные команды по приложениям. Если вы зависели от этого вывода -- например, парсили его -- адаптируйте свой код. Получить список всех доступных команд можно с помощью :djadmin:`manage.py help --commands <help>`.

source: ``extends`` template tag
ru: Тег шаблона ``extends``

source: Previously, the :ttag:`extends` tag used a buggy method of parsing arguments, which could lead to it erroneously considering an argument as a string literal when it wasn't. It now uses ``parser.compile_filter``, like other tags.
ru: Ранее тег :ttag:`extends` использовал примитивный алгоритм разбора аргументов, ошибочно считая строкой то, что по сути не было ею. Теперь же ``parser.compile_filter`` работает также, как и остальные теги.

source: The internals of the tag aren't part of the official stable API, but in the interests of full disclosure, the ``ExtendsNode.__init__`` definition has changed, which may break any custom tags that use this class.
ru: Внутренности этого тега не были частью публичного API, но в интересах реализации ``ExtendsNode.__init__`` изменилось, что может сказаться на совместимости с тегами, основанными на этом классе.

source: Loading some incomplete fixtures no longer works
ru: Загрузка неполных фикстур более не поддерживается
