Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/releases/1.4.po
Languages: ru

source: Django 1.4 release notes
ru: О релизе Django 1.4

source: *March 23, 2012*
ru: *23 марта 2012*

source: Welcome to Django 1.4!
ru: Добро пожаловать в Django 1.4!

source: Overview
ru: Обзор

source: The biggest new feature in Django 1.4 is `support for time zones`_ when handling date/times. When enabled, this Django will store date/times in UTC, use timezone-aware objects internally, and translate them to users' local timezones for display.
ru: Самым важным изменением стало `support for time zones`_, которая учитывает разницу даты/времени. Если эта опция включена, то Django сохраняет дату/время в формате UTC и переводит его в часовой пояс пользователя для отображения.

source: Other notable new features in Django 1.4 include:
ru: Другие изменения в Django 1.4:

source: A number of ORM improvements, including `SELECT FOR UPDATE support`_, the ability to `bulk insert <#model-objects-bulk-create-in-the-orm>`_ large datasets for improved performance, and `QuerySet.prefetch_related`_, a method to batch-load related objects in areas where :meth:`~django.db.models.query.QuerySet.select_related` doesn't work.
ru: Ряд улучшений ORM, включая `SELECT FOR UPDATE support`_, который позволяет `bulk insert <#model-objects-bulk-create-in-the-orm>`_ большие объёмы данных без потери в производительности, и `QuerySet.prefetch_related`_ -- метод, позволяющий пакетно загрузить связанные объекты, когда :meth:`~django.db.models.query.QuerySet.select_related` не работает.

source: Some nice security additions, including `improved password hashing`_ (featuring PBKDF2_ and bcrypt_ support), new `tools for cryptographic signing`_, several `CSRF improvements`_, and `simple clickjacking protection`_.
ru: Улучшения безопасности, включая `improved password hashing`_ (поддержка PBKDF2_ и bcrypt_), новый `tools for cryptographic signing`_, некоторые `CSRF improvements`_ и `simple clickjacking protection`_.

source: An `updated default project layout and manage.py`_ that removes the "magic" from prior versions. And for those who don't like the new layout, you can use `custom project and app templates`_ instead!
ru: `updated default project layout and manage.py`_, который убирает магию предыдущих версий.

source: `Support for in-browser testing frameworks`_ (like Selenium_).
ru: `Support for in-browser testing frameworks`_ (например, Selenium_).

source: ... and a whole lot more; `see below <#what-s-new-in-django-1-4>`_!
ru: ... и кучу всего другого; `see below <#what-s-new-in-django-1-4>`_!

source: Python compatibility
ru: Совместимость версий Python

source: Django 1.4 has dropped support for Python 2.4. Python 2.5 is now the minimum required Python version. Django is tested and supported on Python 2.5, 2.6 and 2.7.
ru: Django 1.4 более не поддерживает Python 2.4. Теперь минимальной версией является Python 2.5. Этот релиз мы протестировали на Python 2.5, 2.6, 2.7.

source: This change should affect only a small number of Django users, as most operating-system vendors today are shipping Python 2.5 or newer as their default version. If you're still using Python 2.4, however, you'll need to stick to Django 1.3 until you can upgrade. Per :doc:`our support policy </internals/release-process>`, Django 1.3 will continue to receive security support until the release of Django 1.5.
ru: Это изменение должно затронуть лишь небольшое число пользователей, т.к. большинство ОС поставляется с Python 2.5 или чем-то поновее. Если у вас нет возможности уйти с Python 2.4, то лучше оставайтесь на 1.3. Согласно :doc:`our support policy </internals/release-process>` мы будем выпускать обновления безопасности вплоть до выпуска Django 1.5.

source: Django does not support Python 3.x at this time. At some point before the release of Django 1.4, we plan to publish a document outlining our full timeline for deprecating Python 2.x and moving to Python 3.x.
ru: Django пока ещё не поддерживает Python 3.x, но в скором времени мы планируем опубликовать документ с планом перехода на Python 3.x.

source: What's new in Django 1.4
ru: Что нового в Django 1.4

source: Support for time zones
ru: Поддержка часовых поясов.

source: In previous versions, Django used "naive" date/times (that is, date/times without an associated time zone), leaving it up to each developer to interpret what a given date/time "really means". This can cause all sorts of subtle timezone-related bugs.
ru: В предыдущих версиях Django использует "наивную" дату/время (без указания временной зоны), соответственно, каждый разработчик должен сам следить за тем, что же она означает по местному времени. Это провоцировало много ошибок.

source: In Django 1.4, you can now switch Django into a more correct, time-zone aware mode. In this mode, Django stores date and time information in UTC in the database, uses time-zone-aware datetime objects internally and translates them to the end user's time zone in templates and forms. Reasons for using this feature include:
ru: В Django 1.4 вы можете активировать поддержку временных зон. В этом случае дата будет записываться в базу данных в формате UTC, а используя time-zone-объекты перевод в тайм-зону пользователя будет происходить автоматически. Это может понадобиться в следующих случаях:

source: Customizing date and time display for users around the world.
ru: Настройка отображения даты и времени для пользователей по всему миру.

source: Storing datetimes in UTC for database portability and interoperability. (This argument doesn't apply to PostgreSQL, because it already stores timestamps with time zone information in Django 1.3.)
ru: Сохранение даты/времени в формате UTC обеспечивает совместимость и переносимость. Это не относится к PostgreSQL, потому что это уже реализовано в Django 1.3.

source: Avoiding data corruption problems around DST transitions.
ru: Позволяет избежать проблем с повреждением данных при переходе DST.

source: Time zone support is enabled by default in new projects created with :djadmin:`startproject`. If you want to use this feature in an existing project, read the :ref:`migration guide <time-zones-migration-guide>`. If you encounter problems, there's a helpful :ref:`FAQ <time-zones-faq>`.
ru: Поддержка временных зон включена по умолчанию для новых проектов, созданных с помощью :djadmin:`startproject`. Если вы хотите его включить в существующем проекте, обратитесь к :ref:`migration guide <time-zones-migration-guide>`. При возникновении проблем загляните в :ref:`FAQ <time-zones-faq>`.

source: Support for in-browser testing frameworks
ru: Поддержка фреймворков для тестирования в браузере

source: Django 1.4 supports integration with in-browser testing frameworks like Selenium_. The new :class:`django.test.LiveServerTestCase` base class lets you test the interactions between your site's front and back ends more comprehensively. See the :class:`documentation<django.test.LiveServerTestCase>` for more details and concrete examples.
ru: Django 1.4 поддерживает интеграцию с фреймворками для тестирования в браузере типа Selenium_. Новый класс :class:`django.test.LiveServerTestCase` позволяет тестировать взаимодействие клиентской и серверной части. Подробную информацию и примеры можно найти в :class:`documentation<django.test.LiveServerTestCase>`.

source: Updated default project layout and ``manage.py``
ru: Обновлён шаблон нового проекта и ``manage.py``

source: Django 1.4 ships with an updated default project layout and ``manage.py`` file for the :djadmin:`startproject` management command. These fix some issues with the previous ``manage.py`` handling of Python import paths that caused double imports, trouble moving from development to deployment, and other difficult-to-debug path issues.
ru: Django 1.4 поставляется с обновлённым шаблоном для нового приложения, который создаётся командой :djadmin:`startproject`. Он исправляет несколько ошибок, связанных с дублирующим импортом, трудностями развертывания и прочими сложными в отладке проблемами.

source: The previous ``manage.py`` called functions that are now deprecated, and thus projects upgrading to Django 1.4 should update their ``manage.py``. (The old-style ``manage.py`` will continue to work as before until Django 1.6. In 1.5 it will raise ``DeprecationWarning``).
ru: Предыдущий ``manage.py`` использовал функциональность, которая стала устаревшей, так что надо бы обновить и его в проекте. Но можно пока не торопиться - он будет работать до версии 1.6, правда, в 1.5 вам напомнят исключением ``DeprecationWarning``.

source: The new recommended ``manage.py`` file should look like this::
ru: Новый рекомендуемый ``manage.py`` должен выглядеть как-то так::

source: ``{{ project_name }}`` should be replaced with the Python package name of the actual project.
ru: где ``{{ project_name }}`` -- имя вашего приложения.

source: For instance, with the following layout::
ru: Например, как-то так::

source: You could import ``mysite.settings``, ``mysite.urls``, and ``mysite.myapp``, but not ``settings``, ``urls``, or ``myapp`` as top-level modules.
ru: Вы должны импортировать ``mysite.settings``, ``mysite.urls``, ``mysite.myapp``, а не ``settings``, ``urls``, ``myapp`` в виде модулей верхнего уровня.

source: Anything imported as a top-level module can be placed adjacent to the new ``manage.py``. For instance, to decouple "myapp" from the project module and import it as just ``myapp``, place it outside the ``mysite/`` directory::
ru: Всё, что импортируется как модуль верхнего уровня, может быть размещено рядом с новым ``manage.py``. Например, чтобы отделить "myapp" от проекта и импортировать его просто как ``myapp``, просто вынесите его из каталога ``mysite/``::

source: If the same code is imported inconsistently (some places with the project prefix, some places without it), the imports will need to be cleaned up when switching to the new ``manage.py``.
ru: Если же импорт идёт непоследовательно (где-то с префиксом проекта, где-то без), то его необходимо почистить при обновлении ``manage.py``.

source: Custom project and app templates
ru: Пользовательские проекты и шаблоны приложений

source: The :djadmin:`startapp` and :djadmin:`startproject` management commands now have a ``--template`` option for specifying a path or URL to a custom app or project template.
ru: Команды :djadmin:`startapp` и :djadmin:`startproject` теперь имеют опцию ``--template`` для указания пути или URL до пользовательского приложения или шаблона.

source: For example, Django will use the ``/path/to/my_project_template`` directory when you run the following command::
ru: Например, Django будет использовать каталог ``/path/to/my_project_template`` при выполнении следующего кода::

source: You can also now provide a destination directory as the second argument to both :djadmin:`startapp` and :djadmin:`startproject`::
ru: Вы также можете указать каталог назначения вторым аргументом к :djadmin:`startapp` и :djadmin:`startproject`::

source: For more information, see the :djadmin:`startapp` and :djadmin:`startproject` documentation.
ru: За подробностями обратитесь к :djadmin:`startapp` и :djadmin:`startproject`.

source: Improved WSGI support
ru: Улучшение поддержки WSGI

source: The :djadmin:`startproject` management command now adds a :file:`wsgi.py` module to the initial project layout, containing a simple WSGI application that can be used for :doc:`deploying with WSGI app servers</howto/deployment/wsgi/index>`.
ru: Команда :djadmin:`startproject` теперь добавляет в новый проект файл :file:`wsgi.py`, содержащий простое приложение WSGI, которое используется :doc:`deploying with WSGI app servers</howto/deployment/wsgi/index>`.

source: The :djadmin:`built-in development server<runserver>` now supports using an externally-defined WSGI callable, which makes it possible to run runserver with the same WSGI configuration that is used for deployment. The new :setting:`WSGI_APPLICATION` setting lets you configure which WSGI callable :djadmin:`runserver` uses.
ru: :djadmin:`built-in development server<runserver>` теперь поддерживает внешние определения вызовов WSGI, что даёт возможность запустить runserver с конфигурацией на боевом сервере. Новая настройка :setting:`WSGI_APPLICATION` определяет какие вызовы WSGI использует :djadmin:`runserver`.

source: ``SELECT FOR UPDATE`` support
ru: Поддержка ``SELECT FOR UPDATE``

source: Django 1.4 includes a :meth:`QuerySet.select_for_update() <django.db.models.query.QuerySet.select_for_update>` method, which generates a ``SELECT ... FOR UPDATE`` SQL query. This will lock rows until the end of the transaction, meaning other transactions cannot modify or delete rows matched by a ``FOR UPDATE`` query.
ru: В Django 1.4 есть метод :meth:`QuerySet.select_for_update() <django.db.models.query.QuerySet.select_for_update>`, который генерирует SQL запрос ``SELECT ... FOR UPDATE``. Это блокирует записи до окончания транзакции, так что остальные пользователи не смогут их изменить или удалить.

source: For more details, see the documentation for :meth:`~django.db.models.query.QuerySet.select_for_update`.
ru: За подробностями обратитесь к :meth:`~django.db.models.query.QuerySet.select_for_update`.

source: ``Model.objects.bulk_create`` in the ORM
ru: ``Model.objects.bulk_create`` в ORM

source: This method lets you create multiple objects more efficiently. It can result in significant performance increases if you have many objects.
ru: Этот метод позволяет создавать несколько объектов более эффективно. Это может привести к значительному увеличению производительности, если у вас много объектов.

source: Django makes use of this internally, meaning some operations (such as database setup for test suites) have seen a performance benefit as a result.
ru: Django внутри себя использует этот метод, например при загрузке данных для тестов, что даёт некоторый выигрыш в производительности.

source: See the :meth:`~django.db.models.query.QuerySet.bulk_create` docs for more information.
ru: Подробнее описано в :meth:`~django.db.models.query.QuerySet.bulk_create`.

source: Improved password hashing
ru: Улучшенное хеширование паролей

source: Django's auth system (``django.contrib.auth``) stores passwords using a one-way algorithm. Django 1.3 uses the SHA1_ algorithm, but increasing processor speeds and theoretical attacks have revealed that SHA1 isn't as secure as we'd like. Thus, Django 1.4 introduces a new password storage system: by default Django now uses the PBKDF2_ algorithm (as recommended by NIST_). You can also easily choose a different algorithm (including the popular bcrypt_ algorithm). For more details, see :ref:`auth_password_storage`.
ru: Система аутентификации Django (``django.contrib.auth``) хранит пароли с односторонним алгоритмом шифрования. Django 1.3 использует SHA1_, однако с ростом производительности компьютеров риск успешной атаки всё повышается. В Django 1.4 представлена новая система хранения паролей, основанная на алгоритме PBKDF2_ (рекомендован NIST_). Тем не менее вы можете указать свой, например, популярный bcrypt_. Для подробностей смотрите в :ref:`auth_password_storage`.

source: HTML5 doctype
ru: Поддержка HTML5

source: We've switched the admin and other bundled templates to use the HTML5 doctype. While Django will be careful to maintain compatibility with older browsers, this change means that you can use any HTML5 features you need in admin pages without having to lose HTML validity or override the provided templates to change the doctype.
ru: В админке и прочих стандартных шаблонах мы теперь используем тип документа HTML5. В то же время Django старается сохранить совместимость со старыми браузерами. Это изменение позволяет использовать возможности HTML5 без потери корректности HTML, а также указать самому тип документа.

source: List filters in admin interface
ru: Фильтрация списков в интерфейса администратора

source: Prior to Django 1.4, the :mod:`~django.contrib.admin` app let you specify change list filters by specifying a field lookup, but it didn't allow you to create custom filters. This has been rectified with a simple API (previously used internally and known as "FilterSpec"). For more details, see the documentation for :attr:`~django.contrib.admin.ModelAdmin.list_filter`.
ru: До Django 1.4 :mod:`~django.contrib.admin` позволяло указывать значения отдельных полей без возможности создания своих фильтров. Это было исправлено с помощью небольшого API (ранее использовался внутренний "FilterSpec"). Подробнее можно прочитать здесь :attr:`~django.contrib.admin.ModelAdmin.list_filter`.

source: Multiple sort in admin interface
ru: Множественная сортировка в интерфейсе администратора

source: The admin change list now supports sorting on multiple columns. It respects all elements of the :attr:`~django.contrib.admin.ModelAdmin.ordering` attribute, and sorting on multiple columns by clicking on headers is designed to mimic the behavior of desktop GUIs. We also added a :meth:`~django.contrib.admin.ModelAdmin.get_ordering` method for specifying the ordering dynamically (i.e., depending on the request).
ru: Теперь в админке можно указывать сортировку по нескольким столбцам. Учитываются все элементы, указанные в атрибуте :attr:`~django.contrib.admin.ModelAdmin.ordering`. Поведение взято из настольного GUI - достаточно кликнуть по заголовку столбца. Мы также добавили метод :meth:`~django.contrib.admin.ModelAdmin.get_ordering` для указания сортировки динамически, например, в зависимости от запроса.

source: New ``ModelAdmin`` methods
ru: Новые методы в ``ModelAdmin``

source: We added a :meth:`~django.contrib.admin.ModelAdmin.save_related` method to :mod:`~django.contrib.admin.ModelAdmin` to ease customization of how related objects are saved in the admin.
ru: Мы добавили метод :meth:`~django.contrib.admin.ModelAdmin.save_related` в модель :mod:`~django.contrib.admin.ModelAdmin` для возможности управления сохранением связанных объектов.

source: Two other new :class:`~django.contrib.admin.ModelAdmin` methods, :meth:`~django.contrib.admin.ModelAdmin.get_list_display` and :meth:`~django.contrib.admin.ModelAdmin.get_list_display_links` enable dynamic customization of fields and links displayed on the admin change list.
ru: Два других новых метода класса :class:`~django.contrib.admin.ModelAdmin` :meth:`~django.contrib.admin.ModelAdmin.get_list_display` и :meth:`~django.contrib.admin.ModelAdmin.get_list_display_links` включают динамическое управление полями и ссылками, которые будут показаны в таблицах админки.

source: Admin inlines respect user permissions
ru: Проверка прав в панели администратора

source: Admin inlines now only allow those actions for which the user has permission. For ``ManyToMany`` relationships with an auto-created intermediate model (which does not have its own permissions), the change permission for the related model determines if the user has the permission to add, change or delete relationships.
ru: В админке теперь доступны только те действия, на которые пользователь имеет разрешения. Для отношения ``ManyToMany``, когда создаётся модель, на которую пользователь не имеет явных прав, они определяются из прав на отношение.

source: Tools for cryptographic signing
ru: Инструменты для криптографических подписей

source: Django 1.4 adds both a low-level API for signing values and a high-level API for setting and reading signed cookies, one of the most common uses of signing in Web applications.
ru: Django 1.4 добавляет как низкоуровневые, так и высокоуровневые средства для работы с куками, которые являются одним из самых распространённых способов подписи веб-приложения.

source: See the :doc:`cryptographic signing </topics/signing>` docs for more information.
ru: Подробнее можно посмотреть здесь :doc:`cryptographic signing </topics/signing>`.

source: Cookie-based session backend
ru: Сессии на базе кук

source: Django 1.4 introduces a cookie-based session backend that uses the tools for :doc:`cryptographic signing </topics/signing>` to store the session data in the client's browser.
ru: Django 1.4 поддерживает сессии на базе кук, используя криптографическую подпись :doc:`cryptographic signing </topics/signing>` для хранения данных сессии в браузере клиента.

source: Session data is signed and validated by the server, but it's not encrypted. This means a user can view any data stored in the session but cannot change it. Please read the documentation for further clarification before using this backend.
ru: Данные сессии подписываются и проверяются сервером, но не шифруются. Это означает, что пользователь может их посмотреть, но не изменить. Пожалуйста, прочитайте документацию, прежде чем использовать эту возможность.

source: See the :ref:`cookie-based session backend <cookie-session-backend>` docs for more information.
ru: Подробнее можно посмотреть здесь :ref:`cookie-based session backend <cookie-session-backend>`.

source: New form wizard
ru: Новый FormWizard

source: Django 1.4 ships with a session-based storage backend and a cookie-based storage backend. The latter uses the tools for :doc:`cryptographic signing </topics/signing>` also introduced in Django 1.4 to store the wizard's state in the user's cookies.
ru: Django 1.4 поставляется с возможностью хранения информации пользователя в сессиях или куках. Последние имеют инструменты для :doc:`cryptographic signing </topics/signing>`, которые введены в Django 1.4 для хранения состояния помощника (wizard`а) в куках.

source: Translating URL patterns
ru: Трансляция шаблонов URL

source: Django can now look for a language prefix in the URLpattern when using the new :func:`~django.conf.urls.i18n.i18n_patterns` helper function. It's also now possible to define translatable URL patterns using :func:`~django.utils.translation.ugettext_lazy`. See :ref:`url-internationalization` for more information about the language prefix and how to internationalize URL patterns.
ru: С помощью функции хэлпера :func:`~django.conf.urls.i18n.i18n_patterns` Django теперь может учитывать языковой префикс в URL. Благодаря :func:`~django.utils.translation.ugettext_lazy` стало возможным определять URL для интернационализации. Смотри :ref:`url-internationalization` для информации об использовании языковых префиксов и интернационализации шаблонов URL.

source: Contextual translation support for ``{% trans %}`` and ``{% blocktrans %}``
ru: Поддержка контекстного перевода для ``{% trans %}`` и ``{% blocktrans %}``

source: The :ref:`contextual translation<contextual-markers>` support introduced in Django 1.3 via the ``pgettext`` function has been extended to the :ttag:`trans` and :ttag:`blocktrans` template tags using the new ``context`` keyword.
ru: Поддержка :ref:`contextual translation<contextual-markers>` была введена в Django 1.3 с помощью функции ``pgettext``, которая расширяла теги :ttag:`trans` и :ttag:`blocktrans` через ключевое слово ``context``.

source: Customizable ``SingleObjectMixin`` URLConf kwargs
ru: Настройка ``SingleObjectMixin`` URLConf kwargs

source: Two new attributes, :attr:`pk_url_kwarg<django.views.generic.detail.SingleObjectMixin.pk_url_kwarg>` and :attr:`slug_url_kwarg<django.views.generic.detail.SingleObjectMixin.slug_url_kwarg>`, have been added to :class:`~django.views.generic.detail.SingleObjectMixin` to enable the customization of URLconf keyword arguments used for single object generic views.
ru: Два новых атрибута :attr:`pk_url_kwarg<django.views.generic.detail.SingleObjectMixin.pk_url_kwarg>` и :attr:`slug_url_kwarg<django.views.generic.detail.SingleObjectMixin.slug_url_kwarg>` были добавлены в класс :class:`~django.views.generic.detail.SingleObjectMixin` для возможности настройки URLconf через единственный общий объект представления.

source: Assignment template tags
ru: Связывание тегов шаблонизатора

source: ``*args`` and ``**kwargs`` support for template tag helper functions
ru: Поддержка ``*args`` и ``**kwargs`` для хэлперов тегов
