Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/releases/1.4.po
Languages: ru

source: Prior to 1.4, a default value was inserted for fixture objects that were missing a specific date or datetime value when auto_now or auto_now_add was set for the field. This was something that should not have worked, and in 1.4 loading such incomplete fixtures will fail. Because fixtures are a raw import, they should explicitly specify all field values, regardless of field options on the model.
ru: До версии 1.4 для полей даты и времени в модели можно было указать значения auto_now и auto_now_add при загрузке фикстур. Это работало не всегда так, как хотелось, и в 1.4 было решено убрать такую возможность, потому что фикстуры загружались в "сыром" виде, вне зависимости от опций модели.

source: Development Server Multithreading
ru: Многопоточность встроенного сервера

source: Attributes disabled in markdown when safe mode set
ru: Отключены атрибуты в разметке при активации безопасного режима

source: Prior to Django 1.4, attributes were included in any markdown output regardless of safe mode setting of the filter. With version > 2.1 of the Python-Markdown library, an enable_attributes option was added. When the safe argument is passed to the markdown filter, both the ``safe_mode=True`` and ``enable_attributes=False`` options are set. If using a version of the Python-Markdown library less than 2.1, a warning is issued that the output is insecure.
ru: До Django 1.4 атрибуты были включены в вывод разметки вне зависимости от настроек безопасности фильтра. В версии 2.1 в библиотеку Python-Markdown была добавлена опция enable_attributes. При установке ``safe_mode=True`` и ``enable_attributes=False`` в фильтр будут передаваться безопасные аргументы. Использование версии Python-Markdown < 2.1, приведёт к предупреждению безопасности.

source: FormMixin get_initial returns an instance-specific dictionary
ru: get_initial у FormMixin возвращает изначальный словарь

source: In Django 1.3, the ``get_initial`` method of the :class:`django.views.generic.edit.FormMixin` class was returning the class ``initial`` dictionary. This has been fixed to return a copy of this dictionary, so form instances can modify their initial data without messing with the class variable.
ru: В Django 1.3 метод ``get_initial`` класса :class:`django.views.generic.edit.FormMixin` возвращал класс ``initial`` словаря. Мы решили возвращать копию словаря, так как экземпляры форм могли модифицировать исходные данные без изменения переменной класса.

source: Features deprecated in 1.4
ru: Устаревшая функциональность в 1.4

source: Old styles of calling ``cache_page`` decorator
ru: Старый стиль вызова декоратора ``cache_page``

source: Some legacy ways of calling :func:`~django.views.decorators.cache.cache_page` have been deprecated. Please see the documentation for the correct way to use this decorator.
ru: Некоторые вызовы :func:`~django.views.decorators.cache.cache_page` стали устаревшими. Обратитесь к документации для правильного использования этого декоратора.

source: Support for PostgreSQL versions older than 8.2
ru: Поддержка версий PostgreSQL меньше 8.2

source: Django 1.3 dropped support for PostgreSQL versions older than 8.0, and we suggested using a more recent version because of performance improvements and, more importantly, the end of upstream support periods for 8.0 and 8.1 was near (November 2010).
ru: Django 1.3 не работает с PostgreSQL младше 8.0, и мы настоятельно рекомендуем использовать более новые версии, тем более что срок окончания поддержки 8.0 и 8.1 уже близок (ноябрь 2010).

source: Django 1.4 takes that policy further and sets 8.2 as the minimum PostgreSQL version it officially supports.
ru: В Django 1.4 мы учли это и сделали версию 8.2 минимально поддерживаемой.

source: Request exceptions are now always logged
ru: Исключения в запросе теперь всегда логгируются

source: When we added :doc:`logging support </topics/logging/>` in Django in 1.3, the admin error email support was moved into the :class:`django.utils.log.AdminEmailHandler`, attached to the ``'django.request'`` logger. In order to maintain the established behavior of error emails, the ``'django.request'`` logger was called only when :setting:`DEBUG` was ``False``.
ru: После того как мы добавили :doc:`logging support </topics/logging/>` в Django 1.3, оповещение администратора по email было перемещено в класс :class:`django.utils.log.AdminEmailHandler`, который прикреплялся к логгеру ``django.request``. В целях совместимости с предыдущим поведением логгер ``django.request`` будет вызван только если :setting:`DEBUG` установлен в ``False``.

source: To increase the flexibility of error logging for requests, the ``'django.request'`` logger is now called regardless of the value of :setting:`DEBUG`, and the default settings file for new projects now includes a separate filter attached to :class:`django.utils.log.AdminEmailHandler` to prevent admin error emails in ``DEBUG`` mode::
ru: Для увеличения гибкости регистрации ошибок запросов логгер ``'django.request'`` сейчас вызывается независимо от значения :setting:`DEBUG`, однако в новом проекте по умолчанию добавлен фильтр в :class:`django.utils.log.AdminEmailHandler` для предотвращения отправки сообщений об ошибках в режиме разработки::

source: If your project was created prior to this change, your :setting:`LOGGING` setting will not include this new filter. In order to maintain backwards-compatibility, Django will detect that your ``'mail_admins'`` handler configuration includes no ``'filters'`` section and will automatically add this filter for you and issue a pending-deprecation warning. This will become a deprecation warning in Django 1.5, and in Django 1.6 the backwards-compatibility shim will be removed entirely.
ru: Если вы адаптируете уже существующий проект, то в настройке :setting:`LOGGING` этого фильтра нет. Для обратной совместимости Django определит, что у вашего обработчика ``'mail_admins'`` нет раздела ``'filters'`` и автоматически добавит его. В Django 1.5 мы будем выводить предупреждение, а в версии 1.6 эта совместимость будет удалена.

source: The existence of any ``'filters'`` key under the ``'mail_admins'`` handler will disable this backward-compatibility shim and deprecation warning.
ru: Добавление ключа ``'filters'`` в обработчик ``'mail_admins'`` рушит обратную совместимость.

source: In Django 1.4, they live in :mod:`django.conf.urls`.
ru: В Django 1.4 они перемещены в модуль :mod:`django.conf.urls`.

source: Databrowse has not seen active development for some time, and this does not show any sign of changing. There had been a suggestion for a `GSOC project`_ to integrate the functionality of databrowse into the admin, but no progress was made. While Databrowse has been deprecated, an enhancement of ``django.contrib.admin`` providing a similar feature set is still possible.
ru: Просмотрщик данных долгое время не развивался, и по сей день не было новых коммитов. Было предложено `GSOC project`_ интегрировать в панель администратора, но никакого прогресса не видно. В то время как Databrowse стал устаревшим, некоторая его функциональность переместилась в ``django.contrib.admin``.

source: The code that powers Databrowse is licensed under the same terms as Django itself, so it's available to be adopted by an individual or group as a third-party project.
ru: Лицензия на Databrowse совпадает с лицензией Django, так что любой желающий может доработать его для себя.

source: This function temporarily modified ``sys.path`` in order to make the parent "project" directory importable under the old flat :djadmin:`startproject` layout. This function is now deprecated, as its path workarounds are no longer needed with the new ``manage.py`` and default project layout.
ru: Эта функция временно модифицирует ``sys.path``, делая возможным импорт каталога проекта для старой структуры проекта, создаваемой :djadmin:`startproject`. Эта функция более не нужна с новым ``manage.py`` и структурой проекта.

source: This function was never documented or part of the public API, but it was widely recommended for use in setting up a "Django environment" for a user script. These uses should be replaced by setting the ``DJANGO_SETTINGS_MODULE`` environment variable or using :func:`django.conf.settings.configure`.
ru: Эта функция никогда не документировалась в API, но рекомендовалась для настройки окружения Django для пользовательских скриптов. Вместо неё следует использовать функцию :func:`django.conf.settings.configure` или переменную окружения ``DJANGO_SETTINGS_MODULE``.

source: This function was previously used by ``manage.py`` to execute a management command. It is identical to ``django.core.management.execute_from_command_line``, except that it first calls ``setup_environ``, which is now deprecated. As such, ``execute_manager`` is also deprecated; ``execute_from_command_line`` can be used instead. Neither of these functions is documented as part of the public API, but a deprecation path is needed due to use in existing ``manage.py`` files.
ru: Эта функция ранее использовалась ``manage.py`` для выполнения команд приложения.Она идентична ``django.core.management.execute_from_command_line`` за исключением первого вызова ``setup_environ``. Так что теперь объявлена устаревшей, вместо неё следует использовать ``execute_from_command_line``. Ни одна из этих функций не документирована в рамках API, но объявить устаревшей ``django.core.management.execute_manager`` всё-таки нужно для дальнейшего использования ``manage.py``.

source: ``is_safe`` and ``needs_autoescape`` attributes of template filters
ru: Атрибуты фильтров в шаблонах ``needs_autoescape`` и ``is_safe``

source: Two flags, ``is_safe`` and ``needs_autoescape``, define how each template filter interacts with Django's auto-escaping behavior. They used to be attributes of the filter function::
ru: Два флага (``is_safe`` и ``needs_autoescape``) определяют как каждый фильтр шаблона взаимодействует с автоэкранированием Django. Раньше они были атрибутами функции::

source: However, this technique caused some problems in combination with decorators, especially :func:`@stringfilter <django.template.defaultfilters.stringfilter>`. Now, the flags are keyword arguments of :meth:`@register.filter <django.template.Library.filter>`::
ru: Однако, это вызывало проблемы при комбинировании декораторов, особенно :func:`@stringfilter <django.template.defaultfilters.stringfilter>`. Теперь же флаги являются аргументами :meth:`@register.filter <django.template.Library.filter>`::

source: See :ref:`filters and auto-escaping <filters-auto-escaping>` for more information.
ru: Подробнее в документации :ref:`filters and auto-escaping <filters-auto-escaping>`.

source: Wildcard expansion of application names in `INSTALLED_APPS`
ru: Раскрытие шаблонов имен приложений в `INSTALLED_APPS`

source: ``HttpRequest.raw_post_data`` renamed to ``HttpRequest.body``
ru: ``HttpRequest.raw_post_data`` переименован в ``HttpRequest.body``

source: This attribute was confusingly named ``HttpRequest.raw_post_data``, but it actually provided the body of the HTTP request. It's been renamed to ``HttpRequest.body``, and ``HttpRequest.raw_post_data`` has been deprecated.
ru: Этот атрибут назывался ``HttpRequest.raw_post_data``, но на самом деле представлял собой тело HTTP запроса. Теперь он объявлен устаревшим, а вместо него следует использовать ``HttpRequest.body``.

source: ``django.contrib.sitemaps`` bug fix with potential performance implications
ru: Исправлена потенциальная ошибка производительности в ``django.contrib.sitemaps``

source: In previous versions, ``Paginator`` objects used in sitemap classes were cached, which could result in stale site maps. We've removed the caching, so each request to a site map now creates a new Paginator object and calls the :attr:`~django.contrib.sitemaps.Sitemap.items()` method of the :class:`~django.contrib.sitemaps.Sitemap` subclass. Depending on what your ``items()`` method is doing, this may have a negative performance impact. To mitigate the performance impact, consider using the :doc:`caching framework </topics/cache>` within your ``Sitemap`` subclass.
ru: В предыдущих версиях объекты ``Paginator`` кэшировали карту сайта, что могло сказаться на актуальности. Мы избавились от этого, так что при каждом запросе к sitemap создаётся новый объект ``Paginator`` и вызывается метод :attr:`~django.contrib.sitemaps.Sitemap.items()` класса :class:`~django.contrib.sitemaps.Sitemap`. В зависимости от того, что ваш метод ``items()`` делает, это может сказаться на производительности. Для смягчения последствий рассмотрите возможность использования :doc:`caching framework </topics/cache>` в ваших подклассах ``Sitemap``.

source: Versions of Python-Markdown earlier than 2.1
ru: Версии Python-Markdown меньшие 2.1

source: Versions of Python-Markdown earlier than 2.1 do not support the option to disable attributes. As a security issue, earlier versions of this library will not be supported by the markup contrib app in 1.5 under an accelerated deprecation timeline.
ru: Версии Python-Markdown меньшие, чем 2,1 не поддерживают возможность отключения атрибутов. В целях безопасности старые версии этой библиотеки не будут поддерживаться для разметки в 1.5 и подлежат скорейшему отключению.
