Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/releases/index.po
Languages: ru

source: Release notes
ru: Заметки о релизах

source: Release notes for the official Django releases. Each release note will tell you what's new in each version, and will also describe any backwards-incompatible changes made in that version.
ru: Здесь собраны заметки об официальных релизах Django. В них рассказывается о новой функциональности, а также даются советы по миграции на новые версии.

source: For those :doc:`upgrading to a new version of Django</howto/upgrade-version>`, you will need to check all the backwards-incompatible changes and :doc:`deprecated features</internals/deprecation>` for each 'final' release from the one after your current Django version, up to and including the new version.
ru: Для применения :doc:`upgrading to a new version of Django</howto/upgrade-version>` нужно сначала убрать все обратные совместимости из :doc:`deprecated features</internals/deprecation>` для каждого финального релиза с текущего по тот, на который хотите обновиться.

source: Final releases
ru: Последний релиз

source: 1.6 release
ru: Релиз 1.6

source: 1.5 release
ru: Релиз 1.5

source: 1.4 release
ru: Релиз 1.4

source: 1.3 release
ru: Релиз 1.3

source: 1.2 release
ru: Релиз 1.2

source: 1.1 release
ru: Релиз 1.1

source: 1.0 release
ru: Релиз 1.0

source: Pre-1.0 releases
ru: Пре-релиз 1.0

source: Security releases
ru: Релизы безопасности

source: Whenever a security issue is disclosed via :doc:`Django's security policies </internals/security>`, appropriate release notes are now added to all affected release series.
ru: При исправлении ошибки из :doc:`Django's security policies </internals/security>` сообщение об этом вносится в каждую заметку о релизе, который затронула данный баг.

source: Additionally, :doc:`an archive of disclosed security issues </releases/security>` is maintained.
ru: Дополнительно поддерживается :doc:`an archive of disclosed security issues </releases/security>`.
