Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/internals/contributing/index.po
Languages: ru

source: Contributing to Django
ru: Контрибуция в Django

source: Django is a community that lives on its volunteers. As it keeps growing, we always need more people to help others. As soon as you learn Django, you can contribute in many ways:
ru: Django - это сообщество, которое живёт за счёт добровольцев. Так как оно разрастается, нам всегда нужно больше людей, чтобы помочь другим. Как только Вы узнаете Django, то можете внести свой вклад во многих отношениях:

source: Join the |django-users| mailing list and answer questions. This mailing list has a huge audience, and we really want to maintain a friendly and helpful atmosphere. If you're new to the Django community, you should read the `posting guidelines`_.
ru: Присоединяйтесь к списку рассылки |django-users| и отвечайте на вопросы. Этот список рассылки имеет огромную аудиторию, и мы очень стараемся поддерживать там доброжелательную и полезную атмосферу. Если Вы новичок в сообществе Django, то должны прочитать `правила публикации`_.

source: Join the `#django IRC channel`_ on Freenode and answer questions. By explaining Django to other users, you're going to learn a lot about the framework yourself.
ru: Присоединяйтесь к `IRC каналу #django`_ на Freenode и отвечайте на вопросы. Объясняя Django другим пользователям, Вам придётся узнать много нового о нашем фреймворке.

source: Blog about Django. We syndicate all the Django blogs we know about on the `community page`_; if you'd like to see your blog on that page you can `register it here`_.
ru: Блог о Django. Соединяя все блоги о Django, мы знаем обо всём на `странице сообщества`_; если Вы хотели бы видеть свой блог на этой странице, то можете `зарегистрировать его здесь`_.

source: Contribute to open-source Django projects, write some documentation, or release your own code as an open-source pluggable application. The ecosystem of pluggable applications is a big strength of Django, help us build it!
ru: Содействуйте в Django-проекты с открытым исходным кодом, напишите какую-нибудь документацию или выпустите свой собственный код на основе открытого исходного кода подключаемых приложений. Экосистема подключаемых приложений является основой Django, помогите его построить!

source: If you think working *with* Django is fun, wait until you start working *on* it. We're passionate about helping Django users make the jump to contributing members of the community, so there are several ways you can help Django's development:
ru: Если Вы думаете, что работать *с* Django - это удовольствие, то мы ожидаем, когда же Вы начнете работать *на* него. Мы увлечённо помогаем Django-пользователям осуществить переход в активные члены сообщества, так что есть несколько способов, как Вы можете помочь разработке Django:

source: :doc:`Report bugs <bugs-and-features>` in our `ticket tracker`_.
ru: :doc:`Сообщайте об ошибках <bugs-and-features>` в наш `тикет-трекер`_.

source: :doc:`Submit patches <writing-code/submitting-patches>` for new and/or fixed behavior. If you're looking for an easy way to start contributing to Django read the :doc:`/intro/contributing` tutorial and have a look at the `easy pickings`_ tickets. The :ref:`patch-review-checklist` will also be helpful.
ru: :doc:`Отправляйте патчи <writing-code/submitting-patches>` для новых особенностей и/или фиксирующих исправлений. Если Вы ищете простой способ начать способствовать Django, прочитайте учебник :doc:`/intro/contributing` и посмотрите на `легкую добычу`_ тикетов. Также будет полезно ознакомиться с :ref:`patch-review-checklist`.

source: :doc:`Improve the documentation <writing-documentation>` or :doc:`write unit tests <writing-code/unit-tests>`.
ru: :doc:`Улучшайте документацию <writing-documentation>` или :doc:`пишите юнит-тесты <writing-code/unit-tests>`.

source: :doc:`Triage tickets and review patches <triaging-tickets>` created by other users.
ru: :doc:`Сортируйте тикеты и рассматривайте патчи <triaging-tickets>`, созданные другими пользователями.

source: Really, **ANYONE** can do something to help make Django better and greater!
ru: Действительно, **ЛЮБОЙ** может что-то сделать, чтобы помочь сделать Django лучше и великолепнее!

source: Browse the following sections to find out how:
ru: Просмотрите следующие разделы, чтобы узнать:
