Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/internals/contributing/localizing.po
Languages: ru

source: Localizing Django
ru: Локализация Django

source: Various parts of Django, such as the admin site and validation error messages, are internationalized. This means they display differently depending on each user's language or country. For this, Django uses the same internationalization and localization infrastructure available to Django applications, described in the :doc:`i18n documentation </topics/i18n/index>`.
ru: Разные части Django, например, админка или ошибки валидации, могут быть переведены на множество языков. Текст на одной и той же странице может отображаться по-разному, в зависимости от настроек пользователя. Всё это делается с помощью встроенных средств Django, описанных в :doc:`i18n documentation </topics/i18n/index>`.

source: Translations
ru: Переводы

source: Translations are contributed by Django users worldwide. The translation work is coordinated at `Transifex`_.
ru: Переводы статичных текстов доступны всем, работа по ним координируется `Transifex`_.

source: If you find an incorrect translation or want to discuss specific translations, go to the `Django project page`_. If you would like to help out with translating or add a language that isn't yet translated, here's what to do:
ru: Если вы нашли неверный перевод или хотите обсудить текущий, то загляните в `Django project page`_. Если хотите помочь с переводом, то вам понадобится сделать несколько простых шагов:

source: Make sure you read the notes about :ref:`specialties-of-django-i18n`.
ru: Ознакомьтесь с :ref:`specialties-of-django-i18n`.

source: On the `Django project page`_, choose the language you want to work on, **or** -- in case the language doesn't exist yet -- request a new language team by clicking on the "Request language" link and selecting the appropriate language.
ru: На странице `Django project page`_ выберите язык, с которым хотите работать или, если такового нет в списке, запросите его создание, нажав кнопку "Request language".

source: Then, click the "Join this Team" button to become a member of this team. Every team has at least one coordinator who is responsible to review your membership request. You can of course also contact the team coordinator to clarify procedural problems and handle the actual translation process.
ru: Далее вступите в команду переводчиков, нажав кнопку "Join this Team". Каждый участник имеет хотя бы одного координатора, который ответственен за рассмотрение предложенного перевода. Вы можете связываться со своим координатором для уточнения деталей.

source: For more information about how to use Transifex, read the `Transifex User Guide`_.
ru: За дополнительной информацией как использовать Transifex обратиться можно к `Transifex User Guide`_.

source: Formats
ru: Форматы

source: The format files aren't managed by the use of Transifex. To change them, you must :doc:`create a patch<writing-code/submitting-patches>` against the Django source tree, as for any code change:
ru: Эти файлы не редактируются с помощью Transifex. Для их изменения нужно :doc:`создать патч<writing-code/submitting-patches>`, как и для изменения кода:

source: Create a diff against the current Git master branch.
ru: Создать файл различий (diff) от master-ветки.

source: Open a ticket in Django's ticket system, set its ``Component`` field to ``Translations``, and attach the patch to it.
ru: Открыть задачу в багтрекере Django, установив поле ``Component`` в ``Translations`` и прикрепив патч.
