Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/ref/templates/api.po
Languages: ru

source: Returns a ``Template`` object for a given ``template_name`` by looping through results from :meth:`get_template_sources` and calling :meth:`get_contents`. This returns the first matching template. If no template is found, :exc:`~django.template.TemplateDoesNotExist` is raised.
ru: Возвращает объект ``Template`` для переданного ``template_name``, проверяя все источники из :meth:`get_template_sources` и вызывая :meth:`get_contents`. Возвращает первый найденный шаблон. Если шаблон не найден, будет вызвано исключение :exc:`~django.template.TemplateDoesNotExist`.

source: The optional ``skip`` argument is a list of origins to ignore when extending templates. This allow templates to extend other templates of the same name. It also used to avoid recursion errors.
ru: Необязательный аргумент ``skip`` содержит список источников, которые игнорируются при наследовании шаблонов. Это позволяет шаблонам наследовать шаблоны с одинаковыми именами. Также позволяет избежать ошибки о рекурсии.

source: In general, it is enough to define :meth:`get_template_sources` and :meth:`get_contents` for custom template loaders. ``get_template()`` will usually not need to be overridden.
ru: Обычно достаточно определить методы :meth:`get_template_sources` и :meth:`get_contents`. ``get_template()`` обычно не нужно переопределять.

source: Returns a tuple of (``template_string``, ``template_origin``), where ``template_string`` is a string containing the template contents, and ``template_origin`` is a string identifying the template source. A filesystem-based loader may return the full path to the file as the ``template_origin``, for example.
ru: Возвращает кортеж (``template_string``, ``template_origin``), где ``template_string`` строка с содержимым шаблона, а ``template_origin`` строка, указывающая источник шаблона. Например, загрузчик с файловой системы вернет полный путь к файлу с шаблоном в ``template_origin``.

source: ``template_dirs`` is an optional argument used to control which directories the loader will search.
ru: ``template_dirs`` -- необязательный аргумент, который определяет каталоги для поиска шаблона.

source: This method is called automatically by :meth:`load_template` and should be overridden when writing custom template loaders.
ru: Этот метод автоматически вызывается :meth:`load_template` и должен быть переопределен при создании собственного загрузчика.

source: Custom loaders should use :meth:`get_template` and :meth:`get_contents` instead.
ru: Собственные загрузчики должны использовать :meth:`get_template` и :meth:`get_contents` вместо этого метода.

source: Returns a tuple of (``template``, ``template_origin``), where ``template`` is a ``Template`` object and ``template_origin`` is a string identifying the template source. A filesystem-based loader may return the full path to the file as the ``template_origin``, for example.
ru: Возвращает кортеж (``template``, ``template_origin``), где ``template`` это объект ``Template``, а ``template_origin`` строка, указывающая источник шаблона. Например, загрузчик с файловой системы вернет полный путь к файлу с шаблоном в ``template_origin``.

source: Building your own
ru: Создание собственного загрузчика

source: For examples, `read the source code for Django's built-in loaders`_.
ru: Примеры кода можно найти в `исходниках Django <https://github.com/django/django/tree/master/django/template/loaders>`_.

source: Template origin
ru: Расположение шаблона

source: Templates have an ``origin`` containing attributes depending on the source they are loaded from.
ru: Шаблоны содержат атрибут ``origin``, поля которого зависят от загрузчика шаблона.

source: The path to the template as returned by the template loader. For loaders that read from the file system, this is the full path to the template.
ru: Путь к шаблону, который вернул загрузчик шаблонов. Для загрузчиков, которые ищут в файловой системе, это будет полный путь к файлу шаблона.

source: If the template is instantiated directly rather than through a template loader, this is a string value of ``<unknown_source>``.
ru: Если шаблон создан на прямую, без загрузчика шаблонов, это поле содержит ``<unknown_source>``.

source: The relative path to the template as passed into the template loader.
ru: Относительный путь к шаблону, которые передается в загрузчик шаблонов.

source: If the template is instantiated directly rather than through a template loader, this is ``None``.
ru: Если шаблон создан на прямую, без загрузчика шаблонов, это поле содержит ``None``.
