Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/ref/templates/api.po
Languages: ru

source: The Django template language: for Python programmers
ru: Язык шаблонов Django: для Python программистов

source: This document explains the Django template system from a technical perspective -- how it works and how to extend it. If you're just looking for reference on the language syntax, see :doc:`/ref/templates/language`.
ru: Этот раздел описывает систему шаблонов Django с технической стороны -- как она работает и как расширить её. Если вы ищите просто описание синтаксиса шаблонов, смотрите :doc:`/ref/templates/language`.

source: It assumes an understanding of templates, contexts, variables, tags, and rendering. Start with the :ref:`introduction to the Django template language <template-language-intro>` if you aren't familiar with these concepts.
ru: Этот документ подразумевает, что вы уже знакомы с шаблонами, контекстом, переменными, тегами и рендерингом. Если вам не знакомы эти концепции, начните с :ref:`вступления в систему шаблонов Django <template-language-intro>`.

source: Overview
ru: Введение

source: Using the template system in Python is a three-step process:
ru: Система шаблонов в Python работает в два этапа:

source: You configure an :class:`Engine`.
ru: Вы настраиваете :class:`Engine`.

source: You compile template code into a :class:`Template`.
ru: Сначала вы компилируете код шаблона в объект :class:`Template`.

source: You render the template with a :class:`Context`.
ru: Вы рендерите шаблон с :class:`Context`.

source: Django projects generally rely on the :ref:`high level, backend agnostic APIs <template-engines>` for each of these steps instead of the template system's lower level APIs:
ru: Django использует :ref:`высокоуровневый API, который не привязан к конкретному бэкенду <template-engines>`:

source: For each :class:`~django.template.backends.django.DjangoTemplates` backend in the :setting:`TEMPLATES` setting, Django instantiates an :class:`Engine`. :class:`~django.template.backends.django.DjangoTemplates` wraps :class:`Engine` and adapts it to the common template backend API.
ru: Для каждого бэкенда :class:`~django.template.backends.django.DjangoTemplates` из настройки the :setting:`TEMPLATES`, Django создает экземпляр :class:`Engine`. :class:`~django.template.backends.django.DjangoTemplates` оборачивает :class:`Engine`, чтобы адаптировать его под API конкретного бэкенда шаблонов.

source: The :mod:`django.template.loader` module provides functions such as :func:`~django.template.loader.get_template` for loading templates. They return a ``django.template.backends.django.Template`` which wraps the actual :class:`django.template.Template`.
ru: Модуль :mod:`django.template.loader` предоставляет функции, такие как :func:`~django.template.loader.get_template`, для загрузки шаблонов. Они возвращают ``django.template.backends.django.Template``, который оборачивает :class:`django.template.Template`.

source: The ``Template`` obtained in the previous step has a :meth:`~django.template.backends.base.Template.render` method which marshals a context and possibly a request into a :class:`Context` and delegates the rendering to the underlying :class:`Template`.
ru: ``Template``, полученный на предыдущем шаге, содержит метод :meth:`~django.template.backends.base.Template.render`, который оборачивает контекст и запрос в :class:`Context` и делегирует рендеринг основному объекту :class:`Template`.

source: Configuring an engine
ru: Настройка бэкенда

source: If you are simply using the :class:`~django.template.backends.django.DjangoTemplates` backend, this probably isn't the documentation you're looking for. An instance of the ``Engine`` class described below is accessible using the ``engine`` attribute of that backend and any attribute defaults mentioned below are overridden by what's passed by :class:`~django.template.backends.django.DjangoTemplates`.
ru: Если вы просто используете :class:`~django.template.backends.django.DjangoTemplates` бэкенд, возможно вам не обязательно читать этот раздел. Экземпляр ``Engine``, описанный ниже, доступен через атрибут ``engine`` бэкенда, и все все атрибуты описанные ниже переопределены в :class:`~django.template.backends.django.DjangoTemplates`.

source: When instantiating an ``Engine`` all arguments must be passed as keyword arguments:
ru: При создании ``Engine`` все аргументы должны передаваться как именованные:

source: ``dirs`` is a list of directories where the engine should look for template source files. It is used to configure :class:`filesystem.Loader <django.template.loaders.filesystem.Loader>`.
ru: ``dirs`` -- это список каталого, в которых бэкенд ищет файлы шаблонов. Используется для настройки :class:`filesystem.Loader <django.template.loaders.filesystem.Loader>`.

source: It defaults to an empty list.
ru: По умолчанию равен пустому списку.

source: ``app_dirs`` only affects the default value of ``loaders``. See below.
ru: ``app_dirs`` влияет только на значение ``loaders`` по умолчанию. Смотрите ниже.

source: It defaults to ``False``.
ru: По умолчанию ``False``.

source: ``context_processors`` is a list of dotted Python paths to callables that are used to populate the context when a template is rendered with a request. These callables take a request object as their argument and return a :class:`dict` of items to be merged into the context.
ru: ``context_processors`` -- список путей Python для импорта функций, которые используются для наполнения контекста шаблонов, если он рендерится с объектом запроса. Эти функции принимают объект запроса и возвращают :class:`dict` значений, которые будут добавлены в контекст.

source: See :class:`~django.template.RequestContext` for more information.
ru: Подробности смотрите в описании :class:`~django.template.RequestContext`.

source: ``debug`` is a boolean that turns on/off template debug mode. If it is ``True``, the template engine will store additional debug information which can be used to display a detailed report for any exception raised during template rendering.
ru: ``debug`` -- булево значение, которое включает и выключает режим отладки. При ``True`` шаблонизатор сохраняет дополнительную отладочную информацию, которая может использоваться для отображения информации ошибки, которая возникла во время рендеринга.

source: ``loaders`` is a list of template loader classes, specified as strings. Each ``Loader`` class knows how to import templates from a particular source. Optionally, a tuple can be used instead of a string. The first item in the tuple should be the ``Loader`` class name, subsequent items are passed to the ``Loader`` during initialization.
ru: ``loaders`` -- список загрузчиков шаблонов, указанных строками. Каждый класс ``Loader`` знает как загрузить шаблоны из определенного источника. Вместо строки можно указать кортеж. Первым элементом должен быть путь к классу ``Loader``, вторым -- параметры, которые будут переданы в ``Loader`` при инициализации.

source: It defaults to a list containing:
ru: По умолчанию содержит список:

source: ``'django.template.loaders.app_directories.Loader'`` if and only if ``app_dirs`` is ``True``.
ru: ``'django.template.loaders.app_directories.Loader'``, только если ``app_dirs`` равен ``True``.

source: See :ref:`template-loaders` for details.
ru: Подробности смотрите в :ref:`template-loaders`.

source: ``string_if_invalid`` is the output, as a string, that the template system should use for invalid (e.g. misspelled) variables.
ru: ``string_if_invalid`` значение, которые шаблонизатор выведет вместо неправильной переменной(например, с опечаткой в назчании).

source: It defaults to the empty string.
ru: По умолчанию -- пустая строка.

source: See :ref:`invalid-template-variables` for details.
ru: Смотрите подробности в :ref:`invalid-template-variables`.

source: ``file_charset`` is the charset used to read template files on disk.
ru: ``file_charset`` -- кодировка, которая используется при чтении файла шаблона с диска.

source: It defaults to ``'utf-8'``.
ru: По умолчанию ``'utf-8'``.

source: ``'libraries'``: A dictionary of labels and dotted Python paths of template tag modules to register with the template engine. This is used to add new libraries or provide alternate labels for existing ones. For example::
ru: ``'libraries'``: список названий и путей Python к модулям с тегами, которые будут зарегистрированы в бэкенде шаблонизатора. Используется, чтобы добавить новые библиотеки, или поменять названия для существующих. Например::

source: Libraries can be loaded by passing the corresponding dictionary key to the :ttag:`{% load %}<load>` tag.
ru: Библиотеки могут быть импортированы с помощью тега :ttag:`{% load %}<load>`, передав указанный в словаре ключ.

source: ``'builtins'``: A list of dotted Python paths of template tag modules to add to :doc:`built-ins </ref/templates/builtins>`. For example::
ru: ``'builtins'``: Список путей Python к модулям с тегами, которые будут добавлены к :doc:`встроенным </ref/templates/builtins>`. Например::

source: Tags and filters from built-in libraries can be used without first calling the :ttag:`{% load %}<load>` tag.
ru: Теги и фильтры из этих модулей можно использовать без вызова тега :ttag:`{% load %}<load>`.

source: When a Django project configures one and only one :class:`~django.template.backends.django.DjangoTemplates` engine, this method returns the underlying :class:`Engine`. In other circumstances it will raise :exc:`~django.core.exceptions.ImproperlyConfigured`.
ru: Если проект настроен на использование :class:`~django.template.backends.django.DjangoTemplates` и только его, этот метод вернет соответствующий :class:`Engine`. Иначе вызовет исключение :exc:`~django.core.exceptions.ImproperlyConfigured`.

source: It's required for preserving APIs that rely on a globally available, implicitly configured engine. Any other use is strongly discouraged.
ru: Необходим для совместимости API, который рассчитывает на глобальный, неявно настроенный механизм шаблонов. Не следует использовать для других ситуаций.

source: Compiles the given template code and returns a :class:`Template` object.
ru: Сначала вы компилируете код шаблона в объект :class:`Template`.

source: Loads a template with the given name, compiles it and returns a :class:`Template` object.
ru: Загружает шаблон с указанным названием, компилирует его и возвращает объект :class:`Template`.

source: Like :meth:`~Engine.get_template`, except it takes a list of names and returns the first template that was found.
ru: Похож на :meth:`~Engine.get_template`, но принимает список шаблонов и возвращает первый доступный шаблон из списка.

source: Loading a template
ru: Загрузка шаблонов

source: The recommended way to create a :class:`Template` is by calling the factory methods of the :class:`Engine`: :meth:`~Engine.get_template`, :meth:`~Engine.select_template` and :meth:`~Engine.from_string`.
ru: Рекомендуемый метод создать :class:`Template` -- использовать методы-фабрики :class:`Engine`: :meth:`~Engine.get_template`, :meth:`~Engine.select_template` и :meth:`~Engine.from_string`.

source: In a Django project where the :setting:`TEMPLATES` setting defines exactly one :class:`~django.template.backends.django.DjangoTemplates` engine, it's possible to instantiate a :class:`Template` directly.
ru: В проекте, где настройка :setting:`TEMPLATES` содержит только :class:`~django.template.backends.django.DjangoTemplates`, можно создать экземпляр :class:`Template` напрямую.

source: This class lives at ``django.template.Template``. The constructor takes one argument — the raw template code::
ru: Класс находится в ``django.template.Template``. Конструктор принимает один аргумент -- "сырой" код шаблона::

source: Behind the scenes
ru: За кулисами

source: The system only parses your raw template code once -- when you create the ``Template`` object. From then on, it's stored internally as a tree structure for performance.
ru: Система парсит код шаблона один раз -- когда вы создаете объект ``Template``. Результат для оптимизации сохраняется в памяти как древовидная структура.

source: Even the parsing itself is quite fast. Most of the parsing happens via a single call to a single, short, regular expression.
ru: Сам по себе парсинг работает достаточно быстро, обычно с помощью небольших регулярных выражений.

source: Rendering a context
ru: Рендеринг контекста

source: Once you have a compiled :class:`Template` object, you can render a context with it. You can reuse the same template to render it several times with different contexts.
ru: Скомпилировав объект :class:`Template`, вы можете отрендерить с его помощью контекст. Вы можете использовать один и тот же объект шаблона, чтобы отрендерить несколько контекстов.

source: This class lives at ``django.template.Context``. The constructor takes two optional arguments:
ru: Класс контекста находит в ``django.template.Context``. Конструктор принимает два необязательных аргумента:

source: A dictionary mapping variable names to variable values.
ru: Словарь с переменными и их значениями.

source: The name of the current application. This application name is used to help :ref:`resolve namespaced URLs<topics-http-reversing-url-namespaces>`. If you're not using namespaced URLs, you can ignore this argument.
ru: Название текущего приложения. Оно помогает :ref:`определить текущее пространство имен для URL-ов<topics-http-reversing-url-namespaces>`. Если вы не используете пространство имен для URL-ов, можете игнорировать этот аргумент.

source: For details, see :ref:`playing-with-context` below.
ru: Подробности смотрте ниже в :ref:`playing-with-context`.

source: Call the :class:`Template` object's ``render()`` method with a :class:`Context` to "fill" the template::
ru: Вызовите метод ``render()`` объекта :class:`Template` с контекстом, чтобы "выполнить" шаблон::

source: Variables and lookups
ru: Переменные

source: Variable names must consist of any letter (A-Z), any digit (0-9), an underscore (but they must not start with an underscore) or a dot.
ru: Название переменной может состоять из букв (A-Z), цифр (0-9), подчеркивания (но не начинаться с подчеркивания) или точки.

source: Dots have a special meaning in template rendering. A dot in a variable name signifies a **lookup**. Specifically, when the template system encounters a dot in a variable name, it tries the following lookups, in this order:
ru: У точки особое значение. Точка в названии переменной означает **поиск**. Встретив точку в названии переменной, система шаблонов пытается найти значение в следующем подряке:

source: Dictionary lookup. Example: ``foo["bar"]``
ru: Поиск в словаре. Например: ``foo["bar"]``

source: Attribute lookup. Example: ``foo.bar``
ru: Поиск атрибута. Например: ``foo.bar``

source: List-index lookup. Example: ``foo[bar]``
ru: Поиск в списке. Напрмиер: ``foo[bar]``

source: Note that "bar" in a template expression like ``{{ foo.bar }}`` will be interpreted as a literal string and not using the value of the variable "bar", if one exists in the template context.
ru: Обратите внимание, "bar" в выражении ``{{ foo.bar }}`` будет интепретировано как строка "bar", а не переменная с названием "bar".

source: The template system uses the first lookup type that works. It's short-circuit logic. Here are a few examples::
ru: Система шаблонов будет использовать первое найденное значение. Вот несколько примеров::

source: If any part of the variable is callable, the template system will try calling it. Example::
ru: Если найдена функция, или любой другой вызываемый объект, шаблон попытается вызвать её. Например::

source: Callable variables are slightly more complex than variables which only require straight lookups. Here are some things to keep in mind:
ru: Вызываемые переменные работают немного сложнее. Вам следует помнить о следующем:

source: If the variable raises an exception when called, the exception will be propagated, unless the exception has an attribute ``silent_variable_failure`` whose value is ``True``. If the exception *does* have a ``silent_variable_failure`` attribute whose value is ``True``, the variable will render as the value of the engine's ``string_if_invalid`` configuration option (an empty string, by default). Example::
ru: Если выполнение функции вызвало исключение, это приведет к ошибке при выполнении шаблона, если только исключение не содержит атрибут ``silent_variable_failure`` равный ``True``. В таком случае переменная будет отрендерена со значением опции ``string_if_invalid`` шаблонизатора (пустая строка по умолчанию). Например::

source: Note that :exc:`django.core.exceptions.ObjectDoesNotExist`, which is the base class for all Django database API ``DoesNotExist`` exceptions, has ``silent_variable_failure = True``. So if you're using Django templates with Django model objects, any ``DoesNotExist`` exception will fail silently.
ru: Обратите внимание, :exc:`django.core.exceptions.ObjectDoesNotExist`, который является родительским для всех ошибок ``DoesNotExist`` в ORM, содержит ``silent_variable_failure = True``. Поэтому, если вы используете объекты модели в шаблонах, исключение ``DoesNotExist`` будет проигнорировано.

source: A variable can only be called if it has no required arguments. Otherwise, the system will return the value of the engine's ``string_if_invalid`` option.
ru: Функция из переменной может быть вызвана, только если не требует обязательных аргументов. В таком случае шаблон вставит вместо переменной значение ``string_if_invalid``.

source: Obviously, there can be side effects when calling some variables, and it'd be either foolish or a security hole to allow the template system to access them.
ru: Очевидно, что вызов функций может выполнять различные побочные действия, которые могут привести к уязвимостям, было бы глупо позволять шаблону выполнять их.

source: A good example is the :meth:`~django.db.models.Model.delete` method on each Django model object. The template system shouldn't be allowed to do something like this::
ru: Хороший пример -- метод :meth:`~django.db.models.Model.delete` модели. Нельзя позволять шаблонам выполнять следующее::

source: To prevent this, set an ``alters_data`` attribute on the callable variable. The template system won't call a variable if it has ``alters_data=True`` set, and will instead replace the variable with ``string_if_invalid``, unconditionally. The dynamically-generated :meth:`~django.db.models.Model.delete` and :meth:`~django.db.models.Model.save` methods on Django model objects get ``alters_data=True`` automatically. Example::
ru: Чтобы избежать этого, укажите атрибут ``alters_data`` в функции или методе. Шаблон не будет вызывать переменную, если значение содержит ``alters_data=True``, и будет использовать значение настройки ``string_if_invalid``. Встроенные методы :meth:`~django.db.models.Model.delete` и :meth:`~django.db.models.Model.save` модели содержат атрибут ``alters_data=True``. Например::

source: Occasionally you may want to turn off this feature for other reasons, and tell the template system to leave a variable uncalled no matter what. To do so, set a ``do_not_call_in_templates`` attribute on the callable with the value ``True``. The template system then will act as if your variable is not callable (allowing you to access attributes of the callable, for example).
ru: В некоторых случая может понадобится отключить вызов переменной и использовать значение как есть. Для этого укажите атрибут ``do_not_call_in_templates`` со значением ``True``. Шаблон будет интерпретировать такую функцию как не вызываемое значение (позволяя обратиться к её атрибутам, например).

source: How invalid variables are handled
ru: Как обрабатываются неправильные переменные

source: Generally, if a variable doesn't exist, the template system inserts the value of the engine's ``string_if_invalid`` configuration option, which is set to ``''`` (the empty string) by default.
ru: Если переменная не найдена в шаблоне, будет использоваться значение опции ``string_if_invalid`` шаблонизатора, равной по умолчанию ``''`` (пустая строка).

source: Filters that are applied to an invalid variable will only be applied if ``string_if_invalid`` is set to ``''`` (the empty string). If ``string_if_invalid`` is set to any other value, variable filters will be ignored.
ru: Фильтры, которые указаны для переменной, будут применяться, только если ``string_if_invalid`` равна ``''`` (пустая строка). Если ``string_if_invalid`` равна другому значению, фильтры будут проигнорированы.

source: This behavior is slightly different for the ``if``, ``for`` and ``regroup`` template tags. If an invalid variable is provided to one of these template tags, the variable will be interpreted as ``None``. Filters are always applied to invalid variables within these template tags.
ru: Теги ``if``, ``for`` и ``regroup`` работают немного по другому. Если указать неправильную переменную, будет использоваться значение ``None``. Фильтры всегда применяются к переменной в этих тегах.

source: If ``string_if_invalid`` contains a ``'%s'``, the format marker will be replaced with the name of the invalid variable.
ru: Если ``string_if_invalid`` содержит ``'%s'``, будет подставлено название переменной.

source: For debug purposes only!
ru: Только для отладки!

source: While ``string_if_invalid`` can be a useful debugging tool, it is a bad idea to turn it on as a 'development default'.
ru: Хотя ``string_if_invalid`` и полезная для отладки, лучше не менять её по умолчанию и использовать только при необходимости локально.

source: Many templates, including those in the Admin site, rely upon the silence of the template system when a non-existent variable is encountered. If you assign a value other than ``''`` to ``string_if_invalid``, you will experience rendering problems with these templates and sites.
ru: Многие шаблоны, включая шаблоны админки, полагаются на то, что неправильные переменные будут проигнорированы системой шаблонов. Если заменить ``''`` в ``string_if_invalid`` на другое значение, могут возникнуть проблемы с рендерингом шаблонов.

source: Generally, ``string_if_invalid`` should only be enabled in order to debug a specific template problem, then cleared once debugging is complete.
ru: Как правило ``string_if_invalid`` необходимо использовать для отладки конкретной проблемы в шаблоне, и после отладки возвращать значение по умолчанию.

source: Built-in variables
ru: Встроенные переменные

source: Every context contains ``True``, ``False`` and ``None``. As you would expect, these variables resolve to the corresponding Python objects.
ru: Каждый контекст содержит ``True``, ``False`` и ``None``. Как и следовало ожидать эти переменные соответствуют объектам Python.

source: Limitations with string literals
ru: Ограничения текстовых литералов

source: Django's template language has no way to escape the characters used for its own syntax. For example, the :ttag:`templatetag` tag is required if you need to output character sequences like ``{%`` and ``%}``.
ru: Система шаблонов Django не позволяет экранировать символы, которые используются в синтаксисе разметки шаблонов. Например, следует использовать тег :ttag:`templatetag`, если необходимо вывести в шаблоне ``{%`` и ``%}`` как строки.

source: A similar issue exists if you want to include these sequences in template filter or tag arguments. For example, when parsing a block tag, Django's template parser looks for the first occurrence of ``%}`` after a ``{%``. This prevents the use of ``"%}"`` as a string literal. For example, a ``TemplateSyntaxError`` will be raised for the following expressions::
ru: Аналогичные проблемы возникают, если необходимо использовать эти значения как аргумент фильтра или тега. Например, при парсинге блочного тега, Django ищет первое появление ``%}`` после ``{%``. Таким образом нельзя использовать ``"%}"`` как текст. Например, в следующих ситуациях будет вызвано исключение ``TemplateSyntaxError``::
