Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/ref/templates/api.po
Languages: ru

source: The same issue can be triggered by using a reserved sequence in filter arguments::
ru: Аналогичная проблема возникнет при использовании ``}}`` в качестве аргумента фильтра::

source: If you need to use strings with these sequences, store them in template variables or use a custom template tag or filter to workaround the limitation.
ru: Чтобы обойти эти ограничения, используйте переменную для хранения запрещенных строк, или свой теги или фильтр, чтобы обойти ограничения.

source: Most of the time, you'll instantiate :class:`Context` objects by passing in a fully-populated dictionary to ``Context()``. But you can add and delete items from a ``Context`` object once it's been instantiated, too, using standard dictionary syntax::
ru: Обычно при создании объекта :class:`Context` сразу передается словарь со всеми переменными. Но вы можете менять содержимое объекта ``Context`` и после его инициализации, использую стандартный API словарей::

source: Returns the value for ``key`` if ``key`` is in the context, else returns ``otherwise``.
ru: Возвращает значение для ``key``, если ``key`` находится в контексте, иначе возвращает ``otherwise``.

source: If ``key`` is in the context, returns its value. Otherwise inserts ``key`` with a value of ``default`` and returns ``default``.
ru: Если контекст содержит ``key``, вернет его значение. Иначе добавит ``key`` с значением ``default`` и вернет ``default``.

source: A ``Context`` object is a stack. That is, you can ``push()`` and ``pop()`` it. If you ``pop()`` too much, it'll raise ``django.template.ContextPopException``::
ru: Объект ``Context`` работает как стек. Поэтому можно использовать методы ``push()`` и ``pop()``. Если вызывать ``pop()`` слишком часто, будет вызвано исключение ``django.template.ContextPopException``::

source: You can also use ``push()`` as a context manager to ensure a matching ``pop()`` is called.
ru: ``push()`` можно использовать как менеджер контекста, чтобы быть уверенным, что будет ``pop()`` вызван в конце.

source: All arguments passed to ``push()`` will be passed to the ``dict`` constructor used to build the new context level.
ru: Все аргументы ``push()`` будут переданы в конструктор ``dict`` при создании нового слоя в контексте.

source: In addition to ``push()`` and ``pop()``, the ``Context`` object also defines an ``update()`` method. This works like ``push()`` but takes a dictionary as an argument and pushes that dictionary onto the stack instead of an empty one.
ru: Кроме ``push()`` и ``pop()`` объект ``Context`` также предоставляет метод ``update()``. Работает как и ``push()``, но принимает словарь в качестве аргумента и добавляет его в стек.

source: Like ``push()``, you can use ``update()`` as a context manager to ensure a matching ``pop()`` is called.
ru: Как и ``push()``, вы можете использовать ``update()`` как менеджер контекста, чтобы быть уверенным, что будет ``pop()`` вызван в конце.

source: Using a ``Context`` as a stack comes in handy in :ref:`some custom template tags <howto-writing-custom-template-tags>`.
ru: Использовать ``Context``, как стек, удобно в :ref:`собственных тегах <howto-writing-custom-template-tags>`..

source: Using ``flatten()`` method you can get whole ``Context`` stack as one dictionary including builtin variables.
ru: Метод ``flatten()`` возвращает весь стек ``Context`` одним словарём, включая встроенные переменные.

source: A ``flatten()`` method is also internally used to make ``Context`` objects comparable.
ru: Метод ``flatten()`` также используется для сравнения объектов ``Context`` внутри системы шаблонов.

source: Result from ``flatten()`` can be useful in unit tests to compare ``Context`` against ``dict``::
ru: Результат ``flatten()`` можно использовать в тестах для сравнения ``Context`` и ``dict``::

source: Django comes with a special ``Context`` class, ``django.template.RequestContext``, that acts slightly differently from the normal ``django.template.Context``. The first difference is that it takes an :class:`~django.http.HttpRequest` as its first argument. For example::
ru: Django предоставляет специальный класс ``Context``, ``django.template.RequestContext``, который немного отличается от обычного ``django.template.Context``. Первое отличие -- он принимает :class:`~django.http.HttpRequest` первым аргументом. Например::

source: The second difference is that it automatically populates the context with a few variables, according to the engine's ``context_processors`` configuration option.
ru: Еще одно отличие -- он автоматически добавляет различные переменные в соответствии с опцией ``context_processors`` шаблонизатора.

source: The ``context_processors`` option is a list of callables -- called **context processors** -- that take a request object as their argument and return a dictionary of items to be merged into the context. In the default generated settings file, the default template engine contains the following context processors::
ru: ``context_processors`` содержит кортеж функций, которые называются **процессорами контекста**. Они принимают объект запроса в качестве аргумента и возвращают словарь переменных, которые будут добавлены в контекст. По умолчанию ``context_processors`` равна::

source: In addition to these, :class:`RequestContext` always enables ``'django.template.context_processors.csrf'``. This is a security related context processor required by the admin and other contrib apps, and, in case of accidental misconfiguration, it is deliberately hardcoded in and cannot be turned off in the ``context_processors`` option.
ru: Кроме этого :class:`RequestContext` всегда использует ``django.core.context_processors.csrf``. Этот процессор контекста используется для безопасности админкой и другими встроенными приложениями. Чтобы исключить его случайное отключение, он захардкоден и не может быть выключен с помощью настройки ``context_processors``.

source: Each processor is applied in order. That means, if one processor adds a variable to the context and a second processor adds a variable with the same name, the second will override the first. The default processors are explained below.
ru: Процессоры контекста применяются по очереди. Это означает, что один процессор может перетереть переменную, которую добавил предыдущий. Процессоры по умолчанию описаны ниже.

source: When context processors are applied
ru: Когда применяются процессоры контекста

source: Context processors are applied on top of context data. This means that a context processor may overwrite variables you've supplied to your :class:`Context` or :class:`RequestContext`, so take care to avoid variable names that overlap with those supplied by your context processors.
ru: Процессоры контекста применяются после инициализации контекста. То есть процессор может перезаписать переменную, которую вы добавили в :class:`Context` или :class:`RequestContext`. Поэтому избегайте названий переменных, которые используются процессорами.

source: If you want context data to take priority over context processors, use the following pattern::
ru: Если вы хотите, чтобы переменная контекста перезаписывала переменные процессора контекста, используйте следующий подход::

source: Django does this to allow context data to override context processors in APIs such as :func:`~django.shortcuts.render` and :class:`~django.template.response.TemplateResponse`.
ru: Django использует такой способ, чтобы перезаписать процессоры контекста во внутреннем API, например :func:`~django.shortcuts.render` и :class:`~django.template.response.TemplateResponse`.

source: Also, you can give :class:`RequestContext` a list of additional processors, using the optional, third positional argument, ``processors``. In this example, the :class:`RequestContext` instance gets a ``ip_address`` variable::
ru: Также в :class:`RequestContext` можно передать список дополнительных процессоров контекста, используя третий необязательный аргумент ``processors``. В это примере в :class:`RequestContext` будет добавлена переменная ``ip_address``::

source: Built-in template context processors
ru: Встроенные процессоры контекста

source: Here's what each of the built-in processors does:
ru: Вот список процессоров контекста по умолчанию:

source: If this processor is enabled, every ``RequestContext`` will contain these variables:
ru: Если включить этот процессор, в ``RequestContext`` будут добавлены следующие переменные:

source: ``user`` -- An ``auth.User`` instance representing the currently logged-in user (or an ``AnonymousUser`` instance, if the client isn't logged in).
ru: ``user`` -- объект ``auth.User`` текущего авторизованного пользователя или объект ``AnonymousUser``, если пользователь не авторизованный).

source: ``perms`` -- An instance of ``django.contrib.auth.context_processors.PermWrapper``, representing the permissions that the currently logged-in user has.
ru: ``perms`` -- объект ``django.contrib.auth.context_processors.PermWrapper``, которые содержит права доступа текущего пользователя.

source: If this processor is enabled, every ``RequestContext`` will contain these two variables -- but only if your :setting:`DEBUG` setting is set to ``True`` and the request's IP address (``request.META['REMOTE_ADDR']``) is in the :setting:`INTERNAL_IPS` setting:
ru: Если включить этот процессор, в ``RequestContext`` будут добавлены следующие переменные, но только при :setting:`DEBUG` равном ``True`` и, если IP адрес запроса (``request.META['REMOTE_ADDR']``) указан в :setting:`INTERNAL_IPS`:

source: ``debug`` -- ``True``. You can use this in templates to test whether you're in :setting:`DEBUG` mode.
ru: ``debug`` -- ``True``. Вы можете использовать эту переменную, чтобы определить :setting:`DEBUG` режим в шаблоне.

source: If this processor is enabled, every ``RequestContext`` will contain these two variables:
ru: Если включить этот процессор, в ``RequestContext`` будут добавлены следующие переменные:

source: ``LANGUAGES`` -- The value of the :setting:`LANGUAGES` setting.
ru: ``LANGUAGES`` -- значение настройки :setting:`LANGUAGES`.

source: ``LANGUAGE_CODE`` -- ``request.LANGUAGE_CODE``, if it exists. Otherwise, the value of the :setting:`LANGUAGE_CODE` setting.
ru: ``LANGUAGE_CODE`` -- ``request.LANGUAGE_CODE``, если существует. Иначе значение :setting:`LANGUAGE_CODE`.

source: See :doc:`/topics/i18n/index` for more.
ru: Смотрите :doc:`/topics/i18n/index`.

source: If this processor is enabled, every ``RequestContext`` will contain a variable ``MEDIA_URL``, providing the value of the :setting:`MEDIA_URL` setting.
ru: Если включить этот процессор, в ``RequestContext`` будет добавлена переменная ``MEDIA_URL``, которая содержит значение :setting:`MEDIA_URL`.

source: If this processor is enabled, every ``RequestContext`` will contain a variable ``STATIC_URL``, providing the value of the :setting:`STATIC_URL` setting.
ru: Если включить этот процессор, в ``RequestContext`` будет добавлена переменная ``STATIC_URL``, которая содержит значение :setting:`STATIC_URL`.

source: This processor adds a token that is needed by the :ttag:`csrf_token` template tag for protection against :doc:`Cross Site Request Forgeries </ref/csrf>`.
ru: Этот процессор добавляет токен, который используется тегом :ttag:`csrf_token` для защиты от :doc:`CSRF атак </ref/csrf>`.

source: If this processor is enabled, every ``RequestContext`` will contain a variable ``request``, which is the current :class:`~django.http.HttpRequest`.
ru: Если включить этот процессор, в ``RequestContext`` будет добавлена переменная ``request``, содержащая текущий :class:`~django.http.HttpRequest`.

source: ``messages`` -- A list of messages (as strings) that have been set via the :doc:`messages framework </ref/contrib/messages>`.
ru: ``messages`` -- список сообщений (строки), которые были добавлены с помощью :doc:`фреймворка сообщений </ref/contrib/messages>`.

source: ``DEFAULT_MESSAGE_LEVELS`` -- A mapping of the message level names to :ref:`their numeric value <message-level-constants>`.
ru: ``DEFAULT_MESSAGE_LEVELS`` -- словарь приоритетов сообщений и :ref:`их числовых кодов <message-level-constants>`.

source: Writing your own context processors
ru: Как создать свой процессор контекста

source: Custom context processors can live anywhere in your code base. All Django cares about is that your custom context processors are pointed to by the ``'context_processors'`` option in your :setting:`TEMPLATES` setting — or the ``context_processors`` argument of :class:`~django.template.Engine` if you're using it directly.
ru: Код процессора может находится где угодно. Главное не забыть указать его в опции ``'context_processors'`` настройки:setting:`TEMPLATES`, или передать аргументом ``context_processors`` в :class:`~django.template.Engine`.

source: Loading templates
ru: Загрузка шаблонов

source: Generally, you'll store templates in files on your filesystem rather than using the low-level :class:`~django.template.Template` API yourself. Save templates in a directory specified as a **template directory**.
ru: Обычно при разработке проекта шаблоны хранятся в файлах, а не создаются с помощью API :class:`~django.template.Template`. Сохраняйте их в каталоге, который называют **каталог с шаблонами**.

source: Django searches for template directories in a number of places, depending on your template loading settings (see "Loader types" below), but the most basic way of specifying template directories is by using the :setting:`DIRS <TEMPLATES-DIRS>` option.
ru: Django ищет каталоги с шаблонами в соответствии с настройками загрузки шаблонов (смотрите "Типа загрузчиков" ниже). Самый простой способ -- указать каталоги с шаблонами в опции :setting:`DIRS <TEMPLATES-DIRS>`.

source: The :setting:`DIRS <TEMPLATES-DIRS>` option
ru: Опция :setting:`DIRS <TEMPLATES-DIRS>`

source: Tell Django what your template directories are by using the :setting:`DIRS <TEMPLATES-DIRS>` option in the :setting:`TEMPLATES` setting in your settings file — or the ``dirs`` argument of :class:`~django.template.Engine`. This should be set to a list of strings that contain full paths to your template directories::
ru: Вы можете указать Django каталоги с шаблонами через опцию :setting:`DIRS <TEMPLATES-DIRS>` настройки :setting:`TEMPLATES`, или в аргументе ``dirs`` при создании :class:`~django.template.Engine`. Настройка должна содержать список или кортеж полных путей к каталогам. Например::

source: Your templates can go anywhere you want, as long as the directories and templates are readable by the Web server. They can have any extension you want, such as ``.html`` or ``.txt``, or they can have no extension at all.
ru: Шаблоны могут находиться где угодно, главное, чтобы у Web-сервера были права на чтение. Расширение файла может быть любым, ``.html`` или ``.txt``, или вообще без расширения.

source: Note that these paths should use Unix-style forward slashes, even on Windows.
ru: Обратите внимание, пути должны быть Unix-стиле, даже для Windows (то есть использовать ``/``).

source: Loader types
ru: Типы загрузчиков

source: By default, Django uses a filesystem-based template loader, but Django comes with a few other template loaders, which know how to load templates from other sources.
ru: По умолчанию Django использует загрузчик шаблонов с файловой системы, но Django предоставляет и другие загрузчики шаблонов, которые позволяют загружать шаблоны с других источников.

source: Some of these other loaders are disabled by default, but you can activate them by adding a ``'loaders'`` option to your ``DjangoTemplates`` backend in the :setting:`TEMPLATES` setting or passing a ``loaders`` argument to :class:`~django.template.Engine`. ``loaders`` should be a list of strings or tuples, where each represents a template loader class. Here are the template loaders that come with Django:
ru: Некоторые из них выключены по умолчанию, но вы можете активировать их изменив опцию ``'loaders'`` бэкенда ``DjangoTemplates`` в настройке :setting:`TEMPLATES`, или передав аргумент ``loaders`` в :class:`~django.template.Engine`. Опция ``loaders`` содержит кортеж строк, каждая из которых представляет класс загрузчика шаблонов. Вот список загрузчиков, которые предоставляет Django:

source: Loads templates from the filesystem, according to :setting:`DIRS <TEMPLATES-DIRS>`.
ru: Загружает шаблоны с файловой системы в соответствии с настройкой :setting:`DIRS <TEMPLATES-DIRS>`.

source: This loader is enabled by default. However it won't find any templates until you set :setting:`DIRS <TEMPLATES-DIRS>` to a non-empty list::
ru: Этот загрузчик включен по умолчанию. Однако, он не найдет ни один шаблон, пока вы не укажите список каталогов в :setting:`DIRS <TEMPLATES-DIRS>`::

source: Loads templates from Django apps on the filesystem. For each app in :setting:`INSTALLED_APPS`, the loader looks for a ``templates`` subdirectory. If the directory exists, Django looks for templates in there.
ru: Загружает шаблоны из каталога приложения Django. Для каждого приложения в :setting:`INSTALLED_APPS` загрузчик ищет под-каталог ``templates``. Если под-каталог найден, Django ищет в нем шаблон.

source: This means you can store templates with your individual apps. This also makes it easy to distribute Django apps with default templates.
ru: Это означает, что вы можете хранить шаблоны вместе с приложением. Таким образом легко распространять приложение Django с шаблонами по умолчанию.

source: For example, for this setting::
ru: Например для следующих настроек::

source: ...then ``get_template('foo.html')`` will look for ``foo.html`` in these directories, in this order:
ru: ... ``get_template('foo.html')`` будет искать ``foo.html`` в таких каталогах в указанном порядке:

source: ... and will use the one it finds first.
ru: ... и будет использовать первый найденный.

source: The order of :setting:`INSTALLED_APPS` is significant! For example, if you want to customize the Django admin, you might choose to override the standard ``admin/base_site.html`` template, from ``django.contrib.admin``, with your own ``admin/base_site.html`` in ``myproject.polls``. You must then make sure that your ``myproject.polls`` comes *before* ``django.contrib.admin`` in :setting:`INSTALLED_APPS`, otherwise ``django.contrib.admin``’s will be loaded first and yours will be ignored.
ru: Порядок :setting:`INSTALLED_APPS` -- важен! Например, вы хотите переопределить шаблон админки Django, например ``admin/base_site.html`` из ``django.contrib.admin``, заменив на ``admin/base_site.html`` из ``myproject.polls``. Вы должны указать ``myproject.polls`` *перед* ``django.contrib.admin`` в :setting:`INSTALLED_APPS`, иначе шаблон из ``django.contrib.admin`` будет загружен первым, а ваш проигнорирован.

source: Note that the loader performs an optimization when it first runs: it caches a list of which :setting:`INSTALLED_APPS` packages have a ``templates`` subdirectory.
ru: Обратите внимание, загрузчик выполняет некоторую оптимизацию при первом импорте: он кеширует список приложений из :setting:`INSTALLED_APPS`, которые содержат под-каталог ``templates``.

source: You can enable this loader simply by setting :setting:`APP_DIRS <TEMPLATES-APP_DIRS>` to ``True``::
ru: Вы можете включить этот загрузчик, указав ``True`` в :setting:`APP_DIRS <TEMPLATES-APP_DIRS>`::

source: Distributing applications as eggs is not recommended.
ru: Распространять приложения как "egg" не рекомендуется.

source: Just like ``app_directories`` above, but it loads templates from Python eggs rather than from the filesystem.
ru: Аналогичен ``app_directories``, но загружает шаблоны из Python eggs, а не файловой системы.

source: This loader is disabled by default.
ru: Загрузчик выключен по умолчанию.

source: All of the built-in Django template tags are safe to use with the cached loader, but if you're using custom template tags that come from third party packages, or that you wrote yourself, you should ensure that the ``Node`` implementation for each tag is thread-safe. For more information, see :ref:`template tag thread safety considerations <template_tag_thread_safety>`.
ru: Все встроенные теги Django можно использовать с кеширующим загрузчиком, но теги сторонних приложений, или ваши собственные, должны использовать потокобезопасный код при использовании класса ``Node``. Смотрите :ref:`Потокобезопасные шаблонные теги<template_tag_thread_safety>`.

source: Loads templates from a Python dictionary. This is useful for testing.
ru: Загружает шаблоны из словаря Python. Удобен при тестировании.

source: This loader takes a dictionary of templates as its first argument::
ru: Этот загрузчик принимает словарь каталогов первым аргументом::

source: Django uses the template loaders in order according to the ``'loaders'`` option. It uses each loader until a loader finds a match.
ru: Django использует загрузчики шаблонов в порядке, указанном в опции ``'loaders'``. Загрузчики используются пока один из них не найдет шаблон.

source: Custom loaders
ru: Собственные загрузчики

source: It's possible to load templates from additional sources using custom template loaders. Custom ``Loader`` classes should inherit from ``django.template.loaders.base.Loader`` and define the ``get_contents()`` and ``get_template_sources()`` methods.
ru: Вы можете загружать шаблоны из дополнительных источников, используя собственный загрузчик шаблонов. Собственный класс ``Loader`` должен наследоваться от ``django.template.loaders.base.Loader`` и определять методы ``get_contents()`` и ``get_template_sources()``.

source: Loader methods
ru: Методы загрузчика шаблонов

source: Loads templates from a given source, such as the filesystem or a database.
ru: Загружает шаблоны из определенного источника, такого как файловая система или база данных.

source: A method that takes a ``template_name`` and yields :class:`~django.template.base.Origin` instances for each possible source.
ru: Метод принимает ``template_name`` и возвращает итератора по экземплярам :class:`~django.template.base.Origin` для каждого возможного источника шаблонов.

source: For example, the filesystem loader may receive ``'index.html'`` as a ``template_name`` argument. This method would yield origins for the full path of ``index.html`` as it appears in each template directory the loader looks at.
ru: Например, загрузчик с файловой системы получает ``'index.html'`` в аргументе ``template_name``. Этот метод вернет итератор, который содержит полные пути к ``index.html`` для каждого каталога, в котором он выполняет поиск шаблонов.

source: The method doesn't need to verify that the template exists at a given path, but it should ensure the path is valid. For instance, the filesystem loader makes sure the path lies under a valid template directory.
ru: Этот метод не проверяет находится ли шаблон по указанному пути, но путь должен быть правильным. Например, загрузчик с файловой системы проверяет, что путь находится в каталоге с шаблонами.

source: Returns the contents for a template given a :class:`~django.template.base.Origin` instance.
ru: Возвращает содержимое шаблона для переданного экземпляра :class:`~django.template.base.Origin`.

source: This is where a filesystem loader would read contents from the filesystem, or a database loader would read from the database. If a matching template doesn't exist, this should raise a :exc:`~django.template.TemplateDoesNotExist` error.
ru: В этом методе загрузчик прочитает содержимое с файловой системы, или базы данных. Если шаблон не найден, метод должен вызвать исключение :exc:`~django.template.TemplateDoesNotExist`.
