Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/ref/templates/builtins.po
Languages: ru

source: ``'listopada'`` (for Polish locale, as opposed to ``'Listopad'``)
ru: ``'listopada'`` (для польского языка, не ``'Listopad'``)

source: Time, in 12-hour hours and minutes, with minutes left off if they're zero. Proprietary extension.
ru: Время, час в 12-часовом формате и минуты, минуты не отображаются если равны нулю. Собственное расширение.

source: Month, textual, long.
ru: Название месяца, текстовое, длинное.

source: Hour, 12-hour format without leading zeros.
ru: Час, 12-часовом формате без ведущих нулей.

source: ``'1'`` to ``'12'``
ru: От ``'1'`` до ``'12'``

source: Hour, 24-hour format without leading zeros.
ru: Час, 24-часовой формат

source: ``'0'`` to ``'23'``
ru: От ``'0'`` до ``'23'``

source: Hour, 12-hour format.
ru: Час, 12-часовой формат.

source: ``'01'`` to ``'12'``
ru: От ``'01'`` до ``'12'``

source: Hour, 24-hour format.
ru: Час, 24-часовой формат.

source: ``'00'`` to ``'23'``
ru: От ``'00'`` до ``'23'``

source: Minutes.
ru: Минуты.

source: ``'00'`` to ``'59'``
ru: От ``'00'`` до ``'59'``

source: Daylight Savings Time, whether it's in effect or not.
ru: Летнее время (DST), не важно, используется оно или нет.

source: ``'1'`` or ``'0'``
ru: От ``'1'`` до ``'0'``

source: Day of the month without leading zeros.
ru: День месяца без ведущего нуля.

source: ``'1'`` to ``'31'``
ru: От ``'1'`` до ``'31'``

source: Day of the week, textual, long.
ru: Название дня недели, текстовое, длинное.

source: Boolean for whether it's a leap year.
ru: Булево значение указывающее високосный ли год.

source: ``True`` or ``False``
ru: ``True`` или ``False``

source: Month, 2 digits with leading zeros.
ru: Месяц, 2-цифирный с ведущими нулями.

source: Month, textual, 3 letters.
ru: Название месяца, текстовое, 3-х буквенное.

source: Month without leading zeros.
ru: Номер месяца без ведущего нуля.

source: Month abbreviation in Associated Press style. Proprietary extension.
ru: Аббревиатура названия месяца в формате Associated Press. Собственное расширение.

source: Difference to Greenwich time in hours.
ru: Разница с временем по Гринвичу

source: Time, in 12-hour hours, minutes and 'a.m.'/'p.m.', with minutes left off if they're zero and the special-case strings 'midnight' and 'noon' if appropriate. Proprietary extension.
ru: Время, в 12-часовом формате, минуты и 'a.m.'/'p.m.', минуты упускаются если равны нулю, значения 'midnight' и 'noon' используются по возможности. Собственное расширение.

source: Seconds, 2 digits with leading zeros.
ru: Секунды, 2-цифирный формат без ведущих нулей.

source: English ordinal suffix for day of the month, 2 characters.
ru: Английский суффикс для дня месяца, 2 символа.

source: ``'st'``, ``'nd'``, ``'rd'`` or ``'th'``
ru: ``'st'``, ``'nd'``, ``'rd'`` или ``'th'``

source: Number of days in the given month.
ru: Количество дней в месяце.

source: ``28`` to ``31``
ru: От ``28`` до ``31``

source: Time zone of this machine.
ru: Часовой пояс сервера.

source: Microseconds.
ru: микросекунды

source: ``000000`` to ``999999``
ru: От ``000000`` до ``999999``

source: Seconds since the Unix Epoch (January 1 1970 00:00:00 UTC).
ru: Секунды с начала эпохи Unix (1 января 1970 00:00:00 UTC).

source: Day of the week, digits without leading zeros.
ru: Номер дня недели, без ведущих нулей.

source: ``'0'`` (Sunday) to ``'6'`` (Saturday)
ru: от ``'0'`` (воскресение) до ``'6'`` (суббота)

source: ISO-8601 week number of year, with weeks starting on Monday.
ru: Норме недели в году в соответствии с ISO-8601, первая неделя начинается с понедельника.

source: Year, 2 digits.
ru: Год, 2 цифры.

source: Year, 4 digits.
ru: Год, 4 цифры.

source: Day of the year.
ru: Номер дня в году.

source: ``0`` to ``365``
ru: От ``0`` до ``365``

source: Time zone offset in seconds. The offset for timezones west of UTC is always negative, and for those east of UTC is always positive.
ru: Смещения часового пояса в секундах. Для часового пояса западнее UTC значение будет отрицательным, для тех, что восточнее UTC -- положительным.

source: ``-43200`` to ``43200``
ru: От ``-43200`` до ``43200``

source: If ``value`` is a :py:class:`~datetime.datetime` object (e.g., the result of ``datetime.datetime.now()``), the output will be the string ``'Wed 09 Jan 2008'``.
ru: Если ``value`` равно объекту :py:class:`~datetime.datetime` (например, результат выполнения ``datetime.datetime.now()``), будет выведено значение ``'Wed 09 Jan 2008'``.

source: The format passed can be one of the predefined ones :setting:`DATE_FORMAT`, :setting:`DATETIME_FORMAT`, :setting:`SHORT_DATE_FORMAT` or :setting:`SHORT_DATETIME_FORMAT`, or a custom format that uses the format specifiers shown in the table above. Note that predefined formats may vary depending on the current locale.
ru: Переданный формат может быть одним из предопределенных(:setting:`DATE_FORMAT`, :setting:`DATETIME_FORMAT`, :setting:`SHORT_DATE_FORMAT` или :setting:`SHORT_DATETIME_FORMAT`) или любой другой сформированный из символов форматирования из таблицы выше. Предопределенные форматы зависят от текущего языка и настройки :ref:`format-localization`, например::

source: Assuming that :setting:`USE_L10N` is ``True`` and :setting:`LANGUAGE_CODE` is, for example, ``"es"``, then for::
ru: Предположим что :setting:`USE_L10N` равно ``True`` и :setting:`LANGUAGE_CODE` равно ``"es"``, тогда::

source: the output would be the string ``"09/01/2008"`` (the ``"SHORT_DATE_FORMAT"`` format specifier for the ``es`` locale as shipped with Django is ``"d/m/Y"``).
ru: результат вывода будет ``"09/01/2008"`` (формат ``"SHORT_DATE_FORMAT"`` для языка ``es`` указан в Django как ``"d/m/Y"``).

source: You can combine ``date`` with the :tfilter:`time` filter to render a full representation of a ``datetime`` value. E.g.::
ru: Вы можете использовать ``date`` с фильтром :tfilter:`time`, чтобы получить полное представление значения ``datetime``. Например::

source: If value evaluates to ``False``, uses the given default. Otherwise, uses the value.
ru: Если значение равно ``False``, будет использовано значение по-умолчанию. В противном случае используется значение.

source: If ``value`` is ``""`` (the empty string), the output will be ``nothing``.
ru: Если ``value`` равно ``""`` (пустая строка), будет выведено ``nothing``.

source: If (and only if) value is ``None``, uses the given default. Otherwise, uses the value.
ru: Если (и только в этом случае) значение равно ``None``, будет использовано значение по-умолчанию. В противном случае используется значение.

source: Note that if an empty string is given, the default value will *not* be used. Use the :tfilter:`default` filter if you want to fallback for empty strings.
ru: Заметим, если передана пустая строка, значение по-умолчанию *не* будет использовано. Используйте фильтр :tfilter:`default`, если нужно учитывать пустую строку.

source: Takes a list of dictionaries and returns that list sorted by the key given in the argument.
ru: Принимает список словарей и возвращает список, отсортированный по указанному ключу.

source: If ``value`` is:
ru: Если ``value`` равно:

source: then the output would be:
ru: будет возвращено:

source: You can also do more complicated things like::
ru: Вы также можете делать более сложные вещи::

source: If ``books`` is:
ru: Если ``books`` равно:

source: then the output would be::
ru: будет возвращено::

source: Takes a list of dictionaries and returns that list sorted in reverse order by the key given in the argument. This works exactly the same as the above filter, but the returned value will be in reverse order.
ru: Принимает список словарей и возвращает список отсортированный по указанному ключу в обратном порядке. Работает аналогично фильтру выше, но возвращает список в обратном порядке.

source: Returns ``True`` if the value is divisible by the argument.
ru: Возвращает ``True``, если значение делится на аргумент.

source: If ``value`` is ``21``, the output would be ``True``.
ru: Если ``value`` равно ``21``, будет возвращено ``True``.

source: Escapes a string's HTML. Specifically, it makes these replacements:
ru: Экранирует HTML. В частности выполняются такие замены:

source: ``<`` is converted to ``&lt;``
ru: ``<`` заменяется на ``&lt;``

source: ``>`` is converted to ``&gt;``
ru: ``>`` заменяется на ``&gt;``

source: ``'`` (single quote) is converted to ``&#39;``
ru: ``'`` (одинарная кавычка) заменяется на ``&#39;``

source: ``"`` (double quote) is converted to ``&quot;``
ru: ``"`` (двойная кавычка) заменяется на ``&quot;``

source: ``&`` is converted to ``&amp;``
ru: ``&`` заменяется на ``&amp;``

source: Applying ``escape`` to a variable that would normally have auto-escaping applied to the result will only result in one round of escaping being done. So it is safe to use this function even in auto-escaping environments. If you want multiple escaping passes to be applied, use the :tfilter:`force_escape` filter.
ru: Применение ``escape`` к переменной, которая уже была экранирована с помощью авто-экранирования, безопасно. Будет применено только одно экранирование. Так что безопасно использовать его с авто-экранированием. Если вам нужно применить экранирование несколько раз, используйте :tfilter:`force_escape`.

source: For example, you can apply ``escape`` to fields when :ttag:`autoescape` is off::
ru: Например, ``escape`` можно использовать для экранирования, если :ttag:`autoescape` выключен::

source: Escapes characters for use in JavaScript strings. This does *not* make the string safe for use in HTML, but does protect you from syntax errors when using templates to generate JavaScript/JSON.
ru: Экранирует символы в строке, используемой в JavaScript. Это *не* делает строку безопасной для использования в HTML, но защищает от синтаксических ошибок при генерации JavaScript/JSON.

source: If ``value`` is ``"testing\r\njavascript \'string" <b>escaping</b>"``, the output will be ``"testing\\u000D\\u000Ajavascript \\u0027string\\u0022 \\u003Cb\\u003Eescaping\\u003C/b\\u003E"``.
ru: Если ``value`` равно ``"testing\r\njavascript \'string" <b>escaping</b>"``, будет выведено ``"testing\\u000D\\u000Ajavascript \\u0027string\\u0022 \\u003Cb\\u003Eescaping\\u003C/b\\u003E"``.

source: If ``value`` is 123456789, the output would be ``117.7 MB``.
ru: Если ``value`` равно 123456789, будет выведено ``117.7 MB``.

source: File sizes and SI units
ru: Размер файла и Международная система единиц

source: Strictly speaking, ``filesizeformat`` does not conform to the International System of Units which recommends using KiB, MiB, GiB, etc. when byte sizes are calculated in powers of 1024 (which is the case here). Instead, Django uses traditional unit names (KB, MB, GB, etc.) corresponding to names that are more commonly used.
ru: Строго говоря, ``filesizeformat`` не соответствует Международной системе единиц, которая рекомендует использовать кибибайт, мебибайт, гибибайт, и т.д. когда размеры байта вычислены в степени 1024 (данный случай). Вместо этого Django использует традиционные имена для единиц измерений (Кбайт, Мбайт, Гбайт, и т.д.) соответствующие именам, которые используются обычно.

source: Returns the first item in a list.
ru: Возвращает первый элемент списка.

source: If ``value`` is the list ``['a', 'b', 'c']``, the output will be ``'a'``.
ru: Если ``value`` равно ``['a', 'b', 'c']``, будет возвращено ``'a'``.

source: When used without an argument, rounds a floating-point number to one decimal place -- but only if there's a decimal part to be displayed. For example:
ru: При использовании без аргументов, округляет число с плавающей запятой до одной десятой. Дробная часть отображается только, если существует. Например:

source: Template
ru: Шаблон

source: Output
ru: Вывод

source: If used with a numeric integer argument, ``floatformat`` rounds a number to that many decimal places. For example:
ru: Если используется целочисленный аргумент, ``floatformat`` округляет до указанного количества знаков после запятой. Например:

source: Particularly useful is passing 0 (zero) as the argument which will round the float to the nearest integer.
ru: Особенно полезный передавать 0 (нуль) как параметр, который будет округлять значение с плавающей точкой к ближайшему целому.

source: If the argument passed to ``floatformat`` is negative, it will round a number to that many decimal places -- but only if there's a decimal part to be displayed. For example:
ru: Если аргумент отрицательный, ``floatformat`` округляет до указанного количества знаков после запятой -- но дробная часть отображается только если существует. Например:

source: Using ``floatformat`` with no argument is equivalent to using ``floatformat`` with an argument of ``-1``.
ru: Использование ``floatformat`` без аргументов эквивалентно ``floatformat`` с ``-1``.

source: Applies HTML escaping to a string (see the :tfilter:`escape` filter for details). This filter is applied *immediately* and returns a new, escaped string. This is useful in the rare cases where you need multiple escaping or want to apply other filters to the escaped results. Normally, you want to use the :tfilter:`escape` filter.
ru: Применяет экранирование HTML к строке (смотрите :tfilter:`escape`). Это фильтр применяется *сразу* и возвращает новую экранированную строку. Это полезно в редких случаях, если вам необходимо применить экранирование несколько раз, или если необходимо применить другие фильтры в экранированной строке.

source: For example, if you want to catch the ``<p>`` HTML elements created by the :tfilter:`linebreaks` filter::
ru: например, если вы хотите экранировать тег ``<p>`` созданный фильтром :tfilter:`linebreaks`::

source: Given a whole number, returns the requested digit, where 1 is the right-most digit, 2 is the second-right-most digit, etc. Returns the original value for invalid input (if input or argument is not an integer, or if argument is less than 1). Otherwise, output is always an integer.
ru: Принимает число и возвращает запрашиваемую цифру, где 1 самая правая цифра, 2 - вторая справа, и тд. Возвращает оригинальное значение, если оно не верно (не число или меньше 1). В противном случае, всегда выводится целое число.

source: If ``value`` is ``123456789``, the output will be ``8``.
ru: Если ``value`` равно ``123456789``, будет выведено ``8``.

source: Converts an IRI (Internationalized Resource Identifier) to a string that is suitable for including in a URL. This is necessary if you're trying to use strings containing non-ASCII characters in a URL.
ru: Конвертирует IRI (Internationalized Resource Identifier) в строку, которая может быть использована в URL. Это необходимо, если вы хотите использовать не ASCII символы в URL.

source: It's safe to use this filter on a string that has already gone through the :tfilter:`urlencode` filter.
ru: Можно использовать этот фильтр после использования фильтра :tfilter:`urlencode`.

source: If ``value`` is ``"?test=1&me=2"``, the output will be ``"?test=1&amp;me=2"``.
ru: Если ``value`` равно ``"?test=1&me=2"``, вывод будет ``"?test=1&amp;me=2"``.

source: Joins a list with a string, like Python's ``str.join(list)``
ru: Объединяет список, используя указанную строку, аналог ``str.join(list)`` в Python

source: If ``value`` is the list ``['a', 'b', 'c']``, the output will be the string ``"a // b // c"``.
ru: Если ``value`` равно списку ``['a', 'b', 'c']``, вывод будет ``"a // b // c"``.

source: Returns the last item in a list.
ru: Возвращает последний элемент списка.

source: If ``value`` is the list ``['a', 'b', 'c', 'd']``, the output will be the string ``"d"``.
ru: Если ``value`` равно ``['a', 'b', 'c', 'd']``, выведет ``"d"``.

source: Returns the length of the value. This works for both strings and lists.
ru: Возвращает размер значения. Работает для строк и списков.

source: If ``value`` is ``['a', 'b', 'c', 'd']`` or ``"abcd"``, the output will be ``4``.
ru: Если ``value`` равно ``['a', 'b', 'c', 'd']`` или ``"abcd"``, выведет ``4``.

source: Returns ``True`` if the value's length is the argument, or ``False`` otherwise.
ru: Возвращает ``True``, если размер значения равен аргументу, и ``False`` в противном случае.

source: If ``value`` is ``['a', 'b', 'c', 'd']`` or ``"abcd"``, the output will be ``True``.
ru: Если ``value`` равно ``['a', 'b', 'c', 'd']`` или ``"abcd"``, вернет ``True``.

source: Replaces line breaks in plain text with appropriate HTML; a single newline becomes an HTML line break (``<br />``) and a new line followed by a blank line becomes a paragraph break (``</p>``).
ru: Заменяет переносы строки аналогами из HTML; один перенос строки будет заменен на ``<br />``, новая строка с предыдущей пустой строкой оборачиваются в тег ``</p>``.

source: If ``value`` is ``Joel\nis a slug``, the output will be ``<p>Joel<br />is a slug</p>``.
ru: Если ``value`` равно ``Joel\nis a slug``, вывод будет ``<p>Joel<br />is a slug</p>``.

source: Converts all newlines in a piece of plain text to HTML line breaks (``<br />``).
ru: Заменяет все переносы строки на ``<br />``.

source: If ``value`` is ``Joel\nis a slug``, the output will be ``Joel<br />is a slug``.
ru: Если ``value`` равно ``Joel\nis a slug``, вывод будет ``Joel<br />is a slug``.

source: Displays text with line numbers.
ru: Отображает текст с номерами строк.

source: If ``value`` is::
ru: Если ``value`` равно::

source: the output will be::
ru: вернет::

source: Left-aligns the value in a field of a given width.
ru: Выравнивает значение влево в поле указанной ширины.

source: **Argument:** field size
ru: **Аргумент:** размер поля

source: If ``value`` is ``Django``, the output will be ``"Django "``.
ru: Если ``value`` равно ``Django``, выведет ``"Django "``.

source: Converts a string into all lowercase.
ru: Конвертирует строку в нижний регистр.

source: If ``value`` is ``Totally LOVING this Album!``, the output will be ``totally loving this album!``.
ru: Если ``value`` равно ``Totally LOVING this Album!``, вывод будет ``totally loving this album!``.

source: If ``value`` is the string ``"Joel"``, the output would be the list ``['J', 'o', 'e', 'l']``. If ``value`` is ``123``, the output will be the list ``['1', '2', '3']``.
ru: Если ``value`` равно строке ``"Joel"``, будет возвращен список ``['J', 'o', 'e', 'l']``. Если ``value`` равно ``123``, вернет список ``['1', '2', '3']``.

source: Converts a phone number (possibly containing letters) to its numerical equivalent.
ru: Преобразует телефонный номер (возможно, содержащий буквы) в его числовой эквивалент.

source: The input doesn't have to be a valid phone number. This will happily convert any string.
ru: Значение не должно быть правильным телефонным номером, будет преобразована любая строка.

source: If ``value`` is ``800-COLLECT``, the output will be ``800-2655328``.
ru: Если ``value`` равно ``800-COLLECT``, выведет ``800-2655328``.

source: Returns a plural suffix if the value is not 1. By default, this suffix is ``'s'``.
ru: Возвращает суффикс множественного числа, если значение не 1. По умолчанию использует суффикс ``'s'``.

source: If ``num_messages`` is ``1``, the output will be ``You have 1 message.`` If ``num_messages`` is ``2`` the output will be ``You have 2 messages.``
ru: Если ``num_messages`` равно ``1``, выведет ``You have 1 message.`` Если ``num_messages`` равно ``2`` выведет ``You have 2 messages.``

source: For words that require a suffix other than ``'s'``, you can provide an alternate suffix as a parameter to the filter.
ru: Для слов, которые используют суффикс отличный от ``'s'``, вы можете указать его как аргумент.

source: For words that don't pluralize by simple suffix, you can specify both a singular and plural suffix, separated by a comma.
ru: Для слов, которые не преобразуются в множественную форму добавлением суффикса, вы можете указать как одинарный так и множественный суффиксы, разделенные запятыми.

source: Use :ttag:`blocktrans` to pluralize translated strings.
ru: Используйте :ttag:`blocktrans` для переводимых строк.

source: A wrapper around :func:`pprint.pprint` -- for debugging, really.
ru: "Обёртка" для :func:`pprint.pprint` -- используется для отладки.

source: Returns a random item from the given list.
ru: Возвращает случайный элемент из списка.

source: If ``value`` is the list ``['a', 'b', 'c', 'd']``, the output could be ``"b"``.
ru: Если ``value`` равно ``['a', 'b', 'c', 'd']``, вернет ``"b"``.

source: Right-aligns the value in a field of a given width.
ru: Выравнивает значение вправо в поле указанной ширины.

source: If ``value`` is ``Django``, the output will be ``" Django"``.
ru: Если ``value`` равно ``Django``, вернет ``" Django"``.

source: Marks a string as not requiring further HTML escaping prior to output. When autoescaping is off, this filter has no effect.
ru: Помечает строку, как не требующую последующего HTML экранирования. Если авто-экранирование отключено, этот фильтр ничего не изменит.

source: Applies the :tfilter:`safe` filter to each element of a sequence. Useful in conjunction with other filters that operate on sequences, such as :tfilter:`join`. For example::
ru: Применяет фильтр :tfilter:`safe` к каждому элементу последовательности. Полезно применять с другими тегами, работающими с последовательностями, такими как :tfilter:`join`. Например::

source: You couldn't use the :tfilter:`safe` filter directly in this case, as it would first convert the variable into a string, rather than working with the individual elements of the sequence.
ru: Вы не можете использовать фильтр :tfilter:`safe` в таком случае, так как он сначала преобразует значение в строку.

source: Returns a slice of the list.
ru: Возвращает срез списка.

source: Uses the same syntax as Python's list slicing. See http://www.diveintopython3.net/native-datatypes.html#slicinglists for an introduction.
ru: Используйте синтаксис срезов Python. Смотрите http://www.diveintopython3.net/native-datatypes.html#slicinglists.

source: If ``some_list`` is ``['a', 'b', 'c']``, the output will be ``['a', 'b']``.
ru: Если ``some_list`` равно ``['a', 'b', 'c']``, вернет ``['a', 'b']``.

source: Converts to ASCII. Converts spaces to hyphens. Removes characters that aren't alphanumerics, underscores, or hyphens. Converts to lowercase. Also strips leading and trailing whitespace.
ru: Конвертирует в ASCII. Преобразует пробелы в дефисы. Удаляет нетекстовые символы (все кроме букв, цифр, дефиса и символа подчеркивания). Удаляет пробелы в начале и в конце строки.

source: If ``value`` is ``"Joel is a slug"``, the output will be ``"joel-is-a-slug"``.
ru: Если ``value`` равно ``"Joel is a slug"``, вернет ``"joel-is-a-slug"``.

source: If ``value`` is ``10``, the output will be ``1.000000E+01``.
ru: Если ``value`` равно ``10``, будет выведено ``1.000000E+01``.

source: Makes all possible efforts to strip all [X]HTML tags.
ru: Пытается удалить все [X]HTML теги.

source: If ``value`` is ``"<b>Joel</b> <button>is</button> a <span>slug</span>"``, the output will be ``"Joel is a slug"``.
ru: Если ``value`` равно ``"<b>Joel</b> <button>is</button> a <span>slug</span>"``, выведет ``"Joel is a slug"``.

source: No safety guarantee
ru: Безопасность не гарантируется

source: Note that ``striptags`` doesn't give any guarantee about its output being HTML safe, particularly with non valid HTML input. So **NEVER** apply the ``safe`` filter to a ``striptags`` output. If you are looking for something more robust, you can use the ``bleach`` Python library, notably its `clean`_ method.
ru: Обратите внимание ``striptags`` не гарантирует, что результат будет безопасным для вставки в HTML, особенно при передаче неправильного HTML. По этому, если данные передаются пользователем, **НИКОГДА** не применяйте фильтр ``safe`` к результату ``striptags``. Если вам нужна более надежная проверка, используйте библиотеку ``bleach`` Python, а точнее метод `clean <http://bleach.readthedocs.org/en/latest/clean.html>`_.
