Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/ref/templates/builtins.po
Languages: ru

source: Formats a time according to the given format.
ru: Форматирует время в соответствии с указанным форматом.

source: Given format can be the predefined one :setting:`TIME_FORMAT`, or a custom format, same as the :tfilter:`date` filter. Note that the predefined format is locale-dependent.
ru: Можно использовать предопределенный :setting:`TIME_FORMAT`, или собственный формат аналогичный формату описанному в :tfilter:`date`. Заметим, что предопределенный формат зависит от текущего языка.

source: If ``value`` is equivalent to ``datetime.datetime.now()``, the output will be the string ``"01:23"``.
ru: Если ``value`` равно ``datetime.datetime.now()``, может вернуть ``"01:23"``.

source: Another example:
ru: Другой пример:

source: Assuming that :setting:`USE_L10N` is ``True`` and :setting:`LANGUAGE_CODE` is, for example, ``"de"``, then for::
ru: Предположим :setting:`USE_L10N` равно ``True`` и :setting:`LANGUAGE_CODE` равно ``"de"``, тогда::

source: The ``time`` filter will only accept parameters in the format string that relate to the time of day, not the date (for obvious reasons). If you need to format a ``date`` value, use the :tfilter:`date` filter instead (or along ``time`` if you need to render a full :py:class:`~datetime.datetime` value).
ru: Фильтр ``time`` принимает только строку формата, который относится к времени, а не дате (по понятным причинам). Если вам нужно отформатировать дату, используйте фильтр :tfilter:`date` (или вместе с ``time``, если необходимо вывести полное значение :py:class:`~datetime.datetime`).

source: There is one exception the above rule: When passed a ``datetime`` value with attached timezone information (a :ref:`time-zone-aware <naive_vs_aware_datetimes>` ``datetime`` instance) the ``time`` filter will accept the timezone-related :ref:`format specifiers <date-and-time-formatting-specifiers>` ``'e'``, ``'O'`` , ``'T'`` and ``'Z'``.
ru: Есть одно исключение: если передано значение ``datetime`` с указанным часовым поясом (:ref:`time-zone-aware <naive_vs_aware_datetimes>` ``datetime`` объект) фильтр ``time`` принимает :ref:`параметры форматирования <date-and-time-formatting-specifiers>` для часового пояса, такие как ``'e'``, ``'O'`` , ``'T'`` и ``'Z'``.

source: Formats a date as the time since that date (e.g., "4 days, 6 hours").
ru: Форматирует дату как время прошедшее с момента другой даты (например, "4 days, 6 hours").

source: Takes an optional argument that is a variable containing the date to use as the comparison point (without the argument, the comparison point is *now*). For example, if ``blog_date`` is a date instance representing midnight on 1 June 2006, and ``comment_date`` is a date instance for 08:00 on 1 June 2006, then the following would return "8 hours"::
ru: Принимает необязательный аргумент -- дату, используемую как точку отсчета (без аргументов используется *текущее время*). Например, если ``blog_date`` это дата, равная полночи 1 июня 2006, и ``comment_date`` равен 08:00, 1 июня 2006, тогда следующий код вернет "8 часов"::

source: Comparing offset-naive and offset-aware datetimes will return an empty string.
ru: Сравнение абсолютной(с временной зоной) и относительной(без временной зоны) дат вернет пустую строку.

source: Minutes is the smallest unit used, and "0 minutes" will be returned for any date that is in the future relative to the comparison point.
ru: Минута - самая малая единица измерения, и для дат из будущего, относительно точки сравнения, возвращается "0 минут" .

source: Similar to ``timesince``, except that it measures the time from now until the given date or datetime. For example, if today is 1 June 2006 and ``conference_date`` is a date instance holding 29 June 2006, then ``{{ conference_date|timeuntil }}`` will return "4 weeks".
ru: Аналогичен ``timesince``, только определяет время от текущей даты до указанной. Например, если сегодня 1 июня 2006 и ``conference_date`` это дата 29 июня 2006, тогда ``{{ conference_date|timeuntil }}`` вернет "4 недели".

source: Takes an optional argument that is a variable containing the date to use as the comparison point (instead of *now*). If ``from_date`` contains 22 June 2006, then the following will return "1 week"::
ru: Принимает необязательный аргумент -- дату, используемую как точку отсчета (вместо *текущего времени*). Если ``from_date`` содержит 22 июня 2006, тогда следующий код вернёт "1 неделя"::

source: Minutes is the smallest unit used, and "0 minutes" will be returned for any date that is in the past relative to the comparison point.
ru: Минута - самая малая единица измерения, и для дат из прошлого, относительно точки сравнения, возвращается "0 минут" .

source: Converts a string into titlecase by making words start with an uppercase character and the remaining characters lowercase. This tag makes no effort to keep "trivial words" in lowercase.
ru: Преобразует первый символ слов в верхний регистр, остальные в нижний.

source: If ``value`` is ``"my FIRST post"``, the output will be ``"My First Post"``.
ru: Если ``value`` равно ``"my FIRST post"``, вернет ``"My First Post"``.

source: Truncates a string if it is longer than the specified number of characters. Truncated strings will end with a translatable ellipsis sequence ("...").
ru: Обрезает строку до указанной длины. Обрезанная строка будет оканчиваться троеточием("...").

source: **Argument:** Number of characters to truncate to
ru: **Аргумент:** длина строки в символах

source: If ``value`` is ``"Joel is a slug"``, the output will be ``"Joel i..."``.
ru: Если ``value`` равно ``"Joel is a slug"``, вернет ``"Joel i..."``.

source: Similar to :tfilter:`truncatechars`, except that it is aware of HTML tags. Any tags that are opened in the string and not closed before the truncation point are closed immediately after the truncation.
ru: Аналогичен :tfilter:`truncatechars`, но учитывает наличие HTML-тегов. Теги, которые остались открыты в строке после обрезания, будут немедленно закрыты.

source: If ``value`` is ``"<p>Joel is a slug</p>"``, the output will be ``"<p>Joel i...</p>"``.
ru: Если ``value`` равно ``"<p>Joel is a slug</p>"``, вернет ``"<p>Joel i...</p>"``.

source: Newlines in the HTML content will be preserved.
ru: Символы новой строки в содержимом будут сохранены.

source: Truncates a string after a certain number of words.
ru: Обрезает строку после указанного количества слов.

source: **Argument:** Number of words to truncate after
ru: **Аргумент:** количество слов в строке

source: If ``value`` is ``"Joel is a slug"``, the output will be ``"Joel is ..."``.
ru: Если ``value`` равно ``"Joel is a slug"``, вернет ``"Joel is ..."``.

source: Newlines within the string will be removed.
ru: Переносы строки будут удалены.

source: Similar to :tfilter:`truncatewords`, except that it is aware of HTML tags. Any tags that are opened in the string and not closed before the truncation point, are closed immediately after the truncation.
ru: Аналогичен :tfilter:`truncatewords`, но учитывает наличие HTML-тегов. Теги, которые остались открыты в строке после обрезания, будут немедленно закрыты.

source: This is less efficient than :tfilter:`truncatewords`, so should only be used when it is being passed HTML text.
ru: Этот фильтр менее эффективен, чем :tfilter:`truncatewords`, используйте его только с HTML-текстом.

source: If ``value`` is ``"<p>Joel is a slug</p>"``, the output will be ``"<p>Joel is ...</p>"``.
ru: Если ``value`` равно ``"<p>Joel is a slug</p>"``, вернет ``"<p>Joel is ...</p>"``.

source: Recursively takes a self-nested list and returns an HTML unordered list -- WITHOUT opening and closing <ul> tags.
ru: Принимает вложенный список и возвращает неупорядоченный HTML список -- БЕЗ открывающего и закрывающего <ul> тегов.

source: The list is assumed to be in the proper format. For example, if ``var`` contains ``['States', ['Kansas', ['Lawrence', 'Topeka'], 'Illinois']]``, then ``{{ var|unordered_list }}`` would return::
ru: Предполагается, что список находится в нужном формате. Например, если ``var`` равен ``['States', ['Kansas', ['Lawrence', 'Topeka'], 'Illinois']]``, тогда ``{{ var|unordered_list }}`` вернет::

source: Converts a string into all uppercase.
ru: Конвертирует строку в верхний регистр

source: If ``value`` is ``"Joel is a slug"``, the output will be ``"JOEL IS A SLUG"``.
ru: Если ``value`` равно ``"Joel is a slug"``, будет возвращено ``"JOEL IS A SLUG"``.

source: Escapes a value for use in a URL.
ru: Экранирует значение для безопасного использования в URL.

source: If ``value`` is ``"https://www.example.org/foo?a=b&c=d"``, the output will be ``"https%3A//www.example.org/foo%3Fa%3Db%26c%3Dd"``.
ru: Если ``value`` равно ``"https://www.example.org/foo?a=b&c=d"``, будет возвращено ``"https%3A//www.example.org/foo%3Fa%3Db%26c%3Dd"``.

source: An optional argument containing the characters which should not be escaped can be provided.
ru: Используй необязательный аргумент, можно указать символы, который не должны быть экранированы.

source: If not provided, the '/' character is assumed safe. An empty string can be provided when *all* characters should be escaped. For example::
ru: Если аргумент не указан, символ '/' предполагается как безопасный символ. Если необходимо экранировать *все* символы, передайте пустую строку. Например::

source: If ``value`` is ``"https://www.example.org/"``, the output will be ``"https%3A%2F%2Fwww.example.org%2F"``.
ru: Если ``value`` равно ``"https://www.example.org/"``, будет возвращено ``"https%3A%2F%2Fwww.example.org%2F"``.

source: Converts URLs and email addresses in text into clickable links.
ru: Конвертирует URL-ы и email-ы в тексте в "кликабельные" ссылки.

source: This template tag works on links prefixed with ``http://``, ``https://``, or ``www.``. For example, ``https://goo.gl/aia1t`` will get converted but ``goo.gl/aia1t`` won't.
ru: Этот тег конвертирует ссылки с префиксами ``http://``, ``https://``, или ``www.``. Например, ``https://goo.gl/aia1t`` будет конвертирован, ``goo.gl/aia1t`` -- нет.

source: It also supports domain-only links ending in one of the original top level domains (``.com``, ``.edu``, ``.gov``, ``.int``, ``.mil``, ``.net``, and ``.org``). For example, ``djangoproject.com`` gets converted.
ru: Поддерживаются ссылки состоящие только из домена и заканчивающиеся на один из первоначальных доменов первого уровня (``.com``, ``.edu``, ``.gov``, ``.int``, ``.mil``, ``.net``, and ``.org``). Например, ``djangoproject.com`` будет преобразован.

source: Links can have trailing punctuation (periods, commas, close-parens) and leading punctuation (opening parens), and ``urlize`` will still do the right thing.
ru: Ссылки могут быть с завершающей пунктуацией (точка, запятая, закрывающая скобка) и предшествующей пунктуацией (открывающая скобка), ``urlize`` все корректно преобразует.

source: Links generated by ``urlize`` have a ``rel="nofollow"`` attribute added to them.
ru: Ссылки, созданные ``urlize`` содержат атрибут ``rel="nofollow"``.

source: If ``value`` is ``"Check out www.djangoproject.com"``, the output will be ``"Check out <a href="http://www.djangoproject.com" rel="nofollow">www.djangoproject.com</a>"``.
ru: Если ``value`` равно ``"Check out www.djangoproject.com"``, будет выведено ``"Check out <a href="http://www.djangoproject.com" rel="nofollow">www.djangoproject.com</a>"``.

source: In addition to web links, ``urlize`` also converts email addresses into ``mailto:`` links. If ``value`` is ``"Send questions to foo@example.com"``, the output will be ``"Send questions to <a href="mailto:foo@example.com">foo@example.com</a>"``.
ru: В дополнение к обычным ссылкам, ``urlize`` также преобразует email-ы в ссылки с ``mailto:``. Если ``value`` содержит ``"Send questions to foo@example.com"``, результат будет ``"Send questions to <a href="mailto:foo@example.com">foo@example.com</a>"``.

source: The ``urlize`` filter also takes an optional parameter ``autoescape``. If ``autoescape`` is ``True``, the link text and URLs will be escaped using Django's built-in :tfilter:`escape` filter. The default value for ``autoescape`` is ``True``.
ru: Фильтр ``urlize`` принимает необязательный аргумент ``autoescape``. Если ``autoescape`` равен ``True``, текст ссылки и URL будут экранированы с помощью фильтра :tfilter:`escape`. Значение по-умолчанию для ``autoescape`` равно ``True``.

source: If ``urlize`` is applied to text that already contains HTML markup, things won't work as expected. Apply this filter only to plain text.
ru: Если применить ``urlize`` к тексту, который содержит HTML, результат будет неверным. Применяйте фильтр только к обычному тексту.

source: Converts URLs and email addresses into clickable links just like urlize_, but truncates URLs longer than the given character limit.
ru: Преобразует URL-ы в ссылки как и urlize_, но обрезает название ссылок длиннее указанного предела.

source: **Argument:** Number of characters that link text should be truncated to, including the ellipsis that's added if truncation is necessary.
ru: **Аргумент:** Максимальное количество символов в названии ссылки, включая многоточие, добавленное при обрезании текста.

source: If ``value`` is ``"Check out www.djangoproject.com"``, the output would be ``'Check out <a href="http://www.djangoproject.com" rel="nofollow">www.djangopr...</a>'``.
ru: Если ``value`` равно ``"Check out www.djangoproject.com"``, вернет ``'Check out <a href="http://www.djangoproject.com" rel="nofollow">www.djangopr...</a>'``.

source: As with urlize_, this filter should only be applied to plain text.
ru: Как и urlize_, фильтр следует применять к обычному тексту.

source: Returns the number of words.
ru: Возвращает количество слов.

source: If ``value`` is ``"Joel is a slug"``, the output will be ``4``.
ru: Если ``value`` равно ``"Joel is a slug"``, вернет ``4``.

source: Wraps words at specified line length.
ru: "Оборачивает" слова до указанной длины строки.

source: **Argument:** number of characters at which to wrap the text
ru: **Аргумент:** количество символов в строке

source: If ``value`` is ``Joel is a slug``, the output would be::
ru: Если ``value`` равно ``Joel is a slug``, вернет::

source: Maps values for ``True``, ``False``, and (optionally) ``None``, to the strings "yes", "no", "maybe", or a custom mapping passed as a comma-separated list, and returns one of those strings according to the value:
ru: Для ``True``, ``False`` и (опционально) ``None`` выводит строки "yes", "no", "maybe", или другие, переданные как список значений, разделенный запятыми:

source: Value
ru: Значение

source: ``no`` (converts ``None`` to ``False`` if no mapping for ``None`` is given)
ru: ``no`` (конвертирует ``None`` в ``False``, если значение для ``None`` не указано)

source: Internationalization tags and filters
ru: Теги и фильтры для интернационализация

source: Django provides template tags and filters to control each aspect of :doc:`internationalization </topics/i18n/index>` in templates. They allow for granular control of translations, formatting, and time zone conversions.
ru: Django предоставляет теги и фильтры для управления :doc:`интернационализацией </topics/i18n/index>` в шаблонах. Они предоставляют контроль за переводом, форматированием и преобразованием часового пояса.

source: This library allows specifying translatable text in templates. To enable it, set :setting:`USE_I18N` to ``True``, then load it with ``{% load i18n %}``.
ru: Эта библиотека позволяет определять переводимый текст в шаблонах. Для включения установите настройку :setting:`USE_I18N` в ``True``, потом загрузите библиотеку, добавив ``{% load i18n %}`` в шаблон.

source: See :ref:`specifying-translation-strings-in-template-code`.
ru: Смотрите :ref:`specifying-translation-strings-in-template-code`.

source: This library provides control over the localization of values in templates. You only need to load the library using ``{% load l10n %}``, but you'll often set :setting:`USE_L10N` to ``True`` so that localization is active by default.
ru: Эта библиотека предоставляет контроль за локализацией значений в шаблонах. Просто загрузите библиотеку ``{% load l10n %}``. Если установить :setting:`USE_L10N` в ``True``, локализация будет активна по-умолчанию.

source: See :ref:`topic-l10n-templates`.
ru: Смотрите :ref:`topic-l10n-templates`.

source: This library provides control over time zone conversions in templates. Like ``l10n``, you only need to load the library using ``{% load tz %}``, but you'll usually also set :setting:`USE_TZ` to ``True`` so that conversion to local time happens by default.
ru: Эта библиотека предоставляет возможность преобразовывать временные зоны в шаблонах. Как и ``l10n``, просто загрузите библиотеку ``{% load tz %}``. Но если установить :setting:`USE_TZ` в ``True``, преобразование в локальное время будет происходить автоматически.

source: See :ref:`time-zones-in-templates`.
ru: Смотрите :ref:`time-zones-in-templates`.

source: Other tags and filters libraries
ru: Другие библиотеки тегов и фильтров

source: Django comes with a couple of other template-tag libraries that you have to enable explicitly in your :setting:`INSTALLED_APPS` setting and enable in your template with the :ttag:`{% load %}<load>` tag.
ru: Django содержит несколько других библиотек тегов. Чтобы их использовать, добавьте приложение в :setting:`INSTALLED_APPS` и загрузите библиотеку тегом :ttag:`{% load %}<load>`.

source: A set of Django template filters useful for adding a "human touch" to data. See :doc:`/ref/contrib/humanize`.
ru: Набор фильтров для добавления "человечности" вашим данным. Смотрите :doc:`/ref/contrib/humanize`.

source: You should prefer the :ttag:`static` template tag, but if you need more control over exactly where and how :setting:`STATIC_URL` is injected into the template, you can use the :ttag:`get_static_prefix` template tag::
ru: Лучше использовать :ttag:`static`, но, если вам необходимо больше контроля, где и как использовать :setting:`STATIC_URL` в шаблоне, применяйте тег :ttag:`get_static_prefix`::

source: There's also a second form you can use to avoid extra processing if you need the value multiple times::
ru: Есть другой способ, который позволяет использовать значение в шаблоне несколько раз::

source: Similar to the :ttag:`get_static_prefix`, ``get_media_prefix`` populates a template variable with the media prefix :setting:`MEDIA_URL`, e.g.::
ru: Подобно :ttag:`get_static_prefix`, ``get_media_prefix`` предоставляет префикс медиа-файлов :setting:`MEDIA_URL`, например::

source: By storing the value in a data attribute, we ensure it's escaped appropriately if we want to use it in a JavaScript context.
ru: Сохранив значение в атрибуте ``data``, мы можем использовать его в JavaScript и быть уверенными, что это значение правильно экранировано и безопасно.
