Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/ref/templates/builtins.po
Languages: ru

source: If you want to render the context only with the variables provided (or even no variables at all), use the ``only`` option. No other variables are available to the included template::
ru: Если вы хотите выполнить шаблон используя только указанные переменные в контексте (или не используя переменные совсем), добавите параметр ``only``. Другие переменные не будут доступны в включаемом шаблоне::

source: If the included template causes an exception while it's rendered (including if it's missing or has syntax errors), the behavior varies depending on the :class:`template engine's <django.template.Engine>` ``debug`` option (if not set, this option defaults to the value of :setting:`DEBUG`). When debug mode is turned on, an exception like :exc:`~django.template.TemplateDoesNotExist` or :exc:`~django.template.TemplateSyntaxError` will be raised. When debug mode is turned off, ``{% include %}`` logs a warning to the ``django.template`` logger with the exception that happens while rendering the included template and returns an empty string.
ru: Если включаемый шаблон вызвал исключение (шаблон не найден, или содержит синтаксические ошибки), поведение зависит от опции ``debug`` :class:`шаблонизатора <django.template.Engine>` (если не указан, по умолчанию равна :setting:`DEBUG`). В режиме отладки будут вызваны исключения :exc:`~django.template.TemplateDoesNotExist` или :exc:`~django.template.TemplateSyntaxError`. При выключенном режиме отладки ``{% include %}`` запишет предупреждение с полученной ошибкой в логгер ``django.template`` и вернет пустую строку.

source: The :ttag:`include` tag should be considered as an implementation of "render this subtemplate and include the HTML", not as "parse this subtemplate and include its contents as if it were part of the parent". This means that there is no shared state between included templates -- each include is a completely independent rendering process.
ru: Тег :ttag:`include` должен восприниматься как "выполним этот под-шаблон и включим полученный HTML", а не "парсим этот под-шаблон и включаем его как часть родительского". Это означает, что нет никакого общего состояния между включенными шаблонами -- каждое включение это полностью независимый процесс.

source: Blocks are evaluated *before* they are included. This means that a template that includes blocks from another will contain blocks that have *already been evaluated and rendered* - not blocks that can be overridden by, for example, an extending template.
ru: Блоки выполняются *перед* включение шаблона. Это означает, что шаблон включает *уже выполненные и отрендеренные блоки* - вы не можете переопределить эти блоки, как это делается при наследовании шаблонов.

source: Loads a custom template tag set.
ru: Загружает библиотеку тегов.

source: For example, the following template would load all the tags and filters registered in ``somelibrary`` and ``otherlibrary`` located in package ``package``::
ru: Например, следующий шаблон загрузил бы все теги и фильтры зарегистрированные в ``somelibrary`` и ``otherlibrary`` который находится в пакете ``package``::

source: You can also selectively load individual filters or tags from a library, using the ``from`` argument. In this example, the template tags/filters named ``foo`` and ``bar`` will be loaded from ``somelibrary``::
ru: Вы можете загрузить определенные теги и фильтры из библиотеки, используя аргумент ``from``. В этом примере, шаблонные теги/фильтры ``foo`` и ``bar`` будут загружены с ``somelibrary``::

source: See :doc:`Custom tag and filter libraries </howto/custom-template-tags>` for more information.
ru: Смотрите раздел о :doc:`собственных библиотеках фильтров и тегов </howto/custom-template-tags>`.

source: Displays random "lorem ipsum" Latin text. This is useful for providing sample data in templates.
ru: Выводит случайный "lorem ipsum" текст. Полезен для генерации примера данных в шаблоне.

source: Usage::
ru: Использование::

source: The ``{% lorem %}`` tag can be used with zero, one, two or three arguments. The arguments are:
ru: Тег ``{% lorem %}`` принимает несколько аргументов:

source: Argument
ru: Аргумент

source: A number (or variable) containing the number of paragraphs or words to generate (default is 1).
ru: Количество параграфов или слов в сгенерированном тесте (по умолчанию 1).

source: Either ``w`` for words, ``p`` for HTML paragraphs or ``b`` for plain-text paragraph blocks (default is ``b``).
ru: Принимает ``w`` для слов, ``p`` -- для HTML параграфов, или ``b`` -- для текстовых параграфов (по умолчанию ``b``).

source: The word ``random``, which if given, does not use the common paragraph ("Lorem ipsum dolor sit amet...") when generating text.
ru: Если передать слово ``random``, не будет использоваться стандартный текст ("Lorem ipsum dolor sit amet...") при генерации текста.

source: Examples:
ru: Примеры::

source: ``{% lorem %}`` will output the common "lorem ipsum" paragraph.
ru: ``{% lorem %}`` выведет обычный параграф "lorem ipsum".

source: ``{% lorem 3 p %}`` will output the common "lorem ipsum" paragraph and two random paragraphs each wrapped in HTML ``<p>`` tags.
ru: ``{% lorem 3 p %}`` выведет обычный параграф "lorem ipsum" и два случайных параграфа, обернутые в HTML тег ``<p>``.

source: ``{% lorem 2 w random %}`` will output two random Latin words.
ru: ``{% lorem 2 w random %}`` выведет два случайных слова на латыни.

source: Displays the current date and/or time, using a format according to the given string. Such string can contain format specifiers characters as described in the :tfilter:`date` filter section.
ru: Отображает текущую дату и/или время, используя формат соответственно переданной строке. Эта строка может содержать символы форматирования описанные в разделе о фильтре :tfilter:`date`.

source: Example::
ru: Например::

source: Note that you can backslash-escape a format string if you want to use the "raw" value. In this example, both "o" and "f" are backslash-escaped, because otherwise each is a format string that displays the year and the time, respectively::
ru: Вы можете экранировать символ форматирования с помощью слэша и использовать его как строку. В этом примере, "o" и "f" экранированы, т.к. иначе они будут использованы как строки форматирования, отображающие год и время::

source: This would display as "It is the 4th of September".
ru: Этот пример выведет "It is the 4th of September".

source: You can also use the syntax ``{% now "Y" as current_year %}`` to store the output (as a string) inside a variable. This is useful if you want to use ``{% now %}`` inside a template tag like :ttag:`blocktrans` for example::
ru: Вы также можете использовать синтаксис ``{% now "Y" as current_year %}``, чтобы сохранить результат в переменной. Это может быть полезно при использовании ``{% now %}`` в теге :ttag:`blocktrans`::

source: Regroups a list of alike objects by a common attribute.
ru: Группирует объекты по общему атрибуту.

source: ...and you'd like to display a hierarchical list that is ordered by country, like this:
ru: ...и вам нужно отобразить список, отсортированный по стране, вот так:

source: India
ru: Индия

source: Mumbai: 19,000,000
ru: Мамбай: 19,000,000

source: Calcutta: 15,000,000
ru: Калькутта: 15,000,000

source: USA
ru: США

source: New York: 20,000,000
ru: Нью Йорк: 20,000,000

source: Chicago: 7,000,000
ru: Чикаго: 7,000,000

source: Japan
ru: Япония

source: Tokyo: 33,000,000
ru: Токио: 33,000,000

source: You can use the ``{% regroup %}`` tag to group the list of cities by country. The following snippet of template code would accomplish this::
ru: Вы можете использовать тег ``{% regroup %}``, чтобы сгруппировать список городов по странам. Следующий пример шаблонного кода делает это::

source: Let's walk through this example. ``{% regroup %}`` takes three arguments: the list you want to regroup, the attribute to group by, and the name of the resulting list. Here, we're regrouping the ``cities`` list by the ``country`` attribute and calling the result ``country_list``.
ru: Давайте изучим этот пример. ``{% regroup %}`` принимает три аргумента: список, который вы хотите перегруппировать; атрибут, по которому нужно сгруппировать, и название переменной с результатами. В этом примере, мы перегруппируем список ``cities`` по атрибуту ``country`` и используем результат ``country_list``.

source: ``grouper`` -- the item that was grouped by (e.g., the string "India" or "Japan").
ru: ``grouper`` -- значение, по которому происходила группировка (например, строка "Индия" или "Япония").

source: ``list`` -- a list of all items in this group (e.g., a list of all cities with country='India').
ru: ``list`` -- список объектов в группе (например, список всех городов с ``country='India'``).

source: Note that ``{% regroup %}`` does not order its input! Our example relies on the fact that the ``cities`` list was ordered by ``country`` in the first place. If the ``cities`` list did *not* order its members by ``country``, the regrouping would naively display more than one group for a single country. For example, say the ``cities`` list was set to this (note that the countries are not grouped together):
ru: Следует отметить, что ``{% regroup %}`` не сортирует переданный список! Наш пример опирается на тот факт, что список ``cities`` был изначально отсортирован по ``country``. Если элементы списка ``cities`` *не* были бы отсортированы по ``country``, перегруппировка отобразила бы несколько групп для одной страны. Например, список ``cities`` был таким (заметьте, что страны не сгруппированы вместе):

source: With this input for ``cities``, the example ``{% regroup %}`` template code above would result in the following output:
ru: В результате применения тега ``{% regroup %}`` для списка выше получим такой результат:

source: The easiest solution to this gotcha is to make sure in your view code that the data is ordered according to how you want to display it.
ru: Самый простой способ решить эту проблему - удостовериться, что данные отсортированы так, как должны быть отображены.

source: Another solution is to sort the data in the template using the :tfilter:`dictsort` filter, if your data is in a list of dictionaries::
ru: Еще один способ отсортировать в шаблоне, используя фильтр :tfilter:`dictsort`, если ваши данные это список словарей::

source: Grouping on other properties
ru: Группировка по другим свойствам

source: Any valid template lookup is a legal grouping attribute for the regroup tag, including methods, attributes, dictionary keys and list items. For example, if the "country" field is a foreign key to a class with an attribute "description," you could use::
ru: Можно группировать объекты по методу, атрибуту, ключу словаря и списку объектов, в общем по всему, к чему можно получить доступ в шаблоне. Например, если "country" является внешним ключом на модель с атрибутом "description," вы можете использовать::

source: Or, if ``country`` is a field with ``choices``, it will have a :meth:`~django.db.models.Model.get_FOO_display` method available as an attribute, allowing you to group on the display string rather than the ``choices`` key::
ru: Или, если ``country`` является полем с ``choices``, будет доступен метод :meth:`django.db.models.Model.get_FOO_display` позволяя сгруппировать по отображаемым названиям, а не значениям ``choices``::

source: ``{{ country.grouper }}`` will now display the value fields from the ``choices`` set rather than the keys.
ru: ``{{ country.grouper }}`` теперь будет отображать значение поля, а не ключи ``choices``.

source: Example usage::
ru: Пример использования::

source: This example would return this HTML::
ru: Этот пример вернет такой HTML::

source: Removes whitespace between HTML tags. This includes tab characters and newlines.
ru: Убирает пробелы между HTML тегами, включая символы табуляции и перенос строки.

source: Only space between *tags* is removed -- not space between tags and text. In this example, the space around ``Hello`` won't be stripped::
ru: Будут удалены пробелы только между *тегами*, и оставит между тегами и текстом. В этом примере пробелы вокруг ``Hello`` не будут удалены::

source: Outputs one of the syntax characters used to compose template tags.
ru: Выводит один из символов, которые используются для определения тегов.

source: Since the template system has no concept of "escaping", to display one of the bits used in template tags, you must use the ``{% templatetag %}`` tag.
ru: Так как система шаблонов не поддерживает "экранирование", для отображения элементов синтаксиса необходимо использовать тег ``{% templatetag %}``.

source: The argument tells which template bit to output:
ru: Аргумент указывает, какой элемент синтаксиса отображать:

source: Outputs
ru: Вывод

source: Returns an absolute path reference (a URL without the domain name) matching a given view and optional parameters. Any special characters in the resulting path will be encoded using :func:`~django.utils.encoding.iri_to_uri`.
ru: Возвращает абсолютную ссылку (URL без имени домена) соответствующую указанному представлению с необязательными аргументами. Любые спецсимволы будут экранированы с помощью функции :func:`~django.utils.encoding.iri_to_uri`.

source: This is a way to output links without violating the DRY principle by having to hard-code URLs in your templates::
ru: Этот способ выводить ссылки без "хардкодинга" в шаблоне, чтобы не нарушать принцип DRY::

source: Do not mix both positional and keyword syntax in a single call. All arguments required by the URLconf should be present.
ru: Нельзя использовать и позиционные и именованные аргументы в одном теге. Все обязательные аргументы URLconf должны быть указаны.

source: For example, suppose you have a view, ``app_views.client``, whose URLconf takes a client ID (here, ``client()`` is a method inside the views file ``app_views.py``). The URLconf line might look like this:
ru: Например, мы имеем представление, ``app_views.client``, чей URLconf принимает ID клиента (``client()`` это метод в файле ``app_views.py``). URLconf может выглядеть таким образом:

source: If this app's URLconf is included into the project's URLconf under a path such as this:
ru: Если URLconf приложения добавлен в URLconf проекта:

source: ...then, in a template, you can create a link to this view like this::
ru: ...в шаблоне можно создать ссылку на представление::

source: The template tag will output the string ``/clients/client/123/``.
ru: Тег вернет такую строку ``/clients/client/123/``.

source: If you'd like to retrieve a URL without displaying it, you can use a slightly different call::
ru: Если вам нужно получить URL без его отображения::

source: The scope of the variable created by the ``as var`` syntax is the ``{% block %}`` in which the ``{% url %}`` tag appears.
ru: Переменная, созданная ``as var``, будет доступна только в ``{% block %}``, в котором используется тег ``{% url %}``.

source: This ``{% url ... as var %}`` syntax will *not* cause an error if the view is missing. In practice you'll use this to link to views that are optional::
ru: Такой ``{% url ... as var %}`` синтаксис *не* вызовет исключение, если представление отсутствует. На практике вы будете использовать его для отображения ссылок на необязательные представления::

source: If you'd like to retrieve a namespaced URL, specify the fully qualified name::
ru: Если вы хотите использовать URL с указанным пространством имен, укажите полное имя::

source: This will follow the normal :ref:`namespaced URL resolution strategy <topics-http-reversing-url-namespaces>`, including using any hints provided by the context as to the current application.
ru: Это приведет к использованию стандартной :ref:`стратегии разрешения пространств имен в URL <topics-http-reversing-url-namespaces>`, включая использование данных контекста для определения текущего приложения.

source: Stops the template engine from rendering the contents of this block tag.
ru: Не позволяет шаблонной системе обрабатывать содержимое этого блочного тега.

source: A common use is to allow a JavaScript template layer that collides with Django's syntax. For example::
ru: Обычно используется для размещения JavaScript кода, который конфликтует с синтаксисом Django. Например::

source: You can also designate a specific closing tag, allowing the use of ``{% endverbatim %}`` as part of the unrendered contents::
ru: Вы также можете указать специфичный закрывающий тег, позволив использование ``{% endverbatim %}`` в качестве части неотображаемого контента::

source: For creating bar charts and such, this tag calculates the ratio of a given value to a maximum value, and then applies that ratio to a constant.
ru: Для создания гистограмм и других графиков, этот тег вычисляет отношение переданного значения к максимальному, а затем умножает отношение на константу.

source: For example::
ru: Например::

source: If ``this_value`` is 175, ``max_value`` is 200, and ``max_width`` is 100, the image in the above example will be 88 pixels wide (because 175/200 = .875; .875 * 100 = 87.5 which is rounded up to 88).
ru: Если ``this_value`` равно 175, ``max_value`` равно 200 и ``max_width`` равно 100, изображение из примера выше будет шириной 88 пикселей (так как 175/200 = .875; .875 * 100 = 87.5 что приблизительно равно 88).

source: In some cases you might want to capture the result of ``widthratio`` in a variable. It can be useful, for instance, in a :ttag:`blocktrans` like this::
ru: В некоторых случаях необходимо сохранить результат ``widthratio`` в переменную. Это может быть полезно, например, при использовании тега :ttag:`blocktrans`::

source: Caches a complex variable under a simpler name. This is useful when accessing an "expensive" method (e.g., one that hits the database) multiple times.
ru: Кэширует сложные переменные под простым названием. Это полезно при использовании "тяжелых" методов (например, тех, которые выполняют запрос к базе данных) несколько раз.

source: The populated variable (in the example above, ``total``) is only available between the ``{% with %}`` and ``{% endwith %}`` tags.
ru: Указанная переменная (в примере выше, ``total``) доступна только между тегами ``{% with %}`` и ``{% endwith %}``.

source: You can assign more than one context variable::
ru: Вы можете указать больше одной переменной контекста::

source: The previous more verbose format is still supported: ``{% with business.employees.count as total %}``
ru: Предыдущий синтаксис так же работает: ``{% with business.employees.count as total %}``

source: Built-in filter reference
ru: Список встроенных фильтров

source: Adds the argument to the value.
ru: Суммирует аргумент и значение.

source: If ``value`` is ``4``, then the output will be ``6``.
ru: Если ``value`` равно ``4``, будет выведено ``6``.

source: This filter will first try to coerce both values to integers. If this fails, it'll attempt to add the values together anyway. This will work on some data types (strings, list, etc.) and fail on others. If it fails, the result will be an empty string.
ru: Фильтр попытается преобразовать оба значения в целое число. Если это не удастся, он будет пытаться добавить значения в любом случае. Это работает для некоторых типов (строки, списки и др.) и не работает с другими. Если ничего не получится, будет выведена пустая строка.

source: For example, if we have::
ru: Например, у нас есть::

source: and ``first`` is ``[1, 2, 3]`` and ``second`` is ``[4, 5, 6]``, then the output will be ``[1, 2, 3, 4, 5, 6]``.
ru: и ``first`` равно ``[1, 2, 3]`` и ``second`` равно ``[4, 5, 6]``, тогда результат будет ``[1, 2, 3, 4, 5, 6]``.

source: Strings that can be coerced to integers will be **summed**, not concatenated, as in the first example above.
ru: Строки, которые могут быть преобразованы в числа, будут **суммированы**, а не объединены, как показано в примере выше.

source: Adds slashes before quotes. Useful for escaping strings in CSV, for example.
ru: Добавляет слэш перед кавычкой. Удобно при экранировании строк в CSV, например.

source: If ``value`` is ``"I'm using Django"``, the output will be ``"I\'m using Django"``.
ru: Если ``value`` равно ``"I'm using Django"``, результат будет ``"I\'m using Django"``.

source: Capitalizes the first character of the value. If the first character is not a letter, this filter has no effect.
ru: Первый символ аргумента возводит в верхний регистр. Если первый символ не буква, фильтр ничего не будет делать.

source: If ``value`` is ``"django"``, the output will be ``"Django"``.
ru: Если ``value`` равно ``"django"``, результат будет ``"Django"``.

source: Centers the value in a field of a given width.
ru: Центрирует значение в поле заданной ширины.

source: If ``value`` is ``"Django"``, the output will be ``" Django "``.
ru: Если ``value`` равно ``"django"``, результат будет ``" Django "``.

source: Removes all values of arg from the given string.
ru: Удаляет значение аргумента из строки, к которой применяется фильтр.

source: If ``value`` is ``"String with spaces"``, the output will be ``"Stringwithspaces"``.
ru: Если ``value`` равно ``"String with spaces"``, результат будет ``"Stringwithspaces"``.

source: Formats a date according to the given format.
ru: Форматирует дату в соответствии с указанным форматом.

source: Uses a similar format as PHP's ``date()`` function (https://php.net/date) with some differences.
ru: Использует формат функции ``date()`` в PHP (http://php.net/date) с небольшими отличиями.

source: These format characters are not used in Django outside of templates. They were designed to be compatible with PHP to ease transitioning for designers.
ru: Эти символы форматирования используются только в шаблонах Django. Они были созданы для совместимости с PHP, чтобы верстальщикам было проще перейти на Django.

source: Available format strings:
ru: Доступное форматирование:

source: Format character
ru: Символ форматирования

source: Example output
ru: Пример вывода

source: ``'a.m.'`` or ``'p.m.'`` (Note that this is slightly different than PHP's output, because this includes periods to match Associated Press style.)
ru: ``'a.m.'`` или ``'p.m.'`` (немного отличается от функции PHP, так как отображает в стиле Associated Press.)

source: ``'AM'`` or ``'PM'``.
ru: ``'AM'`` или ``'PM'``.

source: Month, textual, 3 letters, lowercase.
ru: Название месяца, 3-х буквенное, в нижнем регистре.

source: Not implemented.
ru: Не используется.

source: ISO 8601 format. (Note: unlike others formatters, such as "Z", "O" or "r", the "c" formatter will not add timezone offset if value is a naive datetime (see :class:`datetime.tzinfo`).
ru: ISO 8601 формат. (Заметим: в отличии от других форматов, таких как "Z", "O" или "r", формат "c" не добавит временную зону для относительного времени (смотрите :class:`datetime.tzinfo`).

source: ``2008-01-02T10:30:00.000123+02:00``, or ``2008-01-02T10:30:00.000123`` if the datetime is naive
ru: ``2008-01-02T10:30:00.000123+02:00``, или ``2008-01-02T10:30:00.000123`` если время относительное

source: Day of the month, 2 digits with leading zeros.
ru: День месяца, 2 цифры с ведущим нулем.

source: ``'01'`` to ``'31'``
ru: От ``'01'`` до ``'31'``

source: Day of the week, textual, 3 letters.
ru: День недели, 3-х буквенное текстовое название.

source: Timezone name. Could be in any format, or might return an empty string, depending on the datetime.
ru: Название временной зоны. Может быть в любом формате, или вернуть пустую строку в зависимости от объекта даты.

source: ``''``, ``'GMT'``, ``'-500'``, ``'US/Eastern'``, etc.
ru: ``''``, ``'GMT'``, ``'-500'``, ``'US/Eastern'`` и др.

source: Month, locale specific alternative representation usually used for long date representation.
ru: Название месяца, зависит от текущего языка. Используется для отображения полного называния даты.
