Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/ref/templates/builtins.po
Languages: ru

source: Built-in template tags and filters
ru: Встроенные шаблонные теги и фильтры

source: This document describes Django's built-in template tags and filters. It is recommended that you use the :doc:`automatic documentation </ref/contrib/admin/admindocs>`, if available, as this will also include documentation for any custom tags or filters installed.
ru: Этот раздел описывает строенные шаблонные теги и фильтры Django. Рекомендуем использовать :doc:`автоматическую документацию </ref/contrib/admin/admindocs>` по возможности, т.к. она включает также собственные теги и фильтры.

source: Built-in tag reference
ru: Список встроенных тегов

source: Controls the current auto-escaping behavior. This tag takes either ``on`` or ``off`` as an argument and that determines whether auto-escaping is in effect inside the block. The block is closed with an ``endautoescape`` ending tag.
ru: Контролирует авто-экранирование. Этот тег принимает ``on`` или ``off`` аргумент, указывающий должно ли использоваться автоматическое экранирование внутри блока. Блок закрывается закрывающим тегом ``endautoescape``.

source: When auto-escaping is in effect, all variable content has HTML escaping applied to it before placing the result into the output (but after any filters have been applied). This is equivalent to manually applying the :tfilter:`escape` filter to each variable.
ru: Если экранирование включено, ко всем переменным будет применяется HTML-экранирование перед выводом (но после применения всех фильтров). Это эквивалентно использованию фильтра :tfilter:`escape` для каждой переменной.

source: The only exceptions are variables that are already marked as "safe" from escaping, either by the code that populated the variable, or because it has had the :tfilter:`safe` or :tfilter:`escape` filters applied.
ru: Не будут экранированы переменные помеченные как безопасные( "safe"), или кодом определяющим переменную, или после применения фильтров :tfilter:`safe` или :tfilter:`escape`.

source: Sample usage::
ru: Примеры использования::

source: Defines a block that can be overridden by child templates. See :ref:`Template inheritance <template-inheritance>` for more information.
ru: Определяет блок, который может быть переопределен в дочернем шаблоне. Смотрите подробности в разделе о :ref:`наследовании шаблонов <template-inheritance>`.

source: Ignores everything between ``{% comment %}`` and ``{% endcomment %}``. An optional note may be inserted in the first tag. For example, this is useful when commenting out code for documenting why the code was disabled.
ru: Игнорирует содержимое между ``{% comment %}`` и ``{% endcomment %}``. Можно добавить заметку в первый тег. Например, добавить комментарий, описывающий почему код был закомментирован.

source: ``comment`` tags cannot be nested.
ru: Тег ``comment`` не может быть вложенным.

source: This tag is used for CSRF protection, as described in the documentation for :doc:`Cross Site Request Forgeries </ref/csrf>`.
ru: Этот тег используется для организации CSRF защиты, как это описано в разделе о :doc:`защите от CSRF </ref/csrf>`.

source: Produces one of its arguments each time this tag is encountered. The first argument is produced on the first encounter, the second argument on the second encounter, and so forth. Once all arguments are exhausted, the tag cycles to the first argument and produces it again.
ru: Возвращает один из аргументов при вызове. Первый аргумент при первом вызове, второй - при втором, и т.д. Когда аргументы кончаются, тег начинает с начала списка аргументов.

source: This tag is particularly useful in a loop::
ru: Этот тег полезен в циклах::

source: The first iteration produces HTML that refers to class ``row1``, the second to ``row2``, the third to ``row1`` again, and so on for each iteration of the loop.
ru: Первый вызов сгенерирует HTML используя класс ``row1``, второй - ``row2``, третий - снова ``row1``, и так далее для каждой итерации цикла.

source: You can use variables, too. For example, if you have two template variables, ``rowvalue1`` and ``rowvalue2``, you can alternate between their values like this::
ru: Вы можете также использовать переменные. Например, если у вас есть две переменных в шаблоне, ``rowvalue1`` и ``rowvalue2``, вы можете переключаться между их значениями::

source: Variables included in the cycle will be escaped. You can disable auto-escaping with::
ru: Переданные значения будут экранированы. Автоматическое экранирование можно выключить::

source: You can mix variables and strings::
ru: В можете использовать переменные и строки вместе::

source: In some cases you might want to refer to the current value of a cycle without advancing to the next value. To do this, just give the ``{% cycle %}`` tag a name, using "as", like this::
ru: В некоторых случаях вам может понадобиться обратиться к значению не в цикле. Для этого просто передайте в тег ``{% cycle %}`` название, используя "as", например::

source: From then on, you can insert the current value of the cycle wherever you'd like in your template by referencing the cycle name as a context variable. If you want to move the cycle to the next value independently of the original ``cycle`` tag, you can use another ``cycle`` tag and specify the name of the variable. So, the following template::
ru: Теперь вы можете использовать текущее значение цикла в любом месте шаблона используя переданное название как переменную контекста. Если вам необходимо следующее значение, используйте тег снова, используя название переменной. Следующий шаблон::

source: would output::
ru: выведет::

source: You can use any number of values in a ``cycle`` tag, separated by spaces. Values enclosed in single quotes (``'``) or double quotes (``"``) are treated as string literals, while values without quotes are treated as template variables.
ru: Вы можете использовать любое количество значений в теге ``cycle``, разделенных пробелами. Значения в одинарных (``'``) или двойных кавычках (``"``) рассматриваются как строки, в то время как, значения без кавычек, интерпретируются как переменные.

source: By default, when you use the ``as`` keyword with the cycle tag, the usage of ``{% cycle %}`` that initiates the cycle will itself produce the first value in the cycle. This could be a problem if you want to use the value in a nested loop or an included template. If you only want to declare the cycle but not produce the first value, you can add a ``silent`` keyword as the last keyword in the tag. For example::
ru: По умолчанию, использование тега ``{% cycle %}`` с аргументом ``as`` выведет первое значение цикла. Это может быть проблемой, если вы хотите использовать значение во вложенном теге или в включенном теге. Если вы хотите просто определить цикл, но не выводить первое значение, используйте аргумент ``silent`` в конце тега. Например::

source: This will output a list of ``<tr>`` elements with ``class`` alternating between ``row1`` and ``row2``. The subtemplate will have access to ``rowcolors`` in its context and the value will match the class of the ``<tr>`` that encloses it. If the ``silent`` keyword were to be omitted, ``row1`` and ``row2`` would be emitted as normal text, outside the ``<tr>`` element.
ru: Это выведет список элементов ``<tr>`` с ``class`` чередующийся между ``row1`` и ``row2``; включенный шаблон будет иметь доступ к переменной ``rowcolors``, которая содержит класс ``<tr>``. Если бы аргумент ``silent`` не использовался, ``row1`` и ``row2`` вывелись бы как обычный текст вне ``<tr>``.

source: When the silent keyword is used on a cycle definition, the silence automatically applies to all subsequent uses of that specific cycle tag. The following template would output *nothing*, even though the second call to ``{% cycle %}`` doesn't specify ``silent``::
ru: Если используется аргумент ``silent``, он будет автоматически применен ко всем последующим вызовам этого цикла. Этот шаблон *ничего* не выведет, даже учитывая что второй вызов ``{% cycle %}`` не использует ``silent``::

source: Outputs a whole load of debugging information, including the current context and imported modules.
ru: Выводит всю отладочную информацию, в том числе текущей контекст и импортированные модули.

source: Signals that this template extends a parent template.
ru: Указывает что данный шаблон наследуется от родительского.

source: This tag can be used in two ways:
ru: Может использоваться двумя способами:

source: ``{% extends "base.html" %}`` (with quotes) uses the literal value ``"base.html"`` as the name of the parent template to extend.
ru: ``{% extends "base.html" %}`` (с кавычками) использует буквальное значение ``"base.html"`` в качестве названия родительского шаблона.

source: ``{% extends variable %}`` uses the value of ``variable``. If the variable evaluates to a string, Django will use that string as the name of the parent template. If the variable evaluates to a ``Template`` object, Django will use that object as the parent template.
ru: ``{% extends variable %}`` использует значение ``variable``. Если значение строка, Django использует ее как название родительского шаблона. Если значение переменной объект ``Template``, Django использует этот объект как родительский шаблон.

source: See :ref:`template-inheritance` for more information.
ru: Смотрите подробности в :ref:`template-inheritance`.

source: Filters the contents of the block through one or more filters. Multiple filters can be specified with pipes and filters can have arguments, just as in variable syntax.
ru: Содержимое тега будет обработано указанными фильтрами. Можно указать цепочку фильтров, а также их аргументы, как и при выводе переменной в шаблоне.

source: Note that the block includes *all* the text between the ``filter`` and ``endfilter`` tags.
ru: Содержимое тега включает *весь* текст между ``filter`` и ``endfilter``.

source: The :tfilter:`escape` and :tfilter:`safe` filters are not acceptable arguments. Instead, use the :ttag:`autoescape` tag to manage autoescaping for blocks of template code.
ru: Нельзя передавать фильтры :tfilter:`escape` и :tfilter:`safe`. Вместо этого используйте тег :ttag:`autoescape`.

source: Outputs the first argument variable that is not ``False``. Outputs nothing if all the passed variables are ``False``.
ru: Выводит первую из переданных переменных, которая не равна ``False``. Ничего не выводит, если все переменные равны ``False``.

source: This is equivalent to::
ru: Это равносильно::

source: You can also use a literal string as a fallback value in case all passed variables are False::
ru: Вы можете использовать строку как значение по-умолчанию на случай, если все переменные равны ``False``::

source: This tag auto-escapes variable values. You can disable auto-escaping with::
ru: Этот тэг экранирует переменные. Автоматическое экранирование можно выключить::

source: Or if only some variables should be escaped, you can use::
ru: Если только некоторые переменные должны быть экранированы, используйте::

source: You can use the syntax ``{% firstof var1 var2 var3 as value %}`` to store the output inside a variable.
ru: Вы можете использовать синтаксис ``{% firstof var1 var2 var3 as value %}``, чтобы сохранить результат в переменной.

source: Loops over each item in an array, making the item available in a context variable. For example, to display a list of athletes provided in ``athlete_list``::
ru: Цикл по каждому элементу массива, добавляя их в контекст блока. Например, выведем список спортсменов из ``athlete_list``::

source: You can loop over a list in reverse by using ``{% for obj in list reversed %}``.
ru: Вы можете использовать цикл по списку в обратном порядке ``{% for obj in list reversed %}``.

source: If you need to loop over a list of lists, you can unpack the values in each sublist into individual variables. For example, if your context contains a list of (x,y) coordinates called ``points``, you could use the following to output the list of points::
ru: Если вам нужен цикл по списку списков, вы можете распаковать значения под-списка на отдельные переменные. Например, если ваш контекст содержит список (x,y) координат ``points``, вы можете использовать следующий код для их вывода::

source: This can also be useful if you need to access the items in a dictionary. For example, if your context contained a dictionary ``data``, the following would display the keys and values of the dictionary::
ru: Аналогично можно использовать словарь. Например, если ваш контекст содержит словарь ``data``, следующий код выведет ключи и значения словаря::

source: Keep in mind that for the dot operator, dictionary key lookup takes precedence over method lookup. Therefore if the ``data`` dictionary contains a key named ``'items'``, ``data.items`` will return ``data['items']`` instead of ``data.items()``. Avoid adding keys that are named like dictionary methods if you want to use those methods in a template (``items``, ``values``, ``keys``, etc.). Read more about the lookup order of the dot operator in the :ref:`documentation of template variables <template-variables>`.
ru: Помните, что при обращении через точку для словарю сначала ищется ключ, а затем метод. Если словарь ``data`` содержит ключ ``'items'``, ``data.items`` вернет ``data['items']`` вместо ``data.items()``. Избегайте использования ключей, которые совпадают с названиями методов, если вы хотите их использовать в шаблоне (``items``, ``values``, ``keys``, и т.д.). Порядок получения значения описан в :ref:`разделе о переменных шаблонов <template-variables>`.

source: The for loop sets a number of variables available within the loop:
ru: Внутри цикла доступные некоторые дополнительные переменные:

source: Variable
ru: Переменная

source: Description
ru: Описание

source: The current iteration of the loop (1-indexed)
ru: Номер текущей итерации цикла начиная с 1

source: The current iteration of the loop (0-indexed)
ru: Номер текущей итерации цикла начиная с 0

source: The number of iterations from the end of the loop (1-indexed)
ru: Номер текущей итерации цикла начиная с конца с 1

source: The number of iterations from the end of the loop (0-indexed)
ru: Номер текущей итерации цикла начиная с конца с 0

source: True if this is the first time through the loop
ru: ``True``, если это первая итерация

source: True if this is the last time through the loop
ru: ``True``, если это последняя итерация

source: For nested loops, this is the loop surrounding the current one
ru: Для вложенных циклов, это "внешний" цикл.

source: The ``for`` tag can take an optional ``{% empty %}`` clause whose text is displayed if the given array is empty or could not be found::
ru: Тег ``for`` содержит необязательную часть ``{% empty %}``, которая будет отображена, если список пуст или не найден::

source: The above is equivalent to -- but shorter, cleaner, and possibly faster than -- the following::
ru: Это эквивалентно, но короче, читабельней и возможно быстрее, такому коду::

source: The ``{% if %}`` tag evaluates a variable, and if that variable is "true" (i.e. exists, is not empty, and is not a false boolean value) the contents of the block are output::
ru: Тег ``{% if %}`` вычисляет переменную и если она равна "true" (то есть существует, не пустая и не равна "false") выводит содержимое блока::

source: In the above, if ``athlete_list`` is not empty, the number of athletes will be displayed by the ``{{ athlete_list|length }}`` variable.
ru: В примере выше, если ``athlete_list`` не пустой, будет отображено количество спортсменов ``{{ athlete_list|length }}``.

source: As you can see, the ``if`` tag may take one or several ``{% elif %}`` clauses, as well as an ``{% else %}`` clause that will be displayed if all previous conditions fail. These clauses are optional.
ru: Как вы можете видеть, тег ``if`` может содержать один или несколько блоков `` {% elif %}``, так же как и блок ``{% else %}``, который будет выведен, если все предыдущие условия не верны. Все эти блоки необязательны.

source: Boolean operators
ru: Булевы операторы

source: :ttag:`if` tags may use ``and``, ``or`` or ``not`` to test a number of variables or to negate a given variable::
ru: Тег :ttag:`if` может использовать ``and``, ``or`` или ``not``::

source: Use of both ``and`` and ``or`` clauses within the same tag is allowed, with ``and`` having higher precedence than ``or`` e.g.::
ru: Можно использовать ``and`` и ``or`` вместе, операция ``and`` имеет больший приоритет чем ``or``, например::

source: will be interpreted like:
ru: будет интерпретировано как:

source: Use of actual parentheses in the :ttag:`if` tag is invalid syntax. If you need them to indicate precedence, you should use nested :ttag:`if` tags.
ru: Использовать скобки в теге :ttag:`if` нельзя. Если вам нужно указать приоритет, используйте вложенные теги :ttag:`if`.

source: ``==`` operator
ru: Оператор ``==``

source: Equality. Example::
ru: Равенство. Например::

source: ``!=`` operator
ru: Оператор ``!=``

source: Inequality. Example::
ru: Неравенство. Например::

source: ``<`` operator
ru: Оператор ``<``

source: Less than. Example::
ru: Меньше чем. Например::

source: ``>`` operator
ru: Оператор ``>``

source: Greater than. Example::
ru: Больше чем. Например::

source: ``<=`` operator
ru: Оператор ``<=``

source: Less than or equal to. Example::
ru: Меньше чем или равно. Например::

source: ``>=`` operator
ru: Оператор ``>=``

source: Greater than or equal to. Example::
ru: Больше чем или равно. Например::

source: ``in`` operator
ru: Оператор ``in``

source: Contained within. This operator is supported by many Python containers to test whether the given value is in the container. The following are some examples of how ``x in y`` will be interpreted::
ru: Вхождение в. Этот оператор поддерживается большинством контейнеров Python, чтобы проверит входит ли значение в контейнер. Несколько примеров как работает ``x in y``::

source: ``not in`` operator
ru: Оператор ``not in``

source: Not contained within. This is the negation of the ``in`` operator.
ru: Не вхождение в. Оператор обратный оператору ``in``.

source: Filters
ru: Фильтры

source: You can also use filters in the :ttag:`if` expression. For example::
ru: Вы можете использовать фильтры в выражении :ttag:`if`. Например::

source: Complex expressions
ru: Сложные выражения

source: All of the above can be combined to form complex expressions. For such expressions, it can be important to know how the operators are grouped when the expression is evaluated - that is, the precedence rules. The precedence of the operators, from lowest to highest, is as follows:
ru: Все перечисленное выше может быть использовано вместе для создания сложных выражений. Для таких выражений, важно знать как операторы группируются при выполнении выражения - то есть, правила приоритета. Приоритет операторов, от низшего к высшему, выглядит следующим образом:

source: ...will be interpreted as:
ru: ...будет интерпретирован как:

source: If you need different precedence, you will need to use nested :ttag:`if` tags. Sometimes that is better for clarity anyway, for the sake of those who do not know the precedence rules.
ru: Если вам нужен другой приоритет, используйте вложенные теги :ttag:`if`. Иногда этот способ более понятен, во всяком случае, для тех, кто не знает правил приоритета.

source: The comparison operators cannot be 'chained' like in Python or in mathematical notation. For example, instead of using::
ru: Операторы сравнения не могут использовать вместе как в Python или математике. Например, вместо использования::

source: you should use::
ru: вы должны использовать::

source: ``ifequal`` and ``ifnotequal``
ru: ``ifequal`` и ``ifnotequal``

source: ``{% ifequal a b %} ... {% endifequal %}`` is an obsolete way to write ``{% if a == b %} ... {% endif %}``. Likewise, ``{% ifnotequal a b %} ... {% endifnotequal %}`` is superseded by ``{% if a != b %} ... {% endif %}``. The ``ifequal`` and ``ifnotequal`` tags will be deprecated in a future release.
ru: ``{% ifequal a b %} ... {% endifequal %}`` -- устаревший вариант ``{% if a == b %} ... {% endif %}``. Аналогично ``{% ifnotequal a b %} ... {% endifnotequal %}`` заменены ``{% if a != b %} ... {% endif %}``. Теги ``ifequal`` и ``ifnotequal`` будут удалены в будущих релизах.

source: Check if a value has changed from the last iteration of a loop.
ru: Проверяет было ли изменено значение с предыдущей итерации цикла.

source: The ``{% ifchanged %}`` block tag is used within a loop. It has two possible uses.
ru: Блочный тег ``{% ifchanged %}`` используется внутри цикла. Существует два способа использовать тег.

source: Checks its own rendered contents against its previous state and only displays the content if it has changed. For example, this displays a list of days, only displaying the month if it changes::
ru: Проверять содержимое тега, и если оно было изменено с последней итерации, отображать его. Например, этот код отображает список дней и отображает месяц только при его изменении::

source: If given one or more variables, check whether any variable has changed. For example, the following shows the date every time it changes, while showing the hour if either the hour or the date has changed::
ru: Если передано одна или более переменных, проверяет была ли изменена одна из переменных. Например, следующий код отображает дату при каждом изменении, в то же время отображает час, если час или дата были изменены::

source: The ``ifchanged`` tag can also take an optional ``{% else %}`` clause that will be displayed if the value has not changed::
ru: Тег ``ifchanged`` может содержать необязательный блок ``{% else %}``, который будет отображаться, если значение не изменилось::

source: Loads a template and renders it with the current context. This is a way of "including" other templates within a template.
ru: Загружает шаблон и выводит его с текущим контекстом. Это способ "включить" один шаблон в другой.

source: The template name can either be a variable or a hard-coded (quoted) string, in either single or double quotes.
ru: Названия шаблона можно указать переменной или строкой в одинарных или двойных кавычках.

source: This example includes the contents of the template ``"foo/bar.html"``::
ru: Это пример включает содержимое шаблона ``"foo/bar.html"``::

source: This example includes the contents of the template whose name is contained in the variable ``template_name``::
ru: Этот пример включает содержимое шаблона, чье имя содержится в переменной ``template_name``::

source: The variable may also be any object with a ``render()`` method that accepts a context. This allows you to reference a compiled ``Template`` in your context.
ru: Можно передать любой объект с методом ``render()``, который принимает контекст. Это позволяет указать скомпилированные объекты ``Template`` из контекста.

source: An included template is rendered within the context of the template that includes it. This example produces the output ``"Hello, John!"``:
ru: Включенный шаблон выполняется с контекстом шаблона, который его включает. Этот пример выводит ``"Hello, John!"``:

source: Context: variable ``person`` is set to ``"John"`` and variable ``greeting`` is set to ``"Hello"``.
ru: Контекст: переменная ``person`` равна ``"john"`` и ``greeting`` равна ``"Hello"``.

source: Template::
ru: Шаблон::

source: The ``name_snippet.html`` template::
ru: Шаблон ``name_snippet.html``::

source: You can pass additional context to the template using keyword arguments::
ru: Вы можете передать дополнительные переменные контекста в шаблон используя именованные аргументы::
