Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/ref/templates/language.po
Languages: ru

source: With this name value, the template would be rendered as::
ru: С таким именем шаблон вернет::

source: ...which means the browser would pop-up a JavaScript alert box!
ru: ...что приведет к отображению alert-окна JavaScript!

source: Similarly, what if the name contained a ``'<'`` symbol, like this?
ru: Аналогично, что если имя содержит символ ``'<'``?

source: That would result in a rendered template like this::
ru: Шаблон вернет такое содержимое::

source: ...which, in turn, would result in the remainder of the Web page being bolded!
ru: ...в результате оставшееся содержимое страницы будет выделено полужирным!

source: Clearly, user-submitted data shouldn't be trusted blindly and inserted directly into your Web pages, because a malicious user could use this kind of hole to do potentially bad things. This type of security exploit is called a `Cross Site Scripting`_ (XSS) attack.
ru: Очевидно, пользовательским данными нельзя слепо доверять и вставлять непосредственно в содержимое страницы, так как злоумышленники могут использовать это с плохими намерениями. Такой тип уязвимости называется `Cross Site Scripting <http://ru.wikipedia.org/wiki/%D0%9C%D0%B5%D0%B6%D1%81%D0%B0%D0%B9%D1%82%D0%BE%D0%B2%D1%8B%D0%B9_%D1%81%D0%BA%D1%80%D0%B8%D0%BF%D1%82%D0%B8%D0%BD%D0%B3>`_ (XSS) атакой.

source: To avoid this problem, you have two options:
ru: Чтобы избежать этой проблемы, у вас есть два варианта:

source: One, you can make sure to run each untrusted variable through the :tfilter:`escape` filter (documented below), which converts potentially harmful HTML characters to unharmful ones. This was the default solution in Django for its first few years, but the problem is that it puts the onus on *you*, the developer / template author, to ensure you're escaping everything. It's easy to forget to escape data.
ru: Первый, вы можете применять ко всем сомнительным переменным фильтр :tfilter:`escape` (описанный далее), который преобразует потенциально опасные HTML символы в безопасные. Такое решение было принятым в первых версиях Django, но проблема в том, что оно возлагает бремя ответственности за безопасность на *вас*, разработчика / автора шаблона. Легко забыть экранировать переменную.

source: Two, you can take advantage of Django's automatic HTML escaping. The remainder of this section describes how auto-escaping works.
ru: Второй, вы можете позволить Django автоматически экранировать HTML. Оставшаяся часть этого раздела описывает, как автоматическое экранирование работает.

source: By default in Django, every template automatically escapes the output of every variable tag. Specifically, these five characters are escaped:
ru: По-умолчанию в Django, каждый шаблон экранирует все переменные. В частности выполняются такие замены:

source: ``<`` is converted to ``&lt;``
ru: ``<`` заменяется на ``&lt;``

source: ``>`` is converted to ``&gt;``
ru: ``>`` заменяется на ``&gt;``

source: ``"`` (double quote) is converted to ``&quot;``
ru: ``"`` (двойная кавычка) заменяется на ``&quot;``

source: ``&`` is converted to ``&amp;``
ru: ``&`` заменяется на ``&amp;``

source: Again, we stress that this behavior is on by default. If you're using Django's template system, you're protected.
ru: Опять же, мы подчеркиваем, что такое поведение используется по умолчанию. Если вы используете систему шаблонов Django, вы в безопасности.

source: How to turn it off
ru: Как это отключить

source: If you don't want data to be auto-escaped, on a per-site, per-template level or per-variable level, you can turn it off in several ways.
ru: Если вы не хотите, чтобы данные автоматически экранировались, на уровне сайта, шаблона или одной переменной, вы можете отключить это несколькими способами.

source: Why would you want to turn it off? Because sometimes, template variables contain data that you *intend* to be rendered as raw HTML, in which case you don't want their contents to be escaped. For example, you might store a blob of HTML in your database and want to embed that directly into your template. Or, you might be using Django's template system to produce text that is *not* HTML -- like an email message, for instance.
ru: Зачем вам отключить экранирование? Потому что в некоторых ситуациях, вы *намеренно* добавляете HTML в переменную, и хотите, чтобы он выводился без экранирования. Например, вы можете хранить HTML в базе данных и хотите непосредственно вставить его в содержимое страницы. Или шаблоны Django используются для создания текста, который *не* является HTML -- например email.

source: For individual variables
ru: Для отдельных переменных

source: To disable auto-escaping for an individual variable, use the :tfilter:`safe` filter::
ru: Для отключения авто-экранирования для отдельных переменных, используйте фильтр :tfilter:`safe`::

source: Think of *safe* as shorthand for *safe from further escaping* or *can be safely interpreted as HTML*. In this example, if ``data`` contains ``'<b>'``, the output will be::
ru: Думайте о :tfilter:`safe` как сокращение *"обезопасить от последующего экранирования"* или *"может быть смело интерпретировано как HTML"*. В этом примере, если ``data`` содержит ``'<b>'``, будет выведено::

source: For template blocks
ru: Для блоков шаблона

source: The :ttag:`autoescape` tag takes either ``on`` or ``off`` as its argument. At times, you might want to force auto-escaping when it would otherwise be disabled. Here is an example template::
ru: Тег :ttag:`autoescape` в качестве аргумента принимает ``on`` или ``off``. В некоторых случаях, вы захотите включить экранирование в шаблоне, в котором оно было отключено. Например::

source: The auto-escaping tag passes its effect onto templates that extend the current one as well as templates included via the :ttag:`include` tag, just like all block tags. For example:
ru: Тег :ttag:`autoescape` распространяет свой эффект на шаблоны, которые наследуют текущий, и на включенные тегом :ttag:`include` шаблоны, как и другие блочные теги. Например::

source: Because auto-escaping is turned off in the base template, it will also be turned off in the child template, resulting in the following rendered HTML when the ``greeting`` variable contains the string ``<b>Hello!</b>``::
ru: Так как авто-экранирование отключено в базовом шаблоне, оно будет отключено и в дочернем шаблоне. Если переменная ``greeting`` равна ``<b>Hello!</b>``, будет выведено::

source: Notes
ru: Заметки

source: Generally, template authors don't need to worry about auto-escaping very much. Developers on the Python side (people writing views and custom filters) need to think about the cases in which data shouldn't be escaped, and mark data appropriately, so things Just Work in the template.
ru: Обычно, авторы шаблонов не должны волноваться про авто-экранирование. Разработчики на стороне Python (те, кто создает представления и фильтры) должны определять в каких случаях данные не должны экранироваться и помечать их соответствующим образом, так что все будет `просто работать` в шаблонах.

source: If you're creating a template that might be used in situations where you're not sure whether auto-escaping is enabled, then add an :tfilter:`escape` filter to any variable that needs escaping. When auto-escaping is on, there's no danger of the :tfilter:`escape` filter *double-escaping* data -- the :tfilter:`escape` filter does not affect auto-escaped variables.
ru: Если вы создаете шаблон, который может использовать как с включенным авто-экранированием так и без него, добавляйте фильтр :tfilter:`escape` для каждой переменной, которую нужно экранировать. При включенном авто-экранировании фильтр :tfilter:`escape` не выполнит замену символов повторно.

source: String literals and automatic escaping
ru: Строки и автоматическое экранирование

source: As we mentioned earlier, filter arguments can be strings::
ru: Как уже упоминалось выше, аргументом фильтра может быть строка::

source: All string literals are inserted **without** any automatic escaping into the template -- they act as if they were all passed through the :tfilter:`safe` filter. The reasoning behind this is that the template author is in control of what goes into the string literal, so they can make sure the text is correctly escaped when the template is written.
ru: Все строки в шаблоне вставляются **без** автоматического экранирования -- они обрабатываются как строки, к которым применили фильтр :tfilter:`safe`. Причина этого состоит в том, что автор шаблона контролирует содержимое этих строк и самостоятельно может убедиться при создании шаблона, что они не содержат не безопасных символов.

source: This means you would write ::
ru: Это означает, чтобы вы должны писать::

source: ...rather than::
ru: ...вместо::

source: This doesn't affect what happens to data coming from the variable itself. The variable's contents are still automatically escaped, if necessary, because they're beyond the control of the template author.
ru: Это правило не распространяется на переменные, которые используются в качестве аргументов, так как автор шаблоне не может контролировать содержимое этих переменных.

source: Accessing method calls
ru: Вызов методов

source: Most method calls attached to objects are also available from within templates. This means that templates have access to much more than just class attributes (like field names) and variables passed in from views. For example, the Django ORM provides the :ref:`"entry_set"<topics-db-queries-related>` syntax for finding a collection of objects related on a foreign key. Therefore, given a model called "comment" with a foreign key relationship to a model called "task" you can loop through all comments attached to a given task like this::
ru: Вызов большинства методов объектов также доступен в шаблоне. Это означает, что шаблон имеет доступ не только к атрибутам классов (например, название поля) и переменных переданных из представлениях. Например, Django ORM предоставляет :ref:`"entry_set"<topics-db-queries-related>` атрибут для получения связанных через внешний ключ объектов. Следовательно, для модели комментариев("comment") с внешним ключом на модель задач("task") вы можете обратиться в цикле ко всем связанным комментариям переданного объекта задачи::

source: Similarly, :doc:`QuerySets</ref/models/querysets>` provide a ``count()`` method to count the number of objects they contain. Therefore, you can obtain a count of all comments related to the current task with::
ru: Также, :doc:`QuerySets</ref/models/querysets>` предоставляет метод ``count()`` для получения количества объектов. Следовательно, вы можете получить количество комментариев связанных с конкретной задачей::

source: And of course you can easily access methods you've explicitly defined on your own models:
ru: И конечно вы можете использовать методы вашей модели::

source: Because Django intentionally limits the amount of logic processing available in the template language, it is not possible to pass arguments to method calls accessed from within templates. Data should be calculated in views, then passed to templates for display.
ru: Так как Django намеренно ограничивает определение логики проекта в шаблоне, передавать аргументы при вызове метода в шаблоне нельзя. Данные должны вычисляться в представлении и передаваться в шаблон для отображения.

source: Custom tag and filter libraries
ru: Собственные библиотеки тегов и фильтров

source: Certain applications provide custom tag and filter libraries. To access them in a template, ensure the application is in :setting:`INSTALLED_APPS` (we'd add ``'django.contrib.humanize'`` for this example), and then use the :ttag:`load` tag in a template::
ru: Некоторые приложения предоставляют собственные библиотеки тегов и фильтров. Чтобы использовать их в шаблоне, укажите приложение в :setting:`INSTALLED_APPS` (в нашем примере мы используем ``'django.contrib.humanize'``), затем используйте тег :ttag:`load`::

source: In the above, the :ttag:`load` tag loads the ``humanize`` tag library, which then makes the ``intcomma`` filter available for use. If you've enabled :mod:`django.contrib.admindocs`, you can consult the documentation area in your admin to find the list of custom libraries in your installation.
ru: В это примере, тег :ttag:`load` загружает библиотеку ``humanize``, которая предоставляет тег ``intcomma``. Если вы активировали :mod:`django.contrib.admindocs`, в разделе документации вашего интерфейса администратора вы можете найти список всех установленных библиотек.

source: The :ttag:`load` tag can take multiple library names, separated by spaces. Example::
ru: Тег :ttag:`load` может принимать названия нескольких библиотек, разделенные пробелом. Например::

source: See :doc:`/howto/custom-template-tags` for information on writing your own custom template libraries.
ru: Смотрите раздел :doc:`/howto/custom-template-tags`, чтобы узнать как создавать собственные библиотеки для шаблонов.

source: Custom libraries and template inheritance
ru: Собственные библиотеки и наследование шаблонов

source: When you load a custom tag or filter library, the tags/filters are only made available to the current template -- not any parent or child templates along the template-inheritance path.
ru: При загрузке библиотеки, теги и фильтры, которые она содержит, будут доступны только в текущем шаблоне -- не в родительском или дочернем шаблонах.

source: For example, if a template ``foo.html`` has ``{% load humanize %}``, a child template (e.g., one that has ``{% extends "foo.html" %}``) will *not* have access to the humanize template tags and filters. The child template is responsible for its own ``{% load humanize %}``.
ru: Например, если шаблон ``foo.html`` содержит ``{% load humanize %}``, дочерний шаблон (например, содержащий``{% extends "foo.html" %}``) *не* сможет использовать теги и фильтры из этой библиотеки. Дочерний шаблон должен самостоятельно загрузить библиотеку, используя ``{% load humanize %}``.

source: This is a feature for the sake of maintainability and sanity.
ru: Так сделано ради "maintainability" и "sanity".

source: :doc:`The Templates Reference </ref/templates/index>`
ru: :doc:`Описание системы шаблонов </ref/templates/index>`

source: Covers built-in tags, built-in filters, using an alternative template, language, and more.
ru: Описывает встроенные теги, фильтры, использование сторонних шаблонизатор, язык шаблонов и другое.
