Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/ref/templates/language.po
Languages: ru

source: The Django template language
ru: Язык шаблонов Django

source: This document explains the language syntax of the Django template system. If you're looking for a more technical perspective on how it works and how to extend it, see :doc:`/ref/templates/api`.
ru: Этот раздел описывает синтаксис языка шаблонов Django. Если вы ищете технически подробности как он работает и как расширять его, смотрите :doc:`/ref/templates/api`.

source: Django's template language is designed to strike a balance between power and ease. It's designed to feel comfortable to those used to working with HTML. If you have any exposure to other text-based template languages, such as Smarty_ or Jinja2_, you should feel right at home with Django's templates.
ru: Язык шаблонов Django представляет баланс между возможностями и простотой. Он создавался, чтобы быть удобным для пользователей HTML. Если у вас есть опыт работы с другими языками текстовых шаблонов, таких как Smarty_ или Jinja2_, вы должны себя чувствовать как дома с шаблонами Django.

source: Philosophy
ru: Философия

source: If you have a background in programming, or if you're used to languages which mix programming code directly into HTML, you'll want to bear in mind that the Django template system is not simply Python embedded into HTML. This is by design: the template system is meant to express presentation, not program logic.
ru: Если у вас есть опыт программирования или вы использовали PHP, который позволяет интегрировать программный код прямо HTML, вам стоит помнить, что система шаблонов Django -- это не просто Python встроенный в HTML. Это сделано намеренно: шаблоны предназначены для представления, а не для реализации логики программы.

source: The Django template system provides tags which function similarly to some programming constructs -- an :ttag:`if` tag for boolean tests, a :ttag:`for` tag for looping, etc. -- but these are not simply executed as the corresponding Python code, and the template system will not execute arbitrary Python expressions. Only the tags, filters and syntax listed below are supported by default (although you can add :doc:`your own extensions </howto/custom-template-tags>` to the template language as needed).
ru: Шаблоны Django предоставляют теги, которые повторяют некоторые структуры языка программирования -- тег :ttag:`if` для проверки на истинность, тег :ttag:`for` для циклов, и др. -- но они не выполняются непосредственно как код Python, и система шаблонов не будет выполнять произвольное выражение Python. Только теги, фильтры и синтаксис, перечисленные ниже, поддерживаются по умолчанию (хотя вы можете добавить :doc:`собственное расширение </howto/custom-template-tags>` для языка шаблонов при необходимости).

source: Templates
ru: Шаблоны

source: A template contains **variables**, which get replaced with values when the template is evaluated, and **tags**, which control the logic of the template.
ru: Шаблон содержит **переменные**, которые будут заменены значениями при выполнении шаблона, и **теги**, которые управляют логикой шаблона.

source: Below is a minimal template that illustrates a few basics. Each element will be explained later in this document.
ru: Ниже приводится простой шаблон, который иллюстрирует некоторые основы. Каждый элемент будет объяснен далее в этом разделе.

source: Why use a text-based template instead of an XML-based one (like Zope's TAL)? We wanted Django's template language to be usable for more than just XML/HTML templates. At World Online, we use it for emails, JavaScript and CSV. You can use the template language for any text-based format.
ru: Зачем использовать текстовый шаблон, а не на основе XML (как TAL в Zope)? Мы хотели, чтобы шаблоны Django были больше, чем просто XML/HTML шаблоны. На World Online, мы используем их для email, JavaScript и CSV. Вы можете использовать шаблоны для любого текстового формата.

source: Oh, and one more thing: making humans edit XML is sadistic!
ru: Ах да, еще одно: заставлять людей редактировать XML -- это садизм!

source: Variables
ru: Переменные

source: Use a dot (``.``) to access attributes of a variable.
ru: Используйте точку (``.``) для доступа к атрибутам переменной.

source: Behind the scenes
ru: За кадром

source: Technically, when the template system encounters a dot, it tries the following lookups, in this order:
ru: Технически, когда шаблон встречает точку, он пытается получить значения в таком порядке:

source: Dictionary lookup
ru: Ключ словаря

source: Attribute or method lookup
ru: Атрибут или метод

source: Numeric index lookup
ru: Индекс списка

source: If the resulting value is callable, it is called with no arguments. The result of the call becomes the template value.
ru: Если найден вызываемый объект(функция или метод), он будет вызван без аргументов. Результат будет использоваться шаблоном как значение.

source: This lookup order can cause some unexpected behavior with objects that override dictionary lookup. For example, consider the following code snippet that attempts to loop over a ``collections.defaultdict``::
ru: Это может приводить к неожиданным результатам с объектами, которые переопределяют поиск по словарю. Например, рассмотрим следующий код, который пытается выполнить цикл по ``collections.defaultdict``::

source: Because dictionary lookup happens first, that behavior kicks in and provides a default value instead of using the intended ``.items()`` method. In this case, consider converting to a dictionary first.
ru: Так как поиск словаре происходит вперёд, такое поведение предоставляет значение по умолчанию вместо использования метода ``.items()``. В данном случае, сначала рассмотрим преобразование в словарь.

source: In the above example, ``{{ section.title }}`` will be replaced with the ``title`` attribute of the ``section`` object.
ru: В примере выше, ``{{ section.title }}`` будет заменен на атрибут ``title`` объекта ``section``.

source: If you use a variable that doesn't exist, the template system will insert the value of the ``string_if_invalid`` option, which is set to ``''`` (the empty string) by default.
ru: Если переменная не найдена, шаблон вставит значение опции ``string_if_invalid``, которая равна ``''`` (пустой строке) по-умолчанию.

source: Note that "bar" in a template expression like ``{{ foo.bar }}`` will be interpreted as a literal string and not using the value of the variable "bar", if one exists in the template context.
ru: Следует отметить, что "bar" в шаблонном выражении выглядит как ``{{ foo.bar }}`` и будет интерпретирован как строка. Если в шаблонном контексте определена переменная с таким именем, то значение локальной переменной "bar" будет проигнорировано.

source: Filters
ru: Фильтры

source: You can modify variables for display by using **filters**.
ru: Вы можете изменить значение переменной используя **фильтры**.

source: Filters look like this: ``{{ name|lower }}``. This displays the value of the ``{{ name }}`` variable after being filtered through the :tfilter:`lower` filter, which converts text to lowercase. Use a pipe (``|``) to apply a filter.
ru: Фильтры выглядят таким образом: ``{{ name|lower }}``. Это выведет значение переменной ``{{ name }}`` после применения фильтра :tfilter:`lower` к нему, который преобразует значение в нижний регистр. Используйте символ (``|``) для применения фильтра.

source: Filters can be "chained." The output of one filter is applied to the next. ``{{ text|escape|linebreaks }}`` is a common idiom for escaping text contents, then converting line breaks to ``<p>`` tags.
ru: Можно использовать "цепочку" фильтров. Вывод одного фильтра используется для другого. ``{{ text|escape|linebreaks }}`` обычно применяется для экранирования текста, и замены переноса строки тегами ``<p>``.

source: Some filters take arguments. A filter argument looks like this: ``{{ bio|truncatewords:30 }}``. This will display the first 30 words of the ``bio`` variable.
ru: Некоторые фильтры принимают аргументы. Аргумент фильтра выглядит таким образом: ``{{ bio|truncatewords:30 }}``. Этот код отобразит первые 30 слов переменной ``bio``.

source: Filter arguments that contain spaces must be quoted; for example, to join a list with commas and spaces you'd use ``{{ list|join:", " }}``.
ru: Аргументы фильтров, которые содержат пробелы, должны быть заключены в кавычки. Например, чтобы объединить список пробелом и запятой, используйте ``{{ list|join:", " }}``.

source: Django provides about sixty built-in template filters. You can read all about them in the :ref:`built-in filter reference <ref-templates-builtins-filters>`. To give you a taste of what's available, here are some of the more commonly used template filters:
ru: Django предоставляет около шестидесяти встроенных фильтров. Вы можете прочитать о них в :ref:`разделе о встроенных фильтрах <ref-templates-builtins-filters>`. Чтобы дать вам представление о возможностях, вот некоторые из наиболее часто используемых фильтров:

source: If a variable is false or empty, use given default. Otherwise, use the value of the variable. For example::
ru: Если значение равно ``False`` или пустым, будет использовано значение по умолчанию. В противном случае используется значение. Например::

source: If ``value`` isn't provided or is empty, the above will display "``nothing``".
ru: Если ``value`` равно ``""`` (пустая строка), будет выведено ``nothing``.

source: Returns the length of the value. This works for both strings and lists. For example::
ru: Возвращает размер значения. Работает для строк и списков, например::

source: If ``value`` is ``['a', 'b', 'c', 'd']``, the output will be ``4``.
ru: Если ``value`` равно ``['a', 'b', 'c', 'd']``, выведет ``4``.

source: Formats the value like a "human-readable" file size (i.e. ``'13 KB'``, ``'4.1 MB'``, ``'102 bytes'``, etc.). For example::
ru: Форматирует размер файла в читабельный вид (например, ``'13 KB'``, ``'4.1 MB'``, ``'102 bytes'``, и т.д.). Например::

source: If ``value`` is 123456789, the output would be ``117.7 MB``.
ru: Если ``value`` равно 123456789, выведет ``117.7 MB``.

source: Again, these are just a few examples; see the :ref:`built-in filter reference <ref-templates-builtins-filters>` for the complete list.
ru: Опять же, это всего лишь несколько примеров; полный список смотрите :ref:`раздел о встроенных фильтрах <ref-templates-builtins-filters>`.

source: You can also create your own custom template filters; see :doc:`/howto/custom-template-tags`.
ru: Вы можете создать собственный фильтр; смотрите :doc:`/howto/custom-template-tags`.

source: Django's admin interface can include a complete reference of all template tags and filters available for a given site. See :doc:`/ref/contrib/admin/admindocs`.
ru: Интерфейс администратора Django может предоставить полный список доступных тегов и фильтров. Смотрите :doc:`/ref/contrib/admin/admindocs`.

source: Tags
ru: Теги

source: Tags look like this: ``{% tag %}``. Tags are more complex than variables: Some create text in the output, some control flow by performing loops or logic, and some load external information into the template to be used by later variables.
ru: Теги выглядят таким образом: ``{% tag %}``. Теги сложнее чем переменные: одни создают текст для вывода, влияют на выполнение используя условия и циклы, другие загружают дополнительную информацию в шаблоны, чтобы использовать ее далее через переменные.

source: Some tags require beginning and ending tags (i.e. ``{% tag %} ... tag contents ... {% endtag %}``).
ru: Некоторые теги требуют открывающий и закрывающий теги (например, ``{% tag %} ... содержимое тега ... {% endtag %}``).

source: Django ships with about two dozen built-in template tags. You can read all about them in the :ref:`built-in tag reference <ref-templates-builtins-tags>`. To give you a taste of what's available, here are some of the more commonly used tags:
ru: Django содержит около двадцати встроенных тегов. Вы можете прочитать все о них в :ref:`разделе о встроенных тегах <ref-templates-builtins-tags>`. Чтобы дать вам представление о возможностях, вот некоторые из наиболее часто используемых тегов:

source: Loop over each item in an array. For example, to display a list of athletes provided in ``athlete_list``::
ru: Цикл по каждому элементу массива. Например, выведем список спортсменов из ``athlete_list``::

source: Evaluates a variable, and if that variable is "true" the contents of the block are displayed::
ru: Вычисляет переменную и если она равна "true", выводит содержимое блока::

source: In the above, if ``athlete_list`` is not empty, the number of athletes will be displayed by the ``{{ athlete_list|length }}`` variable. Otherwise, if ``athlete_in_locker_room_list`` is not empty, the message "Athletes should be out..." will be displayed. If both lists are empty, "No athletes." will be displayed.
ru: В примере выше, если ``athlete_list`` не пустой, будет отображено количество спортсменов ``{{ athlete_list|length }}``. Иначе, если ``athlete_in_locker_room_list`` не пустой, будет показано сообщение "Athletes should be out...". Если оба списка пустые, будет показано сообщение "No athletes.".

source: You can also use filters and various operators in the :ttag:`if` tag::
ru: Вы можете использовать фильтры и операторы в теге :ttag:`if` tag::

source: While the above example works, be aware that most template filters return strings, so mathematical comparisons using filters will generally not work as you expect. :tfilter:`length` is an exception.
ru: Несмотря на работоспособность вышеупомянутого примера, помните, что большинство шаблонных фильтров возвращает строки, таким образом, математическое сравнение результатов фильтров в общем случае будет работать не так, как вы можете ожидать. Хотя : tfilter:`length` является исключением.

source: Set up `template inheritance`_ (see below), a powerful way of cutting down on "boilerplate" in templates.
ru: Определяет :ref:`наследование шаблонов <template-inheritance>` (смотрите ниже), эффективный способ использовать шаблоны.

source: Again, the above is only a selection of the whole list; see the :ref:`built-in tag reference <ref-templates-builtins-tags>` for the complete list.
ru: Опять же, это только несколько тегов; полный список смотрите в :ref:`разделе о встроенных тегах <ref-templates-builtins-tags>`.

source: You can also create your own custom template tags; see :doc:`/howto/custom-template-tags`.
ru: Вы можете создать собственный тег; смотрите :doc:`/howto/custom-template-tags`.

source: Comments
ru: Комментарии

source: To comment-out part of a line in a template, use the comment syntax: ``{# #}``.
ru: Чтобы закомментировать строку в шаблоне, используйте синтаксис комментариев: ``{# #}``.

source: For example, this template would render as ``'hello'``::
ru: Например, этот шаблон выведет ``'hello'``::

source: A comment can contain any template code, invalid or not. For example::
ru: Комментарий может содержать любой код шаблона, правильный или нет. Например::

source: This syntax can only be used for single-line comments (no newlines are permitted between the ``{#`` and ``#}`` delimiters). If you need to comment out a multiline portion of the template, see the :ttag:`comment` tag.
ru: Этот синтаксис может быть использован только для однострочных комментариев (нельзя использовать перенос строки между ``{#`` и ``#}``). Если вам нужно закомментировать несколько строк, используйте тег :ttag:`comment`.

source: Template inheritance
ru: Наследование шаблонов

source: The most powerful -- and thus the most complex -- part of Django's template engine is template inheritance. Template inheritance allows you to build a base "skeleton" template that contains all the common elements of your site and defines **blocks** that child templates can override.
ru: Самая могущественная -- и, следовательно, самая сложная -- часть механизма шаблонов Django -- это наследование шаблонов. Наследование шаблонов позволяет создать вам шаблон-"скелет", который содержит базовые элементы вашего сайта и определяет **блоки**, которые могут быть переопределены дочерними шаблонами.

source: In this example, the :ttag:`block` tag defines three blocks that child templates can fill in. All the :ttag:`block` tag does is to tell the template engine that a child template may override those portions of the template.
ru: В этом примере, тег :ttag:`block` определяет три блока, которые может переопределить дочерний шаблон. Все что делает тег :ttag:`block` -- указывает механизму шаблонов, какая часть шаблона может быть переопределена в дочернем шаблоне.

source: A child template might look like this::
ru: Дочерний шаблон может выглядеть таким образом::

source: The :ttag:`extends` tag is the key here. It tells the template engine that this template "extends" another template. When the template system evaluates this template, first it locates the parent -- in this case, "base.html".
ru: Ключевым здесь есть тег :ttag:`extends`. Он говорит механизму шаблонов, что этот шаблон "наследует" другой шаблон. Когда механизм шаблонов выполняет этот шаблон, первым делом находится родительский шаблон -- в этом примере "base.html".

source: At that point, the template engine will notice the three :ttag:`block` tags in ``base.html`` and replace those blocks with the contents of the child template. Depending on the value of ``blog_entries``, the output might look like::
ru: Далее механизм шаблонов находит три тега :ttag:`block` в ``base.html`` и заменяет их содержимым дочернего шаблона. В зависимости от значения ``blog_entries``, результат может выглядеть таким образом::

source: Note that since the child template didn't define the ``sidebar`` block, the value from the parent template is used instead. Content within a ``{% block %}`` tag in a parent template is always used as a fallback.
ru: Так как дочерний шаблон не определяет блок ``sidebar``, будет использовано значение из родительского шаблона. Содержимое тега ``{% block %}`` родительского шаблона всегда используется как значение по умолчанию.

source: You can use as many levels of inheritance as needed. One common way of using inheritance is the following three-level approach:
ru: Вы можете использовать столько уровней наследование, сколько вам нужно. Один из распространенных способов использовать наследование -- это трехуровневый подход:

source: Create a ``base.html`` template that holds the main look-and-feel of your site.
ru: Создать шаблон ``base.html``, который отображает основной вид вашего сайта.

source: Create a ``base_SECTIONNAME.html`` template for each "section" of your site. For example, ``base_news.html``, ``base_sports.html``. These templates all extend ``base.html`` and include section-specific styles/design.
ru: Создать шаблон ``base_SECTIONNAME.html`` для каждого "раздела" вашего сайта. Например, ``base_news.html``, ``base_sports.html``. Все эти шаблоны наследуют ``base.html`` и включают стили и дизайн специфические для конкретного раздела.

source: Create individual templates for each type of page, such as a news article or blog entry. These templates extend the appropriate section template.
ru: Создание шаблона для каждого типа страницы, такие как новость или запись в блоге. Эти шаблоны наследуют соответствующий шаблон раздела.

source: Here are some tips for working with inheritance:
ru: Вот несколько советов по работе с наследованием:

source: If you use :ttag:`{% extends %}<extends>` in a template, it must be the first template tag in that template. Template inheritance won't work, otherwise.
ru: Если вы используете :ttag:`{% extends %}<extends>`, он должен быть первым тегом в шаблоне. Иначе наследование не будет работать.

source: More :ttag:`{% block %}<block>` tags in your base templates are better. Remember, child templates don't have to define all parent blocks, so you can fill in reasonable defaults in a number of blocks, then only define the ones you need later. It's better to have more hooks than fewer hooks.
ru: Чем больше тегов :ttag:`{% block %}<block>` в вашем шаблоне, тем лучше. Помните, дочерний шаблон не обязан определять все блоки родительского, вы можете указать значение по умолчанию для всех блоков, а затем определить в дочернем шаблоне только те, которые необходимы. Лучше иметь больше "hooks", чем меньше "hooks".

source: If you find yourself duplicating content in a number of templates, it probably means you should move that content to a ``{% block %}`` in a parent template.
ru: Если вы дублируете содержимое в нескольких шаблонах, возможно вы должны перенести его в тег ``{% block %}`` родительского шаблона.

source: If you need to get the content of the block from the parent template, the ``{{ block.super }}`` variable will do the trick. This is useful if you want to add to the contents of a parent block instead of completely overriding it. Data inserted using ``{{ block.super }}`` will not be automatically escaped (see the `next section`_), since it was already escaped, if necessary, in the parent template.
ru: Если вам необходимо содержимое блока родительского шаблона, используйте переменную ``{{ block.super }}``. Эта полезно, если вам необходимо дополнить содержимое родительского блока, а не полностью переопределить его. Содержимое ``{{ block.super }}`` не будет автоматически экранировано (смотрите :ref:`раздел ниже <automatic-html-escaping>`), так как оно уже было экранировано, при необходимости, в родительском шаблоне.

source: Variables created outside of a :ttag:`{% block %}<block>` using the template tag ``as`` syntax can't be used inside the block. For example, this template doesn't render anything::
ru: Переменные, созданные вне блока :ttag:`{% block %}<block>`, с использованием ``as``, не могут использоваться внутри блока. Например, этот шаблон ничего не выведет::

source: For extra readability, you can optionally give a *name* to your ``{% endblock %}`` tag. For example::
ru: Для ясности, вы можете добавить *название* вашему тегу ``{% endblock %}``. Например::

source: In larger templates, this technique helps you see which ``{% block %}`` tags are being closed.
ru: В больших шаблонах такой подход поможет вам увидеть какой тег ``{% block %}`` был закрыт.

source: Finally, note that you can't define multiple :ttag:`block` tags with the same name in the same template. This limitation exists because a block tag works in "both" directions. That is, a block tag doesn't just provide a hole to fill -- it also defines the content that fills the hole in the *parent*. If there were two similarly-named :ttag:`block` tags in a template, that template's parent wouldn't know which one of the blocks' content to use.
ru: Вы не можете определить несколько тегов :ttag:`block` с одним названием в одном шаблоне. Такое ограничение существует потому, что тег :ttag:`block` работает в "оба" направления. :ttag:`block` не просто предоставляет "полость" в шаблоне -- он определяет содержимое, которое заполняет "полость" в *родительском шаблоне*. Если бы было несколько тегов :ttag:`block` с одним названием, родительский шаблон не знал содержимое какого блока использовать.

source: Automatic HTML escaping
ru: Автоматическое экранирование HTML

source: When generating HTML from templates, there's always a risk that a variable will include characters that affect the resulting HTML. For example, consider this template fragment::
ru: Создавая HTML используя шаблон, есть риск, что переменная может содержать символы, которые повлияют на структуру полученного HTML. Например, рассмотрим такой фрагмент::

source: At first, this seems like a harmless way to display a user's name, but consider what would happen if the user entered their name as this::
ru: На первый взгляд это кажется безобидным способом отображения имени пользователя, но давайте посмотрим, что произойдет, если пользователь выбрал такое имя:::
