Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/topics/http/decorators.po
Languages: ru

source: View decorators
ru: Декораторы представлений

source: Django provides several decorators that can be applied to views to support various HTTP features.
ru: Django предоставляет несколько декораторов, которые могут быть применены к функции представления, для поддержки различных функций HTTP.

source: Allowed HTTP methods
ru: Ограничение на тип HTTP запроса

source: The decorators in :mod:`django.views.decorators.http` can be used to restrict access to views based on the request method. These decorators will return a :class:`django.http.HttpResponseNotAllowed` if the conditions are not met.
ru: Декораторы из модуля :mod:`django.views.decorators.http` могут быть использованы для ограничения доступа к представлению в зависимости от типа запроса. Эти декораторы возвращают :class:`django.http.HttpResponseNotAllowed` если требования к типу запроса не удовлетворены.

source: Decorator to require that a view only accepts particular request methods. Usage::
ru: Декоратор позволяет представлению обрабатывать только указанные типы запросов. Например::

source: Note that request methods should be in uppercase.
ru: Заметим, что тип запроса должен быть указан в верхнем регистре.

source: Decorator to require that a view only accepts the GET method.
ru: Декоратор позволяет представлению обрабатывать только GET-запросы.

source: Decorator to require that a view only accepts the POST method.
ru: Декоратор позволяет представлению обрабатывать только POST-запросы.

source: Decorator to require that a view only accepts the GET and HEAD methods. These methods are commonly considered "safe" because they should not have the significance of taking an action other than retrieving the requested resource.
ru: Декоратор позволяет представлению обрабатывать только GET и HEAD запросы. Эти метода считаются "безопасными", потому что не должны предпринимать каких либо действий кроме получения данных.

source: Conditional view processing
ru: Условная обработка запроса

source: The following decorators in :mod:`django.views.decorators.http` can be used to control caching behavior on particular views.
ru: Декораторы из модуля :mod:`django.views.decorators.http` могут быть использованы для управления кэширования определенных представлений.

source: These decorators can be used to generate ``ETag`` and ``Last-Modified`` headers; see :doc:`conditional view processing </topics/conditional-view-processing>`.
ru: Эти декораторы могут использоваться для генерации заголовков ``ETag`` и ``Last-Modified``; смотрите раздел про :doc:`условную обработку запроса </topics/conditional-view-processing>`.

source: GZip compression
ru: Сжатие с использованием GZip

source: The decorators in :mod:`django.views.decorators.gzip` control content compression on a per-view basis.
ru: Декораторы из :mod:`django.views.decorators.gzip` управляют сжатием ответа представления.

source: This decorator compresses content if the browser allows gzip compression. It sets the ``Vary`` header accordingly, so that caches will base their storage on the ``Accept-Encoding`` header.
ru: Этот декоратор сжимает содержимое ответа, если браузер допускает gzip сжатие. Он устанавливает соответствующий заголовок ``Vary`` указывая учитывать заголовок ``Accept-Encoding`` при кэшировании.

source: Vary headers
ru: Заголовки Vary

source: The decorators in :mod:`django.views.decorators.vary` can be used to control caching based on specific request headers.
ru: Декораторы из модуля :mod:`django.views.decorators.vary` могут использоваться для кэширования по определенным заголовкам запроса.

source: The ``Vary`` header defines which request headers a cache mechanism should take into account when building its cache key.
ru: Заголовок ``Vary`` указывает какие заголовки должен использоваться кэширующий механизм при создании ключа кэша.

source: See :ref:`using vary headers <using-vary-headers>`.
ru: Смотрите :ref:`использование Vary заголовка <using-vary-headers>`.

source: Caching
ru: Кэширование

source: The decorators in :mod:`django.views.decorators.cache` control server and client-side caching.
ru: Декораторы из :mod:`django.views.decorators.cache` управляют кэшированием на стороне сервера и клиента

source: This decorator adds a ``Cache-Control: max-age=0, no-cache, no-store, must-revalidate`` header to a response to indicate that a page should never be cached.
ru: Декоратор добавляет заголовок ``Cache-Control: max-age=0, no-cache, no-store, must-revalidate`` к ответу, указывая, что странице не должна никогда кэшироваться.

source: Before Django 1.9, ``Cache-Control: max-age=0`` was sent. This didn't reliably prevent caching in all browsers.
ru: До Django 1.9 отправлялся ``Cache-Control: max-age=0``. Это не работало во всех браузерах.
