Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/topics/http/file-uploads.po
Languages: ru

source: File Uploads
ru: Загрузка файлов

source: When Django handles a file upload, the file data ends up placed in :attr:`request.FILES <django.http.HttpRequest.FILES>` (for more on the ``request`` object see the documentation for :doc:`request and response objects </ref/request-response>`). This document explains how files are stored on disk and in memory, and how to customize the default behavior.
ru: Когда Django обрабатывает загрузку файла, данные о нем в конце концов попадают в :attr:`request.FILES <django.http.HttpRequest.FILES>` (подробнее об объекте ``request`` смотрите в :doc:`соответствующем разделе </ref/request-response>`). Этот раздел описывает как файлы сохраняются на диск или в памяти и как переопределить это.

source: There are security risks if you are accepting uploaded content from untrusted users! See the security guide's topic on :ref:`user-uploaded-content-security` for mitigation details.
ru: Принимать загруженный контент от непроверенных пользователей -- опасно! Подробности смотрите в :ref:`user-uploaded-content-security`.

source: Basic file uploads
ru: Основы загрузки файла

source: A view handling this form will receive the file data in :attr:`request.FILES <django.http.HttpRequest.FILES>`, which is a dictionary containing a key for each :class:`~django.forms.FileField` (or :class:`~django.forms.ImageField`, or other :class:`~django.forms.FileField` subclass) in the form. So the data from the above form would be accessible as ``request.FILES['file']``.
ru: Представление, обрабатывающее эту форму, получает данные файла из :attr:`request.FILES <django.http.HttpRequest.FILES>`, который является словарем содержащим ключ для каждого поля :class:`~django.forms.FileField` (или :class:`~django.forms.ImageField`, или подкласса :class:`~django.forms.FileField`) в форме. Так что данные из формы выше будут доступны в ``request.FILES['file']``.

source: Note that :attr:`request.FILES <django.http.HttpRequest.FILES>` will only contain data if the request method was ``POST`` and the ``<form>`` that posted the request has the attribute ``enctype="multipart/form-data"``. Otherwise, ``request.FILES`` will be empty.
ru: Заметим, что атрибут :attr:`request.FILES <django.http.HttpRequest.FILES>` будет содержать данные только при ``POST`` запросе и если форма ``<form>`` содержит ``enctype="multipart/form-data"``. В противном случае ``request.FILES`` будет пустым.

source: Notice that we have to pass :attr:`request.FILES <django.http.HttpRequest.FILES>` into the form's constructor; this is how file data gets bound into a form.
ru: Заметим, что вы должны передать :attr:`request.FILES <django.http.HttpRequest.FILES>` в конструктор формы.

source: Here's a common way you might handle an uploaded file::
ru: Вот пример стандартной обработки загруженного файла::

source: Looping over ``UploadedFile.chunks()`` instead of using ``read()`` ensures that large files don't overwhelm your system's memory.
ru: Цикл по ``UploadedFile.chunks()``, вместо использования ``read()``, обезопасит вас от нагрузки системы при загрузке большого файла.

source: There are a few other methods and attributes available on ``UploadedFile`` objects; see :class:`UploadedFile` for a complete reference.
ru: Объект ``UploadedFile`` содержит и другие методы и атрибуты, смотрите описание :class:`UploadedFile`.

source: Handling uploaded files with a model
ru: Обработка загруженных файлов используя модель

source: If you're saving a file on a :class:`~django.db.models.Model` with a :class:`~django.db.models.FileField`, using a :class:`~django.forms.ModelForm` makes this process much easier. The file object will be saved to the location specified by the :attr:`~django.db.models.FileField.upload_to` argument of the corresponding :class:`~django.db.models.FileField` when calling ``form.save()``::
ru: Если вы сохраняете файлы для модели :class:`~django.db.models.Model` с :class:`~django.db.models.FileField`, использование :class:`~django.forms.ModelForm` значительно упростит этот процесс. Файл будет сохранен по указанному в аргументе :attr:`~django.db.models.FileField.upload_to` поля :class:`~django.db.models.FileField` пути, при вызове ``form.save()``::

source: If you are constructing an object manually, you can simply assign the file object from :attr:`request.FILES <django.http.HttpRequest.FILES>` to the file field in the model::
ru: Если вы создаете объект самостоятельно, вы можете назначить файл из :attr:`request.FILES <django.http.HttpRequest.FILES>` соответствующему полю модели::

source: Upload Handlers
ru: Обработчики загрузки

source: When a user uploads a file, Django passes off the file data to an *upload handler* -- a small class that handles file data as it gets uploaded. Upload handlers are initially defined in the :setting:`FILE_UPLOAD_HANDLERS` setting, which defaults to::
ru: Когда пользователь загружает файл, Django передает содержимое файла в *обработчик загрузки* -- небольшой класс, который обрабатывает загруженные данные. Обработчики загрузки определенны в настройке :setting:`FILE_UPLOAD_HANDLERS`, по умолчанию::

source: Together :class:`MemoryFileUploadHandler` and :class:`TemporaryFileUploadHandler` provide Django's default file upload behavior of reading small files into memory and large ones onto disk.
ru: :class:`MemoryFileUploadHandler` и :class:`TemporaryFileUploadHandler` определяются обработку файлов по умолчанию в Django, загрузка небольших файлов в память и больших на диск.

source: You can write custom handlers that customize how Django handles files. You could, for example, use custom handlers to enforce user-level quotas, compress data on the fly, render progress bars, and even send data to another storage location directly without storing it locally. See :ref:`custom_upload_handlers` for details on how you can customize or completely replace upload behavior.
ru: Вы можете написать собственный обработчик загрузки файлов. Вы можете использовать его, например, для определения квоты для пользователей на загрузку файлов, сжатие данных "на лету", отображение прогресса загрузки файла, или пересылать файл в хранилище данных без сохранения его локально. Смотрите :ref:`custom_upload_handlers`, чтобы узнать как настроить или полностью переопределить поведение загрузки.

source: Where uploaded data is stored
ru: Где хранятся загруженный данные

source: Before you save uploaded files, the data needs to be stored somewhere.
ru: Перед тем, как вы сохраните загруженный файл, загруженные данные должны где-то храниться.

source: By default, if an uploaded file is smaller than 2.5 megabytes, Django will hold the entire contents of the upload in memory. This means that saving the file involves only a read from memory and a write to disk and thus is very fast.
ru: По умолчанию, если загруженный файл меньше 2.5 мегабайт, Django поместит содержимое файла в память. Это означает, что при сохранении файла содержимое прочитается с памяти и сохранится на диск, а это быстрая операция.

source: However, if an uploaded file is too large, Django will write the uploaded file to a temporary file stored in your system's temporary directory. On a Unix-like platform this means you can expect Django to generate a file called something like ``/tmp/tmpzfp6I6.upload``. If an upload is large enough, you can watch this file grow in size as Django streams the data onto disk.
ru: Однако, если загруженный файл большой, Django запишет его во временный каталог вашей системы. На Unix-системах это означает, что Django создаст, например, такой файл ``/tmp/tmpzfp6I6.upload``. Если загружаемый файл достаточно большой, вы можете отследить, как увеличивается размер файла, в процессе загрузки данных.

source: These specifics -- 2.5 megabytes; ``/tmp``; etc. -- are simply "reasonable defaults" which can be customized as described in the next section.
ru: Эти значения -- 2.5 мегабайта, ``/tmp`` и др. -- просто «разумные значения по умолчанию", которое вы можете переопределить. Об этом в следующем разделе.

source: Changing upload handler behavior
ru: Изменение процесса загрузки

source: There are a few settings which control Django's file upload behavior. See :ref:`File Upload Settings <file-upload-settings>` for details.
ru: Процесс загрузки файлов использует несколько настроек. Подробности смотрите в :ref:`разделе настроек <file-upload-settings>`.

source: Modifying upload handlers on the fly
ru: Изменение обработчиков загрузки файла "на лету"

source: Sometimes particular views require different upload behavior. In these cases, you can override upload handlers on a per-request basis by modifying ``request.upload_handlers``. By default, this list will contain the upload handlers given by :setting:`FILE_UPLOAD_HANDLERS`, but you can modify the list as you would any other list.
ru: Иногда различные представления требуют различной обработки загруженных файлов. В таких случаях вы можете переопределить обработчики загрузки, изменив ``request.upload_handlers``. По умолчанию этот атрибут содержит обработчики из настройки :setting:`FILE_UPLOAD_HANDLERS`, но вы можете изменить его.

source: For instance, suppose you've written a ``ProgressBarUploadHandler`` that provides feedback on upload progress to some sort of AJAX widget. You'd add this handler to your upload handlers like this::
ru: Например, вы создали ``ProgressBarUploadHandler``, который уведомляет страницу через AJAX-запросы о прогрессе загрузки файла . Вы можете использовать его таким образом::

source: You'd probably want to use ``list.insert()`` in this case (instead of ``append()``) because a progress bar handler would need to run *before* any other handlers. Remember, the upload handlers are processed in order.
ru: Использование ``list.insert()`` в этом случае (вместо ``append()``) буде уместней, так как обработчик, уведомляющий о прогрессе загрузки, должен использоваться *перед* другими обработчиками. Запомните, обработчики загрузки используются по-порядку.

source: If you want to replace the upload handlers completely, you can just assign a new list::
ru: Если вы хотите полностью переопределить обработчики, просто укажите новый список::

source: You can only modify upload handlers *before* accessing ``request.POST`` or ``request.FILES`` -- it doesn't make sense to change upload handlers after upload handling has already started. If you try to modify ``request.upload_handlers`` after reading from ``request.POST`` or ``request.FILES`` Django will throw an error.
ru: Вы можете изменить обработчики загрузок *перед* использованием ``request.POST`` или ``request.FILES`` -- не имеет смысла это делать после начала загрузки. Если вы попытаетесь изменить ``request.upload_handlers`` после использования ``request.POST`` или ``request.FILES``, Django вызовет исключение.

source: Thus, you should always modify uploading handlers as early in your view as possible.
ru: Вы должны изменять обработчики загрузки в представлении как можно раньше.

source: Also, ``request.POST`` is accessed by :class:`~django.middleware.csrf.CsrfViewMiddleware` which is enabled by default. This means you will need to use :func:`~django.views.decorators.csrf.csrf_exempt` on your view to allow you to change the upload handlers. You will then need to use :func:`~django.views.decorators.csrf.csrf_protect` on the function that actually processes the request. Note that this means that the handlers may start receiving the file upload before the CSRF checks have been done. Example code::
ru: Также ``request.POST`` используется :class:`~django.middleware.csrf.CsrfViewMiddleware`, который включен по умолчанию. Это означает, что вы должны использовать :func:`~django.views.decorators.csrf.csrf_exempt` для представления, в котором собираетесь изменить обработчики загрузки. Также не забывайте воспользоваться декоратором :func:`~django.views.decorators.csrf.csrf_protect` для функции, которая будет обрабатывать запрос. Обратите внимание, что получение файла может начаться перед выполнением CSRF проверки. Например::
