Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/topics/http/sessions.po
Languages: ru

source: As a convenience, Django provides an easy way to test whether the user's browser accepts cookies. Just call the :meth:`~backends.base.SessionBase.set_test_cookie` method of ``request.session`` in a view, and call :meth:`~backends.base.SessionBase.test_cookie_worked` in a subsequent view -- not in the same view call.
ru: Для удобства Django представляет простой способ проверить принимает ли браузер пользователя куки или нет. Просто вызовите метод :meth:`~backends.base.SessionBase.set_test_cookie` объекта ``request.session`` в предоставлении и затем вызовите метод :meth:`~backends.base.SessionBase.test_cookie_worked` в следующем вызове представления, это важный момент.

source: This awkward split between ``set_test_cookie()`` and ``test_cookie_worked()`` is necessary due to the way cookies work. When you set a cookie, you can't actually tell whether a browser accepted it until the browser's next request.
ru: Такое неудобное разделение ``set_test_cookie()`` и ``test_cookie_worked()`` между вызовами предоставления необходимо из-за особенностей работы механизма кук. Когда вы устанавливаете куку, вы не можете гарантировать, что браузер действительно принял куке до тех пор, пока браузер не выполнит следующий запрос.

source: It's good practice to use :meth:`~backends.base.SessionBase.delete_test_cookie()` to clean up after yourself. Do this after you've verified that the test cookie worked.
ru: Хорошим тоном будет использование метода :meth:`~backends.base.SessionBase.delete_test_cookie()` для очистки куки после проверки. Очистку следует выполнять после окончания этапа проверки наличия поддержки кук.

source: Here's a typical usage example::
ru: Покажем типичный вариант использования::

source: Using sessions out of views
ru: Использование сессий вне представлений

source: The examples in this section import the ``SessionStore`` object directly from the ``django.contrib.sessions.backends.db`` backend. In your own code, you should consider importing ``SessionStore`` from the session engine designated by :setting:`SESSION_ENGINE`, as below:
ru: Примеры в данном разделе импортируют объект ``SessionStore`` напрямую из хранилища ``django.contrib.sessions.backends.db``. В своём коде вам стоит рассмотреть импортирование ``SessionStore`` из движка сессий, определенного параметром конфигурации :setting:`SESSION_ENGINE`, как показано ниже:

source: An API is available to manipulate session data outside of a view::
ru: Для манипуляции данными сессии вне представления доступно API::

source: If you're using the ``django.contrib.sessions.backends.db`` backend, each session is just a normal Django model. The ``Session`` model is defined in ``django/contrib/sessions/models.py``. Because it's a normal model, you can access sessions using the normal Django database API::
ru: При использовании хранилища ``django.contrib.sessions.backends.db`` каждая сессия будет представлена в виде обычной модели Django. Модель ``Session`` определена в ``django/contrib/sessions/models.py``. Раз это обычная модель, то вы можете работать с ней через стандартный интерфейс::

source: When sessions are saved
ru: Когда сохраняются сессии

source: By default, Django only saves to the session database when the session has been modified -- that is if any of its dictionary values have been assigned or deleted::
ru: Обычно Django выполняет сохранение в базу данных сессии только в случае внесения изменений в сессию, то есть при назначении или удалении значений словаря::

source: In the last case of the above example, we can tell the session object explicitly that it has been modified by setting the ``modified`` attribute on the session object::
ru: В последнем случае вышеприведённого примера мы можем явно указать объекту сессии, что он был модифицирован, для этого надо у него установить атрибут ``modified``::

source: To change this default behavior, set the :setting:`SESSION_SAVE_EVERY_REQUEST` setting to ``True``. When set to ``True``, Django will save the session to the database on every single request.
ru: Для того, чтобы изменить это поведение установите параметр конфигурации :setting:`SESSION_SAVE_EVERY_REQUEST` в ``True``. Это укажет Django на то, что необходимо сохранять сессию в базу данных при каждом запросе.

source: Note that the session cookie is only sent when a session has been created or modified. If :setting:`SESSION_SAVE_EVERY_REQUEST` is ``True``, the session cookie will be sent on every request.
ru: Следует отметить, что сессионная кука отправляется только при создании и модификации сессии. Если параметр конфигурации :setting:`SESSION_SAVE_EVERY_REQUEST` установлен в ``True``, сессионная кука будет отправляться на каждый запрос.

source: Similarly, the ``expires`` part of a session cookie is updated each time the session cookie is sent.
ru: Аналогично, значение атрибутп ``expires`` сессионной куки обновляется при каждой её отправке.

source: The session is not saved if the response's status code is 500.
ru: Сессия не сохраняется, если отклик имеет статус 500.

source: Browser-length sessions vs. persistent sessions
ru: Разница между временными и постоянными куками

source: You can control whether the session framework uses browser-length sessions vs. persistent sessions with the :setting:`SESSION_EXPIRE_AT_BROWSER_CLOSE` setting.
ru: Вы можете указать какой должна быть длительность сессии, пока браузер не завершается или до некоторой даты, с помощью параметра конфигурации :setting:`SESSION_EXPIRE_AT_BROWSER_CLOSE`.

source: By default, :setting:`SESSION_EXPIRE_AT_BROWSER_CLOSE` is set to ``False``, which means session cookies will be stored in users' browsers for as long as :setting:`SESSION_COOKIE_AGE`. Use this if you don't want people to have to log in every time they open a browser.
ru: По умолчанию параметр конфигурации :setting:`SESSION_EXPIRE_AT_BROWSER_CLOSE` установлен в ``False``, это означает, что сессионные куки будут храниться в браузере пользователя до тех пор, пока не истечёт время, указанное в параметре конфигурации :setting:`SESSION_COOKIE_AGE`. Используйте это если не желаете, чтобы пользователи авторизовались на сайте при каждом открытии браузера.

source: If :setting:`SESSION_EXPIRE_AT_BROWSER_CLOSE` is set to ``True``, Django will use browser-length cookies -- cookies that expire as soon as the user closes their browser. Use this if you want people to have to log in every time they open a browser.
ru: Если параметр конфигурации :setting:`SESSION_EXPIRE_AT_BROWSER_CLOSE` установлен в ``True``, то Django будет использовать временные куки, такие куки работают до момента закрытия браузера. Используйте это если желаете, чтобы пользователи авторизовались на сайте при каждом открытии браузера.

source: This setting is a global default and can be overwritten at a per-session level by explicitly calling the :meth:`~backends.base.SessionBase.set_expiry` method of ``request.session`` as described above in `using sessions in views`_.
ru: Данный параметр конфигурации является глобальным, но может быть переопределён на уровне сессии с помощью явного вызова метода :meth:`~backends.base.SessionBase.set_expiry` объекта ``request.session`` как было описано выше в `using sessions in views`_.

source: Some browsers (Chrome, for example) provide settings that allow users to continue browsing sessions after closing and re-opening the browser. In some cases, this can interfere with the :setting:`SESSION_EXPIRE_AT_BROWSER_CLOSE` setting and prevent sessions from expiring on browser close. Please be aware of this while testing Django applications which have the :setting:`SESSION_EXPIRE_AT_BROWSER_CLOSE` setting enabled.
ru: Некоторые браузеры (например, Chrome) представляют пользователям возможность продлевать временную сессию после закрытия и запуска браузера. В некоторых случаях это может пересекаться с параметром конфигурации :setting:`SESSION_EXPIRE_AT_BROWSER_CLOSE` и препятствовать закрытию сессии при завершении работы браузера. Обращайте на это внимание во время тестирования Django приложений, у которых установлен параметр конфигурации :setting:`SESSION_EXPIRE_AT_BROWSER_CLOSE`.

source: Clearing the session store
ru: Очистка хранилища сессии

source: As users create new sessions on your website, session data can accumulate in your session store. If you're using the database backend, the ``django_session`` database table will grow. If you're using the file backend, your temporary directory will contain an increasing number of files.
ru: По мере создания пользователями новых сессий на вашем сайте в хранилище сессий накапливаются данные этих сессий. При использовании базы данных в качестве хранилища, таблица ``django_session`` постепенно наполняется. При использовании файлов в качестве хранилища, временный каталог будет содержать всё больше и больше файлов.

source: To understand this problem, consider what happens with the database backend. When a user logs in, Django adds a row to the ``django_session`` database table. Django updates this row each time the session data changes. If the user logs out manually, Django deletes the row. But if the user does *not* log out, the row never gets deleted. A similar process happens with the file backend.
ru: Для понимания проблемы давайте рассмотрим, что произойдёт с хранилищем на основе базы данных. При авторизации пользователя Django добавляет запись в таблицу ``django_session``. Django обновляет эту запись при каждом изменении данных сессии. Если пользователь завершает сеанс явно, то Django удаляет эту запись. В противном случае эта запись не удаляется. Похожее происходит и в случае файлового хранилища.

source: Django does *not* provide automatic purging of expired sessions. Therefore, it's your job to purge expired sessions on a regular basis. Django provides a clean-up management command for this purpose: :djadmin:`clearsessions`. It's recommended to call this command on a regular basis, for example as a daily cron job.
ru: Django *не обеспечивает* автоматическую очистку просроченных сессий. Следовательно, эта задача ложится на вас на регулярной основе. Django представляет для этой цели команду очистки: :djadmin:`clearsessions`. Рекомендуется выполнять эту команду на регулярной основе, например, через cron ежедневно.

source: Note that the cache backend isn't vulnerable to this problem, because caches automatically delete stale data. Neither is the cookie backend, because the session data is stored by the users' browsers.
ru: Следует отметить, что хранилище на основе кэша не подтверждено этой проблеме так как кэш автоматически удаляет устаревшие данные. Так же нет проблемы и с хранилищем на основе кук, потому что они хранятся в браузерах у пользователей.

source: Settings
ru: Параметры конфигурации

source: A few :ref:`Django settings <settings-sessions>` give you control over session behavior:
ru: Несколько :ref:`параметров конфигурации Django <settings-sessions>` представляют вам управление поведением сессии:

source: Session security
ru: Безопасность сессии

source: Subdomains within a site are able to set cookies on the client for the whole domain. This makes session fixation possible if cookies are permitted from subdomains not controlled by trusted users.
ru: Поддомены внутри сайта имеют возможность устанавливать куки на клиенте для всего домена. Это приводит к возможности фиксации сессии, если куки принимаются от поддоменов, которые не находятся под управлением доверенных пользователей.

source: For example, an attacker could log into ``good.example.com`` and get a valid session for their account. If the attacker has control over ``bad.example.com``, they can use it to send their session key to you since a subdomain is permitted to set cookies on ``*.example.com``. When you visit ``good.example.com``, you'll be logged in as the attacker and might inadvertently enter your sensitive personal data (e.g. credit card info) into the attackers account.
ru: Например, атакующий может авторизоваться на ``good.example.com`` и получить достоверную сессию для своего аккаунта. Если у атакующего есть контроль над ``bad.example.com``, он может использовать его для отправки своего ключа сессии вам, так как поддомену разрешено устанавливать куки для ``*.example.com``. Когда вы посетите ``good.example.com``, вы будете авторизован как атакующий и можете непреднамеренно внести важные персональные данные (например, номер кредитной карты) в аккаунт атакующего.

source: Technical details
ru: Технические детали

source: Session data is stored in a database table named ``django_session`` .
ru: Данные сессии сохраняются в базе данных в таблице ``django_session`` .

source: Django only sends a cookie if it needs to. If you don't set any session data, it won't send a session cookie.
ru: Django отправляем куки только когда это требуется. Если вы не сохранили никаких данных в сессию, то сессионная кука не будет отправляться.

source: Session IDs in URLs
ru: Идентификаторы сессии в URL

source: The Django sessions framework is entirely, and solely, cookie-based. It does not fall back to putting session IDs in URLs as a last resort, as PHP does. This is an intentional design decision. Not only does that behavior make URLs ugly, it makes your site vulnerable to session-ID theft via the "Referer" header.
ru: Поддержка сессий в Django полностью, и исключительно, основана на кук. Django не помещает идентификатор сессии в URL в качестве крайнего варианта, как это делает PHP. Это - осознанное проектное решение. Мало того, что такое поведение делает URL уродливыми, оно делает ваш сайт уязвимым для воровства идентификатора сессии через заголовок "Referer".
