Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/topics/http/sessions.po
Languages: ru

source: How to use sessions
ru: Как использовать сессии

source: Django provides full support for anonymous sessions. The session framework lets you store and retrieve arbitrary data on a per-site-visitor basis. It stores data on the server side and abstracts the sending and receiving of cookies. Cookies contain a session ID -- not the data itself (unless you're using the :ref:`cookie based backend<cookie-session-backend>`).
ru: Django полностью поддерживает сессии для анонимных пользователей, позволяет сохранять и получать данные для каждой посетителя сайта. Механизм сессии сохраняет данные на сервере и самостоятельно управляет сессионными куками. Куки содержат ID сессии, а не сами данные (если только вы не используете :ref:`бэкенд на основе кук<cookie-session-backend>`).

source: Enabling sessions
ru: Активируем сессии

source: Sessions are implemented via a piece of :doc:`middleware </ref/middleware>`.
ru: Сессии реализованы через :doc:`промежуточный слой </ref/middleware>`.

source: To enable session functionality, do the following:
ru: Чтобы активировать сессии, выполните следующие действия:

source: Configuring the session engine
ru: Настройка сессий

source: By default, Django stores sessions in your database (using the model ``django.contrib.sessions.models.Session``). Though this is convenient, in some setups it's faster to store session data elsewhere, so Django can be configured to store session data on your filesystem or in your cache.
ru: По умолчанию, Django хранит сессии в базе данных (используя модель ``django.contrib.sessions.models.Session``). В некоторых случаях лучше хранить данные сессии в других хранилищах, поэтому Django позволяет использовать файловую систему или кэш.

source: Using database-backed sessions
ru: Использование базы данных для хранения сессии

source: If you want to use a database-backed session, you need to add ``'django.contrib.sessions'`` to your :setting:`INSTALLED_APPS` setting.
ru: Если вы хотите использовать базу данных для хранения сессии, укажите ``'django.contrib.sessions'`` в настройке :setting:`INSTALLED_APPS`.

source: Once you have configured your installation, run ``manage.py migrate`` to install the single database table that stores session data.
ru: После настройки выполните ``manage.py migrate``, чтобы добавить таблицу в базу данных.

source: Using cached sessions
ru: Использование кэша для хранения сессии

source: For better performance, you may want to use a cache-based session backend.
ru: Для улучшения производительности вы можете использовать кэш для хранения сессии.

source: To store session data using Django's cache system, you'll first need to make sure you've configured your cache; see the :doc:`cache documentation </topics/cache>` for details.
ru: Для этого вы должны настроить кэш, смотрите :doc:`раздел о кэше </topics/cache>`.

source: You should only use cache-based sessions if you're using the Memcached cache backend. The local-memory cache backend doesn't retain data long enough to be a good choice, and it'll be faster to use file or database sessions directly instead of sending everything through the file or database cache backends. Additionally, the local-memory cache backend is NOT multi-process safe, therefore probably not a good choice for production environments.
ru: Вам следует использовать кэш только при использовании Memcached. Кэш в памяти не хранит данные достаточно долго, и лучше использовать файлы или базу данных для сессии, чем каждый раз обращаться к кэшу в файловой системе или базе данных. Также кэш в памяти использует различные экземпляры кэша для разных процессов.

source: If you have multiple caches defined in :setting:`CACHES`, Django will use the default cache. To use another cache, set :setting:`SESSION_CACHE_ALIAS` to the name of that cache.
ru: Если вы указали несколько кэшей в :setting:`CACHES`, Django будет использовать кэш по умолчанию. Чтобы использовать другой кэш, укажите его название в :setting:`SESSION_CACHE_ALIAS`.

source: Once your cache is configured, you've got two choices for how to store data in the cache:
ru: После настройки кэша у вас есть две опции, определяющие как хранить данные в кэше:

source: Set :setting:`SESSION_ENGINE` to ``"django.contrib.sessions.backends.cache"`` for a simple caching session store. Session data will be stored directly in your cache. However, session data may not be persistent: cached data can be evicted if the cache fills up or if the cache server is restarted.
ru: Указать ``"django.contrib.sessions.backends.cache"`` в :setting:`SESSION_ENGINE`. Данные сессии будут храниться непосредственно в кэше. Однако, данные могут быть удалены при переполнении кэша или перезагрузке сервера кэша.

source: For persistent, cached data, set :setting:`SESSION_ENGINE` to ``"django.contrib.sessions.backends.cached_db"``. This uses a write-through cache -- every write to the cache will also be written to the database. Session reads only use the database if the data is not already in the cache.
ru: Для постоянного хранения закэшированных данных укажите ``"django.contrib.sessions.backends.cached_db"`` в :setting:`SESSION_ENGINE`. Все записи в кэш будут продублированы в базу данных. База данных будет использоваться, если данные не найдены в кэше.

source: Both session stores are quite fast, but the simple cache is faster because it disregards persistence. In most cases, the ``cached_db`` backend will be fast enough, but if you need that last bit of performance, and are willing to let session data be expunged from time to time, the ``cache`` backend is for you.
ru: Оба варианта работают достаточно быстро, но первый немного быстрее. Для большинства случаев ``cached_db`` будет достаточно быстрым, но если производительность для вас важнее, чем надежное хранение сессии, используйте бэкенд ``cache``.

source: If you use the ``cached_db`` session backend, you also need to follow the configuration instructions for the `using database-backed sessions`_.
ru: Если вы используете ``cached_db``, вам необходимо настроить и бэкенд базы данных.

source: Using file-based sessions
ru: Использование файловой системы для хранения сессии

source: To use file-based sessions, set the :setting:`SESSION_ENGINE` setting to ``"django.contrib.sessions.backends.file"``.
ru: Чтобы использовать файловую систему, укажите ``"django.contrib.sessions.backends.file"`` в :setting:`SESSION_ENGINE`.

source: You might also want to set the :setting:`SESSION_FILE_PATH` setting (which defaults to output from ``tempfile.gettempdir()``, most likely ``/tmp``) to control where Django stores session files. Be sure to check that your Web server has permissions to read and write to this location.
ru: Вы также можете указать :setting:`SESSION_FILE_PATH` (по умолчанию ``tempfile.gettempdir()``, обычно это ``/tmp``), чтобы указать Django, где сохранять сессионные файлы. Убедитесь, что ваш сервер имеет права на чтение и запись указанного каталога.

source: Using cookie-based sessions
ru: Хранение сессии в куках

source: To use cookies-based sessions, set the :setting:`SESSION_ENGINE` setting to ``"django.contrib.sessions.backends.signed_cookies"``. The session data will be stored using Django's tools for :doc:`cryptographic signing </topics/signing>` and the :setting:`SECRET_KEY` setting.
ru: Чтобы хранить сессию в куках, укажите ``"django.contrib.sessions.backends.signed_cookies"`` в :setting:`SESSION_ENGINE`. Данные сессии будут сохранены в куках, используя :doc:`криптографическую подпись </topics/signing>` и значение :setting:`SECRET_KEY`.

source: It's recommended to leave the :setting:`SESSION_COOKIE_HTTPONLY` setting on ``True`` to prevent access to the stored data from JavaScript.
ru: Рекомендуем указать ``True`` в :setting:`SESSION_COOKIE_HTTPONLY`, чтобы запретить доступ JavaScript к кукам.

source: **If the SECRET_KEY is not kept secret and you are using the** :class:`~django.contrib.sessions.serializers.PickleSerializer`, **this can lead to arbitrary remote code execution.**
ru: **Если SECRET_KEY не хранить в безопасности при использовании** :class:`~django.contrib.sessions.serializers.PickleSerializer`, **можно пострадать от атаки удаленного выполнения кода.**

source: An attacker in possession of the :setting:`SECRET_KEY` can not only generate falsified session data, which your site will trust, but also remotely execute arbitrary code, as the data is serialized using pickle.
ru: Злоумышленник, узнав :setting:`SECRET_KEY`, может не только подделать данные сессии, но и выполнить удаленный код, т.к. данные сессии используют ``pickle``.

source: If you use cookie-based sessions, pay extra care that your secret key is always kept completely secret, for any system which might be remotely accessible.
ru: Если вы храните сессию в куках, храните ваш секретный ключ максимально надежно для всех систем, которые используются пользователем.

source: **The session data is signed but not encrypted**
ru: **Сессионные данные подписаны, но не закодированы**

source: When using the cookies backend the session data can be read by the client.
ru: Клиент может прочитать данные сессии, если вы храните их в куках.

source: A MAC (Message Authentication Code) is used to protect the data against changes by the client, so that the session data will be invalidated when being tampered with. The same invalidation happens if the client storing the cookie (e.g. your user's browser) can't store all of the session cookie and drops data. Even though Django compresses the data, it's still entirely possible to exceed the `common limit of 4096 bytes`_ per cookie.
ru: MAC (Message Authentication Code) используется для защиты данных от подделки пользователем. Данные будут недействительными, если пользователь попытается их поменять. Аналогичное происходит, если клиент, который хранит куки (например, браузер пользователя), не может сохранить сессионную куку и удаляет её. Несмотря на то , что Django сжимает данные, вполне возможно превысить `принятый лимит 4096 байтов <http://tools.ietf.org/html/rfc2965#section-5.3>`_ на куку.

source: **No freshness guarantee**
ru: **Актуальность не гарантируется**

source: Note also that while the MAC can guarantee the authenticity of the data (that it was generated by your site, and not someone else), and the integrity of the data (that it is all there and correct), it cannot guarantee freshness i.e. that you are being sent back the last thing you sent to the client. This means that for some uses of session data, the cookie backend might open you up to `replay attacks`_. Unlike other session backends which keep a server-side record of each session and invalidate it when a user logs out, cookie-based sessions are not invalidated when a user logs out. Thus if an attacker steals a user's cookie, they can use that cookie to login as that user even if the user logs out. Cookies will only be detected as 'stale' if they are older than your :setting:`SESSION_COOKIE_AGE`.
ru: Обратите внимание, хотя MAC может гарантировать авторизацию данных (что они были созданы вашим сайтом, а не кем-то другим), и целостность данных (данные не менялись и правильны), он не может гарантировать актуальность, то есть, что полученные данные последние, которые вы отсылали клиенту. Это означает, что при определенном использовании кук для сессии, ваш сайт может быть подвержен `replay атакам <https://en.wikipedia.org/wiki/Replay_attack>`_. В отличии от других бэкендов сессии, которые хранят данные на сервере и очищают их при выходе пользователя(log out), сессия в куках не очищается, когда пользователь выходит. По этому, если атакующий украдет куки пользователя, он может использовать их для входа даже после того, как пользователь вышел с сайта. Куки будут определены как устаревшие, если только они старее чем :setting:`SESSION_COOKIE_AGE`.

source: **Performance**
ru: **Производительность**

source: Finally, the size of a cookie can have an impact on the `speed of your site`_.
ru: Наконец, размер кук может повлиять на `производительность вашего сайта <http://yuiblog.com/blog/2007/03/01/performance-research-part-3/>`_.

source: Using sessions in views
ru: Использование сессии в представлениях

source: When ``SessionMiddleware`` is activated, each :class:`~django.http.HttpRequest` object -- the first argument to any Django view function -- will have a ``session`` attribute, which is a dictionary-like object.
ru: Когда ``SessionMiddleware`` активный, каждый объект :class:`~django.http.HttpRequest` -- первый аргумент представления в Django -- будет содержать атрибут ``session``, который является объектом с интерфейсом словаря.

source: You can read it and write to ``request.session`` at any point in your view. You can edit it multiple times.
ru: Вы можете читать и менять ``request.session`` в любом месте вашего представления множество раз.

source: This is the base class for all session objects. It has the following standard dictionary methods:
ru: Это базовый класс для всех объектов сессии. Он предоставляет набор стандартных методов словаря:

source: Example: ``fav_color = request.session['fav_color']``
ru: Например: ``fav_color = request.session['fav_color']``

source: Example: ``request.session['fav_color'] = 'blue'``
ru: Например: ``request.session['fav_color'] = 'blue'``

source: Example: ``del request.session['fav_color']``. This raises ``KeyError`` if the given ``key`` isn't already in the session.
ru: Например: ``del request.session['fav_color']``. Вызовет ``KeyError``, если ``key`` ещё не в сессии.

source: Example: ``'fav_color' in request.session``
ru: Например: ``'fav_color' in request.session``

source: Example: ``fav_color = request.session.get('fav_color', 'red')``
ru: Например: ``fav_color = request.session.get('fav_color', 'red')``

source: It also has these methods:
ru: Также содержит следующие методы:

source: Sets a test cookie to determine whether the user's browser supports cookies. Due to the way cookies work, you won't be able to test this until the user's next page request. See `Setting test cookies`_ below for more information.
ru: Устанавливает тестовую куку, чтобы проверить, что браузер пользователя поддерживает куки. Из-за особенностей работы кук вы не сможете проверить тестовую куку, пока пользователь не запросит следующую страницу. Подробности смотрите ниже (`Setting test cookies`_).

source: Returns either ``True`` or ``False``, depending on whether the user's browser accepted the test cookie. Due to the way cookies work, you'll have to call ``set_test_cookie()`` on a previous, separate page request. See `Setting test cookies`_ below for more information.
ru: Возвращает ``True`` или ``False``, в зависимости от того, принял ли бразуер пользователя тестовую куку. Из-за особенностей работы кук вам необходимо вызывать в предыдущем запросе ``set_test_cookie()``. Подробности смотрите ниже (`Setting test cookies`_).

source: Deletes the test cookie. Use this to clean up after yourself.
ru: Удаляет тестовую куку. Используйте, чтобы убрать за собой.

source: Sets the expiration time for the session. You can pass a number of different values:
ru: Указывает время жизни сессии. Вы можете передать различные значения:

source: If ``value`` is an integer, the session will expire after that many seconds of inactivity. For example, calling ``request.session.set_expiry(300)`` would make the session expire in 5 minutes.
ru: Если ``value`` целое число, сессия истечет после указанного количества секунд неактивности пользователя. Например, ``request.session.set_expiry(300)`` установит время жизни равное 5 минутам.

source: If ``value`` is a ``datetime`` or ``timedelta`` object, the session will expire at that specific date/time. Note that ``datetime`` and ``timedelta`` values are only serializable if you are using the :class:`~django.contrib.sessions.serializers.PickleSerializer`.
ru: Если ``value`` это ``datetime`` или ``timedelta``, сессия истечёт в указанное время. Обратите внимание, ``datetime`` и ``timedelta`` сериализуются только при использовании :class:`~django.contrib.sessions.serializers.PickleSerializer`.

source: If ``value`` is ``0``, the user's session cookie will expire when the user's Web browser is closed.
ru: Если ``value`` равно ``0``, сессионная кука удалится при закрытии браузера.

source: If ``value`` is ``None``, the session reverts to using the global session expiry policy.
ru: Если ``value`` равно ``None``, сессия будет использовать глобальное поведение.

source: Reading a session is not considered activity for expiration purposes. Session expiration is computed from the last time the session was *modified*.
ru: Чтение сессии не обновляет время жизни сессии. Время жизни просчитывается с момента последнего *изменения*.

source: Returns the number of seconds until this session expires. For sessions with no custom expiration (or those set to expire at browser close), this will equal :setting:`SESSION_COOKIE_AGE`.
ru: Возвращает время в секундах до окончания действия сессии. Для сессий без времени окончания (или для тех, что действуют пока работает браузер), значение будет равно :setting:`SESSION_COOKIE_AGE`.

source: This function accepts two optional keyword arguments:
ru: Функция понимает два необязательных именованных аргумента:

source: ``modification``: last modification of the session, as a :class:`~datetime.datetime` object. Defaults to the current time.
ru: ``modification``: время последнего изменения сессии в виде объекта :class:`~datetime.datetime`. По умолчанию соответствует текущему времени.

source: ``expiry``: expiry information for the session, as a :class:`~datetime.datetime` object, an :class:`int` (in seconds), or ``None``. Defaults to the value stored in the session by :meth:`set_expiry`, if there is one, or ``None``.
ru: ``expiry``: время окончания сессии в виде объекта :class:`~datetime.datetime`, количества секунд в виде :class:`int` или ``None``. По умолчанию используется значение, установленное методом :meth:`set_expiry`, если оно есть, в противном случае будет ``None``.

source: Returns the date this session will expire. For sessions with no custom expiration (or those set to expire at browser close), this will equal the date :setting:`SESSION_COOKIE_AGE` seconds from now.
ru: Возвращает дату окончания действия сессии. Для сессий, у которых дата завершения не указана (или которые завершаются при закрытии браузера), значением будет дата, отстоящая на :setting:`SESSION_COOKIE_AGE` секунд от текущего момента.

source: This function accepts the same keyword arguments as :meth:`get_expiry_age`.
ru: Функция принимает те же именованные аргументы, что и :meth:`get_expiry_age`.

source: Returns either ``True`` or ``False``, depending on whether the user's session cookie will expire when the user's Web browser is closed.
ru: Возвращает ``True`` или ``False``, в зависимости от того, будет ли кука пользовательской сессии сброшена когда пользователь закроет свой браузер.

source: Removes expired sessions from the session store. This class method is called by :djadmin:`clearsessions`.
ru: Удаляет просроченные сессии из хранилища сессий. Этот метод класса используется :djadmin:`clearsessions`.

source: Creates a new session key while retaining the current session data. :func:`django.contrib.auth.login()` calls this method to mitigate against session fixation.
ru: Создает новый ключ сессии при сохранении текущих данных в ней. Функция :func:`django.contrib.auth.login()` вызывает этот метод, чтобы противодействовать фиксации сессии.

source: Session serialization
ru: Сериализация сессии

source: A wrapper around the JSON serializer from :mod:`django.core.signing`. Can only serialize basic data types.
ru: Обёртка над JSON сериализатором из :mod:`django.core.signing`. Может сериализовать только простые типы данных.

source: In addition, as JSON supports only string keys, note that using non-string keys in ``request.session`` won't work as expected::
ru: Следует отметить, что раз JSON поддерживает только строки в качестве ключей, то использование других типов данных в этом качестве в ``request.session`` приведёт к неожиданным результатам::

source: See the :ref:`custom-serializers` section for more details on limitations of JSON serialization.
ru: Обратитесь к разделу :ref:`custom-serializers` для получения подробностей по возможностям сериализации в JSON.

source: Supports arbitrary Python objects, but, as described above, can lead to a remote code execution vulnerability if :setting:`SECRET_KEY` becomes known by an attacker.
ru: Поддерживает произвольные объекты Python, но, как было указано выше, может привести к несанкционированному исполнению чужого кода на сервере в случае, если значение параметра конфигурации :setting:`SECRET_KEY` станет известно злоумышленнику.

source: Your serializer class must implement two methods, ``dumps(self, obj)`` and ``loads(self, data)``, to serialize and deserialize the dictionary of session data, respectively.
ru: Класс вашего сериализатора должен реализовать два метода: ``dumps(self, obj)`` и ``loads(self, data)``, для кодирования и декодирования словаря данных сессии соответственно.

source: Session object guidelines
ru: Рекомендации для объекта сессии

source: Use normal Python strings as dictionary keys on ``request.session``. This is more of a convention than a hard-and-fast rule.
ru: Используйте обычные строки Python в качестве ключей словаря в ``request.session``. Это больше соглашение, чем правило.

source: Session dictionary keys that begin with an underscore are reserved for internal use by Django.
ru: Ключи словаря сессии, которые начинаются с подчёркивания зарезервированы для внутреннего использования Django.

source: Don't override ``request.session`` with a new object, and don't access or set its attributes. Use it like a Python dictionary.
ru: Не перекрывайте ``request.session`` новым объектом, не меняйте его атрибута. Пользуйтесь им как обычным словарём Python.

source: Examples
ru: Примеры

source: This simplistic view sets a ``has_commented`` variable to ``True`` after a user posts a comment. It doesn't let a user post a comment more than once::
ru: Простейшее представление устанавливает переменную ``has_commented`` в ``True`` после того, как пользователь отправит комментарий. Это не позволяет пользователю отправлять комментарий более одного раза::

source: This simplistic view logs in a "member" of the site::
ru: Это простейшее представление авторизует пользователя сайта::

source: ...And this one logs a member out, according to ``login()`` above::
ru: ... А это обеспечивает выход пользователя, аналогично ``login()`` выше::

source: The standard :meth:`django.contrib.auth.logout` function actually does a bit more than this to prevent inadvertent data leakage. It calls the :meth:`~backends.base.SessionBase.flush` method of ``request.session``. We are using this example as a demonstration of how to work with session objects, not as a full ``logout()`` implementation.
ru: Стандартный метод :meth:`django.contrib.auth.logout` в действительности выполняет гораздо больше действий для предотвращения непреднамеренной утечки данных. Он вызывает :meth:`~backends.base.SessionBase.flush` объекта ``request.session``. Мы используем этот пример в качестве демонстрации того, как можно работать с объектами сессий, а не показываем полную реализацию метода ``logout()``.

source: Setting test cookies
ru: Установка проверочных кук
