Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/topics/http/shortcuts.po
Languages: ru

source: Django shortcut functions
ru: Вспомогательные функции

source: The package ``django.shortcuts`` collects helper functions and classes that "span" multiple levels of MVC. In other words, these functions/classes introduce controlled coupling for convenience's sake.
ru: Пакет ``django.shortcuts`` содержит вспомогательные функции и классы "влияющие" на несколько уровней MVC. Другими словами, эти функции упрощают разработку и код.

source: Combines a given template with a given context dictionary and returns an :class:`~django.http.HttpResponse` object with that rendered text.
ru: Выполняет указанный шаблон с переданным словарем контекста и возвращает :class:`~django.http.HttpResponse` с полученным содержимым.

source: Django does not provide a shortcut function which returns a :class:`~django.template.response.TemplateResponse` because the constructor of :class:`~django.template.response.TemplateResponse` offers the same level of convenience as :func:`render()`.
ru: Django не предоставляет функции для создания :class:`~django.template.response.TemplateResponse` т.к. конструктор :class:`~django.template.response.TemplateResponse` принимает аргументы аналогичные аргументам :func:`render()`.

source: Required arguments
ru: Обязательные аргументы

source: The request object used to generate this response.
ru: Объект обрабатываемого запроса

source: The full name of a template to use or sequence of template names. If a sequence is given, the first template that exists will be used. See the :ref:`template loading documentation <template-loading>` for more information on how templates are found.
ru: Полное название шаблона, который должен использоваться, или список названий шаблонов. Если передать список, будет использован первый существующий шаблон. Обратитесь к :ref:`документации по загрузке шаблонов <temlate-loading>` для получения информации о методике поиска шаблонов.

source: Optional arguments
ru: Необязательные аргументы

source: A dictionary of values to add to the template context. By default, this is an empty dictionary. If a value in the dictionary is callable, the view will call it just before rendering the template.
ru: Словарь переменных для контекста шаблона. По умолчанию, этот словарь пустой. Если значение ключа словаря это функция, она будет вызвана перед выполнением шаблона.

source: The MIME type to use for the resulting document. Defaults to the value of the :setting:`DEFAULT_CONTENT_TYPE` setting.
ru: MIME-тип результата. По умолчанию используется значение настройки :setting:`DEFAULT_CONTENT_TYPE`.

source: The status code for the response. Defaults to ``200``.
ru: Код HTTP статуса ответа. По умолчанию ``200``.

source: The :setting:`NAME <TEMPLATES-NAME>` of a template engine to use for loading the template.
ru: Параметр конфигурации :setting:`NAME <TEMPLATES-NAME>` используется шаблонным движком для загрузки шаблона.

source: Example
ru: Пример

source: The following example renders the template ``myapp/index.html`` with the MIME type :mimetype:`application/xhtml+xml`::
ru: Следующий пример выполняет шаблон ``myapp/index.html`` и возвращает ответ с MIME-типом :mimetype:`application/xhtml+xml`::

source: This example is equivalent to::
ru: Этот пример аналогичен::

source: Returns an :class:`~django.http.HttpResponseRedirect` to the appropriate URL for the arguments passed.
ru: Возвращает перенаправление(:class:`~django.http.HttpResponseRedirect`) на URL указанный через аргументы.

source: The arguments could be:
ru: В аргументах можно передать:

source: A model: the model's :meth:`~django.db.models.Model.get_absolute_url()` function will be called.
ru: Экземпляр модели: как URL будет использоваться результат вызова метода :meth:`~django.db.models.Model.get_absolute_url()`.

source: An absolute or relative URL, which will be used as-is for the redirect location.
ru: Абсолютный или относительный URL, который будет использован для перенаправления на указанный адрес.

source: By default issues a temporary redirect; pass ``permanent=True`` to issue a permanent redirect.
ru: По умолчанию использует временное перенаправление, используйте аргумент ``permanent=True`` для постоянного перенаправления.

source: Examples
ru: Примеры

source: You can use the :func:`redirect` function in a number of ways.
ru: Функцию :func:`redirect` можно использовать несколькими способами.

source: By passing some object; that object's :meth:`~django.db.models.Model.get_absolute_url` method will be called to figure out the redirect URL::
ru: Передавая объект; в качестве URL-а для перенаправления будет использоваться результат вызова метода :meth:`~django.db.models.Model.get_absolute_url`::

source: By passing a hardcoded URL to redirect to::
ru: Передавая непосредственно URL::

source: This also works with full URLs::
ru: Работает также с полным URL-ом::

source: By default, :func:`redirect` returns a temporary redirect. All of the above forms accept a ``permanent`` argument; if set to ``True`` a permanent redirect will be returned::
ru: По умолчанию, :func:`redirect` возвращает временное перенаправление. Все варианты выше принимают аргумент ``permanent``; если передать ``True`` будет использоваться постоянное перенаправление::

source: Calls :meth:`~django.db.models.query.QuerySet.get()` on a given model manager, but it raises :class:`~django.http.Http404` instead of the model's :class:`~django.db.models.Model.DoesNotExist` exception.
ru: Вызывает :meth:`~django.db.models.query.QuerySet.get()` для переданного менеджера модели и возвращает полученный объект. Но вызывает исключение :class:`~django.http.Http404` вместо :class:`~django.db.models.Model.DoesNotExist`.

source: A :class:`~django.db.models.Model` class, a :class:`~django.db.models.Manager`, or a :class:`~django.db.models.query.QuerySet` instance from which to get the object.
ru: Класс :class:`~django.db.models.Model`, экземпляр :class:`~django.db.models.Manager` или :class:`~django.db.models.query.QuerySet`, который будет использован для получения объекта.

source: Lookup parameters, which should be in the format accepted by ``get()`` and ``filter()``.
ru: Параметры поиска в формате принимаемом методами ``get()`` и ``filter()``.

source: The following example gets the object with the primary key of 1 from ``MyModel``::
ru: Этот пример получает объект модели ``MyModel`` с первичным ключом равным 1::

source: The most common use case is to pass a :class:`~django.db.models.Model`, as shown above. However, you can also pass a :class:`~django.db.models.query.QuerySet` instance::
ru: Обычно используется :class:`~django.db.models.Model`, как в примере выше. Но можно передать и объект :class:`~django.db.models.query.QuerySet`::

source: The above example is a bit contrived since it's equivalent to doing::
ru: Приведенный пример немного надуманный, так как это равносильно::

source: but it can be useful if you are passed the ``queryset`` variable from somewhere else.
ru: но может быть полезен, если ``queryset`` передается из другого места.

source: Finally, you can also use a :class:`~django.db.models.Manager`. This is useful for example if you have a :ref:`custom manager<custom-managers>`::
ru: Также можно использовать :class:`~django.db.models.Manager`. Это полезно, если, например, вы используете :ref:`собственный менеджер<custom-managers>`::

source: You can also use :class:`related managers<django.db.models.fields.related.RelatedManager>`::
ru: Можно использовать :class:`менеджер отношений между моделями<django.db.models.fields.related.RelatedManager>`::

source: Note: As with ``get()``, a :class:`~django.core.exceptions.MultipleObjectsReturned` exception will be raised if more than one object is found.
ru: Заметим: так как используется метод ``get()``, может быть вызвано исключение :class:`~django.core.exceptions.MultipleObjectsReturned`, если запрос вернет несколько объектов.

source: Returns the result of :meth:`~django.db.models.query.QuerySet.filter()` on a given model manager cast to a list, raising :class:`~django.http.Http404` if the resulting list is empty.
ru: Возвращает результат метода :meth:`~django.db.models.query.QuerySet.filter()` для переданного менеджера модели, вызывает :class:`~django.http.Http404` если получен пустой список.

source: A :class:`~django.db.models.Model`, :class:`~django.db.models.Manager` or :class:`~django.db.models.query.QuerySet` instance from which to get the list.
ru: Экземпляр :class:`~django.db.models.Model`, :class:`~django.db.models.Manager` или :class:`~django.db.models.query.QuerySet`, который будет использован для получения списка объектов.

source: The following example gets all published objects from ``MyModel``::
ru: Этот пример получает все опубликованные объекты модели``MyModel``::
