Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/topics/http/urls.po
Languages: ru

source: URL dispatcher
ru: Менеджер URL-ов

source: A clean, elegant URL scheme is an important detail in a high-quality Web application. Django lets you design URLs however you want, with no framework limitations.
ru: Чистая, элегантная схема URL-ов -- это важная часть качественного приложения. Django позволяет проектировать URL-адреса как вы пожелаете, без ограничений "фреймворка".

source: There's no ``.php`` or ``.cgi`` required, and certainly none of that ``0,2097,1-1-1928,00`` nonsense.
ru: В URL-ах не нужны ни ``.php``, ни ``.cgi``, ни всякая ерунда вроде ``0,2097,1-1-1928,00``.

source: See `Cool URIs don't change`_, by World Wide Web creator Tim Berners-Lee, for excellent arguments on why URLs should be clean and usable.
ru: Читайте `Cool URIs don't change <http://www.w3.org/Provider/Style/URI>`_, создателя World Wide Web, Тима Бернерса-Ли, чтобы узнать почему URL-ы должны быть красивыми и практичными.

source: Overview
ru: Обзор

source: To design URLs for an app, you create a Python module informally called a **URLconf** (URL configuration). This module is pure Python code and is a mapping between URL path expressions to Python functions (your views).
ru: Для определения URL-ов приложения, создайте модуль Python, неофициально названный **URLconf** (конфигурация URL-ов). Этот модуль содержит код Python, который отображает URL-выражения на функции Python (ваши представления).

source: This mapping can be as short or as long as needed. It can reference other mappings. And, because it's pure Python code, it can be constructed dynamically.
ru: Эта конфигурация может быть короткой или длинной настолько, насколько это нужно. Она может ссылаться на другие конфигурации. И, так как это код Python, может создаваться динамически.

source: Django also provides a way to translate URLs according to the active language. See the :ref:`internationalization documentation <url-internationalization>` for more information.
ru: Django также предоставляет метод для перевода URL на текущий язык. Обратитесь к :ref:`документации по интернационализации <url-internationalization>` для подробностей.

source: How Django processes a request
ru: Как Django обрабатывает запрос

source: When a user requests a page from your Django-powered site, this is the algorithm the system follows to determine which Python code to execute:
ru: При запросе к странице вашего Django-сайта, используется такой алгоритм для определения какой код выполнить:

source: Django determines the root URLconf module to use. Ordinarily, this is the value of the :setting:`ROOT_URLCONF` setting, but if the incoming ``HttpRequest`` object has a :attr:`~django.http.HttpRequest.urlconf` attribute (set by middleware), its value will be used in place of the :setting:`ROOT_URLCONF` setting.
ru: Django определяет какой корневой модуль URLconf использовать. Обычно, это значение настройки :setting:`ROOT_URLCONF`, но, если объект запроса ``HttpRequest`` содержит атрибут :attr:`~django.http.HttpRequest.urlconf` (установленный промежуточным слоем), его значение будет использоваться вместо :setting:`ROOT_URLCONF`.

source: Django loads that Python module and looks for the variable ``urlpatterns``. This should be a Python list of :func:`django.urls.path` and/or :func:`django.urls.re_path` instances.
ru: Django загружает модуль конфигурации URL и ищет переменную ``urlpatterns``. Это должен быть список экземпляров :func:`django.urls.path и/или :func:`django.urls.re_path`.

source: Django runs through each URL pattern, in order, and stops at the first one that matches the requested URL.
ru: Django перебирает каждый URL-шаблон по порядку, и останавливается при первом совпадении с запрошенным URL-ом.

source: Once one of the URL patterns matches, Django imports and calls the given view, which is a simple Python function (or a :doc:`class-based view </topics/class-based-views/index>`). The view gets passed the following arguments:
ru: Если один из URL-шаблонов совпадает, Django импортирует и вызывает соответствующее представление, которое представляет из себя обычную функцию Python(или :doc:`представление-класс </topics/class-based-views/index>`). При вызове передаются следующие аргументы:

source: An instance of :class:`~django.http.HttpRequest`.
ru: Экземпляр :class:`~django.http.HttpRequest`.

source: If the matched URL pattern returned no named groups, then the matches from the regular expression are provided as positional arguments.
ru: Если совпавший шаблон URL вернул безымянные группы, то совпадения из регулярного выражения передаются как позиционные аргументы.

source: The keyword arguments are made up of any named parts matched by the path expression, overridden by any arguments specified in the optional ``kwargs`` argument to :func:`django.urls.path` or :func:`django.urls.re_path`.
ru: Именованные аргументы создаются из именованных частей, совпавших в выражении пути. Они могут быть перезаписаны значениями из опционального аргумента ``kwargs``, переданного в :func:`django.urls.path` или :func:`django.urls.re_path`.

source: If no URL pattern matches, or if an exception is raised during any point in this process, Django invokes an appropriate error-handling view. See `Error handling`_ below.
ru: Если ни один URL-шаблон не совпал, или возникла ошибка на любом из этапов, Django вызывает соответствующий обработчик ошибок. Смотрите `Error handling`_ ниже.

source: Example
ru: Например

source: Here's a sample URLconf::
ru: Вот пример простого URLconf::

source: Notes:
ru: Заметим:

source: To capture a value from the URL, use angle brackets.
ru: Для извлечения значения из URL, используйте угловые скобки.

source: Captured values can optionally include a converter type. For example, use ``<int:name>`` to capture an integer parameter. If a converter isn't included, any string, excluding a ``/`` character, is matched.
ru: Извлеченные значения опционально могут содержать тип конвертера. Например, используйте ``<int:name>`` для извлечения целочисленного параметра. Если конвертер не указан, то любая строка, кроме символа ``/``, будет считаться совпавшей с шаблоном.

source: There's no need to add a leading slash, because every URL has that. For example, it's ``articles``, not ``/articles``.
ru: Не нужно добавлять косую черту в начале, потому что каждый URL уже содержит ее. Например, используйте ``articles``, вместо ``/articles``.

source: Example requests:
ru: Примеры запросов:

source: A request to ``/articles/2005/03/`` would match the third entry in the list. Django would call the function ``views.month_archive(request, year=2005, month=3)``.
ru: Запрос к ``/articles/2005/03/`` будет соответствовать третьей записи в списке шаблонов. Django вызовет функцию ``views.month_archive(request, year=2005, month=3)``.

source: ``/articles/2003/`` would match the first pattern in the list, not the second one, because the patterns are tested in order, and the first one is the first test to pass. Feel free to exploit the ordering to insert special cases like this. Here, Django would call the function ``views.special_case_2003(request)``
ru: ``/articles/2003/`` соответствует первой записи, не второй, потому что шаблоны проверяются по порядку и берется первый найденный. Не стесняйтесь использовать порядок для обработки различных ситуаций, таких как эта. В данном примере Django вызовет функцию ``views.special_case_2003(request)``.

source: ``/articles/2003`` would not match any of these patterns, because each pattern requires that the URL end with a slash.
ru: ``/articles/2003`` не соответствует ни одному шаблону, потому что каждый из них требует наличия символа косой черты в конце URL.

source: ``/articles/2003/03/building-a-django-site/`` would match the final pattern. Django would call the function ``views.article_detail(request, year=2003, month=3, slug="building-a-django-site")``.
ru: ``/articles/2003/03/03/`` соответствует последнему шаблону. Django вызовет функцию ``views.article_detail(request, year=2003, month=3, slug="building-a-django-site")``.

source: Path converters
ru: Конвертеры путей

source: The following path converters are available by default:
ru: По умолчанию доступны следующие конвертеры путей:

source: ``str`` - Matches any non-empty string, excluding the path separator, ``'/'``. This is the default if a converter isn't included in the expression.
ru: ``str`` - Соответствует любой не пустой строке, за исключение разделителя пути ``'/'``. Этот конвертер используется по умолчанию, даже если он явно не указан в выражении.

source: ``int`` - Matches zero or any positive integer. Returns an `int`.
ru: ``int`` - Соответствует нулю или положительному целому числу. Возвращает тип `int`.

source: ``slug`` - Matches any slug string consisting of ASCII letters or numbers, plus the hyphen and underscore characters. For example, ``building-your-1st-django-site``.
ru: ``slug`` - Соответствует любой строке slug, состоящей из букв или цифр ASCII, плюс символы дефиса и подчеркивания. Например, ``building-your-1st-django-site``.

source: ``uuid`` - Matches a formatted UUID. To prevent multiple URLs from mapping to the same page, dashes must be included and letters must be lowercase. For example, ``075194d3-6885-417e-a8a8-6c931e272f00``. Returns a :class:`~uuid.UUID` instance.
ru: ``uuid`` - Соответствует форматированному UUID. Для предотвращения отображения нескольких URL на одну страницу, должны присутствовать тире и буквы должны быть строчными. Возвращает экземпляр :class:`~uuid.UUID`.

source: ``path`` - Matches any non-empty string, including the path separator, ``'/'``. This allows you to match against a complete URL path rather than just a segment of a URL path as with ``str``.
ru: ``path`` - Соответствует любой не пустой строке, включая разделитель пути ``'/'``. Позволяет получить полный URL-путь, а не только его часть, как в случае со ``str``.

source: Registering custom path converters
ru: Регистрация собственных конвертеров пути

source: For more complex matching requirements, you can define your own path converters.
ru: Для более сложных требований к обработке URL - вы можете определить свои собственные конвертеры пути.

source: A converter is a class that includes the following:
ru: Конвертер это класс, содержащий:

source: A ``regex`` class attribute, as a string.
ru: Строковый атрибут класса ``regex``.

source: A ``to_python(self, value)`` method, which handles converting the matched string into the type that should be passed to the view function. It should raise ``ValueError`` if it can't convert the given value.
ru: Метод ``to_python(self, value)``, преобразующий совпавшую строку в тип, который будет передан в представление. Если преобразование невозможно, должно быть выброшено исключение ``ValueError``.

source: A ``to_url(self, value)`` method, which handles converting the Python type into a string to be used in the URL.
ru: Метод ``to_url(self, value)``, преобразующий тип Python в строку, для использования при построении URL.

source: For example::
ru: Например::

source: Register custom converter classes in your URLconf using :func:`~django.urls.register_converter`::
ru: Зарегистрируем собственный класс конвертера в URLconf используя :func:`~django.urls.register_converter`::

source: Using regular expressions
ru: Использование регулярный выражений

source: If the paths and converters syntax isn't sufficient for defining your URL patterns, you can also use regular expressions. To do so, use :func:`~django.urls.re_path` instead of :func:`~django.urls.path`.
ru: Если синтаксиса путей и конвертеров недостаточно для определения ваших шаблонов URL-адресов, вы также можете использовать регулярные выражения. Для этого используйте :func:`~django.urls.re_path` вместо :func:`~django.urls.path`.

source: In Python regular expressions, the syntax for named regular expression groups is ``(?P<name>pattern)``, where ``name`` is the name of the group and ``pattern`` is some pattern to match.
ru: Для регулярных выражений в Python синтаксис для именованных групп регулярных выражений выглядит таким образом ``(?P<name>pattern)``, где ``name`` это название группы, а ``pattern`` -- шаблон.

source: Here's the example URLconf from earlier, rewritten using regular expressions::
ru: Это переписанный с использованием регулярный выражений пример URLconf::

source: This accomplishes roughly the same thing as the previous example, except:
ru: Это реализация аналогична предыдущему примеру, но имеющая следующие отличия:

source: The exact URLs that will match are slightly more constrained. For example, the year 10000 will no longer match since the year integers are constrained to be exactly four digits long.
ru: Более строгие требования соответствия к URL. Например 10000 год больше не попадает под соответствие, т.к. число года имеет ограничение длины в 4 цифры.

source: Each captured argument is sent to the view as a string, regardless of what sort of match the regular expression makes.
ru: Каждый найденный аргумент передается в представление как строка, независимо от того, какой тип совпадения определен в регулярном выражении.

source: When switching from using :func:`~django.urls.path` to :func:`~django.urls.re_path` or vice versa, it's particularly important to be aware that the type of the view arguments may change, and so you may need to adapt your views.
ru: Когда вы переходите от использования :func:`~django.urls.path` к :func:`~django.urls.re_path` и наоборот, нужно помнить, что тип передаваемых в представление аргументов может измениться, и возможно представление придется адаптировать.

source: Using unnamed regular expression groups
ru: Использование безымянный групп регулярного выражения

source: As well as the named group syntax, e.g. ``(?P<year>[0-9]{4})``, you can also use the shorter unnamed group, e.g. ``([0-9]{4})``.
ru: По аналогии с синтаксисом именованных совпадений, например ``(?P<year>[0-9]{4})``, вы можете использовать более краткую форму без указания имени группы, например ``([0-9]{4})``.

source: This usage isn't particularly recommended as it makes it easier to accidentally introduce errors between the intended meaning of a match and the arguments of the view.
ru: Но мы рекомендуем не использовать эту форму, т.к. она способствует появлению ошибок из-за несовпадения предполагаемых значений соответствия с аргументами представления.

source: In either case, using only one style within a given regex is recommended. When both styles are mixed, any unnamed groups are ignored and only named groups are passed to the view function.
ru: В любом случае рекомендуем использовать только один стиль. Если их смешать, безымянные группы будут проигнорированы и в представление будут переданы только именованные.

source: Nested arguments
ru: Вложенные аргументы

source: Regular expressions allow nested arguments, and Django will resolve them and pass them to the view. When reversing, Django will try to fill in all outer captured arguments, ignoring any nested captured arguments. Consider the following URL patterns which optionally take a page argument::
ru: Регулярные выражения позволяют использовать вложенные аргументы, и Django может их найти и передать в представление. Во время поиска аргументов Django попытается получить самый внешний аргумент, игнорируя вложенные аргументы. Возьмем следующие шаблоны URL-ов, которые принимает необязательный номер страницы::

source: Both patterns use nested arguments and will resolve: for example, ``blog/page-2/`` will result in a match to ``blog_articles`` with two positional arguments: ``page-2/`` and ``2``. The second pattern for ``comments`` will match ``comments/page-2/`` with keyword argument ``page_number`` set to 2. The outer argument in this case is a non-capturing argument ``(?:...)``.
ru: Оба шаблона используют вложенные аргументы и могут обрабатывать URL-ы: например, для ``blog/page-2/`` будет найдено представление ``blog_articles`` и передано ему два позиционных аргумента ``page-2/`` и ``2``. Второй URL-шаблон для ``comments`` в ``comments/page-2/`` найдет именованный аргумент ``page_number`` со значеним 2. Внешний аргумент ``(?:...)`` в этом случае не захватывается.

source: The ``blog_articles`` view needs the outermost captured argument to be reversed, ``page-2/`` or no arguments in this case, while ``comments`` can be reversed with either no arguments or a value for ``page_number``.
ru: При обратной операции (получение URL из шаблона) для представления ``blog_articles`` необходимо указать самый внешний аргумент ``page-2/`` или ни одного аргумента, как в данном случае. В то время как для ``comments`` необходимо передать значение через аргумент ``page_number`` или вообще не предавать аргументы.

source: Nested captured arguments create a strong coupling between the view arguments and the URL as illustrated by ``blog_articles``: the view receives part of the URL (``page-2/``) instead of only the value the view is interested in. This coupling is even more pronounced when reversing, since to reverse the view we need to pass the piece of URL instead of the page number.
ru: Вложенные захватываемые аргументы создают сильную связанность между URL и аргументами представления, как это показано для ``blog_articles``: представление получает часть URL-а (``page-2/``) вместо значение, которое на самом деле необходимо представлению. Эта связанность особенно заметна при создании URL-а т.к. необходимо передать часть URL-а вместо номера страницы.

source: As a rule of thumb, only capture the values the view needs to work with and use non-capturing arguments when the regular expression needs an argument but the view ignores it.
ru: Как правило, URL-шаблон должен захватывать только необходимые для представления аргументы.

source: What the URLconf searches against
ru: Что использует URLconf при поиске нужного шаблона URL

source: The URLconf searches against the requested URL, as a normal Python string. This does not include GET or POST parameters, or the domain name.
ru: URLconf использует запрашиваемый URL как обычную строку Python. Он не учитывает параметры GET, POST и имя домена.

source: For example, in a request to ``https://www.example.com/myapp/``, the URLconf will look for ``myapp/``.
ru: Например, при запросе к ``https://www.example.com/myapp/``, URLconf возьмет ``myapp/``.

source: In a request to ``https://www.example.com/myapp/?page=3``, the URLconf will look for ``myapp/``.
ru: При запросе к ``https://www.example.com/myapp/?page=3`` URLconf так же воспользуется только ``myapp/``.

source: The URLconf doesn't look at the request method. In other words, all request methods -- ``POST``, ``GET``, ``HEAD``, etc. -- will be routed to the same function for the same URL.
ru: URLconf не учитывает тип запроса. Другими словами, все типы запросов -- ``POST``, ``GET``, ``HEAD``, и др. -- будут обработаны одним представлением при одинаковом URL.

source: Specifying defaults for view arguments
ru: Значения по умолчанию для аргументов представления

source: A convenient trick is to specify default parameters for your views' arguments. Here's an example URLconf and view::
ru: Принято указывать значения по-умолчанию для аргументов представления. Пример URLconf и представления::

source: In the above example, both URL patterns point to the same view -- ``views.page`` -- but the first pattern doesn't capture anything from the URL. If the first pattern matches, the ``page()`` function will use its default argument for ``num``, ``1``. If the second pattern matches, ``page()`` will use whatever ``num`` value was captured.
ru: В примере выше, оба URL-шаблона указывают на одно представление -- ``views.page`` -- но первый шаблон не принимает аргументы в URL. Если первый шаблон будет выбран, функция ``page()`` будет использовать значение по-умолчанию аргумента ``num`` равное ``"1"``. Если будет выбран другой шаблон, ``page()`` будет использовать значение ``num`` захваченное в URL.

source: Performance
ru: Производительность

source: Each regular expression in a ``urlpatterns`` is compiled the first time it's accessed. This makes the system blazingly fast.
ru: Каждое регулярное выражение в ``urlpatterns`` будет скомпилировано при первом использовании. Это делает систему невероятно быстрой.

source: Syntax of the ``urlpatterns`` variable
ru: Синтаксис переменной ``urlpatterns``

source: ``urlpatterns`` should be a Python list of :func:`~django.urls.path` and/or :func:`~django.urls.re_path` instances.
ru: ``urlpatterns`` должен быть списком экземпляров :func:`~django.urls.path` и/или :func:`~django.urls.re_path`.

source: Error handling
ru: Обработчики ошибок

source: When Django can't find a match for the requested URL, or when an exception is raised, Django invokes an error-handling view.
ru: Если Django не может найти совпадение для запрашиваемого URL, или было вызвано исключение в процессе обработки запроса, Django вызовет соответствующее представление обрабатывающее ошибку.

source: The views to use for these cases are specified by four variables. Their default values should suffice for most projects, but further customization is possible by overriding their default values.
ru: Эти представления определены в четырёх переменных. Их значения по-умолчанию должны подойти для большинства проектов, но вы можете их поменять при необходимости.

source: See the documentation on :ref:`customizing error views <customizing-error-views>` for the full details.
ru: Подробности в разделе о :ref:`переопределении обработчика ошибок <customizing-error-views>`.

source: Such values can be set in your root URLconf. Setting these variables in any other URLconf will have no effect.
ru: Эти значения должны быть определены в главном URLconf.

source: Values must be callables, or strings representing the full Python import path to the view that should be called to handle the error condition at hand.
ru: Значение это функции, или полный путь для импорта, которая будет вызвана, если не был найден подходящий URL-шаблон.

source: The variables are:
ru: Есть следующие переменные:

source: ``handler400`` -- See :data:`django.conf.urls.handler400`.
ru: ``handler400`` -- Смотрите :data:`django.conf.urls.handler400`.

source: ``handler403`` -- See :data:`django.conf.urls.handler403`.
ru: ``handler403`` -- Смотрите :data:`django.conf.urls.handler403`.

source: ``handler404`` -- See :data:`django.conf.urls.handler404`.
ru: ``handler404`` -- Смотрите :data:`django.conf.urls.handler404`.

source: ``handler500`` -- See :data:`django.conf.urls.handler500`.
ru: ``handler500`` -- Смотрите :data:`django.conf.urls.handler500`.

source: Including other URLconfs
ru: Комбинирование URLconfs

source: At any point, your ``urlpatterns`` can "include" other URLconf modules. This essentially "roots" a set of URLs below other ones.
ru: В любой месте,к вашему ``urlpatterns`` подключить другие модули URLconf.

source: For example, here's an excerpt of the URLconf for the `Django website`_ itself. It includes a number of other URLconfs::
ru: Вот пример URLconf для `сайта Django <https://www.djangoproject.com/>`_. Он включает множество других конфигураций URL::

source: Whenever Django encounters :func:`~django.urls.include()`, it chops off whatever part of the URL matched up to that point and sends the remaining string to the included URLconf for further processing.
ru: Каждый раз, когда Django встречает:func:`~django.urls.include()`, из URL вырезается уже совпавшая часть, остальное передается во включенный URLconf для дальнейшей обработки.

source: Another possibility is to include additional URL patterns by using a list of :func:`~django.urls.path` instances. For example, consider this URLconf::
ru: Другой возможностью будет добавление дополнительных URL-шаблонов с помощью списка экземпляров :func:`~django.urls.path`. Например, рассмотрим такую схему::
