Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/topics/http/urls.po
Languages: ru

source: Secondly, you can include an object that contains embedded namespace data. If you ``include()`` a list of :func:`~django.urls.path` or :func:`~django.urls.re_path` instances, the URLs contained in that object will be added to the global namespace. However, you can also ``include()`` a 2-tuple containing::
ru: Второй, вы можете добавить объект, который содержит все необходимые данные. Если добавить через ``include()`` список :func:`~django.urls.path` или :func:`~django.urls.re_path`, он будет добавлен в глобальное пространство имен. Однако, в ``include()`` можно передать 2-элементный кортеж, который содержит::

source: This will include the nominated URL patterns into the given application namespace.
ru: Этот код добавляет URL-шаблоны, используя указанное название приложения.

source: The instance namespace can be specified using the ``namespace`` argument to :func:`~django.urls.include`. If the instance namespace is not specified, it will default to the included URLconf's application namespace. This means it will also be the default instance for that namespace.
ru: Имя конкретного экземпляра приложения можно указать с помощью аргумента ``namespace`` для :func:`~django.urls.include`. Если он не указан, будет использовать название приложения.
