Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/topics/http/urls.po
Languages: ru

source: In this example, the ``/credit/reports/`` URL will be handled by the ``credit_views.report()`` Django view.
ru: В этом примере URL ``/credit/reports/`` обработан представлением ``credit_views.report()``.

source: This can be used to remove redundancy from URLconfs where a single pattern prefix is used repeatedly. For example, consider this URLconf::
ru: Такой подход может применяться для уменьшения дублирования кода в настройках URL, когда используется один и тот же шаблонный префикс. Например, возьмём такую конфигурацию URL::

source: We can improve this by stating the common path prefix only once and grouping the suffixes that differ::
ru: Мы можем сделать её проще, указав общий префикс только один раз и сгруппировав различающиеся суффиксы::

source: Captured parameters
ru: Нахождение аргументов в URL

source: An included URLconf receives any captured parameters from parent URLconfs, so the following example is valid::
ru: Включенный URLconf получает все аргументы найденные родительским URLconfs, поэтому этот пример работает::

source: In the above example, the captured ``"username"`` variable is passed to the included URLconf, as expected.
ru: В примере выше, найденный аргумент ``"username"`` передается во включенный URLconf, как и ожидалось.

source: Passing extra options to view functions
ru: Передача дополнительных аргументов в представление

source: URLconfs have a hook that lets you pass extra arguments to your view functions, as a Python dictionary.
ru: Конфигурация URL-ов позволяет определить дополнительные аргументы для функции представления, используя словарь Python.

source: The :func:`~django.urls.path` function can take an optional third argument which should be a dictionary of extra keyword arguments to pass to the view function.
ru: Функция :func:`~django.urls.path` может принимать третий необязательный элемент. Этот элемент является словарем, который определяет дополнительные именованные аргументы для функции представления.

source: In this example, for a request to ``/blog/2005/``, Django will call ``views.year_archive(request, year=2005, foo='bar')``.
ru: В этом примере, при запросе к ``/blog/2005/``, Django вызовет ``views.year_archive(request, year='2005', foo='bar')``.

source: This technique is used in the :doc:`syndication framework </ref/contrib/syndication>` to pass metadata and options to views.
ru: Такой подход используется в :doc:`syndication framework </ref/contrib/syndication>` для передачи параметров и дополнительных данных представление.

source: Dealing with conflicts
ru: Конфликты переменных

source: It's possible to have a URL pattern which captures named keyword arguments, and also passes arguments with the same names in its dictionary of extra arguments. When this happens, the arguments in the dictionary will be used instead of the arguments captured in the URL.
ru: Можно создать шаблон URL, который одновременно захватывает именованные аргументы и при этом передает аргументы с такими же именами в словаре дополнительных аргументов. В таком случае будут использованы аргументы из словаря дополнительных аргументов, вместо значений из URL.

source: Passing extra options to ``include()``
ru: Передача дополнительных аргументов в ``include()``

source: Similarly, you can pass extra options to :func:`~django.urls.include` and each line in the included URLconf will be passed the extra options.
ru: Аналогично вы можете передать дополнительные аргументы в :func:`~django.urls.include`. При этом, *каждый* URL-шаблон включенного URLconf будет дополнен этими дополнительными аргументами.

source: For example, these two URLconf sets are functionally identical:
ru: Например, эти два URLconf работают идентично:

source: Set one::
ru: Первый::

source: Set two::
ru: Второй::

source: Note that extra options will *always* be passed to *every* line in the included URLconf, regardless of whether the line's view actually accepts those options as valid. For this reason, this technique is only useful if you're certain that every view in the included URLconf accepts the extra options you're passing.
ru: Дополнительные аргументы *всегда* передаются *каждому* представлению во включенном URLconf, независимо от того, принимает оно эти аргументы или нет. Поэтому, такой подход полезен только если вы уверенны, что каждое представление принимает передаваемые аргументы.

source: Reverse resolution of URLs
ru: Получение URL из шаблона

source: A common need when working on a Django project is the possibility to obtain URLs in their final forms either for embedding in generated content (views and assets URLs, URLs shown to the user, etc.) or for handling of the navigation flow on the server side (redirections, etc.)
ru: Обычной задачей является получение URL-а по его определению в шаблоне для отображения пользователю или для редиректа.

source: It is strongly desirable to avoid hard-coding these URLs (a laborious, non-scalable and error-prone strategy). Equally dangerous is devising ad-hoc mechanisms to generate URLs that are parallel to the design described by the URLconf, which can result in the production of URLs that become stale over time.
ru: Очень важно не "хардкодить" URL-ы (трудоемкая и плохо поддерживаемая стратегия). Также не следует создавать "костыли" для генерации URL-ов, которые не следуют задокументированному дизайну URLconf.

source: In other words, what's needed is a DRY mechanism. Among other advantages it would allow evolution of the URL design without having to go over all the project source code to search and replace outdated URLs.
ru: В общем необходимо придерживаться принципа DRY. Немаловажно иметь возможность менять URL-ы в одном месте, а не выполнять поиск и замену по всему проекту.

source: The primary piece of information we have available to get a URL is an identification (e.g. the name) of the view in charge of handling it. Other pieces of information that necessarily must participate in the lookup of the right URL are the types (positional, keyword) and values of the view arguments.
ru: Для получения URL-а нам необходим его идентификатор, то есть название URL-шаблона, и позиционные и именованные аргументы.

source: Django provides a solution such that the URL mapper is the only repository of the URL design. You feed it with your URLconf and then it can be used in both directions:
ru: В Django для работы с URL-ами используется так называемый "URL mapper". Ему передается URLconf, и теперь его можно использовать в обоих направлениях:

source: Starting with a URL requested by the user/browser, it calls the right Django view providing any arguments it might need with their values as extracted from the URL.
ru: При получении запрошенного URL вызывает необходимое представление и предоставляет все необходимые аргументы полученные из URL-а.

source: Starting with the identification of the corresponding Django view plus the values of arguments that would be passed to it, obtain the associated URL.
ru: При получении идентификатора представления и передаваемых ему аргументов, возвращает URL.

source: The first one is the usage we've been discussing in the previous sections. The second one is what is known as *reverse resolution of URLs*, *reverse URL matching*, *reverse URL lookup*, or simply *URL reversing*.
ru: Первое это то, что мы уже рассмотрели в предыдущем разделе. Второе называется *URL reversing*, в общем получение URL-а по его названию.

source: Django provides tools for performing URL reversing that match the different layers where URLs are needed:
ru: Django предоставляет инструменты для получения URL-ов в различных компонентах фреймворка:

source: In templates: Using the :ttag:`url` template tag.
ru: В шаблонах: Использование шаблонного тега :ttag:`url`.

source: In Python code: Using the :func:`~django.urls.reverse` function.
ru: В Python коде: Использование функции :func:`~django.urls.reverse`.

source: In higher level code related to handling of URLs of Django model instances: The :meth:`~django.db.models.Model.get_absolute_url` method.
ru: На более высоком уровне для привязки URL-ов к моделям - метод :meth:`~django.db.models.Model.get_absolute_url`.

source: Examples
ru: Примеры

source: Consider again this URLconf entry::
ru: Рассмотрим следующий URLconf::

source: According to this design, the URL for the archive corresponding to year *nnnn* is ``/articles/<nnnn>/``.
ru: В соответствии с ним архиву *nnnn* года соответствует URL ``/articles/<nnnn>/``.

source: You can obtain these in template code by using:
ru: Вы можете получить его в шаблоне следующим образом:

source: Or in Python code::
ru: В Python коде::

source: If, for some reason, it was decided that the URLs where content for yearly article archives are published at should be changed then you would only need to change the entry in the URLconf.
ru: Если по каким-либо причинам необходимо будет изменить URL, достаточно будет изменить запись в вашем URLconf.

source: In some scenarios where views are of a generic nature, a many-to-one relationship might exist between URLs and views. For these cases the view name isn't a good enough identifier for it when comes the time of reversing URLs. Read the next section to know about the solution Django provides for this.
ru: В некоторых случаях URL-ы и представления могут соотноситься как многое-к-одному. В таких случаях название представления не может идентифицировать конкретный URL. Как решить эту проблему читайте в следующем разделе.

source: Naming URL patterns
ru: Именованные URL-шаблоны

source: In order to perform URL reversing, you'll need to use **named URL patterns** as done in the examples above. The string used for the URL name can contain any characters you like. You are not restricted to valid Python names.
ru: Для того, чтобы выполнить обратное разрешение URL, вам потребуется использовать **именованные URL шаблоны**, как это показано в примерах выше. Строка, использованная для наименования URL, может содержать любые символы. Вы не ограничены только теми именами, что позволяет Python.

source: When naming URL patterns, choose names that are unlikely to clash with other applications' choice of names. If you call your URL pattern ``comment`` and another application does the same thing, the URL that :func:`~django.urls.reverse()` finds depends on whichever pattern is last in your project's ``urlpatterns`` list.
ru: При выборе названия для URL-шаблона, убедитесь что оно достаточно уникально. Если вы назовете URL-шаблон ``comment``, и в другом приложении поступите так же, функция :func:`~django.urls.reverse()` вернет тот URL, шаблон которого находится последним в списке ``urlpatterns`` вашего проекта.

source: Putting a prefix on your URL names, perhaps derived from the application name (such as ``myapp-comment`` instead of ``comment``), decreases the chance of collision.
ru: Добавление префикса к названию URL-шаблона, возможного состоящего из названия приложения, уменьшит шанс конфликта. Мы советуем использовать ``myapp-comment`` вместо ``comment``.

source: You can deliberately choose the *same URL name* as another application if you want to override a view. For example, a common use case is to override the :class:`~django.contrib.auth.views.LoginView`. Parts of Django and most third-party apps assume that this view has a URL pattern with the name ``login``. If you have a custom login view and give its URL the name ``login``, :func:`~django.urls.reverse()` will find your custom view as long as it's in ``urlpatterns`` after ``django.contrib.auth.urls`` is included (if that's included at all).
ru: Вы можете преднамеренно выбрать *такое же имя URL*, если хотите переопределить представление. Например, типичным случаем будет переопределение класса :class:`~django.contrib.auth.views.LoginView`. В Django и большинстве сторонних приложений предполагается, что это предсавление имеет URL-шаблон с именем ``login``. Если у вас есть собственное представление для входа в систему и его URL называется ``login``, :func:`~django.urls.reverse()` найдет ваше представление, если оно находится в ``urlpatterns`` после ``django.contrib.auth.urls``(при его наличии).

source: You may also use the same name for multiple URL patterns if they differ in their arguments. In addition to the URL name, :func:`~django.urls.reverse()` matches the number of arguments and the names of the keyword arguments.
ru: Так же можно использовать одно имя для нескольких шаблонов URL, если они отличаются друг от друга. Кроме имени :func:`~django.urls.reverse()` проверяет соответствие количества аргументов, а так же имен у именованных аргументов.

source: URL namespaces
ru: Пространства имен в конфигурации URL-ов

source: Introduction
ru: Описание

source: URL namespaces allow you to uniquely reverse :ref:`named URL patterns <naming-url-patterns>` even if different applications use the same URL names. It's a good practice for third-party apps to always use namespaced URLs (as we did in the tutorial). Similarly, it also allows you to reverse URLs if multiple instances of an application are deployed. In other words, since multiple instances of a single application will share named URLs, namespaces provide a way to tell these named URLs apart.
ru: Пространства имен позволяют получить URL по :ref:`названию URL-шаблона <naming-url-patterns>` даже, если несколько приложений используют одинаковые названия. Для сторонних приложений использование пространств имен -- хорошая практика (как мы и делаем в руководстве). Аналогично можно получить URL, если несколько экземпляров одного приложения подключены в конфигурации URL-ов.

source: Django applications that make proper use of URL namespacing can be deployed more than once for a particular site. For example :mod:`django.contrib.admin` has an :class:`~django.contrib.admin.AdminSite` class which allows you to easily :ref:`deploy more than one instance of the admin <multiple-admin-sites>`. In a later example, we'll discuss the idea of deploying the polls application from the tutorial in two different locations so we can serve the same functionality to two different audiences (authors and publishers).
ru: Django приложения, правильно используя пространство имен для URL, могут использоваться в нескольких экземплярах в одном проекте. Например, :mod:`django.contrib.admin` содержит класс :class:`~django.contrib.admin.AdminSite`, который легко позволяет :ref:`подключить несколько интерфейсов администратора <multiple-admin-sites>`. Ниже мы опишем как сделать аналогично для нашего приложения опросов, чтобы можно было создать несколько интерфейсов (для авторов и издателей).

source: A URL namespace comes in two parts, both of which are strings:
ru: Пространство имен состоит из двух частей, каждая из которых это строка:

source: This describes the name of the application that is being deployed. Every instance of a single application will have the same application namespace. For example, Django's admin application has the somewhat predictable application namespace of ``'admin'``.
ru: Указывает название установленного приложения. Все экземпляры одного приложения будет иметь одно название. Например, название приложения администратора Django -- ``admin``.

source: This identifies a specific instance of an application. Instance namespaces should be unique across your entire project. However, an instance namespace can be the same as the application namespace. This is used to specify a default instance of an application. For example, the default Django admin instance has an instance namespace of ``'admin'``.
ru: Идентифицирует конкретный экземпляр приложения. Должно быть уникальным для проекта. Однако, название экземпляра может быть равным названию приложения. Оно используется по-умолчанию при создании приложения. Например, пространство имен приложения администратора Django -- ``admin``.

source: Namespaced URLs are specified using the ``':'`` operator. For example, the main index page of the admin application is referenced using ``'admin:index'``. This indicates a namespace of ``'admin'``, and a named URL of ``'index'``.
ru: Пространство имен определяется с помощью оператора ``':'``. Например, главная страница интерфейса администратора определяется как ``'admin:index'``. Мы видим пространство имен ``'admin'``, и название URL-шаблона ``'index'``.

source: Namespaces can also be nested. The named URL ``'sports:polls:index'`` would look for a pattern named ``'index'`` in the namespace ``'polls'`` that is itself defined within the top-level namespace ``'sports'``.
ru: Пространства имен могут быть вложенными. Название URL-а ``'sports:polls:index'`` означает именованный URL-шаблон с названием ``'index'`` в пространстве имен ``'polls'``, которое было определенно в другом пространстве имен - ``'sports'``.

source: Reversing namespaced URLs
ru: Поиск URL-а по шаблону с пространством имен

source: When given a namespaced URL (e.g. ``'polls:index'``) to resolve, Django splits the fully qualified name into parts and then tries the following lookup:
ru: Если необходимо найти URL по названию с пространством имен (например, ``'polls:index'``), Django разбивает название на части и следует такому алгоритму:

source: First, Django looks for a matching :term:`application namespace` (in this example, ``'polls'``). This will yield a list of instances of that application.
ru: Первым делом, Django проверяет :term:`application namespace` (например, ``polls``). Django получает список экземпляров приложения.

source: If there is a current application defined, Django finds and returns the URL resolver for that instance. The current application can be specified with the ``current_app`` argument to the :func:`~django.urls.reverse()` function.
ru: Если указан текущий экземпляр приложения, Django найдёт и вернет "URL resolver" для этого экземпляра. Текущее приложение можно указать с помощью аргумента ``current_app`` функции :func:`~django.urls.reverse()`.

source: The :ttag:`url` template tag uses the namespace of the currently resolved view as the current application in a :class:`~django.template.RequestContext`. You can override this default by setting the current application on the :attr:`request.current_app <django.http.HttpRequest.current_app>` attribute.
ru: Шаблонный тег :ttag:`url` использует пространство имен представления как текущее приложение в :class:`~django.template.RequestContext`. Вы можете переопределить его, указав в атрибуте :attr:`request.current_app <django.http.HttpRequest.current_app>`.

source: If there is no default application instance, Django will pick the last deployed instance of the application, whatever its instance name may be.
ru: Если экземпляр по-умолчанию не найден, Django возьмет последний установленный экземпляр приложения, не обращая внимание на его название.

source: If the provided namespace doesn't match an :term:`application namespace` in step 1, Django will attempt a direct lookup of the namespace as an :term:`instance namespace`.
ru: Если на первом шаге не было найдено приложение по указанному пространству имен, Django попытается найти экземпляр приложения по его названию, используя пространство имен как название экземпляра.

source: If there are nested namespaces, these steps are repeated for each part of the namespace until only the view name is unresolved. The view name will then be resolved into a URL in the namespace that has been found.
ru: Если пространство имен вложенное, этот процесс будет повторен, пока неопределенным не останется только название представления. URL для названия представления будет искаться среди URL-шаблонов определенных в приложении, найденном через пространство имен.

source: To show this resolution strategy in action, consider an example of two instances of the ``polls`` application from the tutorial: one called ``'author-polls'`` and one called ``'publisher-polls'``. Assume we have enhanced that application so that it takes the instance namespace into consideration when creating and displaying polls.
ru: Разберем небольшой пример. У нас есть два экземпляра приложения ``polls``: один назван ``'author-polls'``, другой - ``'publisher-polls'``. Предположим, что мы уже изменили код приложения и оно учитывает текущее пространство имен при создании страниц.

source: Using this setup, the following lookups are possible:
ru: Для таких настроек URL-ов возможны следующие варианты поиска URL-а по названию:

source: If one of the instances is current - say, if we were rendering the detail page in the instance ``'author-polls'`` - ``'polls:index'`` will resolve to the index page of the ``'author-polls'`` instance; i.e. both of the following will result in ``"/author-polls/"``.
ru: Если один из экземпляров указан как текущий - например, мы выполняем шаблон в экземпляре ``'author-polls'`` - поиск URL-а по ``'polls:index'`` вернет URL на главную страницу экземпляра приложения ``'author-polls'``. То есть мы получим ``"/author-polls/"`` для двух, приведенных ниже, примеров.

source: In the method of a class-based view::
ru: В методе представления::

source: and in the template:
ru: и в шаблоне:

source: If there is no current instance - say, if we were rendering a page somewhere else on the site - ``'polls:index'`` will resolve to the last registered instance of ``polls``. Since there is no default instance (instance namespace of ``'polls'``), the last instance of ``polls`` that is registered will be used. This would be ``'publisher-polls'`` since it's declared last in the ``urlpatterns``.
ru: Если текущий экземпляр приложения не указан - например, мы ищем URL в другом приложении - поиск по ``'polls:index'`` вернет URL для последнего добавленного экземпляра ``'polls'``. Т.к. у нас не определен экземпляр приложения по умолчанию (с instance namespace равным ``'polls'``), будет использоваться последний добавленный экземпляр ``polls``. Это будет ``'publisher-polls'`` т.к. он последний в ``urlpatterns``.

source: ``'author-polls:index'`` will always resolve to the index page of the instance ``'author-polls'`` (and likewise for ``'publisher-polls'``) .
ru: Поиск по ``'author-polls:index'`` всегда вернет ссылку на главную страницу экземпляра приложения ``'author-polls'`` (аналогично и для ``'publisher-polls'``).

source: If there were also a default instance - i.e., an instance named ``'polls'`` - the only change from above would be in the case where there is no current instance (the second item in the list above). In this case ``'polls:index'`` would resolve to the index page of the default instance instead of the instance declared last in ``urlpatterns``.
ru: Если бы у нас был экземпляр приложения по умолчанию -- то есть с instance name ``'polls'`` -- у нас бы поменялся результат только для тех случаев, где не указан текущий экземпляр (второй пункт в списке выше). В этом случае для ``'polls:index'`` мы бы получили ссылку на главную страницу экземпляра приложения по умолчанию, а не для последнего в ``urlpatterns``.

source: URL namespaces and included URLconfs
ru: Пространства имен в URL -ах и include

source: Application namespaces of included URLconfs can be specified in two ways.
ru: Название приложения в URLconfs можно определить двумя путями.

source: Firstly, you can set an ``app_name`` attribute in the included URLconf module, at the same level as the ``urlpatterns`` attribute. You have to pass the actual module, or a string reference to the module, to :func:`~django.urls.include`, not the list of ``urlpatterns`` itself.
ru: Первый -- вы можете указать атрибут ``app_name`` в модуле URLconf приложения, на том же уровне, что и атрибут ``urlpatterns``. При этом в функцию :func:`~django.urls.include` вам необходимо передать сам модуль или путь к импорту модуля, а не список ``urlpatterns``.

source: The URLs defined in ``polls.urls`` will have an application namespace ``polls``.
ru: URL-ы, определенные в ``polls.urls``, содержат название приложения ``polls``.
