Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/topics/http/views.po
Languages: ru

source: Writing views
ru: Создание представлений

source: A view function, or *view* for short, is simply a Python function that takes a Web request and returns a Web response. This response can be the HTML contents of a Web page, or a redirect, or a 404 error, or an XML document, or an image . . . or anything, really. The view itself contains whatever arbitrary logic is necessary to return that response. This code can live anywhere you want, as long as it's on your Python path. There's no other requirement--no "magic," so to speak. For the sake of putting the code *somewhere*, the convention is to put views in a file called ``views.py``, placed in your project or application directory.
ru: Функция представления, или коротко *представление* -- это функция Python, которая принимает Web-запрос и возвращает Web-ответ. Ответом может быть HTML-содержимое страницы, или перенаправление, или 404 ошибка, или XML-документ, или изображение . . . что угодно. Представление содержит всю необходимую логику для создания ответа. Этот код может находиться где угодно, главное, чтобы он находился в ``PYTHON_PATH``. Никаких других требований нет -- никакой "магии". Несмотря на возможность расположить код представлений *где угодно*, принято держать его в файле ``views.py``, который находится в каталоге проекта или приложения.

source: A simple view
ru: Простое представление

source: Here's a view that returns the current date and time, as an HTML document::
ru: Вот пример простого представления, которое отображает текущую дату и время, как документ HTML::

source: Let's step through this code one line at a time:
ru: Давайте проанализируем код строка за строкой:

source: First, we import the class :class:`~django.http.HttpResponse` from the :mod:`django.http` module, along with Python's ``datetime`` library.
ru: Сначала мы импортировали класс :class:`~django.http.HttpResponse` из модуля :mod:`django.http` и библиотеку Python ``datetime``.

source: Next, we define a function called ``current_datetime``. This is the view function. Each view function takes an :class:`~django.http.HttpRequest` object as its first parameter, which is typically named ``request``.
ru: Теперь определим функцию ``current_datetime``. Это функция представления. Каждая функция представления принимает объект :class:`~django.http.HttpRequest` первым аргументом, который обычно называют ``request``.

source: Note that the name of the view function doesn't matter; it doesn't have to be named in a certain way in order for Django to recognize it. We're calling it ``current_datetime`` here, because that name clearly indicates what it does.
ru: Название функции может быть каким угодно, нет никаких конкретных правил для именования. Мы назвали функцию ``current_datetime``.

source: The view returns an :class:`~django.http.HttpResponse` object that contains the generated response. Each view function is responsible for returning an :class:`~django.http.HttpResponse` object. (There are exceptions, but we'll get to those later.)
ru: Представление возвращает объект :class:`~django.http.HttpResponse`, который содержит сгенерированный ответ. Каждая функция представления должна возвращать объект :class:`~django.http.HttpResponse`. (Есть исключения, но мы расскажем об этом далее.)

source: Django's Time Zone
ru: Часовые пояса в Django

source: Django includes a :setting:`TIME_ZONE` setting that defaults to ``America/Chicago``. This probably isn't where you live, so you might want to change it in your settings file.
ru: Django содержит настройку :setting:`TIME_ZONE` равную по умолчанию ``America/Chicago``. Возможно это не там, где вы живете, вы можете изменить эту настройку в файле настройки.

source: Mapping URLs to views
ru: Сопоставление представления с URL

source: So, to recap, this view function returns an HTML page that includes the current date and time. To display this view at a particular URL, you'll need to create a *URLconf*; see :doc:`/topics/http/urls` for instructions.
ru: Итак, напомним, функция представления возвращает HTML-страницу, которая содержит текущую дату и время. Чтобы привязать это представление к определенному URL-у, необходимо создать *URLconf*; подробности смотрите в разделе :doc:`/topics/http/urls`.

source: Returning errors
ru: Возвращение ошибок

source: Returning HTTP error codes in Django is easy. There are subclasses of :class:`~django.http.HttpResponse` for a number of common HTTP status codes other than 200 (which means *"OK"*). You can find the full list of available subclasses in the :ref:`request/response <ref-httpresponse-subclasses>` documentation. Just return an instance of one of those subclasses instead of a normal :class:`~django.http.HttpResponse` in order to signify an error. For example::
ru: Возвращение HTTP ошибок в Django очень просто. Существует ряд подклассов :class:`~django.http.HttpResponse` для распространенных HTTP-состояний, отличных от 200 (что означает *"OK"*). Вы можете посмотреть полный список доступных подклассов в разделе о :ref:`HTTP запросах и ответах <ref-httpresponse-subclasses>`. Просто верните экземпляр необходимого подкласса вместо :class:`~django.http.HttpResponse`. Например::

source: There isn't a specialized subclass for every possible HTTP response code, since many of them aren't going to be that common. However, as documented in the :class:`~django.http.HttpResponse` documentation, you can also pass the HTTP status code into the constructor for :class:`~django.http.HttpResponse` to create a return class for any status code you like. For example::
ru: Не существует подкласса для всех HTTP-состояний, так как многие из них редко используются. Однако, как указанно в описании :class:`~django.http.HttpResponse`, вы можете передать код HTTP-состояния в конструктор :class:`~django.http.HttpResponse`. Например::

source: Because 404 errors are by far the most common HTTP error, there's an easier way to handle those errors.
ru: Так как ошибка 404 самая используемая HTTP-ошибка, существует простой способ работы с такими ошибками.

source: The ``Http404`` exception
ru: Исключение ``Http404``

source: When you return an error such as :class:`~django.http.HttpResponseNotFound`, you're responsible for defining the HTML of the resulting error page::
ru: Если вы возвращаете ошибку :class:`~django.http.HttpResponseNotFound`, вы должны добавить HTML содержимое страницы с ошибкой::

source: For convenience, and because it's a good idea to have a consistent 404 error page across your site, Django provides an ``Http404`` exception. If you raise ``Http404`` at any point in a view function, Django will catch it and return the standard error page for your application, along with an HTTP error code 404.
ru: Для удобства и чтобы все страницы для ошибки 404 выглядели одинаково, Django предоставляет исключение ``Http404``. Если вы вызываете исключение ``Http404`` в любой момент обработки запроса, Django перехватит его и вернет стандартную страницу 404 ошибки вашего проекта вместе с 404 кодом состояния HTTP.

source: Example usage::
ru: Пример использования::

source: In order to show customized HTML when Django returns a 404, you can create an HTML template named ``404.html`` and place it in the top level of your template tree. This template will then be served when :setting:`DEBUG` is set to ``False``.
ru: Чтобы переопределить страницу, которую Django возвращает для 404 ошибки, вы можете создать HTML шаблон с названием ``404.html`` в корне каталога с шаблонами. Этот шаблон будет использоваться, если настройка :setting:`DEBUG` равна ``False``.

source: When :setting:`DEBUG` is ``True``, you can provide a message to ``Http404`` and it will appear in the standard 404 debug template. Use these messages for debugging purposes; they generally aren't suitable for use in a production 404 template.
ru: Если указать сообщение в исключении ``Http404``, оно появится на 404 странице при :setting:`DEBUG` равном ``True``. Используйте эти сообщения для отладки; сообщения не отображаются при отключенной отладке.

source: Customizing error views
ru: Настройка представления обрабатывающего ошибки

source: The default error views in Django should suffice for most Web applications, but can easily be overridden if you need any custom behavior. Simply specify the handlers as seen below in your URLconf (setting them anywhere else will have no effect).
ru: Встроенных представлений для обработки ошибок хватит для большинства Web-приложенийю Но если вы хотите переопределить их, добавьте ваше обработчики в главный URLconf(добавление куда-либо еще не сработает).

source: The :func:`~django.views.defaults.page_not_found` view is overridden by :data:`~django.conf.urls.handler404`::
ru: :func:`~django.views.defaults.page_not_found` переопределяется :data:`~django.conf.urls.handler404`::

source: The :func:`~django.views.defaults.server_error` view is overridden by :data:`~django.conf.urls.handler500`::
ru: :func:`~django.views.defaults.server_error` переопределяется :data:`~django.conf.urls.handler500`::

source: The :func:`~django.views.defaults.permission_denied` view is overridden by :data:`~django.conf.urls.handler403`::
ru: :func:`~django.views.defaults.permission_denied` переопределяется :data:`~django.conf.urls.handler403`::

source: The :func:`~django.views.defaults.bad_request` view is overridden by :data:`~django.conf.urls.handler400`::
ru: :func:`~django.views.defaults.bad_request` переопределяется :data:`~django.conf.urls.handler400`::

source: Use the :setting:`CSRF_FAILURE_VIEW` setting to override the CSRF error view.
ru: Чтобы переопределить представление, которое обрабатывает ошибку CSRF, используйте настройку :setting:`CSRF_FAILURE_VIEW`.
