Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/misc/design-philosophies.po
Languages: ru

source: Design philosophies
ru: Философия дизайна

source: This document explains some of the fundamental philosophies Django's developers have used in creating the framework. Its goal is to explain the past and guide the future.
ru: Этот документ объясняет некоторые из фундаментальных идей, которыми руководствуются при работе с фреймворком Django. Его цель - объяснить уже сделанное и направить в нужную сторону.

source: Overall
ru: Основы

source: Loose coupling
ru: Слабое связывание

source: A fundamental goal of Django's stack is `loose coupling and tight cohesion`_. The various layers of the framework shouldn't "know" about each other unless absolutely necessary.
ru: Фундаментальная основа стека Django - это слабая связанность и сильное зацепление (`loose coupling and tight cohesion`_). Отдельным слоям фреймворка не следует "знать" друг о друге, если в этом нет острой необходимости.

source: For example, the template system knows nothing about Web requests, the database layer knows nothing about data display and the view system doesn't care which template system a programmer uses.
ru: Например, система шаблонов ничего не знает о Web запросах, а базу данных не интересует, как эти данные представлены. В то же время представление не зависит от того, какие шаблоны использует программист.

source: Although Django comes with a full stack for convenience, the pieces of the stack are independent of another wherever possible.
ru: Django поставляется с пакетом приложений, который представляет из себя кусочки, для удобства независимые настолько, насколько это возможно.

source: Less code
ru: Меньше кода

source: Django apps should use as little code as possible; they should lack boilerplate. Django should take full advantage of Python's dynamic capabilities, such as introspection.
ru: Приложения Django должны использовать настолько мало кода, насколько возможно; следует избегать шаблонных кусков. Django должен в полной мере использовать все динамические возможности Python'а, например интроспекцию.

source: Quick development
ru: Быстрая разработка

source: The point of a Web framework in the 21st century is to make the tedious aspects of Web development fast. Django should allow for incredibly quick Web development.
ru: К Web фреймворку 21-го века ставятся жесткие требования. Одним из них является время разработки. Django должен позволять разрабатывать Web приложения невероятно быстро.

source: Don't repeat yourself (DRY)
ru: Не повторяйтесь (DRY)

source: Every distinct concept and/or piece of data should live in one, and only one, place. Redundancy is bad. Normalization is good.
ru: Каждая отдельная концепция и/или кусок данных следует хранить в одном и лишь одном месте. Избыточность - плохо. Нормализация - хорошо.

source: The framework, within reason, should deduce as much as possible from as little as possible.
ru: Фреймворк, в пределах разумного, должен использовать как можно больше из как можно меньшего.

source: The `discussion of DRY on the Portland Pattern Repository`__
ru: `Обсуждение DRY на Portland Pattern Repository <http://c2.com/cgi/wiki?DontRepeatYourself>`__

source: Explicit is better than implicit
ru: Явное лучше чем неявное

source: This is a core Python principle listed in :pep:`20`, and it means Django shouldn't do too much "magic." Magic shouldn't happen unless there's a really good reason for it. Magic is worth using only if it creates a huge convenience unattainable in other ways, and it isn't implemented in a way that confuses developers who are trying to learn how to use the feature.
ru: Этот принцип Python'а упоминается в :pep:`20`, и это значит, что Django не должен творить слишком много "магии." Она не должна происходить без явной на то причины. Магию стоит использовать только в том случае, если она дает значительные преимущества, недостижимые другими путями, и, кроме того, не вводит в заблуждение разработчиков, пытающихся понять, как же она работает.

source: Consistency
ru: Логичность

source: The framework should be consistent at all levels. Consistency applies to everything from low-level (the Python coding style used) to high-level (the "experience" of using Django).
ru: Фреймворк должен быть логичным на всех уровнях: начиная от стиля программирования на Python'е и заканчивая опытом использования Django

source: Models
ru: Модели

source: Fields shouldn't assume certain behaviors based solely on the name of the field. This requires too much knowledge of the system and is prone to errors. Instead, behaviors should be based on keyword arguments and, in some cases, on the type of the field.
ru: Поведение поля (fields) не должно основываться исключительно на его имени. Это требует слишком много знаний о системе и ведет ко множеству ошибок. Вместо этого используйте в качестве ключевых слов аргументы и, в некоторых случаях, тип поля.

source: Include all relevant domain logic
ru: Включайте всю логику предметной области

source: Models should encapsulate every aspect of an "object," following Martin Fowler's `Active Record`_ design pattern.
ru: Модель должна инкапсулировать каждый аспект "объекта", поэтому придерживайтесь патерна `Active Record`_ Мартина Фаулера

source: This is why both the data represented by a model and information about it (its human-readable name, options like default ordering, etc.) are defined in the model class; all the information needed to understand a given model should be stored *in* the model.
ru: Вот почему информация, описывающая модель и логику ее работы (например, хорошо читаемое имя, настройки по умолчанию и др.), определена в классе модели; все данные, необходимые для понимания работы модели, следует хранить *в* самой модели.

source: Database API
ru: API баз данных

source: The core goals of the database API are:
ru: Главные задачи ядра баз данных:

source: SQL efficiency
ru: Эффективность SQL

source: It should execute SQL statements as few times as possible, and it should optimize statements internally.
ru: SQL запросы должны выполняться как можно реже, и должны быть оптимизированы.

source: This is why developers need to call ``save()`` explicitly, rather than the framework saving things behind the scenes silently.
ru: Поэтому разработчик должен делать вызов save() явным, а не ждать пока фреймворк сохранит данные сам.

source: This is also why the ``select_related()`` ``QuerySet`` method exists. It's an optional performance booster for the common case of selecting "every related object."
ru: Кроме того, это объясняет, для чего нужны метод ``select_related()`` класса ``QuerySet``. Это альтернативный способ оптимизации стандартной задачи получения всех связанных объектов.

source: Terse, powerful syntax
ru: Немногословный, но мощный синтаксис

source: The database API should allow rich, expressive statements in as little syntax as possible. It should not rely on importing other modules or helper objects.
ru: API базы данных должен поддерживать богатые выразительные средства, используя при этом как можно меньше синтаксиса, кроме того не следует полагаться на импорт других можулей и объектов

source: Joins should be performed automatically, behind the scenes, when necessary.
ru: Слияние выполняется автоматически, когда это необходимо.

source: Every object should be able to access every related object, systemwide. This access should work both ways.
ru: Каждый объект должен иметь возможность получить доступ ко всем связанным и общесистемным объектам. Такой доступ должен работать в обоих направлениях.

source: Option to drop into raw SQL easily, when needed
ru: Возможность легко использовать SQL, если это необходимо

source: The database API should realize it's a shortcut but not necessarily an end-all-be-all. The framework should make it easy to write custom SQL -- entire statements, or just custom ``WHERE`` clauses as custom parameters to API calls.
ru: API базы данных должен упрощать работу с базой данных, а не замыть её полностью на себе. Фреймворк должен позволять легко использовать SQL -- полностью написать запрос, или указать только ``WHERE`` при вызове API.

source: URL design
ru: Использование URL

source: URLs in a Django app should not be coupled to the underlying Python code. Tying URLs to Python function names is a Bad And Ugly Thing.
ru: ULR-адреса в приложениях Django не следует как-либо привязывать к коду Python'а. URL-адреса в именах функций Python'а совершенно ненужны и уродливы.

source: Along these lines, the Django URL system should allow URLs for the same app to be different in different contexts. For example, one site may put stories at ``/stories/``, while another may use ``/news/``.
ru: URL-адреса Django должны позволять формировать разные URL для одного и того же приложения в разных контекстах. Например, один сайт может поместить истории в ``/stories/``, в то время как другой использует ``/news/``.

source: Infinite flexibility
ru: Бесконечная гибкость

source: URLs should be as flexible as possible. Any conceivable URL design should be allowed.
ru: URL должны быть максимально гибкими и позволять абсолютно любую форму URL-адреса.

source: Encourage best practices
ru: Поощряйте "best practices"

source: The framework should make it just as easy (or even easier) for a developer to design pretty URLs than ugly ones.
ru: Фреймворк должен подталкивать разработчика к использованию красивых и логичных URL-адресов.

source: File extensions in Web-page URLs should be avoided.
ru: Не используйте расширение файла в URL страниц.

source: Vignette-style commas in URLs deserve severe punishment.
ru: Использующие запятые в URL, заслуживают сурового наказания.

source: Definitive URLs
ru: Дефинитивные URL-адреса

source: Technically, ``foo.com/bar`` and ``foo.com/bar/`` are two different URLs, and search-engine robots (and some Web traffic-analyzing tools) would treat them as separate pages. Django should make an effort to "normalize" URLs so that search-engine robots don't get confused.
ru: Технически, ``foo.com/bar`` и ``foo.com/bar/`` -- это два разных URL-адреса, и поисковые роботы (и некоторые утилиты анализа трафика) будут воспринимать их как отдельные страницы, поэтому Django должен позаботиться о "нормализации" адресов.

source: This is the reasoning behind the :setting:`APPEND_SLASH` setting.
ru: Вот для чего была создана настройка :setting:`APPEND_SLASH`.

source: Template system
ru: Шаблоны Django

source: Separate logic from presentation
ru: Отделяйте логику от представления

source: We see a template system as a tool that controls presentation and presentation-related logic -- and that's it. The template system shouldn't support functionality that goes beyond this basic goal.
ru: Система шаблонов, как мы видим, являет собой контроллер представления и связанную с этим логику, и ничего более. Шаблоны не поддерживают какую либо функциональность, выходящую за рамки отображения данных

source: Discourage redundancy
ru: Откажитесь от избыточности

source: This is the philosophy behind :ref:`template inheritance <template-inheritance>`.
ru: Это основа философии :ref:`наследования шаблонов <template-inheritance>`.

source: Be decoupled from HTML
ru: Не зацикливайтесь на HTML

source: The template system shouldn't be designed so that it only outputs HTML. It should be equally good at generating other text-based formats, or just plain text.
ru: Шаблоны следует проектировать так, чтобы была возможность генерировать представление данных в любых текстовых форматах, а не только в HTML

source: XML should not be used for template languages
ru: XML не лучший способ описания шаблонов

source: Using an XML engine to parse templates introduces a whole new world of human error in editing templates -- and incurs an unacceptable level of overhead in template processing.
ru: Использование XML в качестве основы для парсера шаблонов приведет Вас в новый безграничный мир человеческих ошибок, и, кроме того, потребует больших затрат при обработке шаблона

source: Assume designer competence
ru: Предполагается, что верстальщики знают свое дело

source: The template system shouldn't be designed so that templates necessarily are displayed nicely in WYSIWYG editors such as Dreamweaver. That is too severe of a limitation and wouldn't allow the syntax to be as nice as it is. Django expects template authors are comfortable editing HTML directly.
ru: Проектируйте шаблон так, чтобы его редактирование не требовало обязательного использования реакторов WYSIWYG, таких как Dreamweaver, для красивого отображения. Код должен хорошо выглядеть и таким, какой он есть. Django позволяет автору шаблона создавать его в обычном текстовом редакторе.

source: Treat whitespace obviously
ru: Очевидная обработка пробелов

source: The template system shouldn't do magic things with whitespace. If a template includes whitespace, the system should treat the whitespace as it treats text -- just display it. Any whitespace that's not in a template tag should be displayed.
ru: Шаблоны не должны творить магию с пробелами. Если шаблон включает пробел, то система обрабатывает пробелы также как и обычный текст - просто отображает его. Любые пробелы, не включенные в тег, отображаются как есть.

source: Don't invent a programming language
ru: Не изобретайте язык программирования

source: The Django template system recognizes that templates are most often written by *designers*, not *programmers*, and therefore should not assume Python knowledge.
ru: Система шаблонов Django подразумевает, что шаблоны чаще всего создаются *дизайнерами*, не *программистами*, поэтому написание шаблона не привязано к знанию сиснаксиса Python'а

source: Safety and security
ru: Безопасность и защита

source: The template system, out of the box, should forbid the inclusion of malicious code -- such as commands that delete database records.
ru: Из коробки система шаблонов не позволяет выполнять код, так или иначе причиняющий вред данным, например их удаление

source: This is another reason the template system doesn't allow arbitrary Python code.
ru: И это другая причина, почему шаблоны Django не позволяют напрямую работать с кодом Python'а

source: Extensibility
ru: Расширяемость

source: The template system should recognize that advanced template authors may want to extend its technology.
ru: Система шаблонов предполагает, что разработчику может понажобиться расширить спектр используемых технологий

source: This is the philosophy behind custom template tags and filters.
ru: И эта философия основывается на кастомных тегах и фильтрах

source: Views
ru: Представление

source: Simplicity
ru: Простота

source: Writing a view should be as simple as writing a Python function. Developers shouldn't have to instantiate a class when a function will do.
ru: Создание представления следует делать таким же простым как и написание функции Python'а. Разработчики

source: Use request objects
ru: Использование объектов запроса

source: Views should have access to a request object -- an object that stores metadata about the current request. The object should be passed directly to a view function, rather than the view function having to access the request data from a global variable. This makes it light, clean and easy to test views by passing in "fake" request objects.
ru: Представление должно иметь доступ к объекту запроса -- объекту, хранящему метаданные о текущем запросе. Объект следует передавать непосредствено в функцию представления. Это лучше, чем если бы представление получало данные от запроса через какую либо глобальную переменную. Все это делает простым и прозрачным тестирование представления посредством передачи ему "ложных" данных

source: A view shouldn't care about which template system the developer uses -- or even whether a template system is used at all.
ru: Представление не должно заботиться о том, какой шаблон использует разработчик, или даже будут ли шаблоны вообще использоваться.

source: Differentiate between GET and POST
ru: Разграничивайте GET и POST запросы

source: GET and POST are distinct; developers should explicitly use one or the other. The framework should make it easy to distinguish between GET and POST data.
ru: GET и POST сильно отличаются, поэтому разработчику следует разделять их использование. Фреймворк должен легко отличать данных GET и POST запросов.

source: Cache Framework
ru: Ядро кэша

source: The core goals of Django's :doc:`cache framework </topics/cache>` are:
ru: Задачи ядра :doc:`кэша Django</topics/cache>`:

source: A cache should be as fast as possible. Hence, all framework code surrounding the cache backend should be kept to the absolute minimum, especially for ``get()`` operations.
ru: Кэш создается настолько быстрым, насколько это возможно. Таким образом, весь код фреймворка, затрагивающий работу с кэшем, следует сводить к абсолютному минимуму, особенно касательно ``get()`` запросов

source: The cache API should provide a consistent interface across the different cache backends.
ru: API кэша проектируется так, чтобы обеспечить единый интерфейс, позволяющий однообразно работать с различными реализациями кэша

source: The cache API should be extensible at the application level based on the developer's needs (for example, see :ref:`cache_key_transformation`).
ru: Обычно оставляют возможность расширения API кэша в будущем для нужд разработчика (например смотрите :ref:`cache_key_transformation`)

source: Don't repeat yourself
ru: Не повторяйтесь
