Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/topics/testing/advanced.po
Languages: ru

source: Advanced testing topics
ru: Тестирование для продвинутых

source: The request factory
ru: Фабрика запросов

source: The :class:`~django.test.RequestFactory` shares the same API as the test client. However, instead of behaving like a browser, the RequestFactory provides a way to generate a request instance that can be used as the first argument to any view. This means you can test a view function the same way as you would test any other function -- as a black box, with exactly known inputs, testing for specific outputs.
ru: :class:`~django.test.RequestFactory` имеет похожее API как в тестовом клиенте. Однако, вместо того, чтобы имитировать поведение браузера, RequestFactory предоставляет возможность генерировать объект запроса, который может быть использован в качестве первого аргумента в любом представлении. Это означает, что вы можете тестировать функцию представления таким же образом, как если бы вы тестировали любую другую функцию -- как чёрный ящик, точно зная входные данные и просто проверяя выходные данные.

source: The API for the :class:`~django.test.RequestFactory` is a slightly restricted subset of the test client API:
ru: :class:`~django.test.RequestFactory` API является слегка ограниченным подмножеством API тестового клиента:

source: It only has access to the HTTP methods :meth:`~Client.get()`, :meth:`~Client.post()`, :meth:`~Client.put()`, :meth:`~Client.delete()`, :meth:`~Client.head()`, :meth:`~Client.options()`, and :meth:`~Client.trace()`.
ru: Оно имеет доступ только к таким HTTP методам, как :meth:`~Client.get()`, :meth:`~Client.post()`, :meth:`~Client.put()`, :meth:`~Client.delete()`, :meth:`~Client.head()`, :meth:`~Client.options()`, и :meth:`~Client.trace()`.

source: These methods accept all the same arguments *except* for ``follows``. Since this is just a factory for producing requests, it's up to you to handle the response.
ru: Эти методы принимают такие же аргументы *за исключением* аргумента ``follow``. Поскольку это просто фабрика для подготовки запросов, то вы должны сами обрабатывать ответ.

source: It does not support middleware. Session and authentication attributes must be supplied by the test itself if required for the view to function properly.
ru: Не поддерживается промежуточный слой. Сессии и атрибуты аутентификации должны поставляться самими тестами, если они необходимы для корректной отработки функции представления.

source: Example
ru: Пример

source: The following is a simple unit test using the request factory::
ru: Приведённый ниже тест использует фабричный запрос::

source: Tests and multiple host names
ru: Тесты и несколько хостовых имён

source: The :setting:`ALLOWED_HOSTS` setting is validated when running tests. This allows the test client to differentiate between internal and external URLs.
ru: :setting:`ALLOWED_HOSTS` валидируется во время выполнения тестов. Это позволяет тестовому клиенту различать внутренние и внешние URL-адреса.

source: Projects that support multitenancy or otherwise alter business logic based on the request's host and use custom host names in tests must include those hosts in :setting:`ALLOWED_HOSTS`.
ru: Проекты, поддерживающие работу с несколькими доменами или иным образом изменяющие бизнес-логику на основе запросов хоста и использующие пользовательские имена хостов в тестах, должны включать эти хосты в ALLOWED_HOSTS.

source: The first and simplest option to do so is to add the hosts to your settings file. For example, the test suite for docs.djangoproject.com includes the following::
ru: Первый и самый простой способ сделать это - добавить хосты в ваш файл настроек. Например, набор тестов для docs.djangoproject.com включает в себя следующее::

source: and the settings file includes a list of the domains supported by the project::
ru: и файл настроек содержит список доменов, поддерживаемых проектом::

source: Another option is to add the required hosts to :setting:`ALLOWED_HOSTS` using :meth:`~django.test.override_settings()` or :attr:`~django.test.SimpleTestCase.modify_settings()`. This option may be preferable in standalone apps that can't package their own settings file or for projects where the list of domains is not static (e.g., subdomains for multitenancy). For example, you could write a test for the domain ``http://otherserver/`` as follows::
ru: Другой вариант - добавить требуемые хосты в :setting:`ALLOWED_HOSTS`, используя :meth:`~django.test.override_settings()` или :attr:`~django.test.SimpleTestCase.modify_settings()`. Этот вариант может быть предпочтительнее в автономных приложениях, которые не могут работать со своим собственным файлом настроек или для проектов, где список доменов не является статическим. Например, вы можете написать тест для домена ``http://otherserver/`` следующим образом::

source: Disabling :setting:`ALLOWED_HOSTS` checking (``ALLOWED_HOSTS = ['*']``) when running tests prevents the test client from raising a helpful error message if you follow a redirect to an external URL.
ru: Отключение проверки :setting:`ALLOWED_HOSTS` (``ALLOWED_HOSTS = ['*']``) при запуске тестов не позволяет тестовому клиенту выбросить полезное сообщение об ошибке, если вы выполните перенаправление на внешний URL.

source: Older versions didn't validate ``ALLOWED_HOSTS`` while testing so these techniques weren't necessary.
ru: Старые версии не проверяют ``ALLOWED_HOSTS`` во время тестирования, поэтому данная техника необязательна.

source: Tests and multiple databases
ru: Тестирование нескольких баз данных

source: Testing primary/replica configurations
ru: Тестирование primary/replica конфигурации

source: If you're testing a multiple database configuration with primary/replica (referred to as master/slave by some databases) replication, this strategy of creating test databases poses a problem. When the test databases are created, there won't be any replication, and as a result, data created on the primary won't be seen on the replica.
ru: Если вы тестируете конфигурацию нескольких баз данных с репликацией вида primary/replica (упоминается также как master/slave некоторыми СУБД), то такая стратегия создания тестовых баз данных приведёт к проблемам. Когда тестовая база данных будет создана, не будет произведено никаких репликаций, следовательно, данные, созданные в главной базе данных, не будут видны на репликационных.

source: To compensate for this, Django allows you to define that a database is a *test mirror*. Consider the following (simplified) example database configuration::
ru: Чтобы разрешить данную проблему, Django позволяет вам определить такую базу данных в качестве *тестового зеркала*. Рассмотрим следующий (упрощённый) пример конфигурации баз данных::

source: In this setup, we have two database servers: ``dbprimary``, described by the database alias ``default``, and ``dbreplica`` described by the alias ``replica``. As you might expect, ``dbreplica`` has been configured by the database administrator as a read replica of ``dbprimary``, so in normal activity, any write to ``default`` will appear on ``replica``.
ru: Исходя из данной конфигурации, мы имеем два сервера с базой данных: ``dbprimary``, отнесённой к ключевому слову ``default``, и ``dbreplica`` под ключевым словом ``replica``. Как вы можете ожидать, ``dbreplica`` сконфигурирована администратором как копия ``dbprimary``, следовательно, любая запись в ``default`` также появится и в ``replica``.

source: If Django created two independent test databases, this would break any tests that expected replication to occur. However, the ``replica`` database has been configured as a test mirror (using the :setting:`MIRROR <TEST_MIRROR>` test setting), indicating that under testing, ``replica`` should be treated as a mirror of ``default``.
ru: Если Django создаст две независимые тестовые базы данных, то это сломает любой тест, который полагается на репликацию. Однако, база данных ``replica`` была настроена как тестовое зеркало (используя ключ :setting:`MIRROR <TEST_MIRROR>` в тестовых настройках), указывающее при тестировании, что ``replica`` должна считаться зеркалом базы данных ``default``.

source: When the test environment is configured, a test version of ``replica`` will *not* be created. Instead the connection to ``replica`` will be redirected to point at ``default``. As a result, writes to ``default`` will appear on ``replica`` -- but because they are actually the same database, not because there is data replication between the two databases.
ru: Когда тестовое окружение настроено, тестовая версия ``replica`` *не* будет создана. Вместо этого соединение к ``replica`` будет перенаправлено к ``default``. В результате, запись в ``default`` появится и в ``replica``, потому что это одна и та же база данных, но не из-за репликации данных между ними.

source: Controlling creation order for test databases
ru: Контроллирование порядка создания для тестовых баз данных

source: By default, Django will assume all databases depend on the ``default`` database and therefore always create the ``default`` database first. However, no guarantees are made on the creation order of any other databases in your test setup.
ru: По умолчанию, Django будет предполагать, что все зависят от ``default`` базы данных и всегда будет её создавать первой. Однако, нет никаких гарантий по части порядка других баз данных в вашем файле настроек.

source: If your database configuration requires a specific creation order, you can specify the dependencies that exist using the :setting:`DEPENDENCIES <TEST_DEPENDENCIES>` test setting. Consider the following (simplified) example database configuration::
ru: Если ваша настройка требует особого порядка создания баз, то вы можете указать зависимости, используя :setting:`DEPENDENCIES<TEST_DEPENDENCIES>`. Рассмотрим следующий пример конфигурации::

source: Under this configuration, the ``diamonds`` database will be created first, as it is the only database alias without dependencies. The ``default`` and ``clubs`` alias will be created next (although the order of creation of this pair is not guaranteed), then ``hearts``, and finally ``spades``.
ru: Исходя из приведённой выше конфигурации, база данных ``diamonds`` будет создана первой т. к. это единственная база данных без зависимостей. Следующими будут созданы ``default`` и ``clubs`` (несмотря на то, что определённый порядок данной пары не гарантируется), потом ``hearts`` и наконец ``spades``.

source: If there are any circular dependencies in the :setting:`DEPENDENCIES <TEST_DEPENDENCIES>` definition, an :exc:`~django.core.exceptions.ImproperlyConfigured` exception will be raised.
ru: Если в :setting:`DEPENDENCIES<TEST_DEPENDENCIES>` будут присутствовать цикличные зависимости, то будет выброшено исключение :exc:`~django.core.exceptions.ImproperlyConfigured`.

source: Advanced features of ``TransactionTestCase``
ru: Дополнительные возможности ``TransactionTestCase``

source: This attribute is a private API. It may be changed or removed without a deprecation period in the future, for instance to accommodate changes in application loading.
ru: Этот атрибут является приватным API. Он может быть изменён или удалён без предупреждения в будущих версиях, например, при внесении изменений в загрузку приложения.

source: It's used to optimize Django's own test suite, which contains hundreds of models but no relations between models in different applications.
ru: Это используется для оптимизации тестирования Django, которое содержит сотни моделей, но без связей между ними в разных приложениях.

source: By default, ``available_apps`` is set to ``None``. After each test, Django calls :djadmin:`flush` to reset the database state. This empties all tables and emits the :data:`~django.db.models.signals.post_migrate` signal, which re-creates one content type and three permissions for each model. This operation gets expensive proportionally to the number of models.
ru: По умолчанию, значение ``available_apps`` установлено как ``None``. После каждого теста, Django вызывает :djadmin:`flush` для перезапуска состояния базы данных. Это очищает все таблицы и вызывает сигнал :data:`~django.db.models.signals.post_migrate`, который пересоздаёт один тип контента и три разрешения для каждой модели. Сложность и время исполнения такой операции пропорционально количеству моделей.

source: Setting ``available_apps`` to a list of applications instructs Django to behave as if only the models from these applications were available. The behavior of ``TransactionTestCase`` changes as follows:
ru: Добавление в ``available_apps`` списка приложений указывает Django работать таким образом, словно доступны только модели из указанных приложений. Поведение ``TransactionTestCase`` будет изменено:

source: :data:`~django.db.models.signals.post_migrate` is fired before each test to create the content types and permissions for each model in available apps, in case they're missing.
ru: :data:`~django.db.models.signals.post_migrate` не будет вызван перед каждым тестом для создания типов контента и разрешений для каждой модели в доступных приложениях, если они пропущены.

source: After each test, Django empties only tables corresponding to models in available apps. However, at the database level, truncation may cascade to related models in unavailable apps. Furthermore :data:`~django.db.models.signals.post_migrate` isn't fired; it will be fired by the next ``TransactionTestCase``, after the correct set of applications is selected.
ru: После каждого теста, Django очищает только модели, которые присутствуют в указанных приложениях. Однако, на уровне базы данных, очистка может дойти до недоступных приложений. Более того, :data:`~django.db.models.signals.post_migrate` в таком случае не будет вызван: оно будет вызвано следующим TransactionTestCase, после выбора корректного набора приложений.

source: Since the database isn't fully flushed, if a test creates instances of models not included in ``available_apps``, they will leak and they may cause unrelated tests to fail. Be careful with tests that use sessions; the default session engine stores them in the database.
ru: Поскольку база данных очищена не до конца, если тест будет создавать объект модели, не включенной в ``available_apps``, то они не будут учитываться, что может спровоцировать утечку и провалить не относящиеся к этому случаю тесты. Будьте осторожны с тестами, которые используют сессии: основной движок сессий хранит их в базе данных.

source: Since :data:`~django.db.models.signals.post_migrate` isn't emitted after flushing the database, its state after a ``TransactionTestCase`` isn't the same as after a ``TestCase``: it's missing the rows created by listeners to :data:`~django.db.models.signals.post_migrate`. Considering the :ref:`order in which tests are executed <order-of-tests>`, this isn't an issue, provided either all ``TransactionTestCase`` in a given test suite declare ``available_apps``, or none of them.
ru: Поскольку :data:`~django.db.models.signals.post_migrate` не вызывается после очищения базы данных, то её состояние после ``TansactionTestCase`` не является таким же, как после ``TestCase``: оно пропускает строки, созданные слушателями :data:`~django.db.models.signals.post_migrate`. Следуя :ref:`порядку в котором тесты были выполнены <order-of-tests>`, это не проблема, при условии что все ``TransactionTestCase`` в тесте содержат указанный ``available_apps``, или ни один из них.

source: ``available_apps`` is mandatory in Django's own test suite.
ru: Атрибут ``available_apps`` является обязательным при тестировании самого Django.

source: Setting ``reset_sequences = True`` on a ``TransactionTestCase`` will make sure sequences are always reset before the test run::
ru: Установка атрибута ``reset_sequences = True`` в ``TransactionTestCase`` заставит всегда перезапускать порядковый номер первичного ключа перед запуском тестов::

source: Unless you are explicitly testing primary keys sequence numbers, it is recommended that you do not hard code primary key values in tests.
ru: Если вы явно не проверяете порядковые номера первичных ключей, рекомендуется, чтобы вы не указывали напрямую значения первичного ключа в тестах.

source: Using ``reset_sequences = True`` will slow down the test, since the primary key reset is a relatively expensive database operation.
ru: Использование ``reset_sequences = True`` замедлит выполнение тестов т. к. сама по себе операция сброса порядкового номера первичного ключа достаточно сложна для СУБД.

source: Using the Django test runner to test reusable applications
ru: Использование стандартного исполнителя тестов Django для тестирования повторно применяемых приложений

source: If you are writing a :doc:`reusable application </intro/reusable-apps>` you may want to use the Django test runner to run your own test suite and thus benefit from the Django testing infrastructure.
ru: Если вы пишите :doc:`повторно применяемое приложение </intro/reusable-apps>`, то вам может пригодится использование стандартного исполнителя тестов Django для запуска ваших тестов и, следовательно, выгоду от тестовой инфраструктуры Django.

source: A common practice is a *tests* directory next to the application code, with the following structure::
ru: Общей практикой является каталог *тестов* рядом с кодом приложения со следующей структурой:

source: Let's take a look inside a couple of those files:
ru: Давайте взглянем на содержание нескольких файлов:

source: This is the script that you invoke to run the test suite. It sets up the Django environment, creates the test database and runs the tests.
ru: Это скрипт, который вы вызываете для запуска тестов. Он настраивает окружение Django, создаёт тестовую базу данных и запускает тесты.

source: For the sake of clarity, this example contains only the bare minimum necessary to use the Django test runner. You may want to add command-line options for controlling verbosity, passing in specific test labels to run, etc.
ru: Этот пример содержит абсолютный минимум необходимый для запуска исполнителя тестов Django. Вы можете захотеть добавить опции командной строки для передачи специальных тестовых меток и для других случаев.

source: This file contains the :doc:`Django settings </topics/settings>` required to run your app's tests.
ru: Данный файл содержит :doc:`настройки Django </topics/settings>`, необходимые для запуска тестов вашего приложения.

source: Again, this is a minimal example; your tests may require additional settings to run.
ru: Повторимся снова, это минимальный пример; ваши тесты могут нуждаться в дополнительных настройках.

source: Since the *tests* package is included in :setting:`INSTALLED_APPS` when running your tests, you can define test-only models in its ``models.py`` file.
ru: Поскольку пакет *tests* включен в :setting:`INSTALLED_APPS` во время работы ваших тестов, вы можете определить модели только для тестов в ``models.py`` файле.

source: Using different testing frameworks
ru: Использование других тестовых фреймворков

source: Clearly, :mod:`unittest` is not the only Python testing framework. While Django doesn't provide explicit support for alternative frameworks, it does provide a way to invoke tests constructed for an alternative framework as if they were normal Django tests.
ru: Очевидно, что :mod:`unittest` не единственный существующий тестовый фреймворк. Пока Django не предоставляет поддержку альтернативных фреймворков, оно предоставляет способ вызвать тесты, сделанные под алтернативные фреймворки так, как будто бы это обычные тесты для Django.

source: When you run ``./manage.py test``, Django looks at the :setting:`TEST_RUNNER` setting to determine what to do. By default, :setting:`TEST_RUNNER` points to ``'django.test.runner.DiscoverRunner'``. This class defines the default Django testing behavior. This behavior involves:
ru: Когда вы запускаете ``./manage.py test``, Django проверяет :setting:`TEST_RUNNER` значение для определения дальнейших действий. По умолчанию, :setting:`TEST_RUNNER` указывает на ``'django.test.runner.DiscoverRunner'``. Этот класс определяет основное тестовое поведение. Оно включает в себя:

source: Performing global pre-test setup.
ru: Выполнение глобальной настройки перед тестированием.

source: Looking for tests in any file below the current directory whose name matches the pattern ``test*.py``.
ru: Поиск тестов в любом файле ниже текущей директории, которое совпадает по паттерну ``test*.py``.

source: Creating the test databases.
ru: Создание тестовых баз данных.

source: Running ``migrate`` to install models and initial data into the test databases.
ru: Запуск ``миграции`` для установки моделей и первоначальных данных в базы данных.

source: Running the :doc:`system checks </topics/checks>`.
ru: Запуск :doc:`системных проверок</topics/checks>`.

source: Running the tests that were found.
ru: Запуск найденных тестов.

source: Destroying the test databases.
ru: Уничтожение тестовых баз данных.

source: Performing global post-test teardown.
ru: Выполнение глобального завершения тестов.

source: Running the system checks was added.
ru: Был добавлен запуск системных проверок.

source: If you define your own test runner class and point :setting:`TEST_RUNNER` at that class, Django will execute your test runner whenever you run ``./manage.py test``. In this way, it is possible to use any test framework that can be executed from Python code, or to modify the Django test execution process to satisfy whatever testing requirements you may have.
ru: Если вы определите ваш собственный класс исполнителя тестов и укажете в :setting:`TEST_RUNNER` на этот класс, Django запустит ваш исполнитель тестов всякий раз, как вы запускаете ``./manage.py test``. Таким образом, возможно использование любого фреймворка который может быть запущен из кода Python, или модифицировать процесс исполнения тестов Django для достижения каких-либо требований, которые могут у вас возникнуть.

source: Defining a test runner
ru: Определение исполнителя тестов

source: A test runner is a class defining a ``run_tests()`` method. Django ships with a ``DiscoverRunner`` class that defines the default Django testing behavior. This class defines the ``run_tests()`` entry point, plus a selection of other methods that are used to by ``run_tests()`` to set up, execute and tear down the test suite.
ru: Исполнитель тестов — это класс, определяющий метод ``run_tests()``. Django поставляется вместе с классом ``DiscoverRunner``, который определяет изначальное тестовое поведение Django. Этот класс определяет входную точку ``run_tests()``, а также набор других методов, которые используются ``run_tests()`` для настройки, выполнения и завершения теста.

source: ``DiscoverRunner`` will search for tests in any file matching ``pattern``.
ru: ``DiscoverRunner`` будет искать тесты в файлах по указанному паттерну в атрибуте ``pattern``.

source: ``top_level`` can be used to specify the directory containing your top-level Python modules. Usually Django can figure this out automatically, so it's not necessary to specify this option. If specified, it should generally be the directory containing your ``manage.py`` file.
ru: ``top_level`` может быть использовано для указания директории высшего уровня, где могут храниться модули Python. Обычно Django может определить это автоматически, следовательно необходимости в этой опции обычно нет. Если же данный атрибут указан, то должна быть указана директория, содержащая файл ``manage.py``.

source: ``verbosity`` determines the amount of notification and debug information that will be printed to the console; ``0`` is no output, ``1`` is normal output, and ``2`` is verbose output.
ru: ``verbosity`` определяет количество нотификаций и отладочной информации, которая будет выведена в терминал; ``0`` — нет вывода, ``1`` — обычный вывод, и ``2`` — подробный вывод.
