Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/topics/testing/advanced.po
Languages: ru

source: If ``interactive`` is ``True``, the test suite has permission to ask the user for instructions when the test suite is executed. An example of this behavior would be asking for permission to delete an existing test database. If ``interactive`` is ``False``, the test suite must be able to run without any manual intervention.
ru: Если в ``interactive`` указано ``True``, то тест имеет разрешение на запрос у пользователя запрашивать дополнительную информацию во время выполнения. В качестве примера можно привести запрос на разрешение удаления существующей тестовой базы данных. Если в ``interactive`` указано ``False``, то соответственно тесты будут запущены без возможности ввода во время выполнения.

source: If ``failfast`` is ``True``, the test suite will stop running after the first test failure is detected.
ru: Если в ``failfast`` указано ``True``, тесты перестанут выполняться после первого же провала.

source: If ``keepdb`` is ``True``, the test suite will use the existing database, or create one if necessary. If ``False``, a new database will be created, prompting the user to remove the existing one, if present.
ru: Если в ``keepdb`` указано ``True``, то тесты будут использовать существующую базу данных, иначе будет создана новая. Если ``False``, то будет создана новая база данных с запросом на удаление существующей, если такая будет.

source: If ``reverse`` is ``True``, test cases will be executed in the opposite order. This could be useful to debug tests that aren't properly isolated and have side effects. :ref:`Grouping by test class <order-of-tests>` is preserved when using this option.
ru: Если в ``reverse`` указано ``True``, тесты будут выполняться в обратном порядке. Это может быть полезно для отладки недостаточно хорошо изолированных тестов, имеющих побочные эффекты. :ref:`Группировка по тестовым классам <order-of-tests>` сохраняется при использовании данного атрибута.

source: ``debug_mode`` specifies what the :setting:`DEBUG` setting should be set to prior to running tests.
ru: ``debug_mode`` указывает какая :setting:`DEBUG` настройка должна быть в большем приоритете во время запуска тестов.

source: If ``debug_sql`` is ``True``, failing test cases will output SQL queries logged to the :ref:`django.db.backends logger <django-db-logger>` as well as the traceback. If ``verbosity`` is ``2``, then queries in all tests are output.
ru: Если в ``debug_sql`` указано ``True``, провалившиеся тестовые случаи выведут SQL запросы, залоггированные с помощью :ref:`django.db.backends logger <django-db-logger>` вместе с трейсбэком. Если в ``verbosity`` указано ``2``, тогда запросы будут выведены при выполнении всех тестов.

source: Django may, from time to time, extend the capabilities of the test runner by adding new arguments. The ``**kwargs`` declaration allows for this expansion. If you subclass ``DiscoverRunner`` or write your own test runner, ensure it accepts ``**kwargs``.
ru: Время от времени, Django может расширять возможности тестового исполнителя добавляя новые аргументы. Объявление ``**kwargs`` разрешает данное расширение. Если вы наследуетесь от ``DiscoverRunner`` или вы написали свой собственный исполнитель тестов, убедитесь, что оно принимает ``**kwargs``.

source: Your test runner may also define additional command-line options. Create or override an ``add_arguments(cls, parser)`` class method and add custom arguments by calling ``parser.add_argument()`` inside the method, so that the :djadmin:`test` command will be able to use those arguments.
ru: Ваш тестовый исполнитель может также определять дополнительные параметры командной строки. Создайте или переопределите метод класса ``add_arguments(cls, parser)`` и добавьте свои аргументы, вызвав ``parser.add_argument()`` внутри метода, таким образом команда :djadmin:`test` будет способна принимать ваши аргументы.

source: The ``debug_mode`` keyword argument was added.
ru: Был добавлен аргумент ``debug_mode``

source: Attributes
ru: Атрибуты

source: The class used to build the test suite. By default it is set to ``unittest.TestSuite``. This can be overridden if you wish to implement different logic for collecting tests.
ru: Класс, используемый для построения набора тестов. По умолчанию это установлено на ``unittest.TestSuite``. Это может быть изменено, если вам нужно реализовать иную логику для собирания тестов.

source: This is the class of the low-level test runner which is used to execute the individual tests and format the results. By default it is set to ``unittest.TextTestRunner``. Despite the unfortunate similarity in naming conventions, this is not the same type of class as ``DiscoverRunner``, which covers a broader set of responsibilities. You can override this attribute to modify the way tests are run and reported.
ru: Это класс низкоуровневого тестового исполнителя, который используется для выполнения отдельных тестов и форматирования результатов. По умолчанию указан ``unittest.TextTestRunner``. Несмотря на неудачное сходство в соглашениях об именах, это не тот же тип класса, что и ``DiscoverRunner``, который охватывает более широкий круг обязанностей. Вы можете перезаписать данный атрибут для изменения способа запуска и формирования отчёта тестов.

source: This is the class that loads tests, whether from TestCases or modules or otherwise and bundles them into test suites for the runner to execute. By default it is set to ``unittest.defaultTestLoader``. You can override this attribute if your tests are going to be loaded in unusual ways.
ru: Это класс, который загружает тесты, будь то из TestCases или модулей или иным образом, и связывает их с наборами тестов для исполнителя для дальнейшего выполнения. По умолчанию указан ``unittest.defaultTestLoader``. Вы можете переопределить этот атрибут, если ваши тесты должны быть загружены каким-либо необычным образом.

source: Methods
ru: Методы

source: Run the test suite.
ru: Запуск набора тестов.

source: ``test_labels`` allows you to specify which tests to run and supports several formats (see :meth:`DiscoverRunner.build_suite` for a list of supported formats).
ru: ``test_labels`` позволяет указать, какие тесты следует запускать и поддерживает несколько форматов (см. :meth:`DiscoverRunner.build_suite` для списка поддерживаемых форматов).

source: ``extra_tests`` is a list of extra ``TestCase`` instances to add to the suite that is executed by the test runner. These extra tests are run in addition to those discovered in the modules listed in ``test_labels``.
ru: extra_tests - это список дополнительных экземпляров ``TestCase`` для добавления в набор, который выполняется тестовым исполнителем. Эти дополнительные тесты будут запущены дополнительно к обнаруженным в спискемодулей в ``test_labels``.

source: This method should return the number of tests that failed.
ru: Этот метод должен вернуть количество тестов, завершившихся неудачно.

source: Override this class method to add custom arguments accepted by the :djadmin:`test` management command. See :py:meth:`argparse.ArgumentParser.add_argument()` for details about adding arguments to a parser.
ru: Переопределите этот метод класса, чтобы добавить пользовательские аргументы, принимаемые командой :djadmin:`test`. См. :py:meth:`argparse.ArgumentParser.add_argument()` для получения дополнительной информации о добавлении аргументов в парсер.

source: Sets up the test environment by calling :func:`~django.test.utils.setup_test_environment` and setting :setting:`DEBUG` to ``self.debug_mode`` (defaults to ``False``).
ru: Устанавливает тестовую среду, вызывая :func:`~django.test.utils.setup_test_environment` и устанавливая :setting:`DEBUG` в ``self.debug_mode`` (по умолчанию в ``False``).

source: Constructs a test suite that matches the test labels provided.
ru: Создает тестовый набор, соответствующий указанным тестовым меткам.

source: ``test_labels`` is a list of strings describing the tests to be run. A test label can take one of four forms:
ru: ``test_labels`` - это список строк, описывающих тесты, которые нужно запустить. Тестовая метка может принимать одну из четырех форм:

source: ``path.to.test_module.TestCase.test_method`` -- Run a single test method in a test case.
ru: ``path.to.test_module.TestCase.test_method`` -- Выполнить один тестовый метод в тесте.

source: ``path.to.test_module.TestCase`` -- Run all the test methods in a test case.
ru: ``path.to.test_module.TestCase`` -- Выполнить все тестовые методы в тесте.

source: ``path.to.module`` -- Search for and run all tests in the named Python package or module.
ru: ``path.to.module`` -- Найти и запустить все тесты в названном пакете Python или модуле.

source: ``path/to/directory`` -- Search for and run all tests below the named directory.
ru: ``path/to/directory`` -- Найти и запустить все тесты ниже указанного каталога.

source: If ``test_labels`` has a value of ``None``, the test runner will search for tests in all files below the current directory whose names match its ``pattern`` (see above).
ru: Если значение ``test_labels`` имеет значение ``None``, тестовый исполнитель будет искать тесты во всех файлах ниже текущей директории, имена которых соответствуют его ``паттерну`` (см. выше).

source: Returns a ``TestSuite`` instance ready to be run.
ru: Возвращает экземпляр ``TestSuite``, готовый к запуску.

source: Creates the test databases by calling :func:`~django.test.utils.setup_databases`.
ru: Создаёт тестовую базу данных, вызывая :func:`~django.test.utils.setup_databases`.

source: Runs the :doc:`system checks </topics/checks>`.
ru: Запускает :doc:`системные проверки </topics/checks>`.

source: Runs the test suite.
ru: Запуск тестового набора.

source: Returns the result produced by the running the test suite.
ru: Возвращает результат, полученный при запуске набора тестов.

source: Returns the keyword arguments to instantiate the ``DiscoverRunner.test_runner`` with.
ru: Возвращает аргументы ключевого слова для создания экземпляра ``DiscoverRunner.test_runner``.

source: Destroys the test databases, restoring pre-test conditions by calling :func:`~django.test.utils.teardown_databases`.
ru: Уничтожает тестовую базу данных, восстанавливает окружение, вызывая :func:`~django.test.utils.teardown_databases`.

source: Restores the pre-test environment.
ru: Восстанавливает окружение перед запуском тестирования.

source: Computes and returns a return code based on a test suite, and the result from that test suite.
ru: Вычисляет и возвращает код возврата на основе набора тестов и результат этого набора тестов.

source: Testing utilities
ru: Тестовые утилиты

source: To assist in the creation of your own test runner, Django provides a number of utility methods in the ``django.test.utils`` module.
ru: Для помощи в создании ващего собственного исполнителя тестов, Django предоставляет ряд полезных методов в модуле ``django.test.utils``.

source: Performs global pre-test setup, such as installing instrumentation for the template rendering system and setting up the dummy email outbox.
ru: Выполняет глобальную настройку перед исполнением тестов, например, установку инструмента системы рендеринга шаблонов и настройку фиктивной электронной почты.

source: If ``debug`` isn't ``None``, the :setting:`DEBUG` setting is updated to its value.
ru: Если ``debug`` не будет равен ``None``, то настройки :setting:`DEBUG` будут приведены к данному значению.

source: The ``debug`` argument was added.
ru: Был добавлен аргумент ``debug``.

source: Performs global post-test teardown, such as removing instrumentation from the template system and restoring normal email services.
ru: Выполняет глобальную настройку после исполнения тестов, например, удаление магических хуков в системе шаблонов и приведение настроек электронной почты в нормальный вид.

source: Creates the test databases.
ru: Создаёт тестовые базы данных

source: Returns a data structure that provides enough detail to undo the changes that have been made. This data will be provided to the :func:`teardown_databases` function at the conclusion of testing.
ru: Возвращает структуру данных, которая обеспечивает достаточную детализацию для отмены внесенных изменений. Эти данные будут предоставлены функции :func:`teardown_databases` в конце тестирования.

source: Destroys the test databases, restoring pre-test conditions.
ru: Уничтожает тестовые базы данных, восстанавливая условия перед тестами.

source: ``old_config`` is a data structure defining the changes in the database configuration that need to be reversed. It's the return value of the :meth:`setup_databases` method.
ru: old_config - это структура данных, определяющая изменения в конфигурации базы данных, которые необходимо изменить. Это возвращаемое значение метода :meth:`setup_databases`.

source: The creation module of the database backend also provides some utilities that can be useful during testing.
ru: Модуль создания бэкенда базы данных также предоставляет утилиты, которые могут быть полезны при тестировании.

source: Creates a new test database and runs ``migrate`` against it.
ru: Создаёт новую тестовую базу данных и запускает ``миграцию`` для неё.

source: ``verbosity`` has the same behavior as in ``run_tests()``.
ru: ``verbosity`` имеет такое же поведение, как и в ``run_tests()``.

source: ``autoclobber`` describes the behavior that will occur if a database with the same name as the test database is discovered:
ru: ``autoclobber`` описывает поведение в случе, если будет обнаружена база данных с таким же названием:

source: If ``autoclobber`` is ``False``, the user will be asked to approve destroying the existing database. ``sys.exit`` is called if the user does not approve.
ru: Если ``autoclobber`` установлен как ``False``, то пользователя попросят подтвердить уничтожение существующей базы данных. ``sys.exit`` будет вызван, если пользователь не подтвердит.

source: If autoclobber is ``True``, the database will be destroyed without consulting the user.
ru: Если autoclobber установлен как ``True``, то база данных будет уничтожена без подтверждения пользователя.

source: ``serialize`` determines if Django serializes the database into an in-memory JSON string before running tests (used to restore the database state between tests if you don't have transactions). You can set this to ``False`` to speed up creation time if you don't have any test classes with :ref:`serialized_rollback=True <test-case-serialized-rollback>`.
ru: ``serialize`` определяет нужно ли Django сериализовать базу данных прямо в памяти в JSON строку перед запуском тестов (используется для восстановления состояния между тестами если у вас нет транзакций). Вы можете установить этому атрибуту значение ``False`` для ускорения времени создания, если у вас нет каких-либо тестовых классов с установленным значением :ref:`serialized_rollback=True <test-case-serialized-rollback>`.

source: If you are using the default test runner, you can control this with the the :setting:`SERIALIZE <TEST_SERIALIZE>` entry in the :setting:`TEST <DATABASE-TEST>` dictionary.
ru: Если вы используете тестовый исполнитель, предоставленный по умолчанию, то вы можете контроллировать это используя :setting:`SERIALIZE <TEST_SERIALIZE>` в словаре :setting:`TEST <DATABASE-TEST>`.

source: ``keepdb`` determines if the test run should use an existing database, or create a new one. If ``True``, the existing database will be used, or created if not present. If ``False``, a new database will be created, prompting the user to remove the existing one, if present.
ru: ``keepdb`` определяет, должен ли запущенный тест использовать существующую базу данных или создать новую. Если указано ``True``, тогда существующая база данных будет использована, или создана новая если текущей нет. Если же указано ``False``, то будет создана новая база данных с запросом подтверждения на удаление, если такая база будет уже присутствовать.

source: Returns the name of the test database that it created.
ru: Возвращает название тестовой базы данных, которое оно создало.

source: ``create_test_db()`` has the side effect of modifying the value of :setting:`NAME` in :setting:`DATABASES` to match the name of the test database.
ru: ``create_test_db()`` имеет побочный эффект изменения значения :setting:`NAME` в :setting:`DATABASES` для соответствия имени тестовой базы данных.

source: Destroys the database whose name is the value of :setting:`NAME` in :setting:`DATABASES`, and sets :setting:`NAME` to the value of ``old_database_name``.
ru: Уничтожает базу данных по имени в :setting:`NAME` в :setting:`DATABASES`, и устанавливает значение :setting:`NAME` по аргументу ``old_database_name``.

source: The ``verbosity`` argument has the same behavior as for :class:`~django.test.runner.DiscoverRunner`.
ru: Аргумент ``verbosity`` имеет похожее поведение, как у :class:`~django.test.runner.DiscoverRunner`.

source: If the ``keepdb`` argument is ``True``, then the connection to the database will be closed, but the database will not be destroyed.
ru: Если аргумент ``keepdb`` установлен в значение ``True``, тогда соединение с базой данных будет закрыто, но база данных не будет уничтожена.

source: Integration with ``coverage.py``
ru: Интеграция с ``coverage.py``

source: Code coverage describes how much source code has been tested. It shows which parts of your code are being exercised by tests and which are not. It's an important part of testing applications, so it's strongly recommended to check the coverage of your tests.
ru: Покрытие кода показывает сколько написанного кода было протестировано. Оно показывает какие части вашего кода были исполнены тестами, а какие пропущены. Это важная часть тестирования приложений, поэтому сильно рекомендуется проверять время от времени покрытие вашего кода.

source: Django can be easily integrated with `coverage.py`_, a tool for measuring code coverage of Python programs. First, `install coverage.py`_. Next, run the following from your project folder containing ``manage.py``::
ru: В Django может быть с лёгкостью интегрирован `coverage.py`_, инструмент, способный измерить покрытие тестами программ, написанных на Python. В первую очередь, `установите coverage.py <https://pypi.python.org/pypi/coverage>`_. Далее, выполните приведённую ниже команду из директории вашего проекта, содержащую ``manage.py``::

source: This runs your tests and collects coverage data of the executed files in your project. You can see a report of this data by typing following command::
ru: Эта команда запустит ваши тесты и соберёт информацию по покрытию запущенных файлов в вашем проекте. Вы можете просмотреть отчёт по собранной информации введя следующую команду::

source: Note that some Django code was executed while running tests, but it is not listed here because of the ``source`` flag passed to the previous command.
ru: Стоит отметить, что также был запущен некоторый код Django при выполнении тестов, но оно не будет учитываться благодаря указанному в команде выше флагу ``source``.

source: For more options like annotated HTML listings detailing missed lines, see the `coverage.py`_ docs.
ru: Для больших возможностей вроде просмотра отчёта в HTML формате, обратитесь к официальной `coverage.py`_ документации.
