Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/topics/testing/doctests.po
Languages: ru

source: Django and doctests
ru: Django и doctest

source: Doctests use Python's standard :mod:`doctest` module, which searches your docstrings for statements that resemble a session of the Python interactive interpreter. A full explanation of how :mod:`doctest` works is out of the scope of this document; read Python's official documentation for the details.
ru: Doctests использует стандартный моудль Python :mod:`doctest`, который ищет тесты в строках докуентации. Здесь вкратце описывается как же он работает, за более подробной информацией обращайтесь к официальной документации.

source: A good explanation of docstrings (and some guidelines for using them effectively) can be found in :pep:`257`:
ru: Хорошее объяснение работы можно найти в :pep:`257`:

source: A docstring is a string literal that occurs as the first statement in a module, function, class, or method definition. Such a docstring becomes the ``__doc__`` special attribute of that object.
ru: Строка документации - строковый литерал, который идёт первым в модуле, функции, методе или классе. К ней можно обратиться через атрибут ``__doc__``.

source: For example, this function has a docstring that describes what it does::
ru: Например, в строке документации этой функции описано что же она делает::

source: Because tests often make great documentation, putting tests directly in your docstrings is an effective way to document *and* test your code.
ru: Поскольку тесты зачастую прекрасно документируют код, писать их в строке документации - отличная идея. И код протестирован, и документация написана.

source: As with unit tests, for a given Django application, the test runner looks for doctests in two places:
ru: Как и юнит-тесты, doctest`ы ищутся в двух местах:

source: The ``models.py`` file. You can define module-level doctests and/or a doctest for individual models. It's common practice to put application-level doctests in the module docstring and model-level doctests in the model docstrings.
ru: Файл ``models.py``. Вы можете определить doctest`ы на уровне модуля или на уровне конкретной модели. Обычная практика тесты уровня приложения писать в строках документации к модулю, а для модели использовать их собственную.

source: A file called ``tests.py`` in the application directory -- i.e., the directory that holds ``models.py``. This file is a hook for any and all doctests you want to write that aren't necessarily related to models.
ru: Файл ``tests.py`` в каталоге приложения, т.е. там, где лежит ``models.py``. Этот файл -- хук для doctest`ов, которые не связаны непосредственно с какой-то моделью.

source: This example doctest is equivalent to the example given in the unittest section above::
ru: Этот пример эквивалентен примеру, который был приведён при рассмотрении юнит-тестов::

source: When you :ref:`run your tests <running-tests>`, the test runner will find this docstring, notice that portions of it look like an interactive Python session, and execute those lines while checking that the results match.
ru: когда вы :ref:`run your tests <running-tests>`, будет найдены строки документации, которые выглядит как сессия Python в интерпретаторе, и затем выполнены.

source: In the case of model tests, note that the test runner takes care of creating its own test database. That is, any test that accesses a database -- by creating and saving model instances, for example -- will not affect your production database. However, the database is not refreshed between doctests, so if your doctest requires a certain state you should consider flushing the database or loading a fixture. (See the section on :ref:`fixtures <topics-testing-fixtures>` for more on this.) Note that to use this feature, the database user Django is connecting as must have ``CREATE DATABASE`` rights.
ru: При выполнении тестов для моделей создаётся временная база данных. Таким образом, при любом обращении к базе данных (например, создание и сохранение экземпляра) реальные таблицы не пострадают. Однако, состояние БД между выполнением тестов из разных строк документации не сохраняется, так что, если требуются зависимости от других моделей, надо самому позаботиться о дампах или фикстурах. Подробнее про фикстуры - :ref:`fixtures <topics-testing-fixtures>`. Не забудьте дать права пользователю БД на создание баз: ``CREATE DATABASE``.

source: For more details about :mod:`doctest`, see the Python documentation.
ru: За более подробной информацией по поводу :mod:`doctest` смотрите документацию Python.
