Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/topics/testing/index.po
Languages: ru

source: Testing in Django
ru: Тестирование в Django

source: Automated testing is an extremely useful bug-killing tool for the modern Web developer. You can use a collection of tests -- a **test suite** -- to solve, or avoid, a number of problems:
ru: Автоматические тесты очень полезная вещь для современного разработчика. Вы можете использовать наборы тестов -- **test suite** -- для решения ряда проблем.

source: When you're writing new code, you can use tests to validate your code works as expected.
ru: Когда разрабатывается новый функционал, можно сразу же писать к нему тесты, чтобы быть уверенным, что он работает так, как ожидается.

source: When you're refactoring or modifying old code, you can use tests to ensure your changes haven't affected your application's behavior unexpectedly.
ru: Когда вы проводите рефакторинг старого кода, тесты обеспечивают гарантию, что изменения не внесут в приложение новых ошибок.

source: Testing a Web application is a complex task, because a Web application is made of several layers of logic -- from HTTP-level request handling, to form validation and processing, to template rendering. With Django's test-execution framework and assorted utilities, you can simulate requests, insert test data, inspect your application's output and generally verify your code is doing what it should be doing.
ru: Тестирование веб-приложений представляет собой сложную задачу, так как веб-приложение состоит из нескольких слоев логики -- от HTTP запросов на уровне обработки запросов до форм проверки и рендеринга страницы. С помощью тестового фреймворка, встроенного в Django, и нескольких утилит вы можете эмулировать запросы пользователя и проверять какая страница показалась в ответ.

source: The best part is, it's really easy.
ru: Самое приятное, что это очень легко.

source: There are two primary ways to write tests with Django, corresponding to the two test frameworks that ship in the Python standard library. The two frameworks are:
ru: Есть два основных пути написания тестов для Django, которые используют разные фреймворки:

source: **Unit tests** -- tests that are expressed as methods on a Python class that subclasses :class:`unittest.TestCase` or Django's customized :class:`~django.test.TestCase`. For example::
ru: **Unit tests** -- тесты оформляются как методы Python-класса, который унаследован от :class:`unittest.TestCase` или Django-класса :class:`~django.test.TestCase`. Например::

source: **Doctests** -- tests that are embedded in your functions' docstrings and are written in a way that emulates a session of the Python interactive interpreter. For example::
ru: **Doctests** -- тесты встроены в строку документации для функции и написаны как будто для выполнения в интерактивном режиме. Например::

source: Which should I use?
ru: Так что же использовать?

source: Because Django supports both of the standard Python test frameworks, it's up to you and your tastes to decide which one to use. You can even decide to use *both*.
ru: Поскольку Django поддерживает оба способа, можете выбрать любой. А можете использовать и оба сразу.

source: For developers new to testing, however, this choice can seem confusing. Here, then, are a few key differences to help you decide which approach is right for you:
ru: Новичкам может быть сложно выбрать что-либо одно, поэтому приведём несколько ключевых различий, чтобы помочь с выбором:

source: If you've been using Python for a while, :mod:`doctest` will probably feel more "pythonic". It's designed to make writing tests as easy as possible, so it requires no overhead of writing classes or methods. You simply put tests in docstrings. This has the added advantage of serving as documentation (and correct documentation, at that!). However, while doctests are good for some simple example code, they are not very good if you want to produce either high quality, comprehensive tests or high quality documentation. Test failures are often difficult to debug as it can be unclear exactly why the test failed. Thus, doctests should generally be avoided and used primarily for documentation examples only.
ru: Если вы уже погрузились в Python, то способ с :mod:`doctest` может показаться более "pythonic". Он создан, чтобы наиболее упростить написание тестов, посему не требует дополнительных классов или методов. Просто пишите тесты в строке документации. Ещё один плюс состоит в том, что эти тесты будут видны в документации. Однако, этот способ подходит только для простых случаев; он не подойдёт, если вам нужно высокое качество кода или документации. Очень часто бывает сложно отлаживать такой тест, т.к. непонятно где именно он свалился. Таким образом, doctests больше подходит для пример в документации, в остальных случаях его лучше избегать.

source: The :mod:`unittest` framework will probably feel very familiar to developers coming from Java. :mod:`unittest` is inspired by Java's JUnit, so you'll feel at home with this method if you've used JUnit or any test framework inspired by JUnit.
ru: :mod:`unittest`, вероятно, знаком разработчикам, которые писали на Java. Этот фреймворк похож на JUnit и его производные, так что сложностей здесь быть не должно.

source: If you need to write a bunch of tests that share similar code, then you'll appreciate the :mod:`unittest` framework's organization around classes and methods. This makes it easy to abstract common tasks into common methods. The framework also supports explicit setup and/or cleanup routines, which give you a high level of control over the environment in which your test cases are run.
ru: Если вам нужно написать кучу тестов для разных кусков кода, то вы оцените организацию классов и методов в :mod:`unittest`. Схожие задачи там легко группируются в схожие методы. Система также поддерживает настройку среды тестирования для прохождения всех возможных ситуаций.

source: If you're writing tests for Django itself, you should use :mod:`unittest`.
ru: Если вы пишете тесты для Django, то используйте :mod:`unittest`.

source: Where to go from here
ru: Чего бы ещё почитать?

source: As unit tests are preferred in Django, we treat them in detail in the :doc:`overview` document.
ru: Так как модульные тесты являются предпочтительными в Django, то мы рассмотрим их в :doc:`overview`.

source: :doc:`doctests` describes Django-specific features when using doctests.
ru: В :doc:`doctests` разобраны специфичные для Django методы использования тестов в комментариях.

source: You can also use any *other* Python test framework, Django provides an API and tools for that kind of integration. They are described in the :ref:`other-testing-frameworks` section of :doc:`advanced`.
ru: Вы можете использовать и *другие* фреймворки для тестирования, т.к. в Django есть API и утилиты для быстрой интеграции. Они описаны в разделе :ref:`other-testing-frameworks` документации :doc:`advanced`.
