Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/topics/testing/overview.po
Languages: ru

source: Writing and running tests
ru: Создание и запуск тестов

source: The :doc:`testing tutorial </intro/tutorial05>`, the :doc:`testing tools reference </topics/testing/tools>`, and the :doc:`advanced testing topics </topics/testing/advanced>`.
ru: :doc:`Урок по тестированию </intro/tutorial05>`, :doc:`раздел об инструментах для тестирования </topics/testing/tools>` и :doc:`раздел о тестировании для опытных </topics/testing/advanced>`.

source: This document is split into two primary sections. First, we explain how to write tests with Django. Then, we explain how to run them.
ru: Этот раздел состоит из двух разделов. В первом мы расскажем как писать тесты с Django, во втором - как их запускать

source: Writing tests
ru: Написание тестов

source: Django's unit tests use a Python standard library module: :mod:`unittest`. This module defines tests using a class-based approach.
ru: Юнит тесты для Django используют стандартную библиотеку Python: :mod:`unittest`. Эта библиотека позволяет создавать тесты в ООП стиле.

source: Here is an example which subclasses from :class:`django.test.TestCase`, which is a subclass of :class:`unittest.TestCase` that runs each test inside a transaction to provide isolation::
ru: В примере ниже мы наследуемся от :class:`django.test.TestCase`, который является классом наследником :class:`unittest.TestCase`, и запускает каждый тест в отдельной транзакции для их изоляции::

source: When you :ref:`run your tests <running-tests>`, the default behavior of the test utility is to find all the test cases (that is, subclasses of :class:`unittest.TestCase`) in any file whose name begins with ``test``, automatically build a test suite out of those test cases, and run that suite.
ru: Когда вы :ref:`запускаете тесты <running-tests>`, происходит поиск всех тестов (классов унаследованных от :class:`unittest.TestCase`) в файлах, которые начинаются с ``test``, затем создается набор тестов(test suite) и их запуск.

source: For more details about :mod:`unittest`, see the Python documentation.
ru: Подробности о :mod:`unittest` смотрите в документации Python.

source: Where should the tests live?
ru: Где должны находиться тесты?

source: The default :djadmin:`startapp` template creates a ``tests.py`` file in the new application. This might be fine if you only have a few tests, but as your test suite grows you'll likely want to restructure it into a tests package so you can split your tests into different submodules such as ``test_models.py``, ``test_views.py``, ``test_forms.py``, etc. Feel free to pick whatever organizational scheme you like.
ru: Шаблон приложения, который использует команда :djadmin:`startapp`, содержит файл ``tests.py``. Это подходит для приложений, которые содержат не много тестов. Но поре роста количества тестов вы захотите разделить их на модули, например ``test_models.py``, ``test_views.py``, ``test_forms.py``, и т.д. Вы можете использовать любую удобную вам структуру.

source: See also :ref:`testing-reusable-applications`.
ru: Смотрите также :ref:`testing-reusable-applications`.

source: If your tests rely on database access such as creating or querying models, be sure to create your test classes as subclasses of :class:`django.test.TestCase` rather than :class:`unittest.TestCase`.
ru: Если ваши тесты используют базу данных, убедитесь, что вы наследуетесь от :class:`django.test.TestCase`, а не :class:`unittest.TestCase`.

source: Using :class:`unittest.TestCase` avoids the cost of running each test in a transaction and flushing the database, but if your tests interact with the database their behavior will vary based on the order that the test runner executes them. This can lead to unit tests that pass when run in isolation but fail when run in a suite.
ru: При использовании :class:`unittest.TestCase` экономится время на создание транзакции и сброса базы данных, но если тесты работают с базой данных, их поведение очень зависит от порядка выполнения тестов. В таком случае тесты, которые работают изолированно, могут не проходить при запуске вместе в другими тестами.

source: Running tests
ru: Запуск тестов

source: Once you've written tests, run them using the :djadmin:`test` command of your project's ``manage.py`` utility::
ru: Чтобы запустить тесты, используйте команду :djadmin:`test` скрипта ``manage.py`` в вашей проекте::

source: Test discovery is based on the unittest module's :py:ref:`built-in test discovery <unittest-test-discovery>`. By default, this will discover tests in any file named "test*.py" under the current working directory.
ru: Поиск тестов основан на :py:ref:`поиске тестов библиотеки unittest <unittest-test-discovery>`. По умолчанию тесты ищутся во всех файлах "test*.py" в текущем каталоге.

source: You can specify particular tests to run by supplying any number of "test labels" to ``./manage.py test``. Each test label can be a full Python dotted path to a package, module, ``TestCase`` subclass, or test method. For instance::
ru: Вы можете запустить определенные тесты, указав "test labels" для команды ``./manage.py test``. Каждый "label" - это путь к пакету Python, модулю, классу наследнику ``TestCase``, или методу теста. Например::

source: You can also provide a path to a directory to discover tests below that directory::
ru: Также можно передать путь к каталогу, в котором будет выполнен поиск тестов::

source: You can specify a custom filename pattern match using the ``-p`` (or ``--pattern``) option, if your test files are named differently from the ``test*.py`` pattern::
ru: Можно указать шаблон для поиска файлов с тестами, используя опцию ``-p`` (или ``--pattern``), если имена ваших файлов с тестами не соответствуют шаблону ``test*.py``::

source: If you press ``Ctrl-C`` while the tests are running, the test runner will wait for the currently running test to complete and then exit gracefully. During a graceful exit the test runner will output details of any test failures, report on how many tests were run and how many errors and failures were encountered, and destroy any test databases as usual. Thus pressing ``Ctrl-C`` can be very useful if you forget to pass the :option:`--failfast <test --failfast>` option, notice that some tests are unexpectedly failing and want to get details on the failures without waiting for the full test run to complete.
ru: Если нажать ``Ctrl-C`` при выполнении тестов, будет завершен текущий тест и затем остановлено выполнение тестов. После остановки будет выведен результат выполнения тестов и удалена тестовая база данных. ``Ctrl-C`` может быть очень полезна, если вы забыли указать опцию :option:`--failfast <test --failfast>`, и не хотите ждать окончания выполнения всех тестов, если один из них уже выполнился с ошибкой.

source: If you do not want to wait for the currently running test to finish, you can press ``Ctrl-C`` a second time and the test run will halt immediately, but not gracefully. No details of the tests run before the interruption will be reported, and any test databases created by the run will not be destroyed.
ru: Если вы не хотите ждать окончания текущего теста, можете нажать ``Ctrl-C`` еще раз и выполнение тестов завершиться немедленно. При этом вы не получите результатов выполнения тестов и тестовая база данных не будет удалена.

source: Test with warnings enabled
ru: Выполнение тестов с включенными предупреждениями

source: It's a good idea to run your tests with Python warnings enabled: ``python -Wall manage.py test``. The ``-Wall`` flag tells Python to display deprecation warnings. Django, like many other Python libraries, uses these warnings to flag when features are going away. It also might flag areas in your code that aren't strictly wrong but could benefit from a better implementation.
ru: Хорошая практика - запускать тесты с включенными предупреждениями Python: ``python -Wall manage.py test``. Флаг ``-Wall`` указывает Python показывать предупреждения об использовании устаревшего API. Django, как и многие другие библиотеки Python, использует такие предупреждения для пометки функционала, который в будущем будет удален из Django. Предупреждения могут также использоваться, чтобы обратить внимание на код, который не совсем неправильный, но требует лучшей реализации.

source: The test database
ru: Тестовая база данных

source: Tests that require a database (namely, model tests) will not use your "real" (production) database. Separate, blank databases are created for the tests.
ru: Тесты, которые работают с базой данных (то есть тесты моделей), не будут использовать "настоящую" базу данных. Для этого будет создана отдельная пустая база данных.

source: Regardless of whether the tests pass or fail, the test databases are destroyed when all the tests have been executed.
ru: Независимо от результата выполнения тестов тестовая база будет удалена после выполнения тестов.

source: You can prevent the test databases from being destroyed by using the :option:`test --keepdb` option. This will preserve the test database between runs. If the database does not exist, it will first be created. Any migrations will also be applied in order to keep it up to date.
ru: Вы можете защитить тестовые базы данных от уничтожения, добавив флаг :option:`test --keepdb` к команде запуска теста. Это защитит тестовые базы данных между запусками. Если база данных не существует, сначала она будет создана. Любые миграции также будут применены в соответствующем порядке.

source: The default test database names are created by prepending ``test_`` to the value of each :setting:`NAME` in :setting:`DATABASES`. When using SQLite, the tests will use an in-memory database by default (i.e., the database will be created in memory, bypassing the filesystem entirely!). The :setting:`TEST <DATABASE-TEST>` dictionary in :setting:`DATABASES` offers a number of settings to configure your test database. For example, if you want to use a different database name, specify :setting:`NAME <TEST_NAME>` in the :setting:`TEST <DATABASE-TEST>` dictionary for any given database in :setting:`DATABASES`.
ru: По умолчанию название тестовой базы данных формируется путем добавления префикса ``test_`` к значению настройки :setting:`NAME` баз данных, указанных в настройке :setting:`DATABASES`. При использовании SQLite тестовая база данных создается в памяти (файловая система не используется!). Если вы хотите использовать другое название для тестовой базы данных, укажите его через :setting:`NAME <TEST_NAME>` в словаре насйтроки :setting:`TEST <DATABASE-TEST>` для баз данных, указанных в :setting:`DATABASES`.

source: On PostgreSQL, :setting:`USER` will also need read access to the built-in ``postgres`` database.
ru: Для PostgreSQL пользователь из :setting:`USER` должен иметь права на чтение встроенной базы данных ``postgres``.

source: Aside from using a separate database, the test runner will otherwise use all of the same database settings you have in your settings file: :setting:`ENGINE <DATABASE-ENGINE>`, :setting:`USER`, :setting:`HOST`, etc. The test database is created by the user specified by :setting:`USER`, so you'll need to make sure that the given user account has sufficient privileges to create a new database on the system.
ru: При создании тестовой базы данных будут использоваться настройки базы данных: :setting:`ENGINE <DATABASE-ENGINE>`, :setting:`USER`, :setting:`HOST`, и т.д. Тестовая база данных создается пользователем из :setting:`USER`, убедитесь, что у этого пользователя есть права на создания базы данных.

source: For fine-grained control over the character encoding of your test database, use the :setting:`CHARSET <TEST_CHARSET>` TEST option. If you're using MySQL, you can also use the :setting:`COLLATION <TEST_COLLATION>` option to control the particular collation used by the test database. See the :doc:`settings documentation </ref/settings>` for details of these and other advanced settings.
ru: Для больше контроля кодировок в тестовой базе данных используйте параметр :setting:`CHARSET <TEST_CHARSET>` настройки TEST. При использовании MySQL можно также указать :setting:`COLLATION <TEST_COLLATION>`. Подробнее о настройках можно прочитать в :doc:`соответствующем разделе </ref/settings>`.

source: If using an SQLite in-memory database with SQLite 3.7.13+, `shared cache <https://www.sqlite.org/sharedcache.html>`_ is enabled, so you can write tests with ability to share the database between threads.
ru: При использовании работающего в оперативной памяти SQLite совместно с SQLite 3.7.13+, будет активирован `разделяемый кэш <https://www.sqlite.org/sharedcache.html>`_, таким образом, вы сможете создавать тесты с возможностью разделения базы данных между потоками.

source: Finding data from your production database when running tests?
ru: Запросы к настоящей базе дынных при выполнении тестов

source: If your code attempts to access the database when its modules are compiled, this will occur *before* the test database is set up, with potentially unexpected results. For example, if you have a database query in module-level code and a real database exists, production data could pollute your tests. *It is a bad idea to have such import-time database queries in your code* anyway - rewrite your code so that it doesn't do this.
ru: Если ваш код выполняет запросы к базе данных при импорте модуля, эти запросы будут выполнены *перед* созданием тестовой базы данных, что может привести к неожиданным результатам. То есть такие запросы выполнятся для настоящей базы данных. В любом случае *выполнение запросов при импорте модуля - плохая практика*. Избегайте этого.

source: This also applies to customized implementations of :meth:`~django.apps.AppConfig.ready()`.
ru: Это также относиться и к методу :meth:`~django.apps.AppConfig.ready()`.

source: The :ref:`advanced multi-db testing topics <topics-testing-advanced-multidb>`.
ru: :ref:`Раздел об использовании нескольких баз данных при тестировании <topics-testing-advanced-multidb>`.

source: Order in which tests are executed
ru: Порядок выполнения тестов

source: In order to guarantee that all ``TestCase`` code starts with a clean database, the Django test runner reorders tests in the following way:
ru: Чтобы код ``TestCase`` выполнялся на чистой базе данных, Django выполняет тесты в следующем порядке:

source: All :class:`~django.test.TestCase` subclasses are run first.
ru: Сначала классы-наследники :class:`~django.test.TestCase`.

source: Then, all other Django-based tests (test cases based on :class:`~django.test.SimpleTestCase`, including :class:`~django.test.TransactionTestCase`) are run with no particular ordering guaranteed nor enforced among them.
ru: Затем остальные тесты, которые используют базовые тесты Django (классы-наследники :class:`~django.test.SimpleTestCase`, включая :class:`~django.test.TransactionTestCase`). Эти тесты могут быть выполнены в любом порядке.

source: Then any other :class:`unittest.TestCase` tests (including doctests) that may alter the database without restoring it to its original state are run.
ru: Затем все остальные тесты :class:`unittest.TestCase` (включая "doctests"), которые могут изменять базу данных без восстановления начального состояния.

source: The new ordering of tests may reveal unexpected dependencies on test case ordering. This is the case with doctests that relied on state left in the database by a given :class:`~django.test.TransactionTestCase` test, they must be updated to be able to run independently.
ru: Такой порядок выполнения тестов может выявить неожиданные зависимости между тестами. Например, "doctests" могут использовать состояние, оставленное определенным :class:`~django.test.TransactionTestCase`. Такие тесты следует исправить, чтобы они могли выполняться независимо.

source: You may reverse the execution order inside groups using the :option:`test --reverse` option. This can help with ensuring your tests are independent from each other.
ru: Вы можете обратить порядок исполнения внутри группы, передав флаг :option:`test --reverse` в команду запуска теста. Это может помочь в проверке того, что ваши тесты независимы друг от друга.

source: Rollback emulation
ru: Эмуляция отката изменений

source: Any initial data loaded in migrations will only be available in ``TestCase`` tests and not in ``TransactionTestCase`` tests, and additionally only on backends where transactions are supported (the most important exception being MyISAM). This is also true for tests which rely on ``TransactionTestCase`` such as :class:`LiveServerTestCase` and :class:`~django.contrib.staticfiles.testing.StaticLiveServerTestCase`.
ru: Любые начальные данные, созданные миграциями, будут доступны только в тестах ``TestCase``, но не в тестах ``TransactionTestCase``, и только, если база данных поддерживает транзакции (наиболее важным исключением будет MyISAM). Это также верно для тестов, которые основаны на ``TransactionTestCase``, таких как :class:`LiveServerTestCase` и :class:`~django.contrib.staticfiles.testing.StaticLiveServerTestCase`.

source: Django can reload that data for you on a per-testcase basis by setting the ``serialized_rollback`` option to ``True`` in the body of the ``TestCase`` or ``TransactionTestCase``, but note that this will slow down that test suite by approximately 3x.
ru: Django может восстановить начальные данные перед каждым тестом, эмулируя откат изменений, если указать атрибут ``serialized_rollback`` с ``True`` в теле ``TestCase`` или ``TransactionTestCase``. Но учтите, это замедлит выполнение тестов приблизительно в 3 раза.

source: Third-party apps or those developing against MyISAM will need to set this; in general, however, you should be developing your own projects against a transactional database and be using ``TestCase`` for most tests, and thus not need this setting.
ru: Распространяемые приложения и те, что используют MyISAM, должны использовать этот атрибут. Но мы рекомендуем использовать базу данных, которая поддерживает транзакции, и ``TestCase`` для создания тестов. В таком случае эта настройка не понадобится.

source: The initial serialization is usually very quick, but if you wish to exclude some apps from this process (and speed up test runs slightly), you may add those apps to :setting:`TEST_NON_SERIALIZED_APPS`.
ru: Начальная сериализация данных обычно работает очень быстро, но если вы хотите исключить некоторые приложения из этого процесса (и немного ускорить выполнение тестов), вы можете указать их в настройке :setting:`TEST_NON_SERIALIZED_APPS`.

source: To prevent serialized data from being loaded twice, setting ``serialized_rollback=True`` disables the :data:`~django.db.models.signals.post_migrate` signal when flushing the test database.
ru: Чтобы избежать повторной загрузки сериализованных данных, используйте параметр ``serialized_rollback=True``, который отключает сигнал :data:`~django.db.models.signals.post_migrate` при очистке тестовой базы данных.

source: Other test conditions
ru: Другие условия выполнения тестов

source: Regardless of the value of the :setting:`DEBUG` setting in your configuration file, all Django tests run with :setting:`DEBUG`\=False. This is to ensure that the observed output of your code matches what will be seen in a production setting.
ru: Независимо от значения :setting:`DEBUG` в вашем файле настроек, Django выполняет все тесты со значением :setting:`DEBUG`\=False. Таким образом, при выполнении тестов код будет работать так же, как и на боевом сервере.

source: Caches are not cleared after each test, and running "manage.py test fooapp" can insert data from the tests into the cache of a live system if you run your tests in production because, unlike databases, a separate "test cache" is not used. This behavior `may change`_ in the future.
ru: Кэш не очищается после каждого теста, и выполнение "manage.py test fooapp" может привести к добавлению тестовых данных в кэш на "боевом" сервере, если вы запускаете тесты на этот сервере. В отличии от базы данных, отдельный "кэш для тестирования" не используется. Но это может `измениться в будущем <https://code.djangoproject.com/ticket/11505>`_.

source: Understanding the test output
ru: Разбираем вывод в консоль при выполнении тестов

source: When you run your tests, you'll see a number of messages as the test runner prepares itself. You can control the level of detail of these messages with the ``verbosity`` option on the command line::
ru: При выполнении тестов в консоль выводится различная информация. Вы можете указать уровень подробности вывода, используя опцию ``verbosity``::

source: This tells you that the test runner is creating a test database, as described in the previous section.
ru: Этот вывод уведомляет, что была создана тестовая база данных, как описано выше.

source: Once the test database has been created, Django will run your tests. If everything goes well, you'll see something like this::
ru: После создания базы данных Django начнет выполнять тесты. Если тесты выполнены успешно, вы увидите приблизительно такое::

source: If there are test failures, however, you'll see full details about which tests failed::
ru: Если некоторые тесты не выполнились успешно, будут выведены подробности::

source: A full explanation of this error output is beyond the scope of this document, but it's pretty intuitive. You can consult the documentation of Python's :mod:`unittest` library for details.
ru: Мы не будем подробно описывать информацию об ошибке, но все и так должно быть понятно. Подробности вы можете найти в документации Python для пакета :mod:`unittest`.

source: Note that the return code for the test-runner script is 1 for any number of failed and erroneous tests. If all the tests pass, the return code is 0. This feature is useful if you're using the test-runner script in a shell script and need to test for success or failure at that level.
ru: Обратите внимание, "return code" команды будет 1, если не выполнился хотя бы один тест. Если все тесты выполнились успешно, вернет 0. Это полезно, если вы запускаете тесты в shell скрипте и необходим результат выполнения.

source: Speeding up the tests
ru: Оптимизация тестов

source: Running tests in parallel
ru: Запуск тестов параллельно

source: As long as your tests are properly isolated, you can run them in parallel to gain a speed up on multi-core hardware. See :option:`test --parallel`.
ru: Если ваши тесты хорошо изолированны, вы можете запускать их параллельно, чтобы получить преимущество в скорости при использовании многоядерных процессоров. Смотрите :option:`test --parallel`.

source: Password hashing
ru: Хэширование пароля

source: The default password hasher is rather slow by design. If you're authenticating many users in your tests, you may want to use a custom settings file and set the :setting:`PASSWORD_HASHERS` setting to a faster hashing algorithm::
ru: При генерации хэша для паролей используется медленный алгоритм. Если вы создаете большое количество пользователей в тестах, можно создать отдельный файл настроек и указать в :setting:`PASSWORD_HASHERS` более быстрый алгоритм::

source: Don't forget to also include in :setting:`PASSWORD_HASHERS` any hashing algorithm used in fixtures, if any.
ru: Не забудьте также добавить в :setting:`PASSWORD_HASHERS` все хэширующие алгоритмы, которые используются в фикстурах.

source: Preserving the test database
ru: Сохранение тестовой базы данных

source: The :option:`test --keepdb` option preserves the test database between test runs. It skips the create and destroy actions which can greatly decrease the time to run tests.
ru: Опция :option:`test --keepdb` сохраняет тестовую базу данных между запусками тестов. Пропускается создание и удаление базы данных, что может значительно ускорить выполнение тестов.
