Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/topics/testing/tools.po
Languages: ru

source: After you call this method, the test client will have all the cookies and session data cleared to defaults. Subsequent requests will appear to come from an :class:`~django.contrib.auth.models.AnonymousUser`.
ru: После вызова метода тестовый клиент очистит все куки и сессионные данные. Последующие запросы будт выполнены от :class:`~django.contrib.auth.models.AnonymousUser`.

source: Testing responses
ru: Тестовые ответы

source: The ``get()`` and ``post()`` methods both return a ``Response`` object. This ``Response`` object is *not* the same as the ``HttpResponse`` object returned by Django views; the test response object has some additional data useful for test code to verify.
ru: Методы ``get()`` и ``post()`` возвращают объект ``Response``. Этот объект ``Response`` *отличается* от объекта ``HttpResponse``, который возвращается представлениями Django. Тестовый объект ответа содержит дополнительные данные, которые могут быть полезны при тестировании.

source: Specifically, a ``Response`` object has the following attributes:
ru: Объект ``Response`` содержит следующие атрибуты:

source: The test client that was used to make the request that resulted in the response.
ru: Тестовый клиент, который отправил запрос.

source: The body of the response, as a bytestring. This is the final page content as rendered by the view, or any error message.
ru: Содержимое ответа в виде байтовой строки. Окончательное содержимое страницы, которую вернуло представление, или содержимое об ошибке.

source: The template ``Context`` instance that was used to render the template that produced the response content.
ru: Экземпляр ``Context``, который использовался при рендеринге шаблона, которые использовался при формировании ответа.

source: If the rendered page used multiple templates, then ``context`` will be a list of ``Context`` objects, in the order in which they were rendered.
ru: Если использовалось несколько шаблонов, ``context`` будет содержать список объектов ``Context`` в порядке, котором они использовались при рендеринге.

source: Regardless of the number of templates used during rendering, you can retrieve context values using the ``[]`` operator. For example, the context variable ``name`` could be retrieved using::
ru: Независимо от количества используемых шаблонов, значение переменной можно получить с помощью оператора ``[]``. Например, получаем значение переменной контекста ``name``::

source: Not using Django templates?
ru: Не используйте шаблоны Django?

source: This attribute is only populated when using the :class:`~django.template.backends.django.DjangoTemplates` backend. If you're using another template engine, :attr:`~django.template.response.SimpleTemplateResponse.context_data` may be a suitable alternative on responses with that attribute.
ru: Этот атрибут используется только бэкендом :class:`~django.template.backends.django.DjangoTemplates`. Если вы используете другой шаблонизатор, возможно вам поможет :attr:`~django.template.response.SimpleTemplateResponse.context_data`.

source: The body of the response, parsed as JSON. Extra keyword arguments are passed to :func:`json.loads`. For example::
ru: Тело ответа, преобразованное как JSON. Дополнительные именованные аргументы передаются в :func:`json.loads`. Например::

source: If the ``Content-Type`` header is not ``"application/json"``, then a :exc:`ValueError` will be raised when trying to parse the response.
ru: Если заголовок ``Content-Type`` не ``"application/json"``, будет вызвано исключение :exc:`ValueError`, при попытке вызывать этот метод.

source: The request data that stimulated the response.
ru: Запрос, который был отправлен.

source: The ``WSGIRequest`` instance generated by the test handler that generated the response.
ru: Объект ``WSGIRequest``, который был сгенерирован при отправке запроса.

source: A list of ``Template`` instances used to render the final content, in the order they were rendered. For each template in the list, use ``template.name`` to get the template's file name, if the template was loaded from a file. (The name is a string such as ``'admin/index.html'``.)
ru: Список объектов ``Template``, которые использовались при формировании ответа, в порядке рендеринга. Название файла шаблона можно получить через атрибут ``template.name``, если шаблон был загружен с файла. (Название будет строкой, например ``'admin/index.html'``.)

source: This attribute is only populated when using the :class:`~django.template.backends.django.DjangoTemplates` backend. If you're using another template engine, :attr:`~django.template.response.SimpleTemplateResponse.template_name` may be a suitable alternative if you only need the name of the template used for rendering.
ru: Этот атрибут содержит значение только при использовании :class:`~django.template.backends.django.DjangoTemplates`. Если вы используете другой шаблонизатор, возможно вам поможет :attr:`~django.template.response.SimpleTemplateResponse.template_name`.

source: You can also use dictionary syntax on the response object to query the value of any settings in the HTTP headers. For example, you could determine the content type of a response using ``response['Content-Type']``.
ru: Вы можете использовать синтаксис словаря, чтобы получить значение HTTP заголовков. Например, можно получить тип ответа, используя ``response['Content-Type']``.

source: Exceptions
ru: Исключения

source: If you point the test client at a view that raises an exception, that exception will be visible in the test case. You can then use a standard ``try ... except`` block or :meth:`~unittest.TestCase.assertRaises` to test for exceptions.
ru: Если тестовый клиент выполнит запрос к представлению, которые вызывает исключение, исключение будет доступно в тесте. Вы можете использовать стандартный блок ``try ... except``, или :meth:`~unittest.TestCase.assertRaises`, чтобы протестировать исключения.

source: The only exceptions that are not visible to the test client are :class:`~django.http.Http404`, :class:`~django.core.exceptions.PermissionDenied`, :exc:`SystemExit`, and :class:`~django.core.exceptions.SuspiciousOperation`. Django catches these exceptions internally and converts them into the appropriate HTTP response codes. In these cases, you can check ``response.status_code`` in your test.
ru: Единственные исключения, которые не передаются в тест, :class:`~django.http.Http404`, :class:`~django.core.exceptions.PermissionDenied`, :exc:`SystemExit`, and :class:`~django.core.exceptions.SuspiciousOperation`. Django перехватывает их и конвертирует в соответствующий код ответа HTTP. В таком случае вы можете проверять ``response.status_code`` в тесте.

source: Persistent state
ru: Сохранение состояния

source: The test client is stateful. If a response returns a cookie, then that cookie will be stored in the test client and sent with all subsequent ``get()`` and ``post()`` requests.
ru: Тестовый клиент сохраняет состояние между запросами. Если ответ устанавливает куки, они будут сохранены в тестовом клиенте и отправлены в последующих ``get()`` и ``post()`` запросах.

source: Expiration policies for these cookies are not followed. If you want a cookie to expire, either delete it manually or create a new ``Client`` instance (which will effectively delete all cookies).
ru: Клиент не учитывает срок действия кук. Если необходимо удалить куку, делайте это явно, или создайте новый экземпляр ``Client`` (таким образом вы удалите все куки).

source: A test client has two attributes that store persistent state information. You can access these properties as part of a test condition.
ru: Клиент хранит состояние в двух атрибутах. Вы можете использовать их в тестах.

source: A Python :class:`~http.cookies.SimpleCookie` object, containing the current values of all the client cookies. See the documentation of the :mod:`http.cookies` module for more.
ru: Объект :class:`~http.cookies.SimpleCookie`, который содержит текущие куки клиента. Подробности смотрите в документации модуля :mod:`http.cookies`.

source: A dictionary-like object containing session information. See the :doc:`session documentation</topics/http/sessions>` for full details.
ru: Объект с API словаря, который содержит данные сессии. Подробности смотрите в :doc:`в разделе о сессии</topics/http/sessions>`.

source: To modify the session and then save it, it must be stored in a variable first (because a new ``SessionStore`` is created every time this property is accessed)::
ru: Используйте переменную, чтобы изменить и сохранить данные сессии (т.к. при каждом обращении к атрибуту создается новый экземпляр ``SessionStore``)::

source: Example
ru: Пример

source: The following is a simple unit test using the test client::
ru: Пример простого теста с использованием тестового клиента::

source: Provided test case classes
ru: Базовые классы для создания тестов

source: Normal Python unit test classes extend a base class of :class:`unittest.TestCase`. Django provides a few extensions of this base class:
ru: Обычно тесты в Python наследуются от :class:`unittest.TestCase`. Django предоставляет дополнительные классы, которые предоставляют дополнительные возможности:

source: Hierarchy of Django unit testing classes
ru: Иерархия классов для тестов в Django

source: Some useful assertions like:
ru: Предоставляет возможность:

source: Checking that a callable :meth:`raises a certain exception <SimpleTestCase.assertRaisesMessage>`.
ru: Проверять, что функция :meth:`вызывает определенное исключение <SimpleTestCase.assertRaisesMessage>`.

source: Testing form field :meth:`rendering and error treatment <SimpleTestCase.assertFieldOutput>`.
ru: Проверять :meth:`поля формы <SimpleTestCase.assertFieldOutput>`.

source: Testing :meth:`HTML responses for the presence/lack of a given fragment <SimpleTestCase.assertContains>`.
ru: Проверять :meth:`HTML ответа на наличие/отсутствие фрагмента кода <SimpleTestCase.assertContains>`.

source: Verifying that a template :meth:`has/hasn't been used to generate a given response content <SimpleTestCase.assertTemplateUsed>`.
ru: Проверять, что :meth:`при рендеринге ответа использовался определенный ответ <SimpleTestCase.assertTemplateUsed>`.

source: Verifying a HTTP :meth:`redirect <SimpleTestCase.assertRedirects>` is performed by the app.
ru: Проверять, что ответ содержит HTTP :meth:`редирект на другую страницу <SimpleTestCase.assertRedirects>`.

source: Robustly testing two :meth:`HTML fragments <SimpleTestCase.assertHTMLEqual>` for equality/inequality or :meth:`containment <SimpleTestCase.assertInHTML>`.
ru: Сравнение :meth:`фрагментов HTML <SimpleTestCase.assertHTMLEqual>`, или :meth:`вхождение одного фрагмента в другой <SimpleTestCase.assertInHTML>`.

source: Robustly testing two :meth:`XML fragments <SimpleTestCase.assertXMLEqual>` for equality/inequality.
ru: Сравнение :meth:`фрагментов XML <SimpleTestCase.assertXMLEqual>`.

source: Robustly testing two :meth:`JSON fragments <SimpleTestCase.assertJSONEqual>` for equality.
ru: Сравнение :meth:`фрагментов JSON <SimpleTestCase.assertJSONEqual>`.

source: The ability to run tests with :ref:`modified settings <overriding-settings>`.
ru: Позволяет запускать тест с :ref:`измененными настройками <overriding-settings>`.

source: Using the :attr:`~SimpleTestCase.client` :class:`~django.test.Client`.
ru: Содержит экземпляр :class:`~django.test.Client` в :attr:`~SimpleTestCase.client`.

source: :class:`~SimpleTestCase` disallows database queries by default. This helps to avoid executing write queries which will affect other tests since each ``SimpleTestCase`` test isn't run in a transaction. If you aren't concerned about this problem, you can disable this behavior by setting the ``allow_database_queries`` class attribute to ``True`` on your test class.
ru: :class:`~SimpleTestCase` по умолчанию запрещает выполнять запросы в базу данных. Это позволяет предотвратить выполнение запросов, которые могут повлиять на другие тесты т.к. ``SimpleTestCase`` не создает отдельную транзакцию на каждый тест. Если вас не заботит эта проблема, вы можете отключить такое поведение, указав в атрибуте класса ``allow_database_queries`` значение ``True``.

source: ``SimpleTestCase`` and its subclasses (e.g. ``TestCase``, ...) rely on ``setUpClass()`` and ``tearDownClass()`` to perform some class-wide initialization (e.g. overriding settings). If you need to override those methods, don't forget to call the ``super`` implementation::
ru: ``SimpleTestCase`` и его потомки (т.е., ``TestCase``, ...) используют методы ``setUpClass()`` и ``tearDownClass()`` для выполнения некоторой инициализации в рамках класса (т.е., для переопределения настроек). Если вам понадобится переопределить эти методы, не забудьте воспользоваться оператором ``super``::

source: Database :attr:`~TransactionTestCase.fixtures`.
ru: :attr:`~TransactionTestCase.fixtures` для базы данных.

source: Test :ref:`skipping based on database backend features <skipping-tests>`.
ru: Тесты, которые :ref:`выполняют с учетом возможностей базы данных <skipping-tests>`.

source: The remaining specialized :meth:`assert* <TransactionTestCase.assertQuerysetEqual>` methods.
ru: Остальные методы для проверки :meth:`assert* <TransactionTestCase.assertQuerysetEqual>`.

source: ``TransactionTestCase`` and ``TestCase`` are identical except for the manner in which the database is reset to a known state and the ability for test code to test the effects of commit and rollback:
ru: ``TransactionTestCase`` и ``TestCase`` отличаются лишь механизмом сброса базы данных перед каждым тестом и мозможностью тестировать транзакции:

source: A ``TransactionTestCase`` resets the database after the test runs by truncating all tables. A ``TransactionTestCase`` may call commit and rollback and observe the effects of these calls on the database.
ru: ``TransactionTestCase`` сбрасывает состояние базы данных после выполнения тестам путем очистки всех таблиц. ``TransactionTestCase`` позволяет вызывать коммит и отмену транзакций и проверять результат в базе данных.

source: A ``TestCase``, on the other hand, does not truncate tables after a test. Instead, it encloses the test code in a database transaction that is rolled back at the end of the test. This guarantees that the rollback at the end of the test restores the database to its initial state.
ru: ``TestCase``, в свою очередь, не очищает все таблицы в конце теста. Вместо этого, каждый тест оборачивается в транзакцию, которые откатывается по завершению теста. Это гарантирует, что откат в конце теста вернёт базу данных в начальное состояние.

source: ``TestCase`` running on a database that does not support rollback (e.g. MySQL with the MyISAM storage engine), and all instances of ``TransactionTestCase``, will roll back at the end of the test by deleting all data from the test database.
ru: ``TestCase``, который выполняется на базе данных, которая не поддерживает транзакции (например, MySQL с MyISAM), и все ``TransactionTestCase``, после завершения теста очищают таблицы.

source: Apps :ref:`will not see their data reloaded <test-case-serialized-rollback>`; if you need this functionality (for example, third-party apps should enable this) you can set ``serialized_rollback = True`` inside the ``TestCase`` body.
ru: Данные приложения :ref:`не будут перезагружены <test-case-serialized-rollback>`; если это необходимо (например, распространяемые приложения должны использовать это) вы можете указать ``serialized_rollback = True`` для класса ``TestCase``.

source: The class-level ``atomic`` block described above allows the creation of initial data at the class level, once for the whole ``TestCase``. This technique allows for faster tests as compared to using ``setUp()``.
ru: Описанный выше ``atomic`` блок уровня класса позволяет создание начальных данных на уровне класса, один раз для всего ``TestCase``. Такой подход пригодится для быстрых тестов, по сравнению с обычным использованием метода ``setUp()``.

source: For example::
ru: Например::

source: Note that if the tests are run on a database with no transaction support (for instance, MySQL with the MyISAM engine), ``setUpTestData()`` will be called before each test, negating the speed benefits.
ru: Следует отметить, что если тесты запущены на базе данных, у которой нет поддержки транзакций (например, MySQL с движком MyISAM), то метод ``setUpTestData()`` будет вызван перед выполнением каждого теста, ухудшая показатели скорости.

source: Be careful not to modify any objects created in ``setUpTestData()`` in your test methods. Modifications to in-memory objects from setup work done at the class level will persist between test methods. If you do need to modify them, you could reload them in the ``setUp()`` method with :meth:`~django.db.models.Model.refresh_from_db`, for example.
ru: Будьте осторожны, не меняйте объекты, которые были созданы в ``setUpTestData()``, в тестовых метод. Изменение этих объектов, которые хранятся в памяти, будет влиять на все тесты текущего класса. Если вам все же необходимо их изменить, вы можете перезагрузить их в методе ``setUp()``, используя, например, :meth:`~django.db.models.Model.refresh_from_db`.

source: ``LiveServerTestCase`` does basically the same as :class:`~django.test.TransactionTestCase` with one extra feature: it launches a live Django server in the background on setup, and shuts it down on teardown. This allows the use of automated test clients other than the :ref:`Django dummy client <test-client>` such as, for example, the Selenium_ client, to execute a series of functional tests inside a browser and simulate a real user's actions.
ru: ``LiveServerTestCase`` работает как и :class:`~django.test.TransactionTestCase`, но при этом в фоне запускается встроенный сервер Django, который по завершению тестов выключается. Это позволяет использовать клиенты для автоматического тестирования вместо :ref:`тестового клиента Django <test-client>`, такие как, например, клиент `Selenium <http://seleniumhq.org/>`_. С их помощью вы можете создавать функциональные тесты и симулировать реальное поведение пользователей.

source: To demonstrate how to use ``LiveServerTestCase``, let's write a simple Selenium test. First of all, you need to install the `selenium package`_ into your Python path:
ru: Чтобы продемонстрировать возможности ``LiveServerTestCase``, давайте напишем простой тест на Selenium. Для начала установите Python пакет `selenium <https://pypi.python.org/pypi/selenium>`_:

source: Then, add a ``LiveServerTestCase``-based test to your app's tests module (for example: ``myapp/tests.py``). For this example, we'll assume you're using the :mod:`~django.contrib.staticfiles` app and want to have static files served during the execution of your tests similar to what we get at development time with ``DEBUG=True``, i.e. without having to collect them using :djadmin:`collectstatic`. We'll use the :class:`~django.contrib.staticfiles.testing.StaticLiveServerTestCase` subclass which provides that functionality. Replace it with ``django.test.LiveServerTestCase`` if you don't need that.
ru: Теперь добавьте ``LiveServerTestCase``-тесты в ваше приложение (например: ``myapp/tests.py``). В нашем примере мы используем приложение :mod:`~django.contrib.staticfiles` и хотим, чтобы статические файлы были доступны во время тестов, как это работает при использовании сервера для разработки с настройкой ``DEBUG=True``, то есть без использования :djadmin:`collectstatic`. Мы будем использовать класс :class:`~django.contrib.staticfiles.testing.StaticLiveServerTestCase`, который предоставляет такую возможность. Если вам не нужен такой функционал, замените его на ``django.test.LiveServerTestCase``.

source: The code for this test may look as follows::
ru: Пример тестов::

source: Finally, you may run the test as follows:
ru: Теперь вы можете запустить тесты:

source: This example will automatically open Firefox then go to the login page, enter the credentials and press the "Log in" button. Selenium offers other drivers in case you do not have Firefox installed or wish to use another browser. The example above is just a tiny fraction of what the Selenium client can do; check out the `full reference`_ for more details.
ru: Этот тест автоматически откроет Firefox, затем страницу авторизации, вводит логин и пароль и нажимает кнопку "Log in". Selenium поддерживает и другие драйверы, если у вас не установлен Firefox, или вы хотите использовать другие браузеры. Пример выше показывает лишь малую часть возможностей Selenium; подробности смотрите в `документации <http://selenium-python.readthedocs.org/en/latest/api.html>`_.

source: When using an in-memory SQLite database to run the tests, the same database connection will be shared by two threads in parallel: the thread in which the live server is run and the thread in which the test case is run. It's important to prevent simultaneous database queries via this shared connection by the two threads, as that may sometimes randomly cause the tests to fail. So you need to ensure that the two threads don't access the database at the same time. In particular, this means that in some cases (for example, just after clicking a link or submitting a form), you might need to check that a response is received by Selenium and that the next page is loaded before proceeding with further test execution. Do this, for example, by making Selenium wait until the ``<body>`` HTML tag is found in the response (requires Selenium > 2.13)::
ru: При использовании размещённой в оперативной памяти SQLite для выполнения тестов, подключение к базе данных будет использоваться параллельно двумя потоками: в одном потоке работает тестовый сервер, во втором выполняются тесты. Важно, чтобы запросы в разных потоках не выполнялись одновременно, т.к. это может привести к неожиданному поведению тестов. Поэтому вам необходимо убедиться, что разные потоки не обращаются к базе данных одновременно. Для этого в некоторых ситуациях (например, после нажатия на ссылку или отправки формы), вам необходимо дождаться пока Selenium получит ответ от сервера, и загрузится новая страница, затем продолжить выполнение тестов. Вы можете сделать это указав Selenium ждать пока не будет найден тег ``<body>`` в ответе (требуется Selenium > 2.13)::

source: The tricky thing here is that there's really no such thing as a "page load," especially in modern Web apps that generate HTML dynamically after the server generates the initial document. So, simply checking for the presence of ``<body>`` in the response might not necessarily be appropriate for all use cases. Please refer to the `Selenium FAQ`_ and `Selenium documentation`_ for more information.
ru: Проблема в том, что на самом деле нет определенного момента "загрузки страницы", особенно в современных Web приложениях, которые генерируют HTML динамически после загрузки основы страницы с сервера. Поэтому ожидание тега ``<body>`` не подходит для всех случаев. Дополнительную информацию ищите в `Selenium FAQ <http://code.google.com/p/selenium/wiki/FrequentlyAskedQuestions#Q:_WebDriver_fails_to_find_elements_/_Does_not_block_on_page_loa>`_ и `документации Selenium <http://seleniumhq.org/docs/04_webdriver_advanced.html#explicit-waits>`_.

source: Test cases features
ru: Возможности приложения для тестирования

source: Default test client
ru: Тестовый клиент по умолчанию

source: Every test case in a ``django.test.*TestCase`` instance has access to an instance of a Django test client. This client can be accessed as ``self.client``. This client is recreated for each test, so you don't have to worry about state (such as cookies) carrying over from one test to another.
ru: Каждый тест экземпляра ``django.test.*TestCase`` может использовать экземпляр тестового клиента Django, обратившись к атрибуту ``self.client``. Этот клиент пересоздается для каждого теста, поэтому вам не нужно беспокоится о состоянии (например о куках) между тестами.
