Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/topics/testing/tools.po
Languages: ru

source: This means, instead of instantiating a ``Client`` in each test::
ru: Поэтому вместо создания экземпляра ``Client`` в каждом тесте::

source: ...you can just refer to ``self.client``, like so::
ru: ...вы можете просто обращаться к ``self.client``::

source: Customizing the test client
ru: Переопределение тестового клиента

source: If you want to use a different ``Client`` class (for example, a subclass with customized behavior), use the :attr:`~SimpleTestCase.client_class` class attribute::
ru: Если вы хотите использовать переопределенный класс ``Client``, укажите его в атрибуте :attr:`~SimpleTestCase.client_class`::

source: Fixture loading
ru: Загрузка фикстур

source: A fixture is a collection of data that Django knows how to import into a database. For example, if your site has user accounts, you might set up a fixture of fake user accounts in order to populate your database during tests.
ru: Фикстуры - это набор данных, которые Django умеет импортировать в базу данных. Например, если ваш сайт использует модель пользователя, вы можете создать фикстуру с данными пользователей и загружать её перед запуском тестов.

source: The most straightforward way of creating a fixture is to use the :djadmin:`manage.py dumpdata <dumpdata>` command. This assumes you already have some data in your database. See the :djadmin:`dumpdata documentation<dumpdata>` for more details.
ru: Самый простой способ создать фикстуры, использовать команду :djadmin:`manage.py dumpdata <dumpdata>`. Необходимые данные должны быть в вашей базе данных. Подробности смотрите в описании команды :djadmin:`dumpdata<dumpdata>`.

source: Once you've created a fixture and placed it in a ``fixtures`` directory in one of your :setting:`INSTALLED_APPS`, you can use it in your unit tests by specifying a ``fixtures`` class attribute on your :class:`django.test.TestCase` subclass::
ru: После создания фикстур, добавьте их в каталог ``fixtures`` одного из ваших приложений из :setting:`INSTALLED_APPS`. Теперь вы можете использовать их в тестах, указав в атрибуте ``fixtures`` класса-наследника :class:`django.test.TestCase`::

source: Here's specifically what will happen:
ru: Что произойдет:

source: Then, all the named fixtures are installed. In this example, Django will install any JSON fixture named ``mammals``, followed by any fixture named ``birds``. See the :djadmin:`loaddata` documentation for more details on defining and installing fixtures.
ru: Затем загружаются фикстуры. В примере выше Django загрузит JSON фикстуру с названием ``mammals``, затем фикстуру ``birds``. Подробности смотрите в описании :djadmin:`loaddata`.

source: By default, fixtures are only loaded into the ``default`` database. If you are using multiple databases and set :attr:`multi_db=True <TransactionTestCase.multi_db>`, fixtures will be loaded into all databases.
ru: По умолчанию фикстуры загружаются в базу данных ``default``. Если вы используете несколько баз данных и указали атрибут :attr:`multi_db=True <TransactionTestCase.multi_db>`, фикстуры будут загружены в несколько баз данных.

source: URLconf configuration
ru: Конфигурация URLconf

source: Multi-database support
ru: Поддержка нескольких баз данных

source: Django sets up a test database corresponding to every database that is defined in the :setting:`DATABASES` definition in your settings file. However, a big part of the time taken to run a Django TestCase is consumed by the call to ``flush`` that ensures that you have a clean database at the start of each test run. If you have multiple databases, multiple flushes are required (one for each database), which can be a time consuming activity -- especially if your tests don't need to test multi-database activity.
ru: Django создает тестовую базу для каждой указанной базы данных из настройки :setting:`DATABASES`. Однако, большую часть времени выполнения тестов занимает операция очистки базы данных(``flush``) перед каждым тестом. Если вы используете несколько баз данных, требуется несколько операций ``flush`` (одна на каждую базу денных). Это может заниматься достаточно много времени.

source: As an optimization, Django only flushes the ``default`` database at the start of each test run. If your setup contains multiple databases, and you have a test that requires every database to be clean, you can use the ``multi_db`` attribute on the test suite to request a full flush.
ru: Для оптимизации Django очищает только базу данных ``default`` перед каждым тестом. Если ваш проект использует несколько баз данных, и в перед тестом необходимо очищать все базы данных, вы можете указать атрибут ``multi_db`` для класса тестов.

source: This test case will flush *all* the test databases before running ``test_index_page_view``.
ru: Для этого тестов будут очищены *все* базы данных перед выполнением ``test_index_page_view``.

source: Overriding settings
ru: Переопределение настроек

source: Use the functions below to temporarily alter the value of settings in tests. Don't manipulate ``django.conf.settings`` directly as Django won't restore the original values after such manipulations.
ru: Используйте приведённые ниже функции для временного изменения значения параметров конфигурации в тестах. Не изменяйте ``django.conf.settings`` напрямую, так как Django не восстановит оригинальные значения после таких манипуляций.

source: For testing purposes it's often useful to change a setting temporarily and revert to the original value after running the testing code. For this use case Django provides a standard Python context manager (see :pep:`343`) called :meth:`~django.test.SimpleTestCase.settings`, which can be used like this::
ru: При тестировании часто необходимо временно переопределить настройки и вернуть начальные значение после завершения тестов. Для таких случаев Django предоставляет стандартный контекстный менеджер Python (смотрите :pep:`343`), который называется :meth:`~django.test.SimpleTestCase.settings`. Его можно использовать следующим образом::

source: This example will override the :setting:`LOGIN_URL` setting for the code in the ``with`` block and reset its value to the previous state afterwards.
ru: В этом примере мы переопределили :setting:`LOGIN_URL` для блока ``with``, после выхода из блока настройка будет сброшена.

source: It can prove unwieldy to redefine settings that contain a list of values. In practice, adding or removing values is often sufficient. The :meth:`~django.test.SimpleTestCase.modify_settings` context manager makes it easy::
ru: Помогает при переопределении настроек, которые содержат список. Если вам необходимо добавить или удалить значение из списка, используйте контекстный менеджер :meth:`~django.test.SimpleTestCase.modify_settings`::

source: For each action, you can supply either a list of values or a string. When the value already exists in the list, ``append`` and ``prepend`` have no effect; neither does ``remove`` when the value doesn't exist.
ru: Для каждого действия вы можете указать список значений или строку. Если значение уже в списке, ``append`` и ``prepend`` не имеют никакого эффекта; аналогично ``remove`` ничего не сделает, если значение отсутствует в списке.

source: In case you want to override a setting for a test method, Django provides the :func:`~django.test.override_settings` decorator (see :pep:`318`). It's used like this::
ru: Если вы хотите переопределить настройки для тестового метода, Django предоставляет декоратор :func:`~django.test.override_settings` (смотрите :pep:`318`). Вы можете использовать его следующим образом::

source: The decorator can also be applied to :class:`~django.test.TestCase` classes::
ru: Декоратор можно применять и к классам :class:`~django.test.TestCase`::

source: Likewise, Django provides the :func:`~django.test.modify_settings` decorator::
ru: Также Django содержит декоратор :func:`~django.test.modify_settings`::

source: The decorator can also be applied to test case classes::
ru: Его можно применять к классам с тестами::

source: When given a class, these decorators modify the class directly and return it; they don't create and return a modified copy of it. So if you try to tweak the above examples to assign the return value to a different name than ``LoginTestCase`` or ``MiddlewareTestCase``, you may be surprised to find that the original test case classes are still equally affected by the decorator. For a given class, :func:`~django.test.modify_settings` is always applied after :func:`~django.test.override_settings`.
ru: Эти декораторы непосредственно изменяют класс, они не создают и возвращают копию. Если вы попытаетесь назначить возвращаемый результат переменным с названиями отличными от ``LoginTestCase`` илиr ``MiddlewareTestCase``, вы обнаружите, что оригинальные классы были все равно изменены декораторами. Декоратор :func:`~django.test.modify_settings` всегда применяет после :func:`~django.test.override_settings`, если их добавить к одному классу.

source: The settings file contains some settings that are only consulted during initialization of Django internals. If you change them with ``override_settings``, the setting is changed if you access it via the ``django.conf.settings`` module, however, Django's internals access it differently. Effectively, using :func:`~django.test.override_settings` or :func:`~django.test.modify_settings` with these settings is probably not going to do what you expect it to do.
ru: Файл настроек содержит некоторые настройки, которые используются только при инициализации Django. Если вы измените их с помощью ``override_settings``, настройка измениться, если получить значение из модуля ``django.conf.settings``, однако Django может обращаться к ней по другому. Поэтому :func:`~django.test.override_settings` или :func:`~django.test.modify_settings` могут работать не так, как вы ожидаете .

source: We do not recommend altering the :setting:`DATABASES` setting. Altering the :setting:`CACHES` setting is possible, but a bit tricky if you are using internals that make using of caching, like :mod:`django.contrib.sessions`. For example, you will have to reinitialize the session backend in a test that uses cached sessions and overrides :setting:`CACHES`.
ru: Мы не советуем изменять настройку :setting:`DATABASES`. Менять :setting:`CACHES` можно, но требует дополнительных действий, если кеш используется другими механизмами Django, например :mod:`django.contrib.sessions`. В таком случае вам понадобиться заново инициализировать сессию в тесте после изменения :setting:`CACHES`.

source: Finally, avoid aliasing your settings as module-level constants as ``override_settings()`` won't work on such values since they are only evaluated the first time the module is imported.
ru: Также не указывайте ваши настройки в константах модуля, ``override_settings()`` не будет работать с такими настройками т.к. они выполняются только при первом импорте модуля. (FIXME: whut?)

source: You can also simulate the absence of a setting by deleting it after settings have been overridden, like this::
ru: Вы также можете протестировать отсутствие настройки, удалив ее после использования декоратора::

source: When overriding settings, make sure to handle the cases in which your app's code uses a cache or similar feature that retains state even if the setting is changed. Django provides the :data:`django.test.signals.setting_changed` signal that lets you register callbacks to clean up and otherwise reset state when settings are changed.
ru: При переопределении настроек учитывайте ситуации, когда выше приложение использует кеш или другие механизмы, которые сохраняют свое состояние после изменения настроек. Django предоставляет сигнал :data:`django.test.signals.setting_changed`, который позволяет сбросить состояние, или выполнить другие действия, при изменении настроек.

source: Django itself uses this signal to reset various data:
ru: Django использует этот сигнал для сброса различных данных:

source: Overridden settings
ru: Переопределенные настройки

source: Data reset
ru: Данные, который сбрасываются

source: Databases timezone
ru: Часовой пояс баз данных

source: Template engines
ru: Шаблонные движки

source: Serializers cache
ru: Кеш сериализаторов

source: Default translation and loaded translations
ru: Перевод по умолчанию и загруженные переводы

source: Default file storage
ru: Хранилище файлов по умолчанию

source: Emptying the test outbox
ru: Очистка тестовых электронных писем

source: If you use any of Django's custom ``TestCase`` classes, the test runner will clear the contents of the test email outbox at the start of each test case.
ru: Если вы используйте класс ``TestCase`` Django, содержимое отправленных тестовых электронных писем будет очищено перед каждым тестом.

source: For more detail on email services during tests, see `Email services`_ below.
ru: Подробности смотрите ниже в разделе об :ref:`отправке писем <topics-testing-email>`.

source: Assertions
ru: Проверки

source: As Python's normal :class:`unittest.TestCase` class implements assertion methods such as :meth:`~unittest.TestCase.assertTrue` and :meth:`~unittest.TestCase.assertEqual`, Django's custom :class:`TestCase` class provides a number of custom assertion methods that are useful for testing Web applications:
ru: Кроме стандартных методов для проверки, которые предоставляет стандартный класс :class:`unittest.TestCase`, например :meth:`~unittest.TestCase.assertTrue` и :meth:`~unittest.TestCase.assertEqual`, :class:`TestCase` Django предоставляет дополнительные методы для проверки, которые могут быть полезны при тестировании Web приложений:

source: If only the ``expected_exception`` and ``expected_message`` parameters are given, returns a context manager so that the code being tested can be written inline rather than as a function::
ru: Если передать только ``expected_exception`` и ``expected_message``, вернет контекстный менеджер, что позволит писать проверяемый код без добавления в функцию::

source: Passing ``callable`` as a keyword argument called ``callable_obj`` is deprecated. Pass the callable as a positional argument instead.
ru: Передача ``callable`` именованным аргументом ``callable_obj`` считается устаревшей. Теперь следует передавать как позиционный аргумент.

source: Asserts that a form field behaves correctly with various inputs.
ru: Проверяет поведение поля формы с разными значениями.

source: the class of the field to be tested.
ru: класс поля, который тестируется.

source: a dictionary mapping valid inputs to their expected cleaned values.
ru: словарь, который указывает передаваемые значение и ожидаемые после проверки.

source: a dictionary mapping invalid inputs to one or more raised error messages.
ru: словарь, который указывает неправильные входные значения и ожидаемые ошибки валидации.

source: the args passed to instantiate the field.
ru: позиционные аргументы, которые передаются при создании поля.

source: the kwargs passed to instantiate the field.
ru: именованные аргументы, которые передаются при создании поля.

source: the expected clean output for inputs in ``empty_values``.
ru: ожидаемое значение после проверки для входящих пустых значений из ``empty_values``.

source: For example, the following code tests that an ``EmailField`` accepts ``a@a.com`` as a valid email address, but rejects ``aaa`` with a reasonable error message::
ru: Например, следующий код проверяет, что поле ``EmailField`` принимает ``a@a.com`` как правильное значение, но возвращает ошибки, если передать ``aaa``::

source: Asserts that a field on a form raises the provided list of errors when rendered on the form.
ru: Проверяет, что поле формы из ответа содержит указанный список ошибок.

source: ``form`` is the name the ``Form`` instance was given in the template context.
ru: ``form`` -- название экземпляра ``Form`` в контексте шаблона ответа.

source: ``field`` is the name of the field on the form to check. If ``field`` has a value of ``None``, non-field errors (errors you can access via :meth:`form.non_field_errors() <django.forms.Form.non_field_errors>`) will be checked.
ru: ``field`` -- название поля формы. Если ``field`` содержит ``None``, будут проверятся ошибки не привязанные к конкретному полю (которые можно получить с помощью метода :meth:`form.non_field_errors() <django.forms.Form.non_field_errors>`).

source: ``errors`` is an error string, or a list of error strings, that are expected as a result of form validation.
ru: ``errors`` -- строка с ошибкой, или список ошибок, которые были получены при валидации формы.

source: Asserts that the ``formset`` raises the provided list of errors when rendered.
ru: Проверяет, что ``formset`` из ответа содержит указанный список ошибок.

source: ``formset`` is the name the ``Formset`` instance was given in the template context.
ru: ``formset`` -- название экземпляра ``Formset`` в контексте шаблона ответа.

source: ``form_index`` is the number of the form within the ``Formset``. If ``form_index`` has a value of ``None``, non-form errors (errors you can access via ``formset.non_form_errors()``) will be checked.
ru: ``form_index`` -- номер формы в ``Formset``. Если ``form_index`` содержит ``None``, будут проверятся ошибки не привязанные к конкретной форме (которые можно получить с помощью метода ``formset.non_form_errors()``).

source: Asserts that a ``Response`` instance produced the given ``status_code`` and that ``text`` appears in the content of the response. If ``count`` is provided, ``text`` must occur exactly ``count`` times in the response.
ru: Проверяет, что объект ``Response`` с указанным ``status_code`` и содержит ``text``. Если указан ``count``, ``text`` должен встречаться ``count`` раз в ответе.

source: Set ``html`` to ``True`` to handle ``text`` as HTML. The comparison with the response content will be based on HTML semantics instead of character-by-character equality. Whitespace is ignored in most cases, attribute ordering is not significant. See :meth:`~SimpleTestCase.assertHTMLEqual` for more details.
ru: Укажите ``True`` в ``html``, чтобы ``text`` обрабатывался как HTML. Сравнение содержимого будет основано на семантике HTML, а не посимвольном сравнении. Пробелы будут проигнорированы в большинстве случаев, порядок атрибутов не учитывается. Подробности с мотрите в описании :meth:`~SimpleTestCase.assertHTMLEqual`.

source: Asserts that a ``Response`` instance produced the given ``status_code`` and that ``text`` does *not* appear in the content of the response.
ru: Проверяет, что объект ``Response`` с указанным ``status_code`` и *не* содержит ``text``.

source: Asserts that the template with the given name was used in rendering the response.
ru: Проверяет, что указанный шаблон использовался при рендеринге ответа.

source: The name is a string such as ``'admin/index.html'``.
ru: Название -- строка, например ``'admin/index.html'``.

source: The count argument is an integer indicating the number of times the template should be rendered. Default is ``None``, meaning that the template should be rendered one or more times.
ru: Количество аргументов - это целое, показывающее количество раз, которое будет обработан шаблон. По умолчанию это ``None``, означающее, что шаблон должен быть обработан один или борее раз.

source: You can use this as a context manager, like this::
ru: Можно использовать как менеджер контекста::

source: Asserts that the template with the given name was *not* used in rendering the response.
ru: Проверяет, что указанный шаблон *не* использовался при рендеринге ответа.

source: You can use this as a context manager in the same way as :meth:`~SimpleTestCase.assertTemplateUsed`.
ru: Можно использовать как менеджер контекста, как и :meth:`~SimpleTestCase.assertTemplateUsed`.

source: Asserts that the response returned a ``status_code`` redirect status, redirected to ``expected_url`` (including any ``GET`` data), and that the final page was received with ``target_status_code``.
ru: Проверяет, что ``status_code`` ответа указывает на редирект на ``expected_url`` (включая ``GET`` параметры), и финальная страница загружается со статусом ``target_status_code``.

source: If your request used the ``follow`` argument, the ``expected_url`` and ``target_status_code`` will be the url and status code for the final point of the redirect chain.
ru: Если запрос использует аргумент ``follow``, ``expected_url`` и ``target_status_code`` будут указывать на последний запрос.

source: Scheme is handled correctly when making comparisons between two URLs. If there isn't any scheme specified in the location where we are redirected to, the original request's scheme is used. If present, the scheme in ``expected_url`` is the one used to make the comparisons to.
ru: Протокол правильно обрабатывается при сравнении URL-ов. Если протокол не указан при редиректе, будет использоваться протокол изначального запроса.

source: The ``host`` argument is deprecated, as redirections are no longer forced to be absolute URLs.
ru: Аргумент ``host`` устарел. Перенаправления теперь не обязательно указывать с абсолютным URL.

source: Asserts that the strings ``html1`` and ``html2`` are equal. The comparison is based on HTML semantics. The comparison takes following things into account:
ru: Сравнивает строки ``html1`` и ``html2``. Сравнение основано на семантике HTML. При сравнении используются следующие правила:

source: Whitespace before and after HTML tags is ignored.
ru: Пробелы перед и после HTML тегов игнорируются.

source: All types of whitespace are considered equivalent.
ru: Все типы пробелов считаются одинаковыми.

source: All open tags are closed implicitly, e.g. when a surrounding tag is closed or the HTML document ends.
ru: Все незакрытые теги закрываются, например, при закрытии внешнего тега, или в конце HTML документа.

source: Empty tags are equivalent to their self-closing version.
ru: Пустые теги равны самозакрывающиемся аналогичным тегам.

source: The ordering of attributes of an HTML element is not significant.
ru: Порядок атрибутов HTML тегов не учитывается.

source: Attributes without an argument are equal to attributes that equal in name and value (see the examples).
ru: Атрибуты без значений равны атрибутам, значение которых равно названию атрибута (смотрите примеры).

source: The following examples are valid tests and don't raise any ``AssertionError``::
ru: Следующие тесты не вызывают ``AssertionError``::

source: ``html1`` and ``html2`` must be valid HTML. An ``AssertionError`` will be raised if one of them cannot be parsed.
ru: ``html1`` и ``html2`` должны содержать правильный HTML. Если один из них не будет отпарсен, метод вызовет исключение ``AssertionError``.

source: Output in case of error can be customized with the ``msg`` argument.
ru: Вы можете изменить сообщение об ошибке с помощью аргумента ``msg``.

source: Asserts that the strings ``html1`` and ``html2`` are *not* equal. The comparison is based on HTML semantics. See :meth:`~SimpleTestCase.assertHTMLEqual` for details.
ru: Проверяет, что строки ``html1`` и ``html2`` отличаются. Сравнение основано на семантике HTML. Подробности смотрите в описании :meth:`~SimpleTestCase.assertHTMLEqual`.

source: Asserts that the strings ``xml1`` and ``xml2`` are equal. The comparison is based on XML semantics. Similarly to :meth:`~SimpleTestCase.assertHTMLEqual`, the comparison is made on parsed content, hence only semantic differences are considered, not syntax differences. When invalid XML is passed in any parameter, an ``AssertionError`` is always raised, even if both string are identical.
ru: Проверяет, что строки ``xml1`` и ``xml2`` одинаковы. При сравнении используется семантика XML. Как и в :meth:`~SimpleTestCase.assertHTMLEqual`, сравнивается результат парсинка, то есть учитываются только семантические отличия, а не отличия в синтаксисе. Если передан не правильный XML, вызывается ``AssertionError``, даже если обе строки одинаковы.
