Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/topics/testing/tools.po
Languages: ru

source: Asserts that the strings ``xml1`` and ``xml2`` are *not* equal. The comparison is based on XML semantics. See :meth:`~SimpleTestCase.assertXMLEqual` for details.
ru: Проверяет, что строки ``xml1`` и ``xml2`` *не* одинаковы. При сравнении используется семантика XML. Подробности смотрите в описании :meth:`~SimpleTestCase.assertXMLEqual`.

source: Asserts that the HTML fragment ``needle`` is contained in the ``haystack`` one.
ru: Проверяет наличие HTML фрагмента ``needle`` в ``haystack``.

source: If the ``count`` integer argument is specified, then additionally the number of ``needle`` occurrences will be strictly verified.
ru: Если указан параметр ``count``, проверяется, что ``needle`` встречается указанное число раз.

source: Whitespace in most cases is ignored, and attribute ordering is not significant. The passed-in arguments must be valid HTML.
ru: В большинстве случаев пробелы игнорируются. Аргументы должны содержать правильный HTML.

source: Asserts that the JSON fragments ``raw`` and ``expected_data`` are equal. Usual JSON non-significant whitespace rules apply as the heavyweight is delegated to the :mod:`json` library.
ru: Проверяет, что JSON в ``raw`` и ``expected_data`` одинаковый. Обработка пробелов в JSON делегируется библиотеке :mod:`json`.

source: Asserts that the JSON fragments ``raw`` and ``expected_data`` are *not* equal. See :meth:`~SimpleTestCase.assertJSONEqual` for further details.
ru: Проверяет, что фрагменты JSON ``raw`` и ``expected_data`` *не* одинаковы. Подробности смотрите в описании :meth:`~SimpleTestCase.assertJSONEqual`.

source: Asserts that a queryset ``qs`` returns a particular list of values ``values``.
ru: Проверяет, что ``qs``(объект ``QuerySet``) возвращает список значений ``values``.

source: The comparison of the contents of ``qs`` and ``values`` is performed using the function ``transform``; by default, this means that the ``repr()`` of each value is compared. Any other callable can be used if ``repr()`` doesn't provide a unique or helpful comparison.
ru: При сравнении содержимого ``qs`` и ``values`` используется функция ``transform``; по умолчанию сравнивается результат ``repr()`` над каждым значением. Вы можете указать другую функцию, если ``repr()`` возвращает не уникальные значения, которые нельзя использовать при сравнении.

source: By default, the comparison is also ordering dependent. If ``qs`` doesn't provide an implicit ordering, you can set the ``ordered`` parameter to ``False``, which turns the comparison into a ``collections.Counter`` comparison. If the order is undefined (if the given ``qs`` isn't ordered and the comparison is against more than one ordered values), a ``ValueError`` is raised.
ru: По умолчанию, при сравнении учитывается и порядок значений. Если ``qs`` не содержит неявных правил сортировки, вы можете указать ``False`` в ``ordered``, что преобразует сравнение в сравнение ``collections.Counter``. Если же порядок не определён (если переданная ``qs`` не отсортирована и сравнение сравнение производится по нескольким отсортированным значениям), то вызывается исключение ``ValueError``.

source: Asserts that when ``func`` is called with ``*args`` and ``**kwargs`` that ``num`` database queries are executed.
ru: Проверяет, что при вызове функции ``func`` с аргументами ``*args`` и ``**kwargs`` выполнилось ``num`` запросов в базу данных.

source: If a ``"using"`` key is present in ``kwargs`` it is used as the database alias for which to check the number of queries. If you wish to call a function with a ``using`` parameter you can do it by wrapping the call with a ``lambda`` to add an extra parameter::
ru: Если ``kwargs`` содержит ключ ``"using"``, он используется для определения базы данных, для которой необходимо считать количество запросов. Если вы хотите вызывать функцию с аргументом ``using``, оберните её в ``lambda``, чтобы добавить аргумент::

source: You can also use this as a context manager::
ru: Вы можете использовать этот метод как менеджер контекста::

source: Email services
ru: Сервисы для отправки писем

source: If any of your Django views send email using :doc:`Django's email functionality </topics/email>`, you probably don't want to send email each time you run a test using that view. For this reason, Django's test runner automatically redirects all Django-sent email to a dummy outbox. This lets you test every aspect of sending email -- from the number of messages sent to the contents of each message -- without actually sending the messages.
ru: Если выши представления оправляют электронные письма, используя :doc:`встроенный функционал Django </topics/email>`, вы, скорее всего, не захотите, чтобы они отправлялись при каждом запуске тестов. В таких случаях Django автоматически перенаправляет все письма, отправленные через механизм Django, в специальную переменную в памяти. Это позволяет тестировать отправку писем без реальной отправки.

source: The test runner accomplishes this by transparently replacing the normal email backend with a testing backend. (Don't worry -- this has no effect on any other email senders outside of Django, such as your machine's mail server, if you're running one.)
ru: Django неявно подменяет бэкенд для отправки писем при запуске тестов. (Не беспокойтесь -- это распространяется только на Django. Если вы используете локальные почтовые сервисы, они будут работь без изменений.)

source: During test running, each outgoing email is saved in ``django.core.mail.outbox``. This is a simple list of all :class:`~django.core.mail.EmailMessage` instances that have been sent. The ``outbox`` attribute is a special attribute that is created *only* when the ``locmem`` email backend is used. It doesn't normally exist as part of the :mod:`django.core.mail` module and you can't import it directly. The code below shows how to access this attribute correctly.
ru: При выполнении тестов все отправленные письма сохраняются в переменной ``django.core.mail.outbox``. Это просто список объектов :class:`~django.core.mail.EmailMessage` писем, которые были отправлены. Атрибут ``outbox`` создается *только* для ``locmem`` бэкенда отправки писем. Вы не можете импортировать его из модуля :mod:`django.core.mail`. Пример ниже показывает как следует его использовать.

source: Here's an example test that examines ``django.core.mail.outbox`` for length and contents::
ru: Этот пример проверяет размер и содержимое ``django.core.mail.outbox``::

source: As noted :ref:`previously <emptying-test-outbox>`, the test outbox is emptied at the start of every test in a Django ``*TestCase``. To empty the outbox manually, assign the empty list to ``mail.outbox``::
ru: Как упоминалось :ref:`выше <emptying-test-outbox>`, содержимое этого атрибута очищается при запуске каждого теста из ``*TestCase``. Чтобы явно очистить -- просто укажите пустой список в ``mail.outbox``::

source: Management Commands
ru: Команды управления

source: Management commands can be tested with the :func:`~django.core.management.call_command` function. The output can be redirected into a ``StringIO`` instance::
ru: Команды управления могут быть протестированы с помощью функции :func:`~django.core.management.call_command`. Вывод может быть перенаправлен в объект ``StringIO``::

source: Skipping tests
ru: Пропуск тестов

source: The unittest library provides the :func:`@skipIf <unittest.skipIf>` and :func:`@skipUnless <unittest.skipUnless>` decorators to allow you to skip tests if you know ahead of time that those tests are going to fail under certain conditions.
ru: Библиотека unittest предоставляет декораторы :func:`@skipIf <unittest.skipIf>` и :func:`@skipUnless <unittest.skipUnless>`, которые позволяют пропускать тесты, если вы знаете, что они не выполнятся успешно при определенных условиях.

source: For example, if your test requires a particular optional library in order to succeed, you could decorate the test case with :func:`@skipIf <unittest.skipIf>`. Then, the test runner will report that the test wasn't executed and why, instead of failing the test or omitting the test altogether.
ru: Например, если ваш тест требует определенной необязательной библиотеки, вы можете обернуть тест декоратором :func:`@skipIf <unittest.skipIf>`. Тест будет пропущен, будет выведена причина пропуска.

source: To supplement these test skipping behaviors, Django provides two additional skip decorators. Instead of testing a generic boolean, these decorators check the capabilities of the database, and skip the test if the database doesn't support a specific named feature.
ru: Django предоставляет два дополнительных декоратора для пропуска теста. Вместо проверки явного условия, эти декораторы проверяют наличие определенного функционала базы данных, и тест пропускается, если база данных не поддерживает необходимый функционал.

source: The decorators use a string identifier to describe database features. This string corresponds to attributes of the database connection features class. See ``django.db.backends.BaseDatabaseFeatures`` class for a full list of database features that can be used as a basis for skipping tests.
ru: Декораторы используют строковые называние возможностей базы данных. Строка соответствует атрибуту из класса ``django.db.backends.BaseDatabaseFeatures``, смотрите описание класса, чтобы узнать полный список возможностей базы данных, которые можно проверять.

source: Skip the decorated test or ``TestCase`` if all of the named database features are supported.
ru: Пропускает декорируемый тест или ``TestCase``, если поддерживаются все указанные возможности базы данных.

source: For example, the following test will not be executed if the database supports transactions (e.g., it would *not* run under PostgreSQL, but it would under MySQL with MyISAM tables)::
ru: Например, следующий тест будет пропущен, если база данных поддерживает транзакции (например, он *не* будет выполнятся на PostgreSQL, но выполниться на MySQL с таблицами MyISAM)::

source: Skip the decorated test or ``TestCase`` if any of the named database features are *not* supported.
ru: Пропускает декорируемый тест или ``TestCase``, если *не* поддерживается любая из перечисленных возможностей базы данных.

source: For example, the following test will only be executed if the database supports transactions (e.g., it would run under PostgreSQL, but *not* under MySQL with MyISAM tables)::
ru: Например, следующий тест выполнится, если база данных поддерживает транзакции (например, он выполниться на PostgreSQL, но *не* на MySQL с таблицами MyISAM)::
