Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/topics/testing/tools.po
Languages: ru

source: Testing tools
ru: Инструменты для тестирования

source: Django provides a small set of tools that come in handy when writing tests.
ru: Django предоставляет несколько инструментов, которые могут быть полезны при написании тестов.

source: The test client
ru: Тестовый клиент

source: The test client is a Python class that acts as a dummy Web browser, allowing you to test your views and interact with your Django-powered application programmatically.
ru: Тестовый клиент -- это класс Python, который умеет эмулировать запросы браузера. Он позволяет протестировать ваши представления и программно взаимодействовать с вашим Django-приложением.

source: Some of the things you can do with the test client are:
ru: Некоторые вещи, которые вы можете делать с тестовым клиентом:

source: Simulate GET and POST requests on a URL and observe the response -- everything from low-level HTTP (result headers and status codes) to page content.
ru: Эмулирует GET или POST запросы к URL-у и обрабатывает ответ -- начиная от низкоуровневого HTTP (заголовки результата и код ответа) и заканчивая содержимым ответа.

source: See the chain of redirects (if any) and check the URL and status code at each step.
ru: Следует по цепочке редиректов (если такие есть) и проверяет URL и код ответа на каждом шаге.

source: Test that a given request is rendered by a given Django template, with a template context that contains certain values.
ru: Может проверять, что полученный ответ был отрендерен определенным шаблоном Django с контекстом, который содержит определенные переменные.

source: Note that the test client is not intended to be a replacement for Selenium_ or other "in-browser" frameworks. Django's test client has a different focus. In short:
ru: Обратите внимание, этот клиент не может заменить Selenium_ или другие фреймворки, которые используют движок браузера для запросов. У тестового клиента Django другие задачи. Если кратко:

source: Use Django's test client to establish that the correct template is being rendered and that the template is passed the correct context data.
ru: Вы можете использовать тестовый клиент, если нужно проверить какой шаблон использовался для рендеринга ответа, и какой контекст ему передавался.

source: Use in-browser frameworks like Selenium_ to test *rendered* HTML and the *behavior* of Web pages, namely JavaScript functionality. Django also provides special support for those frameworks; see the section on :class:`~django.test.LiveServerTestCase` for more details.
ru: Фреймворки, которые используют движок браузера, например Selenium_, позволяют тестировать уже *готовый* HTML и *поведение* страниц в браузере, а именно работу JavaScript. Django предоставляет инструменты для работы с ними, подробности смотрите в описании :class:`~django.test.LiveServerTestCase`.

source: A comprehensive test suite should use a combination of both test types.
ru: Комплексный набор тестов должен использовать комбинацию обоих типов тестов.

source: Overview and a quick example
ru: Обзор и примеры

source: To use the test client, instantiate ``django.test.Client`` and retrieve Web pages::
ru: Для использования тестового клиента создайте экземпляр ``django.test.Client``, затем получите страницу::

source: As this example suggests, you can instantiate ``Client`` from within a session of the Python interactive interpreter.
ru: Как видно из примера, вы можете использовать ``Client`` в консоли Python.

source: Note a few important things about how the test client works:
ru: Несколько заметок о работе тестового клиента:

source: The test client does *not* require the Web server to be running. In fact, it will run just fine with no Web server running at all! That's because it avoids the overhead of HTTP and deals directly with the Django framework. This helps make the unit tests run quickly.
ru: Для работы тестового клиента *не нужно* запускать сервер. Он работает непосредственно с Django. Это ускоряет выполнение тестов.

source: When retrieving pages, remember to specify the *path* of the URL, not the whole domain. For example, this is correct::
ru: Следует указывать *путь* из URL без домена. Например, вот так правильно::

source: This is incorrect::
ru: А это не будет работать::

source: The test client is not capable of retrieving Web pages that are not powered by your Django project. If you need to retrieve other Web pages, use a Python standard library module such as :mod:`urllib`.
ru: Тестовый клиент умеет получить только те страницы, которые принадлежат текущему Django проекту. Для загрузки внешних страниц можно использовать стандартную библиотеку Python :mod:`urllib`.

source: To resolve URLs, the test client uses whatever URLconf is pointed-to by your :setting:`ROOT_URLCONF` setting.
ru: При обработке URL-ов тестовый клиент использует URLconf указанный в настройке :setting:`ROOT_URLCONF`.

source: Although the above example would work in the Python interactive interpreter, some of the test client's functionality, notably the template-related functionality, is only available *while tests are running*.
ru: Несмотря на то, что примеры выше работают в консоли Python, некоторый функционал тестового клиента, в частности связанный с шаблонизатором, работает только *при выполнении тестов*.

source: The reason for this is that Django's test runner performs a bit of black magic in order to determine which template was loaded by a given view. This black magic (essentially a patching of Django's template system in memory) only happens during test running.
ru: Причина в "темной магии", которую Django использует при запуске тестов для определения какой шаблон был использован представлением. Эта "темная магия" (патчинг системы шаблонов Django в памяти) работает только при выполнении тестов.

source: By default, the test client will disable any CSRF checks performed by your site.
ru: По умолчанию тестовый клиент отключает все CSRF проверки на вашем проекте.

source: If, for some reason, you *want* the test client to perform CSRF checks, you can create an instance of the test client that enforces CSRF checks. To do this, pass in the ``enforce_csrf_checks`` argument when you construct your client::
ru: Если вы *хотите*, чтобы тестовый клиент выполнял проверку CSRF, вы можете создать отдельный экземпляр тестового клиента и указать ему выполнять проверку CSRF. Для этого передайте аргумент ``enforce_csrf_checks`` в конструктор::

source: Making requests
ru: Выполнение запросов

source: Use the ``django.test.Client`` class to make requests.
ru: Используйте класс ``django.test.Client`` для выполнения запросов.

source: It requires no arguments at time of construction. However, you can use keywords arguments to specify some default headers. For example, this will send a ``User-Agent`` HTTP header in each request::
ru: Конструктор не требует обязательных аргументов. Однако, вы можете использовать именованные аргументы, чтобы указать заголовки для запросов. Например, следующий код добавит HTTP заголовок ``User-Agent`` для каждого запроса::

source: The values from the ``extra`` keywords arguments passed to :meth:`~django.test.Client.get()`, :meth:`~django.test.Client.post()`, etc. have precedence over the defaults passed to the class constructor.
ru: Значения из аргумента ``extra``, который передается в :meth:`~django.test.Client.get()`, :meth:`~django.test.Client.post()`, и т.д., имею более высокий, чем аргументы конструктора.

source: The ``enforce_csrf_checks`` argument can be used to test CSRF protection (see above).
ru: Аргумент ``enforce_csrf_checks`` может использоваться для проверки CSRF (смотрите выше).

source: Once you have a ``Client`` instance, you can call any of the following methods:
ru: Создав экземпляр ``Client``, вы можете использовать следующие методы:

source: Makes a GET request on the provided ``path`` and returns a ``Response`` object, which is documented below.
ru: Выполняет GET запрос по указанному ``path`` и возвращает объект ``Response``(описан ниже).

source: The key-value pairs in the ``data`` dictionary are used to create a GET data payload. For example::
ru: В словаре ``data`` можно передать GET аргументы. Например::

source: ...will result in the evaluation of a GET request equivalent to::
ru: ...выполнит GET запрос аналогичный::

source: The ``extra`` keyword arguments parameter can be used to specify headers to be sent in the request. For example::
ru: Именованные аргументы ``extra`` позволяют указать дополнительные HTTP заголовки. Например::

source: ...will send the HTTP header ``HTTP_X_REQUESTED_WITH`` to the details view, which is a good way to test code paths that use the :meth:`django.http.HttpRequest.is_ajax()` method.
ru: ...отправит HTTP заголовок ``HTTP_X_REQUESTED_WITH``, который позволит протестировать обработку :meth:`django.http.HttpRequest.is_ajax()`.

source: CGI specification
ru: Спецификация CGI

source: The headers sent via ``**extra`` should follow CGI_ specification. For example, emulating a different "Host" header as sent in the HTTP request from the browser to the server should be passed as ``HTTP_HOST``.
ru: Заголовки из ``**extra`` должны соответствовать `CGI <http://www.w3.org/CGI/>`_ спецификации. Например, различные значения для HTTP заголовка "Host" следует указать в параметре ``HTTP_HOST``.

source: If you already have the GET arguments in URL-encoded form, you can use that encoding instead of using the data argument. For example, the previous GET request could also be posed as::
ru: Если у вас уже есть путь с GET аргументами в URL-кодированном формате, вы можете его использовать без аргумента ``data``. Например, GET запрос из примера выше можно выполнить следующим образом::

source: If you provide a URL with both an encoded GET data and a data argument, the data argument will take precedence.
ru: Если вы передали URL с GET параметрами и передали аргумент ``data``, будет использовать ``data``.

source: If you set ``follow`` to ``True`` the client will follow any redirects and a ``redirect_chain`` attribute will be set in the response object containing tuples of the intermediate urls and status codes.
ru: Если передать ``follow`` со значением ``True``, тестовый клиент будет следовать всем редиректам и атрибут ``redirect_chain`` будет содержать кортеж из всех URL-ов и статусов ответа.

source: If you had a URL ``/redirect_me/`` that redirected to ``/next/``, that redirected to ``/final/``, this is what you'd see::
ru: Если у вас есть URL ``/redirect_me/``, который перенаправляет на ``/next/``, который перенаправляет на ``/final/``, вы получите следующее::

source: If you set ``secure`` to ``True`` the client will emulate an HTTPS request.
ru: Если передать ``secure`` со значением ``True``, тестовый клиент эмулирует HTTPS запрос.

source: Makes a POST request on the provided ``path`` and returns a ``Response`` object, which is documented below.
ru: Выполняет POST запрос по указанному ``path`` и возвращает объект ``Response``(описан ниже).

source: The key-value pairs in the ``data`` dictionary are used to submit POST data. For example::
ru: В словаре ``data`` можно передать данные для POST запроса. Например::

source: ...will result in the evaluation of a POST request to this URL::
ru: ...выполнит POST запрос на URL::

source: ...with this POST data::
ru: ...отправив через POST данные::

source: If you provide ``content_type`` (e.g. :mimetype:`text/xml` for an XML payload), the contents of ``data`` will be sent as-is in the POST request, using ``content_type`` in the HTTP ``Content-Type`` header.
ru: Если указать ``content_type`` (например :mimetype:`text/xml` для загрузки XML), содержимое ``data`` будет отправлено без изменений, используя значение ``content_type`` как HTTP заголовок ``Content-Type``.

source: If you don't provide a value for ``content_type``, the values in ``data`` will be transmitted with a content type of :mimetype:`multipart/form-data`. In this case, the key-value pairs in ``data`` will be encoded as a multipart message and used to create the POST data payload.
ru: Если ``content_type`` не указан, данные из ``data`` будут отправлены с типом :mimetype:`multipart/form-data`. В этом случае значения из ``data`` будут кодированы как "multipart" сообщение и отправлены через POST.

source: To submit multiple values for a given key -- for example, to specify the selections for a ``<select multiple>`` -- provide the values as a list or tuple for the required key. For example, this value of ``data`` would submit three selected values for the field named ``choices``::
ru: Чтобы отправить несколько значений для одного ключа -- например, указать список значений из ``<select multiple>`` -- укажите список или кортеж значений. Например, следующий ``data`` отправит три значения для поля с названием ``choices``::

source: Submitting files is a special case. To POST a file, you need only provide the file field name as a key, and a file handle to the file you wish to upload as a value. For example::
ru: Отправка файлов -- особый случай. Чтобы отправить файлы через POST запрос, укажите название файлового поля в качестве ключа и открытый файл в качестве значения. Например::

source: (The name ``attachment`` here is not relevant; use whatever name your file-processing code expects.)
ru: (Название ``attachment`` взято в качестве примера, используйте название из вашего кода.)

source: You may also provide any file-like object (e.g., :class:`~io.StringIO` or :class:`~io.BytesIO`) as a file handle.
ru: Также можно предоставить любой похожий на файл объект (т.е., :class:`~io.StringIO` или :class:`~io.BytesIO`) в качестве файлового дескриптора.

source: Note that if you wish to use the same file handle for multiple ``post()`` calls then you will need to manually reset the file pointer between posts. The easiest way to do this is to manually close the file after it has been provided to ``post()``, as demonstrated above.
ru: Обратите внимание, если вы хотите использовать один файл для нескольких вызовов ``post()``, необходимо явно сбросить указатель текущей позиции файла между вызовами. Самый простой способ -- закрыть файл после вызова ``post()``, как это сделано в примере выше.

source: You should also ensure that the file is opened in a way that allows the data to be read. If your file contains binary data such as an image, this means you will need to open the file in ``rb`` (read binary) mode.
ru: Вы также должны отрыть файл с возможностью чтения. Если файл содержит бинарные данные, например изображение, необходимо открыть его в режиме ``rb`` (бинарное чтение).

source: The ``extra`` argument acts the same as for :meth:`Client.get`.
ru: Аргумент ``extra`` работает так же, как и для :meth:`Client.get`.

source: If the URL you request with a POST contains encoded parameters, these parameters will be made available in the request.GET data. For example, if you were to make the request::
ru: Если URL, на который отправляет POST запрос, содержит параметры, они будут доступны через ``request.GET``. Например, при следующем запросе::

source: ... the view handling this request could interrogate request.POST to retrieve the username and password, and could interrogate request.GET to determine if the user was a visitor.
ru: ... представление, которое обрабатывает запрос, сможет получить имя и пароль из ``request.POST``, и определить был ли пользователь посетителем через ``request.GET``.

source: Makes a HEAD request on the provided ``path`` and returns a ``Response`` object. This method works just like :meth:`Client.get`, including the ``follow``, ``secure`` and ``extra`` arguments, except it does not return a message body.
ru: Выполняет HEAD запрос по указанному ``path`` и возвращает объект ``Response``(описан ниже). Работает как :meth:`Client.get`, включая аргументы ``follow``, ``secure`` и ``extra``, но ответ без содержимого.

source: Makes an OPTIONS request on the provided ``path`` and returns a ``Response`` object. Useful for testing RESTful interfaces.
ru: Выполняет OPTIONS запрос по указанному ``path`` и возвращает объект ``Response``(описан ниже). Удобен при тестировании REST API.

source: When ``data`` is provided, it is used as the request body, and a ``Content-Type`` header is set to ``content_type``.
ru: Если передать ``data``, значение будет использовать как тело запроса, а заголовок ``Content-Type`` равен ``content_type``.

source: The ``follow``, ``secure`` and ``extra`` arguments act the same as for :meth:`Client.get`.
ru: Аргументы ``follow``, ``secure`` и ``extra`` работают как и для :meth:`Client.get`.

source: Makes a PUT request on the provided ``path`` and returns a ``Response`` object. Useful for testing RESTful interfaces.
ru: Выполняет PUT запрос по указанному ``path`` и возвращает объект ``Response``(описан ниже). Удобен при тестировании REST API.

source: Makes a PATCH request on the provided ``path`` and returns a ``Response`` object. Useful for testing RESTful interfaces.
ru: Выполняет PATCH запрос по указанному ``path`` и возвращает объект ``Response``(описан ниже). Удобен при тестировании REST API.

source: Makes a TRACE request on the provided ``path`` and returns a ``Response`` object. Useful for simulating diagnostic probes.
ru: Выполняет TRACE запрос по указанному ``path`` и возвращает объект ``Response``. Удобен при тестировании.

source: The ``follow``, ``secure``, and ``extra`` arguments act the same as for :meth:`Client.get`.
ru: Аргументы ``follow``, ``secure`` и ``extra`` работают как и для :meth:`Client.get`.

source: If your site uses Django's :doc:`authentication system</topics/auth/index>` and you deal with logging in users, you can use the test client's ``login()`` method to simulate the effect of a user logging into the site.
ru: Если ваш сайт использует :doc:`систему авторизации Django </topics/auth/index>`, вы можете использовать метод ``login()`` тестового клиента, чтобы эмулировать авторизацию пользователями.

source: After you call this method, the test client will have all the cookies and session data required to pass any login-based tests that may form part of a view.
ru: После вызова этого метода тестовый клиент будет содержать все куки и данные сессии, которые необходимы, чтобы пройти проверку авторизации в представлении.

source: The format of the ``credentials`` argument depends on which :ref:`authentication backend <authentication-backends>` you're using (which is configured by your :setting:`AUTHENTICATION_BACKENDS` setting). If you're using the standard authentication backend provided by Django (``ModelBackend``), ``credentials`` should be the user's username and password, provided as keyword arguments::
ru: Формат аргумента ``credentials`` зависит от используемого :ref:`бэкенда авторизации <authentication-backends>` (который настраивается :setting:`AUTHENTICATION_BACKENDS`). Если вы используете стандартный бэкенд Django (``ModelBackend``), ``credentials`` будет имя и пароль пользователя::

source: If you're using a different authentication backend, this method may require different credentials. It requires whichever credentials are required by your backend's ``authenticate()`` method.
ru: Для других бэкендов авторизации параметры могут отличаться. Это зависит от аргументов, которые принимает метод ``authenticate()`` бэкенда авторизации.

source: ``login()`` returns ``True`` if it the credentials were accepted and login was successful.
ru: ``login()`` возвращает ``True``, если пользователь успешно залогинен.

source: Finally, you'll need to remember to create user accounts before you can use this method. As we explained above, the test runner is executed using a test database, which contains no users by default. As a result, user accounts that are valid on your production site will not work under test conditions. You'll need to create users as part of the test suite -- either manually (using the Django model API) or with a test fixture. Remember that if you want your test user to have a password, you can't set the user's password by setting the password attribute directly -- you must use the :meth:`~django.contrib.auth.models.User.set_password()` function to store a correctly hashed password. Alternatively, you can use the :meth:`~django.contrib.auth.models.UserManager.create_user` helper method to create a new user with a correctly hashed password.
ru: Не забудьте создать пользователя перед вызовом метода. Как мы уже сказали выше, тесты используют тестовую базу данных, которая не содержит пользователей по умолчанию. Поэтому пользователь, который существует в вашей базе данных, не будет работать в тестах. Вы должны создать пользователя в текущем наборе тестов явно (используя API Django моделей), или используя тестовые фикстуры. Помните, если вы хотите установить пароль тестовому пользователю, вы не можете этого сделать просто назначив атрибут -- вы должны использовать метод :meth:`~django.contrib.auth.models.User.set_password()`, которая установит пароль в правильно хешированном виде. Также вы можете использовать метод :meth:`~django.contrib.auth.models.UserManager.create_user` для создания пользователя с правильным паролем.

source: If your site uses Django's :doc:`authentication system</topics/auth/index>`, you can use the ``force_login()`` method to simulate the effect of a user logging into the site. Use this method instead of :meth:`login` when a test requires a user be logged in and the details of how a user logged in aren't important.
ru: Если ваш сайт использует :doc:`систему авторизации Django </topics/auth/index>`, вы можете использовать метод ``force_login()`` чтобы эмулировать авторизацию пользователя на вашем сайте. Используйте этот метод вместо :meth:`login`, если необходимо авторизировать пользователя в тестах и при этом не важен способ авторизации.

source: Unlike ``login()``, this method skips the authentication and verification steps: inactive users (:attr:`is_active=False <django.contrib.auth.models.User.is_active>`) are permitted to login and the user's credentials don't need to be provided.
ru: В отличии от ``login()`` этот метод пропускает этапы авторизации и проверки пользователя: неактивные пользователи (:attr:`is_active=False <django.contrib.auth.models.User.is_active>`) могут быть авторизированы и нет надобности указывать данные для авторизации(прим. пер. логин/пароль).

source: The user will have its ``backend`` attribute set to the value of the ``backend`` argument (which should be a dotted Python path string), or to ``settings.AUTHENTICATION_BACKENDS[0]`` if a value isn't provided. The :func:`~django.contrib.auth.authenticate` function called by :meth:`login` normally annotates the user like this.
ru: Атрибут ``backend`` пользователя будет установлен в значение аргумента ``backend`` (которые должен содержать путь для импорта Python), или ``settings.AUTHENTICATION_BACKENDS[0]``, если аргумент не указан. Обычно этот атрибут устанавливает функция :func:`~django.contrib.auth.authenticate`, вызываемая :meth:`login`.

source: This method is faster than ``login()`` since the expensive password hashing algorithms are bypassed. Also, you can speed up ``login()`` by :ref:`using a weaker hasher while testing <speeding-up-tests-auth-hashers>`.
ru: Этот метод быстрее ``login()`` т.к. пропускаются сложные алгоритмы хэширования паролей. Также вы можете ускорить ``login()``, используя :ref:`более простые алгоритмы хэширования паролей <speeding-up-tests-auth-hashers>`.

source: If your site uses Django's :doc:`authentication system</topics/auth/index>`, the ``logout()`` method can be used to simulate the effect of a user logging out of your site.
ru: Если ваш сайт использует :doc:`систему авторизации Django </topics/auth/index>`, вы можете использовать метод ``logout()`` чтобы эмулировать логаут пользователя.
