Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/howto/static-files/deployment.po
Languages: ru

source: Deploying static files
ru: Развертывание статических файлов

source: For an introduction to the use of :mod:`django.contrib.staticfiles`, see :doc:`/howto/static-files/index`.
ru: Что такое :mod:`django.contrib.staticfiles` можно прочитать в разделе :doc:`/howto/static-files/index`.

source: Serving static files in production
ru: Раздача статических файлов на боевом сервере

source: The basic outline of putting static files into production is simple: run the :djadmin:`collectstatic` command when static files change, then arrange for the collected static files directory (:setting:`STATIC_ROOT`) to be moved to the static file server and served. Depending on :setting:`STATICFILES_STORAGE`, files may need to be moved to a new location manually or the :func:`post_process <django.contrib.staticfiles.storage.StaticFilesStorage.post_process>` method of the ``Storage`` class might take care of that.
ru: Процесс работы со статикой на боевом сервер очень простой: выполните :djadmin:`collectstatic` при изменении статических файлов, затем организуйте отправку каталога со статикой (:setting:`STATIC_ROOT`) на ваш сервер статических файлов. В зависимости от :setting:`STATICFILES_STORAGE` файлы может быть необходимо перенести в другой каталог самостоятельно, или же метод :func:`post_process <django.contrib.staticfiles.storage.StaticFilesStorage.post_process>` класса ``Storage`` может сделать это самостоятельно.

source: Of course, as with all deployment tasks, the devil's in the details. Every production setup will be a bit different, so you'll need to adapt the basic outline to fit your needs. Below are a few common patterns that might help.
ru: Конечно же, как и в каждой процедуре развертывания, дьявол кроется в мелочах. Настройки сервера могут немного отличаться и вам придется затачивать все это под себя. Ниже мы описали несколько стандартных шаблонов, которые могут помочь вам.

source: Serving the site and your static files from the same server
ru: Один сервер для приложения и для статики

source: If you want to serve your static files from the same server that's already serving your site, the process may look something like:
ru: Если вы используете один сервер для приложения и для статики, тогда процесс обновления следующий:

source: Push your code up to the deployment server.
ru: Обновите код на сервере.

source: On the server, run :djadmin:`collectstatic` to copy all the static files into :setting:`STATIC_ROOT`.
ru: На сервере выполните команду :djadmin:`collectstatic`, чтобы скопировать файлы в :setting:`STATIC_ROOT`.

source: Configure your web server to serve the files in :setting:`STATIC_ROOT` under the URL :setting:`STATIC_URL`. For example, here's :ref:`how to do this with Apache and mod_wsgi <serving-files>`.
ru: Настройте веб-сервер для раздачи файлов из :setting:`STATIC_ROOT` по URL-у из :setting:`STATIC_URL`. Например, :ref:`как это сделать для Apache и mod_wsgi <serving-files>`.

source: Serving static files from a dedicated server
ru: Раздача статических файлов с отдельного сервера

source: Most larger Django sites use a separate Web server -- i.e., one that's not also running Django -- for serving static files. This server often runs a different type of web server -- faster but less full-featured. Some common choices are:
ru: Большие проекты на Django используют отдельный сервер для раздачи статических файлов. Обычно он отличается от сервера для проекта -- более быстрый, но с меньшими возможностями. Вот несколько вариантов:

source: A stripped-down version of Apache_
ru: Урезанная версия Apache_

source: Configuring these servers is out of scope of this document; check each server's respective documentation for instructions.
ru: Настройка этих серверов не является темой этой статьи, читайте соответствующую документацию.

source: Since your static file server won't be running Django, you'll need to modify the deployment strategy to look something like:
ru: Т.к. статический сервер не запускает ваше приложение, необходимо поменять процесс обновления:

source: When your static files change, run :djadmin:`collectstatic` locally.
ru: Когда статические файлы изменяются, выполните локально :djadmin:`collectstatic`.

source: Push your local :setting:`STATIC_ROOT` up to the static file server into the directory that's being served. `rsync <https://rsync.samba.org/>`_ is a common choice for this step since it only needs to transfer the bits of static files that have changed.
ru: Отправьте локальную версию :setting:`STATIC_ROOT` на статический сервер в каталог, который раздается сервером. `rsync <https://rsync.samba.org/>`_ хороший инструмент для этого т.к. отправит на сервер только файлы, которые изменились.

source: Serving static files from a cloud service or CDN
ru: Раздача статических файлов через облачный сервис или CDN

source: Another common tactic is to serve static files from a cloud storage provider like Amazon's S3 and/or a CDN (content delivery network). This lets you ignore the problems of serving static files and can often make for faster-loading Web pages (especially when using a CDN).
ru: Еще один вариант раздачи статических файлов, это через облачные сервисы, такие как Amazon's S3 и/или CDN (content delivery network). Это избавляет вас от проблем с раздачей статических файлов и часто уменьшает время загрузки страниц (особенно при использовании CDN).

source: When using these services, the basic workflow would look a bit like the above, except that instead of using ``rsync`` to transfer your static files to the server you'd need to transfer the static files to the storage provider or CDN.
ru: При использовании сервисов, процесс обновления аналогичен описанному выше, но вместо отправки файлов на сервер статики через ``rsync`` мы отправляем их в хранилище сервиса или CDN.

source: There's any number of ways you might do this, but if the provider has an API a :doc:`custom file storage backend </howto/custom-file-storage>` will make the process incredibly simple. If you've written or are using a 3rd party custom storage backend, you can tell :djadmin:`collectstatic` to use it by setting :setting:`STATICFILES_STORAGE` to the storage engine.
ru: Есть разные способа сделать это, но если сервис предоставляет API, :doc:`собственный беккенд для хранения файлов </howto/custom-file-storage>` может сильно упростить процесс. Если вы используете сторонний бэкенд, можете указать :djadmin:`collectstatic` использовать его, прописав в :setting:`STATICFILES_STORAGE`.

source: For example, if you've written an S3 storage backend in ``myproject.storage.S3Storage`` you could use it with::
ru: Например, вы создали бэкенд для работы с S3 ``myproject.storage.S3Storage``, можете использовать следующий код::

source: Once that's done, all you have to do is run :djadmin:`collectstatic` and your static files would be pushed through your storage package up to S3. If you later needed to switch to a different storage provider, it could be as simple as changing your :setting:`STATICFILES_STORAGE` setting.
ru: Теперь можно просто запустить :djadmin:`collectstatic` и ваши файлы будут отправлены на S3. Если будет необходимо сменить сервис , просто укажите нужный бэкенд в :setting:`STATICFILES_STORAGE`.

source: For details on how you'd write one of these backends, see :doc:`/howto/custom-file-storage`. There are 3rd party apps available that provide storage backends for many common file storage APIs. A good starting point is the `overview at djangopackages.org <https://djangopackages.org/grids/g/storage-backends/>`_.
ru: Как создать свой бэкенд для работы с файлами, смотрите в :doc:`/howto/custom-file-storage`. Есть много сторонних бэкендов для работы с API различных сервисов для хранения файлов. Начать поиск можно с `djangopackages.com <https://djangopackages.org/grids/g/storage-backends/>`_.

source: Learn more
ru: Узнайте больше

source: For complete details on all the settings, commands, template tags, and other pieces included in :mod:`django.contrib.staticfiles`, see :doc:`the staticfiles reference </ref/contrib/staticfiles>`.
ru: Подробности о настройках, командах, шаблонных тегах и других деталях, включая `:mod:`django.contrib.staticfiles`, смотрите :doc:`раздел о статических файлах </ref/contrib/staticfiles>`.
