Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/ref/class-based-views/*.po
Languages: ru

source: Base views
ru: Базовые представления

source: The following three classes provide much of the functionality needed to create Django views. You may think of them as *parent* views, which can be used by themselves or inherited from. They may not provide all the capabilities required for projects, in which case there are Mixins and Generic class-based views.
ru: Следующие три класса реализуют достаточный набор функциональности, чтобы создать представление Django. Вы можете рассматривать их как *родительские* представления, которые можно использовать как непосредственно, так и в наследовании. Конечно, эти классы не всегда могут удовлетворить все требования к представлению в проекте: в таком случае рекомендуется "присмотреться" к примесям(Mixins) и общим представлениям классам(Generic class-based views)

source: Many of Django's built-in class-based views inherit from other class-based views or various mixins. Because this inheritance chain is very important, the ancestor classes are documented under the section title of **Ancestors (MRO)**. MRO is an acronym for Method Resolution Order.
ru: Множество из встроенных CBV в Django наследуют другие представления-классы или классы-примеси. Это цепочка наследований(и порядок классов) очень важна, поэтому информация о классах-предках находится в разделе **Ancestors (MRO)**. MRO - это акроним для Method Resolution Order.

source: The master class-based base view. All other class-based views inherit from this base class. It isn't strictly a generic view and thus can also be imported from ``django.views``.
ru: Самый главный класс в CBV. Все остальные представления-классы наследуются от него. Может быть импортирован из ``django.views``.

source: **Method Flowchart**
ru: **Диаграмма методов**

source: **Example views.py**::
ru: **Пример views.py**::

source: **Example urls.py**::
ru: **Пример urls.py**::

source: **Attributes**
ru: **Атрибуты**

source: The list of HTTP method names that this view will accept.
ru: Список методов HTTP, которые принимает(обрабатывает) данное представление.

source: Default::
ru: Значения по умолчанию::

source: **Methods**
ru: **Методы**

source: Returns a callable view that takes a request and returns a response::
ru: Возвращает выполняемое(callable) представление, которое принимает запрос и возвращает ответ::

source: The returned view has ``view_class`` and ``view_initkwargs`` attributes.
ru: Возвращаемое представление содержит атрибуты ``view_class`` и ``view_initkwargs``.

source: When the view is called during the request/response cycle, the :class:`~django.http.HttpRequest` is assigned to the view's ``request`` attribute. Any positional and/or keyword arguments :ref:`captured from the URL pattern <how-django-processes-a-request>` are assigned to the ``args`` and ``kwargs`` attributes, respectively. Then :meth:`dispatch` is called.
ru: Когда представление вызывается в цикле запрос/ответ, :class:`~django.http.HttpRequest` добавляется в атрибут ``request`` представления. Любые позиционные и/или именованные аргументы, :ref:`полученные из URL <how-django-processes-a-request>`, добавляются в атрибуты ``args`` и ``kwargs``соответственно. Затем вызывается метод :meth:`dispatch`.

source: The ``view`` part of the view -- the method that accepts a ``request`` argument plus arguments, and returns a HTTP response.
ru: ``view`` часть представления -- метод, который принимает аргумент ``request`` плюс дополнительные аргументы, и возвращает HTTP ответ(response).

source: The default implementation will inspect the HTTP method and attempt to delegate to a method that matches the HTTP method; a ``GET`` will be delegated to ``get()``, a ``POST`` to ``post()``, and so on.
ru: Реализация по умолчанию анализирует HTTP метод запроса и делегирует его соответствующему методу класса; ``GET`` будет обработан методом ``get()``, запрос ``POST`` делегируется к ``post()``, и т.д.

source: By default, a ``HEAD`` request will be delegated to ``get()``. If you need to handle ``HEAD`` requests in a different way than ``GET``, you can override the ``head()`` method. See :ref:`supporting-other-http-methods` for an example.
ru: По умолчанию, запрос ``HEAD`` будет делегирован в метод ``get()``. Если вам необходимо обработать ``HEAD`` запрос другим способом, вы можете переопределить метод ``head()``. Смотри :ref:`supporting-other-http-methods` для примера.

source: If the view was called with a HTTP method it doesn't support, this method is called instead.
ru: Если представление было вызвано с неподдерживаемым методом HTTP, будет вызван данный метод.

source: The default implementation returns ``HttpResponseNotAllowed`` with a list of allowed methods in plain text.
ru: Реализация по умолчанию возвращает ``HttpResponseNotAllowed`` со списком разрешенных методов в виде простого текста.

source: Handles responding to requests for the OPTIONS HTTP verb. Returns a response with the ``Allow`` header containing a list of the view's allowed HTTP method names.
ru: Обрабатывает запросы OPTIONS HTTP. Возвращает список всех разрешенных для представления методов HTTP в заголовке ``Allow``.

source: Renders a given template, with the context containing parameters captured in the URL.
ru: Обрабатывает заданный шаблон, используя контекст(context), содержащий параметры из URL.

source: **Ancestors (MRO)**
ru: **Классы-предки, Ancestors (MRO)**

source: This view inherits methods and attributes from the following views:
ru: Представление наследует методы и атрибуты из следующего представления:

source: **Context**
ru: **Контекст(Context)**

source: Populated (through :class:`~django.views.generic.base.ContextMixin`) with the keyword arguments captured from the URL pattern that served the view.
ru: Словарь ключевых аргументов, "отловленных" (через :class:`~django.views.generic.base.ContextMixin`) из шаблона URL, который обрабатывается данным представлением.

source: You can also add context using the :attr:`~django.views.generic.base.ContextMixin.extra_context` keyword argument for :meth:`~django.views.generic.base.View.as_view`.
ru: Вы можете добавить контекст, используя аргумент :attr:`~django.views.generic.base.ContextMixin.extra_context` для метода :meth:`~django.views.generic.base.View.as_view`.

source: Redirects to a given URL.
ru: Редирект на заданный URL.

source: The given URL may contain dictionary-style string formatting, which will be interpolated against the parameters captured in the URL. Because keyword interpolation is *always* done (even if no arguments are passed in), any ``"%"`` characters in the URL must be written as ``"%%"`` so that Python will convert them to a single percent sign on output.
ru: Переданный URL может содержать строку с форматированием (dictionary-style), которая будет обработана в соответствии с параметрами "отловленными" в URL. Поскольку ключевая интерполяция *всегда* выполняется (даже если не было передано никаких аргументов), любые символы ``"%"`` в URL должны быть написаны как ``"%%"``, а затем Python преобразует их в один знак процента на выходе.

source: If the given URL is ``None``, Django will return an ``HttpResponseGone`` (410).
ru: Если переданный URL равен ``None``, Django вернет исключение ``HttpResponseGone`` (410).

source: This view inherits methods and attributes from the following view:
ru: Представление наследует методы и атрибуты из следующего представления:

source: The URL to redirect to, as a string. Or ``None`` to raise a 410 (Gone) HTTP error.
ru: Адрес URL для редиректа, в виде строки. Или ``None`` для генерации 410 (Gone) HTTP ошибки.

source: The name of the URL pattern to redirect to. Reversing will be done using the same args and kwargs as are passed in for this view.
ru: Название URL-шаблона на который перенаправлять. Вычисление URL-а будет выполнено с аргументами, переданными в это представление.

source: Whether the redirect should be permanent. The only difference here is the HTTP status code returned. If ``True``, then the redirect will use status code 301. If ``False``, then the redirect will use status code 302. By default, ``permanent`` is ``False``.
ru: Должно ли перенаправление быть постоянным. Единственная разница состоит в возвращаемом HTTP коде статуса. Если ``True``, то для редиректа используется код статуса 301. Если ``False``, то 302. По умолчанию, ``permanent`` установлен в ``False``.

source: Whether to pass along the GET query string to the new location. If ``True``, then the query string is appended to the URL. If ``False``, then the query string is discarded. By default, ``query_string`` is ``False``.
ru: Передавать ли строку GET запроса в новую локацию. Если ``True``,то строка запроса добавляется к URL. Если ``False``, то строка запроса отбрасывается. По умолчанию, ``query_string`` равно ``False``.

source: Constructs the target URL for redirection.
ru: Создает целевой URL для редиректа

source: The default implementation uses :attr:`url` as a starting string and performs expansion of ``%`` named parameters in that string using the named groups captured in the URL.
ru: Реализация по умолчанию использует :attr:`url` в качестве отправной строки, выполняет подстановку ``%`` параметров в этой строке из именованных параметров, полученных из URL.

source: If :attr:`url` is not set, ``get_redirect_url()`` tries to reverse the :attr:`pattern_name` using what was captured in the URL (both named and unnamed groups are used).
ru: Если :attr:`url` не указан, ``get_redirect_url()`` пытается получить URL по :attr:`pattern_name`, используя "отловленные" параметры из URL (именованные и позиционные).

source: If requested by :attr:`query_string`, it will also append the query string to the generated URL. Subclasses may implement any behavior they wish, as long as the method returns a redirect-ready URL string.
ru: Если указан атрибут :attr:`query_string`, GET параметры будут добавлены к сгенерированному URL. Подклассы могут реализовать любое поведение, важно лишь чтобы метод возвращал корректную строку URL для редиректа.
