Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/ref/class-based-views/index.po
Languages: ru

source: Built-in class-based views API
ru: API встроенных представлений-классов

source: Class-based views API reference. For introductory material, see the :doc:`/topics/class-based-views/index` topic guide.
ru: Описание API представлений-классов. Подробности смотрите в :doc:`/topics/class-based-views/index`.

source: Specification
ru: Спецификация

source: Each request served by a class-based view has an independent state; therefore, it is safe to store state variables on the instance (i.e., ``self.foo = 3`` is a thread-safe operation).
ru: Состояние представления-класса независимо для каждого обрабатываемого запроса. Поэтому можно безопасно сохранять переменные к экземпляре представления (например, ``self.foo = 3`` - потокобезопасная операция).

source: A class-based view is deployed into a URL pattern using the :meth:`~django.views.generic.base.View.as_view()` classmethod::
ru: Представление-класс назначается на URL-шаблон с использованием метода класса :meth:`~django.views.generic.base.View.as_view()`::

source: Thread safety with view arguments
ru: Потокобезопасность аргументов представления

source: Arguments passed to a view are shared between every instance of a view. This means that you shouldn't use a list, dictionary, or any other mutable object as an argument to a view. If you do and the shared object is modified, the actions of one user visiting your view could have an effect on subsequent users visiting the same view.
ru: Аргументы, которые передаются в представление, общие для всех экземпляров представления. Это означает, что вы не должны использовать списки, словари, или любой другой изменяемый объект в качестве аргумента представления. Если вы не будете следовать этому правилу, действия одного пользователя могут повлиять на обработку запроса другого пользователя.

source: Arguments passed into :meth:`~django.views.generic.base.View.as_view()` will be assigned onto the instance that is used to service a request. Using the previous example, this means that every request on ``MyView`` is able to use ``self.size``. Arguments must correspond to attributes that already exist on the class (return ``True`` on a ``hasattr`` check).
ru: Аргументы, переданные в :meth:`~django.views.generic.base.View.as_view()`, будут добавлены в экземпляр представления, которое обрабатывает запрос. В примере выше это означает, что каждый запрос к ``MyView`` может использовать ``self.size``. Аргументы должны соответствовать атрибутам, которые существуют в классе (возвращают ``True`` при проверке через ``hasattr``).

source: Base vs Generic views
ru: Базовые и общие(Generic) представления

source: Base class-based views can be thought of as *parent* views, which can be used by themselves or inherited from. They may not provide all the capabilities required for projects, in which case there are Mixins which extend what base views can do.
ru: Базовые представления классы - это *родительские* представления, которые можно использовать на прямую, или наследоваться от них. Они могут не предоставлять весь необходимый для проекта функционал, в таком случае добавляйте к ним миксины.

source: Django’s generic views are built off of those base views, and were developed as a shortcut for common usage patterns such as displaying the details of an object. They take certain common idioms and patterns found in view development and abstract them so that you can quickly write common views of data without having to repeat yourself.
ru: Общие представления Django построены на основе базовых, и были созданы для стандартных ситуаций, например получить объект и отрендерить его страницу. Они позволяют легко решить стандартные задачи.

source: Most generic views require the ``queryset`` key, which is a ``QuerySet`` instance; see :doc:`/topics/db/queries` for more information about ``QuerySet`` objects.
ru: Большинство общих представлений используют параметр ``queryset``, который является экземпляром ``QuerySet``. Подробности о ``QuerySet`` смотрите в :doc:`/topics/db/queries`.
