Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/ref/class-based-views/mixins-single-object.po
Languages: ru

source: Single object mixins
ru: Примеси для работы с одиночным объектом(Single object mixins)

source: Provides a mechanism for looking up an object associated with the current HTTP request.
ru: Предоставляет механизм для поиска объекта, связанного с текущим запросом HTTP.

source: **Methods and Attributes**
ru: **Методы и Атрибуты**

source: The model that this view will display data for. Specifying ``model = Foo`` is effectively the same as specifying ``queryset = Foo.objects.all()``, where ``objects`` stands for ``Foo``’s :ref:`default manager <default-managers>`.
ru: Модель с которой "работает" данное представление(представление будет отображать данные этой модели). Указать ``model = Foo`` эквивалентно инструкции ``queryset = Foo.objects.all()``, где ``objects`` является :ref:`менеджером по умолчанию <default-managers>` для модели ``Foo``.

source: A ``QuerySet`` that represents the objects. If provided, the value of ``queryset`` supersedes the value provided for :attr:`model`.
ru: Запрос ``QuerySet``, представляющий объекты. Если указан, то значение ``queryset`` замещает значение в :attr:`model`.

source: ``queryset`` is a class attribute with a *mutable* value so care must be taken when using it directly. Before using it, either call its :meth:`~django.db.models.query.QuerySet.all` method or retrieve it with :meth:`get_queryset` which takes care of the cloning behind the scenes.
ru: ``queryset`` -- атрибут класса с *изменяемым* значением, так что будьте осторожны при его использовании. Используя его, лучше вызывать метод :meth:`~django.db.models.query.QuerySet.all`, или получить его значение через метод :meth:`get_queryset`, которые сделает копию атрибута.

source: The name of the field on the model that contains the slug. By default, ``slug_field`` is ``'slug'``.
ru: Имя поля модели, содержащего слаг(slug). По умолчанию, ``slug_field`` это ``'slug'``.

source: The name of the URLConf keyword argument that contains the slug. By default, ``slug_url_kwarg`` is ``'slug'``.
ru: Имя переданного ключевого аргумента(именованной группы) в URLConf, содержащего значение слага(slug). По умолчанию, ``slug_url_kwarg`` это ``'slug'``.

source: The name of the URLConf keyword argument that contains the primary key. By default, ``pk_url_kwarg`` is ``'pk'``.
ru: Имя переданного ключевого аргумента(именованной группы) в URLConf, содержащего значение первичного ключа(primary key). По умолчанию, ``pk_url_kwarg`` равен ``'pk'``.

source: Designates the name of the variable to use in the context.
ru: Задает имя переменной для использования в текущем контексте.

source: If ``True``, causes :meth:`get_object()` to perform its lookup using both the primary key and the slug. Defaults to ``False``.
ru: При ``True`` метод :meth:`get_object()` ищет объект по первичному ключу и "слагу". По умолчанию ``False``.

source: This attribute can help mitigate `insecure direct object reference`_ attacks. When applications allow access to individual objects by a sequential primary key, an attacker could brute-force guess all URLs; thereby obtaining a list of all objects in the application. If users with access to individual objects should be prevented from obtaining this list, setting ``query_pk_and_slug`` to ``True`` will help prevent the guessing of URLs as each URL will require two correct, non-sequential arguments. Simply using a unique slug may serve the same purpose, but this scheme allows you to have non-unique slugs.
ru: Этот атрибут может помочь предотвратить атаку на `незащищенный ресурс и прямой доступ к объектам <https://www.owasp.org/index.php/Top_10_2013-A4-Insecure_Direct_Object_References>`_. Если приложение предоставляет доступ к объектам через последовательный первичный ключ, атакующий может перебрать URL-ы и получить все объекты в приложении. Если пользователи не должны иметь доступ к списку всех объект, опция ``query_pk_and_slug`` позволит предотвратить подбор URL-ов через первичный ключ т.к. каждый URL будет требовать два правильных непоследовательных аргумента. Вы также можете просто использовать уникальный "slug" для этой цели, но эта опция позволит хранить не уникальный "slug".

source: Returns the single object that this view will display. If ``queryset`` is provided, that queryset will be used as the source of objects; otherwise, :meth:`get_queryset` will be used. ``get_object()`` looks for a :attr:`pk_url_kwarg` argument in the arguments to the view; if this argument is found, this method performs a primary-key based lookup using that value. If this argument is not found, it looks for a :attr:`slug_url_kwarg` argument, and performs a slug lookup using the :attr:`slug_field`.
ru: Возвращает объект, который отображается данным представлением. Если предоставлено значение ``queryset``, то этот queryset будет использован для получения объекта; в противном случае будет использован результат вызова метода :meth:`get_queryset`. Метод ``get_object()`` проверяет значение аргумента :attr:`pk_url_kwarg`, из списка переданных представлению; если этот аргумент найден, то метод выполнит поиск по первичному ключу(по переданному значению). Если этот аргумент не найден, то будет проверено наличие аргумента :attr:`slug_url_kwarg`, и выполнен поиск по значению слага(используя :attr:`slug_field`).

source: When :attr:`query_pk_and_slug` is ``True``, ``get_object()`` will perform its lookup using both the primary key and the slug.
ru: Если :attr:`query_pk_and_slug` равен ``True``, ``get_object()`` будет искать объект по первичному ключу и значению "slug".

source: Returns the queryset that will be used to retrieve the object that this view will display. By default, :meth:`get_queryset` returns the value of the :attr:`queryset` attribute if it is set, otherwise it constructs a :class:`~django.db.models.query.QuerySet` by calling the ``all()`` method on the :attr:`model` attribute's default manager.
ru: Возвращает объект queryset, который буден использован для получения объекта для данного представления. По умолчанию, метод :meth:`get_queryset` возвращает значение атрибута :attr:`queryset` (если он установлен), - в противном случае будет создан экземпляр класса :class:`~django.db.models.query.QuerySet` вызовом метода `all()` у атрибута :attr:`model`( с помощью менеджера по умолчанию).

source: Return the context variable name that will be used to contain the data that this view is manipulating. If :attr:`context_object_name` is not set, the context name will be constructed from the ``model_name`` of the model that the queryset is composed from. For example, the model ``Article`` would have context object named ``'article'``.
ru: Возвращает имя переменной контекста(context variable), которая будет доступна в шаблоне и будет содержать данные, с которыми работает представление. Если атрибут :attr:`context_object_name` не установлен, то имя переменной контекста будет составлено из ``model_name`` модели, "породившей" текущий queryset. Например, модель ``Article`` будет иметь переменную контекста с именем ``'article'``.

source: Returns context data for displaying the object.
ru: Возвращает данные контекста для отображения объекта.

source: The base implementation of this method requires that the ``self.object`` attribute be set by the view (even if ``None``). Be sure to do this if you are using this mixin without one of the built-in views that does so.
ru: Встроенная реализация этого метода требует чтобы атрибут ``self.object`` был установлен в представлении (пускай даже в ``None``). Не забудьте об этом, когда будете использовать этот mixin без одного из встроенных представлений, которое уже делает это.

source: It returns a dictionary with these contents:
ru: Возвращает словарь со следующим содержимым:

source: ``object``: The object that this view is displaying (``self.object``).
ru: ``object``: Объект, который отображается представлением (``self.object``).

source: ``context_object_name``: ``self.object`` will also be stored under the name returned by :meth:`get_context_object_name`, which defaults to the lowercased version of the model name.
ru: ``context_object_name``: ``self.object`` будет сохранен в контексте под именем, которое вернул метод :meth:`get_context_object_name`. По умолчанию это название модели в нижнем регистре.

source: Context variables override values from template context processors
ru: Переменные контекста переопределяют значения из контекстных процессоров

source: Any variables from :meth:`get_context_data` take precedence over context variables from :ref:`context processors <subclassing-context-requestcontext>`. For example, if your view sets the :attr:`model` attribute to :class:`~django.contrib.auth.models.User`, the default context object name of ``user`` would override the ``user`` variable from the :func:`django.contrib.auth.context_processors.auth` context processor. Use :meth:`get_context_object_name` to avoid a clash.
ru: Переменные из :meth:`get_context_data` перезаписывают переменные контекста из :ref:`процессоров контекста <subclassing-context-requestcontext>`. Например, если ваше представление записывает :class:`~django.contrib.auth.models.User` в атрибут :attr:`model`, название переменной контекста по умолчанию ``user`` перезапишет переменную ``user`` и процессора контекста :func:`django.contrib.auth.context_processors.auth`. Используйте :meth:`get_context_object_name`, чтобы избежать конфликтов.

source: Returns the name of a slug field to be used to look up by slug. By default this simply returns the value of :attr:`slug_field`.
ru: Возвращает имя поля, хранящего слаг(slug), которое будет использоваться при выборке данных по слагу. По умолчанию просто возвращает значение атрибута :attr:`slug_field`.

source: A mixin class that performs template-based response rendering for views that operate upon a single object instance. Requires that the view it is mixed with provides ``self.object``, the object instance that the view is operating on. ``self.object`` will usually be, but is not required to be, an instance of a Django model. It may be ``None`` if the view is in the process of constructing a new instance.
ru: Класс-примесь, дающий возможность работы с шаблонами для представлений, отображающих одиночный объект. Требует, чтобы представление, в которое будет добавляться эта примесь, предоставляло значение ``self.object``, - экземпляр объекта с которым "работает" представление. Обычно, хотя это и не требуется, ``self.object``это экземпляр модели Django. Это значение может быть ``None``, если представление "в середине" процесса по созданию нового экземпляра объекта.

source: **Extends**
ru: **Наследуется от**

source: The field on the current object instance that can be used to determine the name of a candidate template. If either ``template_name_field`` itself or the value of the ``template_name_field`` on the current object instance is ``None``, the object will not be used for a candidate template name.
ru: Поле на текущий экземпляр объекта, который может быть использован для определения имени шаблона кандидата(шаблона, который будет использован для отображения данных). Если либо само значение ``template_name_field`` или значение ``template_name_field`` в текущем экземпляре объекта равно ``None``, то объект не будет использоваться для определения имени шаблона кандидата.

source: The suffix to append to the auto-generated candidate template name. Default suffix is ``_detail``.
ru: Суффикс, который добавляется к автоматически сгенерированным именам шаблонов кандидатов. Значение суффикса по умолчанию: ``_detail``.

source: Returns a list of candidate template names. Returns the following list:
ru: Возвращает список имен шаблонов кандидатов. Возвращает следующий список:

source: the value of ``template_name`` on the view (if provided)
ru: значение атрибута ``template_name`` в представлении(если указано)

source: the contents of the ``template_name_field`` field on the object instance that the view is operating upon (if available)
ru: содержимое поля ``template_name_field`` в экземпляре объекта, с которым работает представление(если доступно)
