Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/topics/forms/formsets.po
Languages: ru

source: Formsets
ru: Наборы форм

source: A formset is a layer of abstraction to work with multiple forms on the same page. It can be best compared to a data grid. Let's say you have the following form::
ru: Набор форм — это абстрактный слой для работы с множеством форм на одной странице. Его можно сравнить с таблицей данных. Скажем у вас есть следующая форма::

source: You might want to allow the user to create several articles at once. To create a formset out of an ``ArticleForm`` you would do::
ru: Вы можете позволить пользователю создавать несколько статей за один раз. Для того, чтобы создать набор форм из ``ArticleForm`` вам потребуется::

source: Formsets can also be indexed into, which returns the corresponding form. If you override ``__iter__``, you will need to also override ``__getitem__`` to have matching behavior.
ru: К формами внутри набора можно обращаться по индексу. При определении собственного ``__iter__``, вами потребуется также реализовать ``__getitem__`` для сохранения этой возможности.

source: Using initial data with a formset
ru: Использование начальных данных с наборами форм

source: Initial data is what drives the main usability of a formset. As shown above you can define the number of extra forms. What this means is that you are telling the formset how many additional forms to show in addition to the number of forms it generates from the initial data. Let's take a look at an example::
ru: Возможность назначения начальных данных является одним из ключевых аспектов удобства использования наборов форм. Как было показано выше, вы можете управлять количеством пустых форм, отображаемых набором. Это означает, что вы указываете набору сколько дополнительных пустых форм следует отобразить вместе с формами, которые заполнены начальными данными. Давайте обратимся к следующему примеру::

source: There are now a total of three forms showing above. One for the initial data that was passed in and two extra forms. Also note that we are passing in a list of dictionaries as the initial data.
ru: Выше показаны три формы. Одна с начальными данными и две пустые. Следует отметить, что в качестве начальных данных мы передали список словарей.

source: If you use an ``initial`` for displaying a formset, you should pass the same ``initial`` when processing that formset's submission so that the formset can detect which forms were changed by the user. For example, you might have something like: ``ArticleFormSet(request.POST, initial=[...])``.
ru: Если вы используете ``initial`` при отображении набора форм, вам необходимо передать такой же ``initial`` при обработке набора форм, чтобы он мог определить какие формы изменил пользователь. Например, у вас может быть: ``ArticleFormSet(request.POST, initial=[...])``.

source: :ref:`Creating formsets from models with model formsets <model-formsets>`.
ru: :ref:`Создание наборов модельных форм <model-formsets>`.

source: Limiting the maximum number of forms
ru: Ограничение максимального количества форм

source: The ``max_num`` parameter to :func:`~django.forms.formsets.formset_factory` gives you the ability to limit the number of forms the formset will display::
ru: Параметр ``max_num`` фабрики :func:`~django.forms.formsets.formset_factory` предоставляет вам возможность ограничить максимальное количество пустых форм, отображаемых набором::

source: If the value of ``max_num`` is greater than the number of existing items in the initial data, up to ``extra`` additional blank forms will be added to the formset, so long as the total number of forms does not exceed ``max_num``. For example, if ``extra=2`` and ``max_num=2`` and the formset is initialized with one ``initial`` item, a form for the initial item and one blank form will be displayed.
ru: Если значение параметра ``max_num`` больше количества существующих объектов, то к набору будет добавлено до ``extra`` пустых форм. Так будет происходить пока не будет достигнуто значение ``max_num``. Например, если ``extra=2`` и ``max_num=2``, а набор форм был создан с одним ``initial`` элементом, то в данном наборе форм будет отображена одна переданная форма и одна пустая.

source: If the number of items in the initial data exceeds ``max_num``, all initial data forms will be displayed regardless of the value of ``max_num`` and no extra forms will be displayed. For example, if ``extra=3`` and ``max_num=1`` and the formset is initialized with two initial items, two forms with the initial data will be displayed.
ru: Если количество инициализированных форм превышает ``max_num``, все они будут показаны, не взирая на значение ``max_num`` и никаких дополнительных форм показано не будет. Например, при``extra=3`` и ``max_num=1`` и набором форм, проинициализированным двумя формами, именно эти две формы и будут отображены.

source: A ``max_num`` value of ``None`` (the default) puts a high limit on the number of forms displayed (1000). In practice this is equivalent to no limit.
ru: Присвоение свойству ``max_num`` значения ``None`` (по умолчанию) устанавливает достаточное ограничение на количество отображаемых форм (1000). На практике это эквивалентно отсутствию ограничения.

source: By default, ``max_num`` only affects how many forms are displayed and does not affect validation. If ``validate_max=True`` is passed to the :func:`~django.forms.formsets.formset_factory`, then ``max_num`` will affect validation. See :ref:`validate_max`.
ru: По умолчанию, ``max_num`` просто определяет количество форм без валидации. Если передать ``validate_max=True`` в :func:`~django.forms.formsets.formset_factory`, ``max_num`` будет учитываться при валидации. Смотрите :ref:`validate_max`.

source: Formset validation
ru: Проверка набора форм

source: Validation with a formset is almost identical to a regular ``Form``. There is an ``is_valid`` method on the formset to provide a convenient way to validate all forms in the formset::
ru: Проверка набора форм практически совпадает с аналогичной задачей для обычных форм. Набор форм обладает методом :meth:`is_valid`, который предоставляет удобный способ выполнить проверку всех форм набора::

source: We passed in no data to the formset which is resulting in a valid form. The formset is smart enough to ignore extra forms that were not changed. If we provide an invalid article::
ru: Мы не передали в набор форм никаких данных, но он успешно прошёл проверку. Набор обладает достаточной логикой, чтобы игнорировать дополнительные незаполненные формы. Но если мы предоставим неправильную статью::

source: As we can see, ``formset.errors`` is a list whose entries correspond to the forms in the formset. Validation was performed for each of the two forms, and the expected error message appears for the second item.
ru: Как можно увидеть, ``formset.errors`` является списком значений, которые связаны с формами набора. Проверка была выполнена для обеих форм и в результате было отображено сообщение об ошибке во второй форме.

source: Just like when using a normal ``Form``, each field in a formset's forms may include HTML attributes such as ``maxlength`` for browser validation. However, form fields of formsets won't include the ``required`` attribute as that validation may be incorrect when adding and deleting forms.
ru: Как и при использовании обычной ``Form``, каждое поле формы из набора форм может содержать HTML атрибут, такой как ``maxlength``, для валидации в браузере. Однако, поля форм из набора форм не будут содержать атрибут ``required`` т.к. валидации может работать неверно при добавлении или удалении форм.

source: To check how many errors there are in the formset, we can use the ``total_error_count`` method::
ru: Чтобы определить общее количество ошибок, используйте метод ``total_error_count``::

source: We can also check if form data differs from the initial data (i.e. the form was sent without any data)::
ru: У нас есть возможность проверить изменились ли данные относительно начальных значений (т.е форма была отправлена пустой)::

source: Understanding the ``ManagementForm``
ru: Понимание ``ManagementForm``

source: You may have noticed the additional data (``form-TOTAL_FORMS``, ``form-INITIAL_FORMS`` and ``form-MAX_NUM_FORMS``) that was required in the formset's data above. This data is required for the ``ManagementForm``. This form is used by the formset to manage the collection of forms contained in the formset. If you don't provide this management data, an exception will be raised::
ru: Вы могли обратить внимание на дополнительные поля (``form-TOTAL_FORMS``, ``form-INITIAL_FORMS`` и ``form-MAX_NUM_FORMS``), которые появлялись при выводе набора форм. Эти данные необходимы для работы формы ``ManagementForm``. Эта форма используется набором для управления своей коллекцией форм. Если эти данные не будут предоставлены набору, то будет вызвано исключение::

source: It is used to keep track of how many form instances are being displayed. If you are adding new forms via JavaScript, you should increment the count fields in this form as well. On the other hand, if you are using JavaScript to allow deletion of existing objects, then you need to ensure the ones being removed are properly marked for deletion by including ``form-#-DELETE`` in the ``POST`` data. It is expected that all forms are present in the ``POST`` data regardless.
ru: Она используется для отслеживания количества экземпляров отображаемых форм. Если вы добавляете новую форму с помощью JavaScript, вам следует увеличить счётчики в соответствующих полях этой формы. С другой стороны, если вы позволяете удалять существующие объекты через JavaScript, то вы должны обеспечить правильную маркировку этих объектов с помощью ``form-#-DELETE`` в данных ``POST``. Ожидается, что все формы присутствуют в данных ``POST``, даже если они "удалены".

source: The management form is available as an attribute of the formset itself. When rendering a formset in a template, you can include all the management data by rendering ``{{ my_formset.management_form }}`` (substituting the name of your formset as appropriate).
ru: Доступ к форме управления возможен через атрибут набора форм. При отображении формы в шаблоне, вы можете включать в страницу все управляющие данные с помощью ``{{ my_formset.management_form }}`` (подставьте имя своего набора).

source: ``total_form_count`` and ``initial_form_count``
ru: Методы ``total_form_count`` и ``initial_form_count``

source: ``BaseFormSet`` has a couple of methods that are closely related to the ``ManagementForm``, ``total_form_count`` and ``initial_form_count``.
ru: Класс ``BaseFormSet`` имеет ряд методов, которые предназначены для работы с ``ManagementForm``: ``total_form_count`` и ``initial_form_count``.

source: ``total_form_count`` returns the total number of forms in this formset. ``initial_form_count`` returns the number of forms in the formset that were pre-filled, and is also used to determine how many forms are required. You will probably never need to override either of these methods, so please be sure you understand what they do before doing so.
ru: Метод ``total_form_count`` возвращает количество форм в наборе. Метод ``initial_form_count`` возвращает количество предварительно заполненных форм в наборе, а также используется для определения количества форм, обязательных для заполнения. Скорее всего у вас никогда не возникнет необходимости переопределения этих методов, просто запомните их назначение.

source: ``BaseFormSet`` provides an additional attribute ``empty_form`` which returns a form instance with a prefix of ``__prefix__`` for easier use in dynamic forms with JavaScript.
ru: Класс ``BaseFormSet`` имеет атрибут ``empty_form``, который возвращает экземпляр формы с префиксом ``__prefix__``, что может упростить динамическое создание форм с помощью JavaScript.

source: Custom formset validation
ru: Собственная проверка набора форм

source: A formset has a ``clean`` method similar to the one on a ``Form`` class. This is where you define your own validation that works at the formset level::
ru: Набор форм имеет метод ``clean``, аналогичный методу класса ``Form``. Переопределите этот метод для реализации собственных проверок данных на уровне набора форм::

source: The formset ``clean`` method is called after all the ``Form.clean`` methods have been called. The errors will be found using the ``non_form_errors()`` method on the formset.
ru: Метод ``clean`` набора форм вызывается после вызова аналогичного метода всех форм. Ошибки будут найдены с помощью метода ``non_form_errors()`` набора форм.

source: Validating the number of forms in a formset
ru: Проверка количества форм

source: Django provides a couple ways to validate the minimum or maximum number of submitted forms. Applications which need more customizable validation of the number of forms should use custom formset validation.
ru: Django предоставляет несколько способов валидации минимального и максимально количества отправленных форм. Если вам нужна более сложная валидация, используйте собственную валидацию для набора форм.

source: If ``validate_max=True`` is passed to :func:`~django.forms.formsets.formset_factory`, validation will also check that the number of forms in the data set, minus those marked for deletion, is less than or equal to ``max_num``.
ru: Если передать ``validate_max=True`` в :func:`~django.forms.formsets.formset_factory`, при валидации будет проверенно, что общее количество форм, без учета помеченных для удаления, не больше чем ``max_num``.

source: ``validate_max=True`` validates against ``max_num`` strictly even if ``max_num`` was exceeded because the amount of initial data supplied was excessive.
ru: При ``validate_max=True`` будет ошибка даже если количество инициализированных форм превышает ``max_num``

source: Regardless of ``validate_max``, if the number of forms in a data set exceeds ``max_num`` by more than 1000, then the form will fail to validate as if ``validate_max`` were set, and additionally only the first 1000 forms above ``max_num`` will be validated. The remainder will be truncated entirely. This is to protect against memory exhaustion attacks using forged POST requests.
ru: Независимо от ``validate_max``, если количество форм превышает ``max_num`` на более чем 1000, будет ошибка валидация как при включенном ``validate_max``, и только первые 1000 форм после ``max_num`` буду провалидированы. Остальные будут проигнорированы. Это сделано для защит от атаки на память(memory exhaustion attack) через модифицированный POST запрос.

source: If ``validate_min=True`` is passed to :func:`~django.forms.formsets.formset_factory`, validation will also check that the number of forms in the data set, minus those marked for deletion, is greater than or equal to ``min_num``.
ru: Если передать ``validate_min=True`` в :func:`~django.forms.formsets.formset_factory`, при валидации будет проверенно, что общее количество форм, без учета помеченных для удаления, больше или равно ``min_num``.

source: Dealing with ordering and deletion of forms
ru: Сортировка и удаление форм

source: The :func:`~django.forms.formsets.formset_factory` provides two optional parameters ``can_order`` and ``can_delete`` to help with ordering of forms in formsets and deletion of forms from a formset.
ru: :func:`~django.forms.formsets.formset_factory` принимает два необязательных аргумента: ``can_order`` и ``can_delete``, которые добавляют возможность сортировки и удаления форм.

source: Default: ``False``
ru: Значение по умолчанию: ``False``

source: Lets you create a formset with the ability to order::
ru: Позволяет создавать наборы форм с возможностью сортировки::

source: This adds an additional field to each form. This new field is named ``ORDER`` and is an ``forms.IntegerField``. For the forms that came from the initial data it automatically assigned them a numeric value. Let's look at what will happen when the user changes these values::
ru: Здесь добавляется дополнительное поле к каждой форме. Поле называется ``ORDER`` и представлено в виде ``forms.IntegerField``. Для форм, которые были созданы с помощью начальных данных, это поле будет автоматически заполнено их порядковым номером. Давайте рассмотрим, что произойдёт, если пользователь изменит эти значения::

source: Lets you create a formset with the ability to select forms for deletion::
ru: Позволяет создавать наборы форм с возможностью удаления их элементов::

source: Similar to ``can_order`` this adds a new field to each form named ``DELETE`` and is a ``forms.BooleanField``. When data comes through marking any of the delete fields you can access them with ``deleted_forms``::
ru: Подобно ``can_order``, использование этого аргумента добавляет новое поле ``DELETE`` в виде ``forms.BooleanField``. При обработке данных набора форм, вы можете получить доступ ко всем помеченным полям через свойство ``deleted_forms``::

source: If you are using a :class:`ModelFormSet<django.forms.models.BaseModelFormSet>`, model instances for deleted forms will be deleted when you call ``formset.save()``.
ru: Если вы используете :class:`ModelFormSet<django.forms.models.BaseModelFormSet>`, объекты удаленных форм будут удалены при выполнении ``formset.save()``.

source: If you call ``formset.save(commit=False)``, objects will not be deleted automatically. You'll need to call ``delete()`` on each of the :attr:`formset.deleted_objects <django.forms.models.BaseModelFormSet.deleted_objects>` to actually delete them::
ru: Если выполнить ``formset.save(commit=False)``, объекты не будут удалены автоматически. Вам необходимо вызвать ``delete()`` для каждого объекта из :attr:`formset.deleted_objects <django.forms.models.BaseModelFormSet.deleted_objects>`::

source: On the other hand, if you are using a plain ``FormSet``, it's up to you to handle ``formset.deleted_forms``, perhaps in your formset's ``save()`` method, as there's no general notion of what it means to delete a form.
ru: Если же вы используете просто ``FormSet``, можете делать что хотите с ``formset.deleted_forms``, возможно в переопределенном методе ``save()``. Django просто не знает что должно произойти при удалении таких форм.

source: Adding additional fields to a formset
ru: Добавление дополнительных полей к набору форм

source: Passing custom parameters to formset forms
ru: Как передать свои параметры в формы набора форм

source: Sometimes your form class takes custom parameters, like ``MyArticleForm``. You can pass this parameter when instantiating the formset::
ru: Ваша форма может принимать дополнительные параметры, например ``MyArticleForm``. Вы можете передать из при создании набора форм::

source: The ``form_kwargs`` may also depend on the specific form instance. The formset base class provides a ``get_form_kwargs`` method. The method takes a single argument - the index of the form in the formset. The index is ``None`` for the :ref:`empty_form`::
ru: ``form_kwargs`` может зависеть от конкретного экземпляра формы. Набор форм предоставляет метод ``get_form_kwargs``. Этот метод принимает единственный аргумент - норме формы в наборе форм. Номер равен ``None`` для :ref:`empty_form`::

source: Using a formset in views and templates
ru: Использование наборов форм в представлениях и шаблонах

source: The ``manage_articles.html`` template might look like this:
ru: Шаблон ``manage_articles.html`` может выглядеть так:

source: However there's a slight shortcut for the above by letting the formset itself deal with the management form:
ru: Тем не менее, вышеприведённый код можно сократить и позволить набору самостоятельно обеспечивать вывод управляющей формы:

source: The above ends up calling the ``as_table`` method on the formset class.
ru: Пример завершается вызовом метода ``as_table`` набора форм.

source: Manually rendered ``can_delete`` and ``can_order``
ru: Вручную созданные поля ``can_delete`` и ``can_order``

source: If you manually render fields in the template, you can render ``can_delete`` parameter with ``{{ form.DELETE }}``:
ru: Если вы вручную создаёте эти поля в шаблоне, то вы можете отобразить параметр ``can_delete`` с помощью ``{{ form.DELETE }}``:

source: Similarly, if the formset has the ability to order (``can_order=True``), it is possible to render it with ``{{ form.ORDER }}``.
ru: Аналогично, если набор форм может выполнять сортировку (``can_order=True``), то соответствующее поле можно вывести с помощью ``{{ form.ORDER }}``.

source: Using more than one formset in a view
ru: Использование нескольких наборов форм в представлении

source: You would then render the formsets as normal. It is important to point out that you need to pass ``prefix`` on both the POST and non-POST cases so that it is rendered and processed correctly.
ru: После этого вы можете отображать наборы форм как обычно. Важно помнить, что надо передать префикс набора форм в каждый экземпляр набора, это гарантирует их правильную работу.
