Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/topics/forms/index.po
Languages: ru

source: Working with forms
ru: Работа с формами

source: About this document
ru: О разделе

source: This document provides an introduction to the basics of web forms and how they are handled in Django. For a more detailed look at specific areas of the forms API, see :doc:`/ref/forms/api`, :doc:`/ref/forms/fields`, and :doc:`/ref/forms/validation`.
ru: Этот документ знакомит со способами работы с формами. Для более детальной информации по API форм обращайтесь к :doc:`/ref/forms/api`, :doc:`/ref/forms/fields` и :doc:`/ref/forms/validation`.

source: Unless you're planning to build websites and applications that do nothing but publish content, and don't accept input from your visitors, you're going to need to understand and use forms.
ru: Если вы планируете создавать сайты и приложения, который принимают и сохраняют данные от пользователей, вам необходимо использовать формы.

source: Django provides a range of tools and libraries to help you build forms to accept input from site visitors, and then process and respond to the input.
ru: Django предоставляет широкий набор инструментов для этого.

source: HTML forms
ru: HTML формы

source: In HTML, a form is a collection of elements inside ``<form>...</form>`` that allow a visitor to do things like enter text, select options, manipulate objects or controls, and so on, and then send that information back to the server.
ru: Форма в HTML -- это набор элементов в ``<form>...</form>``, которые позволяют пользователю вводить текст, выбирать опции, изменять объекты и конторолы страницы, и так далее, а потом отправлять эту информацию на сервер.

source: Some of these form interface elements - text input or checkboxes - are fairly simple and are built into HTML itself. Others are much more complex; an interface that pops up a date picker or allows you to move a slider or manipulate controls will typically use JavaScript and CSS as well as HTML form ``<input>`` elements to achieve these effects.
ru: Некоторые элементы формы - текстовые поля ввода и чекбоксы - достаточно простые и встроены в HTML. Некоторые -- довольно сложные, состоят из диалогов выбора даты, слайдеров и других контролов, который обычно используют JavaScript и CSS.

source: As well as its ``<input>`` elements, a form must specify two things:
ru: Кроме ``<input>`` элементов форма должна содержать еще две вещи:

source: *where*: the URL to which the data corresponding to the user's input should be returned
ru: *куда*: URL, на который будут отправлены данные

source: *how*: the HTTP method the data should be returned by
ru: *как*: HTTP метод, который должна использовать форма для отправки данных

source: As an example, the login form for the Django admin contains several ``<input>`` elements: one of ``type="text"`` for the username, one of ``type="password"`` for the password, and one of ``type="submit"`` for the "Log in" button. It also contains some hidden text fields that the user doesn't see, which Django uses to determine what to do next.
ru: Например, форма авторизации Django содержит несколько ``<input>`` элементов: один с ``type="text"`` для логина пользователя, один с ``type="password"`` для пароля, и один с ``type="submit"`` для кнопки "Log in". Она также содержит несколько скрытых текстовых полей, которые Django использует для определения что делать после авторизации.

source: It also tells the browser that the form data should be sent to the URL specified in the ``<form>``’s ``action`` attribute - ``/admin/`` - and that it should be sent using the HTTP mechanism specified by the ``method`` attribute - ``post``.
ru: Форма также говорит браузеру, что данные должны оправляться на URL, указанный в атрибуте ``action`` тега ``<form>`` - ``/admin/`` - и для отправки необходимо использовать HTTP метод, указанный атрибуте ``method`` - ``post``.

source: When the ``<input type="submit" value="Log in">`` element is triggered, the data is returned to ``/admin/``.
ru: При нажатии на элемент ``<input type="submit" value="Log in">`` данные будут отправлены на ``/admin/``.

source: ``GET`` and ``POST``
ru: ``GET`` или ``POST``

source: ``GET`` and ``POST`` are the only HTTP methods to use when dealing with forms.
ru: ``GET`` и ``POST`` -- единственные HTTP методы, которые используются для форм.

source: Django's login form is returned using the ``POST`` method, in which the browser bundles up the form data, encodes it for transmission, sends it to the server, and then receives back its response.
ru: Форма авторизации в Django использует ``POST`` метод. При отправке формы браузер собирает все данные формы, кодирует для отправки, отправляет на сервер и получает ответ.

source: ``GET``, by contrast, bundles the submitted data into a string, and uses this to compose a URL. The URL contains the address where the data must be sent, as well as the data keys and values. You can see this in action if you do a search in the Django documentation, which will produce a URL of the form ``https://docs.djangoproject.com/search/?q=forms&release=1``.
ru: При ``GET``, в отличии от ``POST``, данные собираются в строку и передаются в URL. URL содержит адрес, куда отправлять данные, и данные для отправки. Пример работы можно посмотреть на странице поиска по документации Django. При оправке формы поиска, вы будете перенаправлены на URL ``https://docs.djangoproject.com/search/?q=forms&release=1``.

source: ``GET`` and ``POST`` are typically used for different purposes.
ru: ``GET`` и ``POST`` обычно используются для разных действий.

source: Any request that could be used to change the state of the system - for example, a request that makes changes in the database - should use ``POST``. ``GET`` should be used only for requests that do not affect the state of the system.
ru: Любой запрос, который может изменить состояние системы - например, который изменяет данные в базе данных - должен использовать ``POST``. ``GET`` должен использоваться для запросов, которые не влияют на состояние системы.

source: ``GET`` would also be unsuitable for a password form, because the password would appear in the URL, and thus, also in browser history and server logs, all in plain text. Neither would it be suitable for large quantities of data, or for binary data, such as an image. A Web application that uses ``GET`` requests for admin forms is a security risk: it can be easy for an attacker to mimic a form's request to gain access to sensitive parts of the system. ``POST``, coupled with other protections like Django's :doc:`CSRF protection </ref/csrf/>` offers more control over access.
ru: Не следует использовать ``GET`` запросы для формы с паролем, т.к. пароль появится в URL, а следовательно в истории браузера и журналах сервера. Также он не подходит для отправки большого количества данных или бинарных данных, например, изображения. Web-приложение, которое использует ``GET`` запросы в админке, подвержено атакам: не сложно подделать форму для запроса на сервер и получить важные данные о системе. Применение ``POST`` запросов, объединённых с другими видами защиты подобных :doc:`CSRF </ref/csrf/>`, предоставляет больше контроля за доступом к данным.

source: On the other hand, ``GET`` is suitable for things like a web search form, because the URLs that represent a ``GET`` request can easily be bookmarked, shared, or resubmitted.
ru: ``GET`` удобен для таких вещей, как форма поиска, т.к. URL, который представляет ``GET`` запрос, можно легко сохранить в избранное или отправить по почте.

source: Django's role in forms
ru: Роль Django в формах

source: Handling forms is a complex business. Consider Django's admin, where numerous items of data of several different types may need to be prepared for display in a form, rendered as HTML, edited using a convenient interface, returned to the server, validated and cleaned up, and then saved or passed on for further processing.
ru: Работа с формами -- довольно непростая задача. Возьмем админку Django. Необходимо подготовить для отображения в форме большое количество данных разного типа, отобразить форму в HTML, создать удобный интерфейс для редактирования, получить данные на сервере, проверить и преобразовать в нужный формат, и в конце сохранить или передать для дальнейшей обработки.

source: Django's form functionality can simplify and automate vast portions of this work, and can also do it more securely than most programmers would be able to do in code they wrote themselves.
ru: Формы Django могут упростить и автоматизировать большую часть этого процесса, и могут сделать это проще и надежнее, чем код, написанный большинством программистов.

source: Django handles three distinct parts of the work involved in forms:
ru: Django позволяет:

source: preparing and restructuring data to make it ready for rendering
ru: подготовить данные для отображения в форме

source: creating HTML forms for the data
ru: создать HTML формы для данных

source: receiving and processing submitted forms and data from the client
ru: получить и обработать отправленные формой данные

source: It is *possible* to write code that does all of this manually, but Django can take care of it all for you.
ru: Вы *можете* написать код, который все это будет делать, но Django может выполнить большую часть самостоятельно.

source: Forms in Django
ru: Формы в Django

source: We've described HTML forms briefly, but an HTML ``<form>`` is just one part of the machinery required.
ru: Мы уже описали HTML формы, но HTML ``<form>`` только часть необходимого механизма.

source: In the context of a Web application, 'form' might refer to that HTML ``<form>``, or to the Django :class:`Form` that produces it, or to the structured data returned when it is submitted, or to the end-to-end working collection of these parts.
ru: В контексте Web приложения 'form' может означать HTML ``<form>``, или класс Django :class:`Form`, который создает HTML формы, или данне, которые передаются при отправке формы, или ко всему механизму вместе.

source: The Django :class:`Form` class
ru: Класс Django :class:`Form`

source: At the heart of this system of components is Django's :class:`Form` class. In much the same way that a Django model describes the logical structure of an object, its behavior, and the way its parts are represented to us, a :class:`Form` class describes a form and determines how it works and appears.
ru: Сердце всего механизма -- класс :class:`Form`. Как и модель в Django, которая описывает структуру объекта, его поведение и представление, :class:`Form` описывает форму, как она работает и показывается пользователю.

source: In a similar way that a model class's fields map to database fields, a form class's fields map to HTML form ``<input>`` elements. (A :class:`ModelForm` maps a model class's fields to HTML form ``<input>`` elements via a :class:`Form`; this is what the Django admin is based upon.)
ru: Как поля модели представляют поля в базе данных, поля формы представляют HTML ``<input>`` элементы. (:class:`ModelForm` отображает поля модели в виде HTML ``<input>`` элементов, используя :class:`Form`. Используется в админке Django.)

source: A form's fields are themselves classes; they manage form data and perform validation when a form is submitted. A :class:`DateField` and a :class:`FileField` handle very different kinds of data and have to do different things with it.
ru: Поля формы сами являются классами. Они управляют данными формы и выполняют их проверку при отправке формы. Например, :class:`DateField` и :class:`FileField` работают с разными данными и выполняют разные действия с ними.

source: A form field is represented to a user in the browser as an HTML "widget" - a piece of user interface machinery. Each field type has an appropriate default :doc:`Widget class </ref/forms/widgets/>`, but these can be overridden as required.
ru: Поле формы представлено в браузере HTML "виджетом" - компонент интерфейса. Каждый тип поля представлен по умолчанию определенным :doc:`классом Widget </ref/forms/widgets/>`, который можно переопределить при необходимости.

source: Instantiating, processing, and rendering forms
ru: Создание, обработка и рендеринг форм

source: When rendering an object in Django, we generally:
ru: При рендеринге объекта в Django мы обычно:

source: get hold of it in the view (fetch it from the database, for example)
ru: получаем его в представлении (например, загружаем из базы данных)

source: pass it to the template context
ru: передаем в контекст шаблона

source: expand it to HTML markup using template variables
ru: представляем в виде HTML в шаблоне, используя переменные контекста

source: Rendering a form in a template involves nearly the same work as rendering any other kind of object, but there are some key differences.
ru: Рендеринг форм происходит аналогичным образом с некоторыми отличиями.

source: In the case of a model instance that contained no data, it would rarely if ever be useful to do anything with it in a template. On the other hand, it makes perfect sense to render an unpopulated form - that's what we do when we want the user to populate it.
ru: В случае с моделями, вряд ли нам может понадобится пустая модель в шаблоне. Для форм же нормально показывать пустую форму для пользователя.

source: So when we handle a model instance in a view, we typically retrieve it from the database. When we're dealing with a form we typically instantiate it in the view.
ru: Экземпляр модели, который используется в представлении, обычно загружается из базы данных. При работе с формой мы обычно создаем экземпляр формы в представлении.

source: When we instantiate a form, we can opt to leave it empty or pre-populate it, for example with:
ru: При создании формы мы может оставить её пустой, или добавить начальные данные, например:

source: data from a saved model instance (as in the case of admin forms for editing)
ru: сохраненного ранее объекта модели (для редактирования их в админке)

source: data that we have collated from other sources
ru: полученные из других источников

source: data received from a previous HTML form submission
ru: получение из предыдущей отправки формы

source: The last of these cases is the most interesting, because it's what makes it possible for users not just to read a website, but to send information back to it too.
ru: Последний случай самый интересный, т.к. позволяет пользователям не только читать сайт, но и отправлять ему информацию.

source: Building a form
ru: Создание формы

source: The work that needs to be done
ru: Что необходимо сделать

source: Suppose you want to create a simple form on your website, in order to obtain the user's name. You'd need something like this in your template:
ru: Предположим вам необходимо создать простую форму на сайте, которая позволяет пользователю указать имя. Вам необходимо добавить в шаблон следующий код:

source: This tells the browser to return the form data to the URL ``/your-name/``, using the ``POST`` method. It will display a text field, labeled "Your name:", and a button marked "OK". If the template context contains a ``current_name`` variable, that will be used to pre-fill the ``your_name`` field.
ru: Этот код указывает браузеру отправить данные на URL ``/your-name/``, используя метод ``POST``. Браузер покажет на странице текстовое поле ввода с меткой "Your name:", и кнопку "OK". Если в контексте шаблона указать переменную ``current_name``, её значение будет добавлено в текстовое поле ``your_name``.

source: You'll need a view that renders the template containing the HTML form, and that can supply the ``current_name`` field as appropriate.
ru: Вам необходимо создать представление, которое рендерит шаблон с HTML формой и передает в контекст шаблона ``current_name``.

source: When the form is submitted, the ``POST`` request which is sent to the server will contain the form data.
ru: При отправке формы будет отправлен ``POST`` запрос с данными из формы.

source: Now you'll also need a view corresponding to that ``/your-name/`` URL which will find the appropriate key/value pairs in the request, and then process them.
ru: Также необходимо добавить представление, которое обрабатывает запрос на ``/your-name/`` URL.

source: This is a very simple form. In practice, a form might contain dozens or hundreds of fields, many of which might need to be pre-populated, and we might expect the user to work through the edit-submit cycle several times before concluding the operation.
ru: Это очень простая форма. На практике форма может состоять из дюжин или сотен полей, множество из которых необходимо заполнить начальным значением, и мы должны позволить пользователю отправить форму несколько раз прежде чем обработать окончательный результат.

source: We might require some validation to occur in the browser, even before the form is submitted; we might want to use much more complex fields, that allow the user to do things like pick dates from a calendar and so on.
ru: Вам может понадобится валидация на стороне браузера, или более сложные конролы, например, позволить пользователю выбрать дату из календаря.

source: At this point it's much easier to get Django to do most of this work for us.
ru: На много легче позволить Django сделать эту работу за нас.

source: Building a form in Django
ru: Создание форм в Django

source: The :class:`Form` class
ru: Класс :class:`Form`

source: We already know what we want our HTML form to look like. Our starting point for it in Django is this:
ru: Мы уже знаем какую форму хотим получить в HTML. Для начала нам понадобится следующий класс формы:

source: This defines a :class:`Form` class with a single field (``your_name``). We've applied a human-friendly label to the field, which will appear in the ``<label>`` when it's rendered (although in this case, the :attr:`~Field.label` we specified is actually the same one that would be generated automatically if we had omitted it).
ru: Этот код создает класс :class:`Form` с одним полем (``your_name``). Мы добавили читабельное название поля, которое будет добавлено в тег ``<label>`` при рендеринге поля (на самом деле мы могли не добавлять :attr:`~Field.label` т.к. аналогичное название Django сгенерировал бы самостоятельно).

source: The field's maximum allowable length is defined by :attr:`~CharField.max_length`. This does two things. It puts a ``maxlength="100"`` on the HTML ``<input>`` (so the browser should prevent the user from entering more than that number of characters in the first place). It also means that when Django receives the form back from the browser, it will validate the length of the data.
ru: Максимальное количество символом в значении мы указали с помощью параметра :attr:`~CharField.max_length`. Он используется для двух вещей. Будет добавлен атрибут ``maxlength="100"`` в HTML тег ``<input>`` (теперь браузер не позволит пользователю ввести больше символов, чем мы указали). Также Django выполнит проверку введенного значения, когда получит запрос с браузера с введенными данными.

source: A :class:`Form` instance has an :meth:`~Form.is_valid()` method, which runs validation routines for all its fields. When this method is called, if all fields contain valid data, it will:
ru: Экземпляр :class:`Form` содержит метод :meth:`~Form.is_valid()`, который выполняет проверку всех полей формы. Если все данные правильные, это метод:

source: return ``True``
ru: вернет ``True``

source: place the form's data in its :attr:`~Form.cleaned_data` attribute.
ru: добавит данные формы в атрибут :attr:`~Form.cleaned_data`.

source: The whole form, when rendered for the first time, will look like:
ru: После рендеринга наша форма будет выглядеть следующим образом:

source: Note that it **does not** include the ``<form>`` tags, or a submit button. We'll have to provide those ourselves in the template.
ru: Обратите внимание, она **не** содержит тег ``<form>``, или кнопку отправки. Вам необходимо самостоятельно их добавить в шаблоне.

source: The view
ru: Представление

source: Form data sent back to a Django website is processed by a view, generally the same view which published the form. This allows us to reuse some of the same logic.
ru: Данные формы отправляются обратно в Django и обрабатываются представлением, обычно тем же, которое и создает форму. Это позволяет повторно использовать часть кода.

source: To handle the form we need to instantiate it in the view for the URL where we want it to be published:
ru: Для обработки данных формой нам необходимо создать ее в представлении для URL, на который браузер отправляет данные формы:

source: If we arrive at this view with a ``GET`` request, it will create an empty form instance and place it in the template context to be rendered. This is what we can expect to happen the first time we visit the URL.
ru: Если в представление пришел ``GET`` запрос, будет создана пустая форма и добавлена в контекст шаблона для последующего рендеринга. Это мы и ожидаем получить первый раз открыв страницу с формой.

source: If the form is submitted using a ``POST`` request, the view will once again create a form instance and populate it with data from the request: ``form = NameForm(request.POST)`` This is called "binding data to the form" (it is now a *bound* form).
ru: Если форма отправлена через ``POST`` запрос, представление создаст форму с данными из запроса: ``form = NameForm(request.POST)`` Это называется "привязать данные к форме" (теперь это *связанная с данными* форма).

source: We call the form's ``is_valid()`` method; if it's not ``True``, we go back to the template with the form. This time the form is no longer empty (*unbound*) so the HTML form will be populated with the data previously submitted, where it can be edited and corrected as required.
ru: Мы вызываем метод ``is_valid()`` формы. Если получили не ``True``, снова рендерим шаблон, передав нашу форму. Теперь форма не пустая (*не связана с данными*) и HTML форма будет содержать ранее отправленные данные, их можно повторно отредактировать и отправить снова.

source: If ``is_valid()`` is ``True``, we'll now be able to find all the validated form data in its ``cleaned_data`` attribute. We can use this data to update the database or do other processing before sending an HTTP redirect to the browser telling it where to go next.
ru: Если ``is_valid()`` вернет ``True``, мы можем найти проверенные данные в атрибуте ``cleaned_data``. Мы можем сохранить эти данные в базе данных, или выполнить какие-то другие действия над ними, перед тем, как сделать редирект на другую страницу.

source: The template
ru: Шаблон

source: We don't need to do much in our ``name.html`` template. The simplest example is:
ru: Наш ``name.html`` шаблон может быть довольно простым:

source: All the form's fields and their attributes will be unpacked into HTML markup from that ``{{ form }}`` by Django's template language.
ru: Все поля формы и их атрибуты будут добавлены в HTML из ``{{ form }}`` при рендеринге шаблона.

source: Forms and Cross Site Request Forgery protection
ru: Формы и CSRF защита

source: Django ships with an easy-to-use :doc:`protection against Cross Site Request Forgeries </ref/csrf>`. When submitting a form via ``POST`` with CSRF protection enabled you must use the :ttag:`csrf_token` template tag as in the preceding example. However, since CSRF protection is not directly tied to forms in templates, this tag is omitted from the following examples in this document.
ru: Django поставляется с :doc:`защитой против Cross Site Request Forgeries </ref/csrf>`. При отправке формы через ``POST`` с включенной защитой от CSRF вы должны использовать шаблонный тег :ttag:`csrf_token`, как показано в предыдущем примере. Тем не менее, раз CSRF-защита не обязательна для применения в шаблонах при оформлении формы, этот тег опущен в последующих примерах.

source: HTML5 input types and browser validation
ru: HTML5 поля и проверка в браузере
