Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/topics/forms/index.po
Languages: ru

source: If your form includes a :class:`~django.forms.URLField`, an :class:`~django.forms.EmailField` or any integer field type, Django will use the ``url``, ``email`` and ``number`` HTML5 input types. By default, browsers may apply their own validation on these fields, which may be stricter than Django's validation. If you would like to disable this behavior, set the `novalidate` attribute on the ``form`` tag, or specify a different widget on the field, like :class:`TextInput`.
ru: Если ваша форма содержит :class:`~django.forms.URLField`, :class:`~django.forms.EmailField` или одно из числовых полей, Django будет использовать ``url``, ``email`` и ``number`` поля ввода HTML5. По умолчанию браузеры могут выполнять собственную проверку для этих полей, некоторые проверки могут быть более строгие чем в Django. Если вы хотите отключить это, добавьте `novalidate` атрибут в тег ``form``, или используйте другой виджет для этих полей, например :class:`TextInput`.

source: We now have a working web form, described by a Django :class:`Form`, processed by a view, and rendered as an HTML ``<form>``.
ru: Теперь у нас есть полностью рабочая форма, созданная классом :class:`Form`, обрабатываемая представлением, и представленная на странице как HTML ``<form>``.

source: That's all you need to get started, but the forms framework puts a lot more at your fingertips. Once you understand the basics of the process described above, you should be prepared to understand other features of the forms system and ready to learn a bit more about the underlying machinery.
ru: Это все что вам нужно для начала, но формы в Django предоставляют на много больше возможностей. Как только вы разберетесь со всем, что описано выше, можете приступать к изучению всех возможностей, которые предоставляет Django.

source: More about Django :class:`Form` classes
ru: Дополнительные возможности Django :class:`Form`

source: Models and Forms
ru: Модели и формы

source: In fact if your form is going to be used to directly add or edit a Django model, a :doc:`ModelForm </topics/forms/modelforms>` can save you a great deal of time, effort, and code, because it will build a form, along with the appropriate fields and their attributes, from a ``Model`` class.
ru: Если ваша форма будет использоваться для создания или редактирования объекта модели, вы можете использовать :doc:`ModelForm </topics/forms/modelforms>`. Она поможет сэкономить много времени и кода, т.к. позволяет создать форму по классу модели.

source: Bound and unbound form instances
ru: Связанные и не связанные с данными экземпляры формы

source: The distinction between :ref:`ref-forms-api-bound-unbound` is important:
ru: Важно понимать разницу между :ref:`ref-forms-api-bound-unbound`:

source: An unbound form has no data associated with it. When rendered to the user, it will be empty or will contain default values.
ru: Незаполненная форма не содержит данных, привязанных к её полям. При отображении формы пользователь увидит её пустой или содержащей значения по умолчанию.

source: A bound form has submitted data, and hence can be used to tell if that data is valid. If an invalid bound form is rendered, it can include inline error messages telling the user what data to correct.
ru: Заполненная форма содержит переданную информацию и, следовательно, может быть использована для проверки введённых данных. При отображении заполненной формы, не прошедшей проверку, она будет содержать встроенные сообщения об ошибках, которые расскажут пользователю о причинах отказа в принятии его данных.

source: The form's :attr:`~Form.is_bound` attribute will tell you whether a form has data bound to it or not.
ru: Атрибут формы :attr:`~Form.is_bound` позволяет узнать связана форма с данными или нет.

source: More on fields
ru: Поля формы

source: Consider a more useful form than our minimal example above, which we could use to implement "contact me" functionality on a personal website:
ru: Рассмотрим более полезную форму, чем наш минимальный пример выше, которая может быть использована для реализации функционала "свяжитесь с нами" на личном веб сайте:

source: Our earlier form used a single field, ``your_name``, a :class:`CharField`. In this case, our form has four fields: ``subject``, ``message``, ``sender`` and ``cc_myself``. :class:`CharField`, :class:`EmailField` and :class:`BooleanField` are just three of the available field types; a full list can be found in :doc:`/ref/forms/fields`.
ru: Наша первая форма содержала только одно поле ``your_name`` типа :class:`CharField`. В этом случае, форма содержит четыре поля: ``subject``, ``message``, ``sender`` и ``cc_myself``. :class:`CharField`, :class:`EmailField` и :class:`BooleanField` -- это просто три стандартных типа поля; полный список полей может быть найден в :doc:`/ref/forms/fields`.

source: Widgets
ru: Виджеты

source: Each form field has a corresponding :doc:`Widget class </ref/forms/widgets/>`, which in turn corresponds to an HTML form widget such as ``<input type="text">``.
ru: Каждое поле формы содержит соответствующий :doc:`класс Widget </ref/forms/widgets/>`, который отвечает за создание HTML кода, представляющего поле, например ``<input type="text">``.

source: In most cases, the field will have a sensible default widget. For example, by default, a :class:`CharField` will have a :class:`TextInput` widget, that produces an ``<input type="text">`` in the HTML. If you needed ``<textarea>`` instead, you'd specify the appropriate widget when defining your form field, as we have done for the ``message`` field.
ru: В большинстве случаев поле уже содержит подходящий виджет. Например, по умолчанию поле :class:`CharField` представлено виджетом :class:`TextInput`, который создает тег ``<input type="text">`` в HTML. Если вам вместо него необходим ``<textarea>``, вы можете указать подходящий виджет при определении поля формы, как мы сделали для поля ``message``.

source: Field data
ru: Данные поля

source: Whatever the data submitted with a form, once it has been successfully validated by calling ``is_valid()`` (and ``is_valid()`` has returned ``True``), the validated form data will be in the ``form.cleaned_data`` dictionary. This data will have been nicely converted into Python types for you.
ru: Когда в форму добавлены данные, и она проверена методом ``is_valid()`` (и ``is_valid()`` вернул ``True``), проверенные данные будут добавлены в словарь ``form.cleaned_data``. Эти данные будет преобразованы в подходящий тип Python.

source: You can still access the unvalidated data directly from ``request.POST`` at this point, but the validated data is better.
ru: Также вы можете напрямую обратиться к непроверенным данным через ``request.POST``, но лучше использовать проверенные данные.

source: In the contact form example above, ``cc_myself`` will be a boolean value. Likewise, fields such as :class:`IntegerField` and :class:`FloatField` convert values to a Python ``int`` and ``float`` respectively.
ru: В приведённом ранее примере, ``cc_myself`` будет булевым значением. Аналогично, такие поля как :class:`IntegerField` и :class:`FloatField` преобразовывают свои значения в типы Python ``int`` и ``float`` соответственно.

source: Here's how the form data could be processed in the view that handles this form:
ru: Вот небольшой пример того, как можно обрабатывать данные в представлении, к которому привязана форма:

source: For more on sending email from Django, see :doc:`/topics/email`.
ru: Подробную информацию про отправку электронной почты с помощью Django можно найти в :doc:`/topics/email`.

source: Some field types need some extra handling. For example, files that are uploaded using a form need to be handled differently (they can be retrieved from ``request.FILES``, rather than ``request.POST``). For details of how to handle file uploads with your form, see :ref:`binding-uploaded-files`.
ru: Некоторые поля требуют дополнительной обработки. Например, загруженные файлы необходимо обрабатывать по другому (их можно получить из ``request.FILES``, а не ``request.POST``). Подробности смотрите в :ref:`binding-uploaded-files`.

source: Working with form templates
ru: Работа с шаблонами формы

source: All you need to do to get your form into a template is to place the form instance into the template context. So if your form is called ``form`` in the context, ``{{ form }}`` will render its ``<label>`` and ``<input>`` elements appropriately.
ru: Чтобы получить доступ к форме в шаблоне, просто передайте экземпляр в контекст шаблона. Если ваша форма добавлена в контекст как ``form``, ``{{ form }}`` создаст необходимые теги ``<label>`` и ``<input>``.

source: Form rendering options
ru: Настройки рендеринга формы

source: Additional form template furniture
ru: Что еще необходимо при рендеринге формы

source: Don't forget that a form's output does *not* include the surrounding ``<form>`` tags, or the form's ``submit`` control. You will have to provide these yourself.
ru: Обратите внимание, форма *не* добавляет тег ``<form>`` и ``submit`` кнопку. Вы должны добавить их самостоятельно.

source: There are other output options though for the ``<label>``/``<input>`` pairs:
ru: Вы можете использовать следующие варианты рендеринга ``<label>``/``<input>``:

source: ``{{ form.as_table }}`` will render them as table cells wrapped in ``<tr>`` tags
ru: ``{{ form.as_table }}`` выведет их в таблице, в ячейках тега ``<tr>``

source: ``{{ form.as_p }}`` will render them wrapped in ``<p>`` tags
ru: ``{{ form.as_p }}`` обернет их в тег ``<p>``

source: ``{{ form.as_ul }}`` will render them wrapped in ``<li>`` tags
ru: ``{{ form.as_ul }}`` выведет в теге ``<li>``

source: Note that you'll have to provide the surrounding ``<table>`` or ``<ul>`` elements yourself.
ru: Обратите внимание, тег ``<table>`` или ``<ul>`` вы должны добавить сами.

source: Here's the output of ``{{ form.as_p }}`` for our ``ContactForm`` instance:
ru: Вот результат ``{{ form.as_p }}`` для нашей формы ``ContactForm``:

source: Note that each form field has an ID attribute set to ``id_<field-name>``, which is referenced by the accompanying label tag. This is important in ensuring that forms are accessible to assistive technology such as screen reader software. You can also :ref:`customize the way in which labels and ids are generated <ref-forms-api-configuring-label>`.
ru: Следует отметить, что каждое поле формы обладает атрибутом с идентификатором ``id_<field-name>``, с помощью которого обеспечивается связь с тегом метки. Это позволяет формам быть дружественными к вспомогательным технологиям, например, это поможет работе ПО для слепых. Также вы можете :ref:`настроить способ генерации меток и идентификаторов <ref-forms-api-configuring-label>`.

source: See :ref:`ref-forms-api-outputting-html` for more on this.
ru: Смотрите :ref:`ref-forms-api-outputting-html`.

source: Rendering fields manually
ru: Рендеринг полей вручную

source: We don't have to let Django unpack the form's fields; we can do it manually if we like (allowing us to reorder the fields, for example). Each field is available as an attribute of the form using ``{{ form.name_of_field }}``, and in a Django template, will be rendered appropriately. For example:
ru: Мы можем не использовать полный рендеринг формы и отрендерить каждое поле отдельно (например, чтобы поменять порядок полей). Каждое поле формы можно получить через атрибут формы ``{{ form.name_of_field }}``. Например:

source: Complete ``<label>`` elements can also be generated using the :meth:`~django.forms.BoundField.label_tag`. For example:
ru: Элемент ``<label>`` также может быть создан с помощью метода :meth:`~django.forms.BoundField.label_tag`. Например:

source: Rendering form error messages
ru: Рендеринг ошибок проверки

source: Of course, the price of this flexibility is more work. Until now we haven't had to worry about how to display form errors, because that's taken care of for us. In this example we have had to make sure we take care of any errors for each field and any errors for the form as a whole. Note ``{{ form.non_field_errors }}`` at the top of the form and the template lookup for errors on each field.
ru: За гибкость мы платим количеством кода. До этого мы не заботились о выводе ошибок проверки, т.к. Django делал это за нас. В этом примере нам пришлось явно выводить ошибки проверки для каждого поля и для всей формы. Обратите внимание на ``{{ form.non_field_errors }}`` в начале в формы и вывод ошибок для каждого поля.

source: Using ``{{ form.name_of_field.errors }}`` displays a list of form errors, rendered as an unordered list. This might look like:
ru: Список ошибок можно вывести используя ``{{ form.name_of_field.errors }}``. Они будут выглядеть приблизительно как:

source: The list has a CSS class of ``errorlist`` to allow you to style its appearance. If you wish to further customize the display of errors you can do so by looping over them:
ru: Списку назначен CSS-класс ``errorlist``, что позволяет вам настроить параметры его отображения. Если потребуется более тонкая настройка отображения ошибок, вы можете это организовать с помощью цикла по ним:

source: Non-field errors (and/or hidden field errors that are rendered at the top of the form when using helpers like ``form.as_p()``) will be rendered with an additional class of ``nonfield`` to help distinguish them from field-specific errors. For example, ``{{ form.non_field_errors }}`` would look like:
ru: Ошибки, не относящиеся к полям, (и/или ошибки скрытых полей, которые отображаются наверху формы при использовании методов подобных ``form.as_p()``) будут отображаться с дополнительным классом ``nonfield``, что поможет их отделить от ошибок полей формы. Например, ``{{ form.non_field_errors }}`` может выглядеть так:

source: See :doc:`/ref/forms/api` for more on errors, styling, and working with form attributes in templates.
ru: Подробности о выводе ошибок, стилях и атрибутах смотрите в :doc:`/ref/forms/api`.

source: Looping over the form's fields
ru: Цикл по полям формы

source: If you're using the same HTML for each of your form fields, you can reduce duplicate code by looping through each field in turn using a ``{% for %}`` loop:
ru: Если вы используете однотипный HTML для каждого поля формы, вы можете избежать дублирования кода, используя тег ``{% for %}`` для прохода по полям формы:

source: Useful attributes on ``{{ field }}`` include:
ru: Полезные атрибуты ``{{ field }}``:

source: The label of the field, e.g. ``Email address``.
ru: Метка поля, т.е. ``Email address``.

source: The field's label wrapped in the appropriate HTML ``<label>`` tag. This includes the form's :attr:`~django.forms.Form.label_suffix`. For example, the default ``label_suffix`` is a colon::
ru: Метка поля, обёрнутая в соответствующий HTML тег ``<label>``. Также включает атрибут формы :attr:`~django.forms.Form.label_suffix`. Например, по умолчания ``label_suffix`` содержит двоеточие::

source: The ID that will be used for this field (``id_email`` in the example above). If you are constructing the label manually, you may want to use this in lieu of ``label_tag``. It's also useful, for example, if you have some inline JavaScript and want to avoid hardcoding the field's ID.
ru: ID, которое будет использоваться для этого поля (``id_email`` в примере выше). Вы можете использовать его вместо ``label_tag``, если самостоятельно генерируете `<label>` для поля. Так полезно при генерации JavaScript, если вы не хотите "хардкодить" ID.

source: The value of the field. e.g ``someone@example.com``.
ru: Значение поля, например ``someone@example.com``.

source: The name of the field that will be used in the input element's name field. This takes the form prefix into account, if it has been set.
ru: Имя поля, которое будет использовано в HTML-поле. Здесь учитывается префикс формы, если он был установлен.

source: Any help text that has been associated with the field.
ru: Любой вспомогательный текст, который привязан к полю.

source: Outputs a ``<ul class="errorlist">`` containing any validation errors corresponding to this field. You can customize the presentation of the errors with a ``{% for error in field.errors %}`` loop. In this case, each object in the loop is a simple string containing the error message.
ru: Вывод ``<ul class="errorlist">``, содержащий все ошибки валидации, относящиеся к полю. Вы можете настраивать представление списка ошибок с помощью цикла ``{% for error in field.errors %}``. В этом случае, каждый объект в цикле является простой строкой, содержащей сообщение об ошибке.

source: This attribute is ``True`` if the form field is a hidden field and ``False`` otherwise. It's not particularly useful as a template variable, but could be useful in conditional tests such as:
ru: Значение этого атрибута равно ``True``, если поле является скрытым, и ``False`` в противном случае. Данный атрибут обычно не используется при выводе формы, но может быть полезен в условиях подобных этому:

source: The :class:`~django.forms.Field` instance from the form class that this :class:`~django.forms.BoundField` wraps. You can use it to access :class:`~django.forms.Field` attributes, e.g. ``{{ char_field.field.max_length }}``.
ru: Экземпляр :class:`~django.forms.Field` из класса формы, который обёрнут с помощью :class:`~django.forms.BoundField`. Он предоставляет доступ к атрибутам :class:`~django.forms.Field`, например ``{{ char_field.field.max_length }}``.

source: For a complete list of attributes and methods, see :class:`~django.forms.BoundField`.
ru: Полный список методов и атрибутов смотрите в описании :class:`~django.forms.BoundField`.

source: Looping over hidden and visible fields
ru: Цикл по скрытым и отображаемым полям

source: If you're manually laying out a form in a template, as opposed to relying on Django's default form layout, you might want to treat ``<input type="hidden">`` fields differently from non-hidden fields. For example, because hidden fields don't display anything, putting error messages "next to" the field could cause confusion for your users -- so errors for those fields should be handled differently.
ru: Если вы вручную размещаете форму в шаблоне, то у вас появляется возможность трактовать поля вида ``<input type="hidden">`` по своему. Например, так как скрытые поля не отображаются на форме, размещение сообщений об ошибке для поля "перейти далее" может смутить пользователей. Такие ошибки следует обрабатывать другим способом.

source: Django provides two methods on a form that allow you to loop over the hidden and visible fields independently: ``hidden_fields()`` and ``visible_fields()``. Here's a modification of an earlier example that uses these two methods:
ru: Django предоставляет два метода, которые позволяют организовать раздельные циклы по скрытым и отображаемым полям: ``hidden_fields()`` и ``visible_fields()``. Покажем как изменится наш пример, если воспользоваться этими методами:

source: This example does not handle any errors in the hidden fields. Usually, an error in a hidden field is a sign of form tampering, since normal form interaction won't alter them. However, you could easily insert some error displays for those form errors, as well.
ru: Этот пример не обрабатывает ошибки в скрытых полях. Обычно ошибка в скрытом поле означает наличие подмены в форме, так как обычный сценарий работы с формами не предполагает изменения этих полей. Тем не менее, вы можете реализовать отображение таких ошибок формы.

source: Reusable form templates
ru: Повторное использование шаблонов форм

source: If your site uses the same rendering logic for forms in multiple places, you can reduce duplication by saving the form's loop in a standalone template and using the :ttag:`include` tag to reuse it in other templates:
ru: Если на вашем сайте используется однотипная логика отображения форм, вы можете избежать дублирования кода, сохранив цикл по полям формы в отдельном шаблоне и подключая его в другие шаблоны с помощью тега :ttag:`include`:

source: If the form object passed to a template has a different name within the context, you can alias it using the ``with`` argument of the :ttag:`include` tag:
ru: Если объект формы, переданный в шаблон, имеет другое имя в контексте, вы можете создать для него псевдоним, используя аргумент ``with`` тега :ttag:`include`:

source: If you find yourself doing this often, you might consider creating a custom :ref:`inclusion tag<howto-custom-template-tags-inclusion-tags>`.
ru: Если вам придётся делать такое часто, то можно создать собственный :ref:`включающий тег <howto-custom-template-tags-inclusion-tags>`.

source: Further topics
ru: Изучите далее

source: This covers the basics, but forms can do a whole lot more:
ru: Мы рассмотрели базовые возможности форм, но они могут больше:

source: :doc:`The Forms Reference </ref/forms/index>`
ru: :doc:`Справочник по формам </ref/forms/index>`

source: Covers the full API reference, including form fields, form widgets, and form and field validation.
ru: Предоставляет полный справочник на API, включая поля, виджеты и валидацию как полей, так и формы.
