Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/topics/forms/media.po
Languages: ru

source: Form Assets (the ``Media`` class)
ru: Статические файлы форм (класс ``Media``)

source: Rendering an attractive and easy-to-use Web form requires more than just HTML - it also requires CSS stylesheets, and if you want to use fancy "Web2.0" widgets, you may also need to include some JavaScript on each page. The exact combination of CSS and JavaScript that is required for any given page will depend upon the widgets that are in use on that page.
ru: Для генерации отзывчивых и удобных форм недостаточно простого HTML. Как минимум, нужен CSS, а современные виджеты нуждаются ещё и в JavaScript. Точная комбинация CSS и JavaScript зависит от виджетов, используемых на этой странице.

source: This is where asset definitions come in. Django allows you to associate different files -- like stylesheets and scripts -- with the forms and widgets that require those assets. For example, if you want to use a calendar to render DateFields, you can define a custom Calendar widget. This widget can then be associated with the CSS and JavaScript that is required to render the calendar. When the Calendar widget is used on a form, Django is able to identify the CSS and JavaScript files that are required, and provide the list of file names in a form suitable for easy inclusion on your Web page.
ru: Именно здесь используются статические файлы формы. Django позволяет привязать различные файлы к форме и виджетам, которым они нужны. Например, если вы желаете использовать календарь для полей с датами, вы можете определить собственный виджет календаря. Этот виджет может требовать для своей работы CSS и JavaScript. При использовании этого виджета на форме, Django может определить необходимые ``.css`` и ``.js`` файлы и предоставить список имён этих файлов для их включения в код страницы.

source: Assets and Django Admin
ru: Статические файлы интерфейса администратора Django

source: The Django Admin application defines a number of customized widgets for calendars, filtered selections, and so on. These widgets define asset requirements, and the Django Admin uses the custom widgets in place of the Django defaults. The Admin templates will only include those files that are required to render the widgets on any given page.
ru: Поставляемое с Django приложение интерфейса администратора определяет ряд собственных виджетов для календарей, отфильтрованных выборок и так далее. Эти виджеты имеют свои требования к ресурсам. Шаблоны приложения подключают соответствующие файлы, которые необходимы для работы виджетов на странице.

source: If you like the widgets that the Django Admin application uses, feel free to use them in your own application! They're all stored in ``django.contrib.admin.widgets``.
ru: Если вам понравились виджеты интерфейса администратора, то используйте их в своих приложениях. Они все расположены в ``django.contrib.admin.widgets``.

source: Which JavaScript toolkit?
ru: Какую библиотеку JavaScript использовать?

source: Many JavaScript toolkits exist, and many of them include widgets (such as calendar widgets) that can be used to enhance your application. Django has deliberately avoided blessing any one JavaScript toolkit. Each toolkit has its own relative strengths and weaknesses - use whichever toolkit suits your requirements. Django is able to integrate with any JavaScript toolkit.
ru: Существует множество библиотек JavaScript, многие из которых представляют виджеты (например, календари), которые могут быть использованы в вашем приложении. Django умышленно избегает использования какой-то одной JavaScript библиотеки. Каждая библиотека имеет свои преимущества и недостатки, выбирайте ту, которая соответствует вашим нуждам. Django можно интегрировать с любой JavaScript библиотекой.

source: Assets as a static definition
ru: Определение статических файлов

source: The easiest way to define assets is as a static definition. Using this method, the declaration is an inner ``Media`` class. The properties of the inner class define the requirements.
ru: Декларативное определение является самым простым способом определения ресурсов. Этот способ предполагает описание ресурса во внутреннем классе ``Media``. Свойства внутреннего класса определяют требования к ресурсам.

source: Here's a simple example::
ru: Рассмотрим простой пример::

source: This code defines a ``CalendarWidget``, which will be based on ``TextInput``. Every time the CalendarWidget is used on a form, that form will be directed to include the CSS file ``pretty.css``, and the JavaScript files ``animations.js`` and ``actions.js``.
ru: Этот код определяет ``CalendarWidget``, который унаследован от ``TextInput``. Каждый раз, при использовании ``CalendarWidget`` на форме, эта форма будет подгружать CSS из файла ``pretty.css`` и JavaScript из файлов ``animations.js`` и ``actions.js``.

source: This static definition is converted at runtime into a widget property named ``media``. The list of assets for a ``CalendarWidget`` instance can be retrieved through this property::
ru: Такое статическое определение преобразуется во время выполнения в свойство ``media`` виджета. Ресурсы для экземпляра ``CalendarWidget`` могут быть получены через это свойство::

source: Here's a list of all possible ``Media`` options. There are no required options.
ru: Ниже приведён список всех возможных вариантов для ``Media``. Ни один из них не является обязательным.

source: A dictionary describing the CSS files required for various forms of output media.
ru: Словарь, описывающий CSS файлы, необходимые для различных устройств.

source: The values in the dictionary should be a tuple/list of file names. See :ref:`the section on paths <form-asset-paths>` for details of how to specify paths to these files.
ru: Значения словаря должны быть кортежами или списками имён файлов. Обратитесь к :ref:`соответствующему разделу <form-asset-paths>` для получения информации о том, как определять пути до файлов с ресурсами.

source: The keys in the dictionary are the output media types. These are the same types accepted by CSS files in media declarations: 'all', 'aural', 'braille', 'embossed', 'handheld', 'print', 'projection', 'screen', 'tty' and 'tv'. If you need to have different stylesheets for different media types, provide a list of CSS files for each output medium. The following example would provide two CSS options -- one for the screen, and one for print::
ru: Ключами словаря являются названия типов устройств отображения. Они идентичны типам, с которыми работает CSS: 'all', 'aural', 'braille', 'embossed', 'handheld', 'print', 'projection', 'screen', 'tty' и 'tv'. Если вам нужны различные стили для разных типов устройств отображения, то укажите список CSS файлов для каждого типа устройств. Следующий пример определяет CSS для вывода на экран и принтер::

source: If a group of CSS files are appropriate for multiple output media types, the dictionary key can be a comma separated list of output media types. In the following example, TV's and projectors will have the same media requirements::
ru: Если набор CSS файлов подходит для нескольких устройств отображения, то ключ словаря может быть списком типов нескольких устройств с запятой в качестве разделителя. В следующем примере, телевизор и проектор имеют одинаковые требования к ресурсам::

source: If this last CSS definition were to be rendered, it would become the following HTML::
ru: Вышеприведённое определение стилей будет преобразовано в следующий код::

source: A tuple describing the required JavaScript files. See :ref:`the section on paths <form-asset-paths>` for details of how to specify paths to these files.
ru: Кортеж, описывающий необходимые JavaScript файлы. Обратитесь к :ref:`соответствующему разделу <form-asset-paths>` для получения информации о правилах определения путей до файлов ресурсов.

source: A boolean defining inheritance behavior for ``Media`` declarations.
ru: Булево значение, определяющее, производится ли наследование ``Media`` базового класса.

source: By default, any object using a static ``Media`` definition will inherit all the assets associated with the parent widget. This occurs regardless of how the parent defines its own requirements. For example, if we were to extend our basic Calendar widget from the example above::
ru: По умолчанию, любой объект, использующий ``Media``, будет наследовать все ресурсы от базового класса. Это будет происходить вне зависимости от того, как базовый класс определяет свои зависимости от ресурсов. Пример, расширения функционала нашего простого календаря::

source: The FancyCalendar widget inherits all the assets from its parent widget. If you don't want ``Media`` to be inherited in this way, add an ``extend=False`` declaration to the ``Media`` declaration::
ru: Виджет ``FancyCalendar`` наследует все ресурсы от базового виджета. Если такое поведение вам не подходит, то добавьте ``extend=False`` к ``Media``::

source: If you require even more control over inheritance, define your assets using a :ref:`dynamic property <dynamic-property>`. Dynamic properties give you complete control over which files are inherited, and which are not.
ru: Если вам требуется больше контроля над наследованием ресурсов, то ресурсы следует определять с помощью :ref:`динамических свойств <dynamic-property>`. Динамическое свойства обеспечивают полный контроль над процессом наследования ресурсов.

source: ``Media`` as a dynamic property
ru: Динамическое определение ресурсов через ``Media``

source: If you need to perform some more sophisticated manipulation of asset requirements, you can define the ``media`` property directly. This is done by defining a widget property that returns an instance of ``forms.Media``. The constructor for ``forms.Media`` accepts ``css`` and ``js`` keyword arguments in the same format as that used in a static media definition.
ru: Если над требованиями к ресурсам необходимо производить более тонкие манипуляции, то можно сделать свойство ``media`` вычисляемым динамически. Это реализуется с помощью определения свойства виджета, которое возвращает экземпляр ``forms.Media``. Конструктор ``forms.Media`` принимает именованные аргументы ``css`` и ``js``, в том же формате, что используется при статическом определении ресурсов.

source: For example, the static definition for our Calendar Widget could also be defined in a dynamic fashion::
ru: Например, вот как может быть представлено определение ресурсов для нашего виджета календаря в динамическом виде::

source: See the section on `Media objects`_ for more details on how to construct return values for dynamic ``media`` properties.
ru: Обратитесь к разделу `Media objects`_ для получения информации о том, как создать возвращаемые значения для динамических свойств ресурсов.

source: Paths in asset definitions
ru: Определение путей до ресурсов

source: Paths used to specify assets can be either relative or absolute. If a path starts with ``/``, ``http://`` or ``https://``, it will be interpreted as an absolute path, and left as-is. All other paths will be prepended with the value of the appropriate prefix. If the :mod:`django.contrib.staticfiles` app is installed, it will be used to serve assets.
ru: Пути, используемые для определения ресурсов, могут быть как относительными, так и абсолютными. Если путь начинается с '/', 'http://' или 'https://', то он будет интерпретирован как абсолютный и оставлен в неизменном виде. Все остальные пути будут дополнены соответствующим префиксом. Если активировано приложение :mod:`django.contrib.staticfiles`, оно будет использоваться для раздачи статических файлов.

source: Whether or not you use :mod:`django.contrib.staticfiles`, the :setting:`STATIC_URL` and :setting:`STATIC_ROOT` settings are required to render a complete web page.
ru: Независимо от того, используете ли вы :mod:`django.contrib.staticfiles`, для отображения страницы необходимо указать настройки :setting:`STATIC_URL` и :setting:`STATIC_ROOT`.

source: To find the appropriate prefix to use, Django will check if the :setting:`STATIC_URL` setting is not ``None`` and automatically fall back to using :setting:`MEDIA_URL`. For example, if the :setting:`MEDIA_URL` for your site was ``'http://uploads.example.com/'`` and :setting:`STATIC_URL` was ``None``::
ru: Для того, чтобы найти правильный префикс, Django проверит параметр :setting:`STATIC_URL` на равенство с ``None`` и, если это так, то автоматически воспользуется параметром :setting:`MEDIA_URL`. Например, если параметр :setting:`MEDIA_URL` для сайта имеет значение ``'http://uploads.example.com/'``, а параметр :setting:`STATIC_URL` равен ``None``::

source: But if :setting:`STATIC_URL` is ``'http://static.example.com/'``::
ru: Но если параметр :setting:`STATIC_URL` равен ``'http://static.example.com/'``::

source: Or if :mod:`~django.contrib.staticfiles` is configured using the :class:`~django.contrib.staticfiles.storage.ManifestStaticFilesStorage`::
ru: Или, если активировано приложение :mod:`~django.contrib.staticfiles`, используется `~django.contib.staticfiles.storage.ManifestStaticFilesStorage`::

source: ``Media`` objects
ru: Объекты ресурсов

source: When you interrogate the ``media`` attribute of a widget or form, the value that is returned is a ``forms.Media`` object. As we have already seen, the string representation of a ``Media`` object is the HTML required to include the relevant files in the ``<head>`` block of your HTML page.
ru: При обращении к атрибуту ``media`` виджета или формы в качестве значения будет возвращён экземпляр ``forms.Media``. Как мы уже выяснили, строковым представлением такого объекта является HTML, который необходимо вставить в блок ``<head>`` вашей страницы.

source: However, ``Media`` objects have some other interesting properties.
ru: Тем не менее, у объектов ``Media`` есть ещё интересные свойства.

source: Subsets of assets
ru: Группы файлов

source: If you only want files of a particular type, you can use the subscript operator to filter out a medium of interest. For example::
ru: Если вам требуется ресурс определённого типа, то вы можете использовать оператор для фильтрации ненужных ресурсов. Например::

source: When you use the subscript operator, the value that is returned is a new ``Media`` object -- but one that only contains the media of interest.
ru: При использовании оператора фильтрации, возвращаемым значением будет новый объект ``Media``, но содержать он будет только указанные ресурсы.

source: Combining ``Media`` objects
ru: Сочетание объектов ``Media``

source: ``Media`` objects can also be added together. When two ``Media`` objects are added, the resulting ``Media`` object contains the union of the assets specified by both::
ru: ``Media`` объекты также можно объединять друг с другом. При объединении двух таких объектов, результатом будет объект ``Media``, содержащий ресурсы обоих объектов::

source: Order of assets
ru: Порядок статических файлов

source: The order in which assets are inserted into the DOM is often important. For example, you may have a script that depends on jQuery. Therefore, combining ``Media`` objects attempts to preserve the relative order in which assets are defined in each ``Media`` class.
ru: Порядок добавления статических файлов в DOM часто важен. Например, вы можете использовать скрипт, который зависит от jQuery. Поэтому при объединении объектов ``Media`` Django пытается сохранить относительный порядок файлов, которые указаны в классе ``Media``.

source: For example::
ru: Например::

source: Combining ``Media`` objects with assets in a conflicting order results in a ``MediaOrderConflictWarning``.
ru: Например, объединяя объекты ``Media``, которые содержат файлы в конфликтующем порядке, вы получите ``MediaOrderConflictWarning``.

source: In older versions, the assets of ``Media`` objects are concatenated rather than merged in a way that tries to preserve the relative ordering of the elements in each list.
ru: В более старых версиях файлы из объектов ``Media`` просто добавлялись друг к другу, а не объединялись с сохранением относительного порядка элементов.

source: ``Media`` on Forms
ru: ``Media`` на формах

source: Widgets aren't the only objects that can have ``media`` definitions -- forms can also define ``media``. The rules for ``media`` definitions on forms are the same as the rules for widgets: declarations can be static or dynamic; path and inheritance rules for those declarations are exactly the same.
ru: Виджеты являются не единственными объектами, которые могут содержать ``media``. Формы тоже могут требовать наличия ``media`` для своей работы. Правила определения ``media`` для форм аналогичны правилам для виджетов: определения могут быть статическими или динамическими. Пути и правила наследования для этих определений тоже не отличаются.

source: Regardless of whether you define a ``media`` declaration, *all* Form objects have a ``media`` property. The default value for this property is the result of adding the ``media`` definitions for all widgets that are part of the form::
ru: Независимо от того, определили вы внешние ресурсы или нет, *всё* объекты ``Form`` обладают свойством ``media``. Значением по умолчанию для этого свойства является результат сочетания ресурсов всех виджетов формы::

source: If you want to associate additional assets with a form -- for example, CSS for form layout -- simply add a ``Media`` declaration to the form::
ru: Если требуется добавить ещё ресурс к форме, например CSS для разметки формы, просто добавьте его определение к форме::
