Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/topics/forms/modelforms.po
Languages: ru

source: Creating forms from models
ru: Создание форм из моделей

source: If you're building a database-driven app, chances are you'll have forms that map closely to Django models. For instance, you might have a ``BlogComment`` model, and you want to create a form that lets people submit comments. In this case, it would be redundant to define the field types in your form, because you've already defined the fields in your model.
ru: При разработке приложения, использующего базу данных, чаще всего вы будете работать с формами, которые аналогичны моделям. Например, имея модель ``BlogComment``, вам может потребоваться создать форму, которая позволит людям отправлять комментарии. В этом случае явное определение полей формы будет дублировать код, так как все поля уже описаны в модели.

source: For this reason, Django provides a helper class that lets you create a ``Form`` class from a Django model.
ru: По этой причине Django предоставляет вспомогательный класс, который позволит вам создать класс ``Form`` по имеющейся модели.

source: For example::
ru: Например::

source: Field types
ru: Типы полей

source: The generated ``Form`` class will have a form field for every model field specified, in the order specified in the ``fields`` attribute.
ru: Сгенерированный класс ``Form`` будет содержать поле формы для каждого поля модели в порядке указанном в атрибуте ``fields``.

source: Each model field has a corresponding default form field. For example, a ``CharField`` on a model is represented as a ``CharField`` on a form. A model ``ManyToManyField`` is represented as a ``MultipleChoiceField``. Here is the full list of conversions:
ru: Каждому полю модели соответствует стандартное поле формы. Например, ``CharField`` поле модели будет представлено на форме как ``CharField``, а ``ManyToManyField`` поле модели будет представлено как ``MultipleChoiceField``. Ниже представлен полный список соответствия полей модели и формы:

source: Model field
ru: Поле модели

source: Form field
ru: Поле формы

source: Not represented in the form
ru: Не представлено на форме

source: :class:`~django.forms.IntegerField` with ``min_value`` set to -9223372036854775808 and ``max_value`` set to 9223372036854775807.
ru: :class:`~django.forms.IntegerField` с атрибутом ``min_value`` равным -9223372036854775808 и атрибутом ``max_value`` равным 9223372036854775807.

source: :class:`~django.forms.CharField` with ``max_length`` set to the model field's ``max_length`` and :attr:`~django.forms.CharField.empty_value` set to ``None`` if ``null=True``.
ru: :class:`~django.forms.CharField` с атрибутом ``max_length`` равным значению атрибута ``max_length`` модели и :attr:`~django.forms.CharField.empty_value` равен ``None``, если ``null=True``.

source: :class:`~django.forms.ModelChoiceField` (see below)
ru: :class:`~django.forms.ModelChoiceField` (смотри далее)

source: :class:`~django.forms.ModelMultipleChoiceField` (see below)
ru: :class:`~django.forms.ModelMultipleChoiceField` (смотри далее)

source: :class:`~django.forms.CharField` with ``widget=forms.Textarea``
ru: :class:`~django.forms.CharField` с ``widget=forms.Textarea``

source: As you might expect, the ``ForeignKey`` and ``ManyToManyField`` model field types are special cases:
ru: Как вы могли ожидать, ``ForeignKey`` и ``ManyToManyField`` поля модели являются особыми случаями:

source: ``ForeignKey`` is represented by ``django.forms.ModelChoiceField``, which is a ``ChoiceField`` whose choices are a model ``QuerySet``.
ru: Поле ``ForeignKey`` модели представлено полем формы ``ModelChoiceField``, которое является обычным ``ChoiceField``, но с вариантами значений, полученными из ``QuerySet``.

source: ``ManyToManyField`` is represented by ``django.forms.ModelMultipleChoiceField``, which is a ``MultipleChoiceField`` whose choices are a model ``QuerySet``.
ru: Поле ``ManyToManyField`` модели представлено полем формы ``ModelMultipleChoiceField``, которое является обычным ``MultipleChoiceField`, но с вариантами значений, полученными из ``QuerySet``.

source: In addition, each generated form field has attributes set as follows:
ru: В дополнение, каждое поле созданной формы имеет следующие атрибуты:

source: If the model field has ``blank=True``, then ``required`` is set to ``False`` on the form field. Otherwise, ``required=True``.
ru: Если у поля модели есть ``blank=True``, тогда к полю формы будет добавлено ``required=False``, иначе -- ``required=True``.

source: The form field's ``label`` is set to the ``verbose_name`` of the model field, with the first character capitalized.
ru: Значением атрибута ``label`` поля будет значение поля ``verbose_name`` модели, причём первый символ этого значения будет преобразован в верхний регистр.

source: The form field's ``help_text`` is set to the ``help_text`` of the model field.
ru: Значением атрибута ``help_text`` поля формы будет значение атрибута ``help_text`` поля модели.

source: If the model field has ``choices`` set, then the form field's ``widget`` will be set to ``Select``, with choices coming from the model field's ``choices``. The choices will normally include the blank choice which is selected by default. If the field is required, this forces the user to make a selection. The blank choice will not be included if the model field has ``blank=False`` and an explicit ``default`` value (the ``default`` value will be initially selected instead).
ru: Если для поля модели установлен атрибут ``choices``, тогда для поля формы будет использоваться виджет ``Select``, который будет отображать содержимое этого атрибута. Варианты выбора обычно содержат пустой вариант, который выбран по умолчанию. Если поле является обязательным, то оно требует от пользователя сделать выбор. Пустой вариант не отображается, если у поля модели есть атрибут ``blank=False`` и явное значение ``default`` (при этом, это значение будет выбрано по умолчанию).

source: Finally, note that you can override the form field used for a given model field. See `Overriding the default fields`_ below.
ru: В конце, следует отметить, что вы можете переопределить поле формы, используемое для определённого поля модели. :ref:`Переопределение стандартных полей <modelforms-overriding-default-fields>` описано ниже.

source: A full example
ru: Полный пример

source: Consider this set of models::
ru: Рассмотрим этот набор полей::

source: With these models, the ``ModelForm`` subclasses above would be roughly equivalent to this (the only difference being the ``save()`` method, which we'll discuss in a moment.)::
ru: Для этих моделей показанные выше классы ``ModelForm`` будут аналогичны следующим формам (разница будет только в методе ``save()``, что мы вскоре рассмотрим.)::

source: Validation on a ``ModelForm``
ru: Валидация в ``ModelForm``

source: There are two main steps involved in validating a ``ModelForm``:
ru: Есть два основных шага при валидации ``ModelForm``:

source: :doc:`Validating the form </ref/forms/validation>`
ru: :ref:`Валидация форм </ref/forms/validation>`

source: :ref:`Validating the model instance <validating-objects>`
ru: :ref:`Валидация объекта модели <validating-objects>`

source: Just like normal form validation, model form validation is triggered implicitly when calling :meth:`~django.forms.Form.is_valid()` or accessing the :attr:`~django.forms.Form.errors` attribute and explicitly when calling ``full_clean()``, although you will typically not use the latter method in practice.
ru: Как и валидация в обычной форме валидация в модельной форме выполняется при вызове :meth:`~django.forms.Form.is_valid()` или при обращении к атрибуту :attr:`~django.forms.Form.errors`, или при явном вызове ``full_clean()``, но на практике вы не будете использовать последний метод.

source: ``Model`` validation (:meth:`Model.full_clean() <django.db.models.Model.full_clean()>`) is triggered from within the form validation step, right after the form's ``clean()`` method is called.
ru: Валидация модели (:meth:`Model.full_clean() <django.db.models.Model.full_clean()>`) выполняется после валидации формы, сразу после завершения метода ``clean()``.

source: The cleaning process modifies the model instance passed to the ``ModelForm`` constructor in various ways. For instance, any date fields on the model are converted into actual date objects. Failed validation may leave the underlying model instance in an inconsistent state and therefore it's not recommended to reuse it.
ru: Процесс валидации изменяет объект модели переданный в конструктор ``ModelForm``. Например, поля даты модели преобразуют значения в объект даты. Ошибка валидации может оставить объект в неопределенном состоянии и лучше не использовать его в последующем коде.

source: Overriding the clean() method
ru: Переопределение метода clean()

source: You can override the ``clean()`` method on a model form to provide additional validation in the same way you can on a normal form.
ru: Вы можете переопределить метод ``clean()`` модели для того, чтобы обеспечить дополнительную проверку. Всё это аналогично работе с обычной формой.

source: A model form instance attached to a model object will contain an ``instance`` attribute that gives its methods access to that specific model instance.
ru: Экземпляр модельной формы, привязанный к объекту модели имеет атрибут ``instance``, через который методы модельной формы имеют доступ к соответствующему экземпляру модели.

source: The ``ModelForm.clean()`` method sets a flag that makes the :ref:`model validation <validating-objects>` step validate the uniqueness of model fields that are marked as ``unique``, ``unique_together`` or ``unique_for_date|month|year``.
ru: Метод ``ModelForm.clean()`` устанавливает флаг, который указывает :ref:`валидации модели <validating-objects>` провалидировать уникальность полей отмеченных ``unique``, ``unique_together`` или ``unique_for_date|month|year``.

source: If you would like to override the ``clean()`` method and maintain this validation, you must call the parent class's ``clean()`` method.
ru: Если вы хотите переопределить метод ``clean()``, вызовите метод ``clean()`` родительского класса.

source: Interaction with model validation
ru: Взаимодействие с механизмами модели

source: As part of the validation process, ``ModelForm`` will call the ``clean()`` method of each field on your model that has a corresponding field on your form. If you have excluded any model fields, validation will not be run on those fields. See the :doc:`form validation </ref/forms/validation>` documentation for more on how field cleaning and validation work.
ru: В процессе проверки данных ``ModelForm`` будет вызывать метод ``clean()`` каждого поля вашей модели, соответствующего полю формы. Для полей модели, которые были исключены из формы, проверка данных производиться не будет. Обратитесь к документации по :doc:`проверке форм </ref/forms/validation>` для получения информации о том, как работает проверка данных поля.

source: The model's ``clean()`` method will be called before any uniqueness checks are made. See :ref:`Validating objects <validating-objects>` for more information on the model's ``clean()`` hook.
ru: Метод модели ``clean()`` вызывается перед проверкой уникальности полей. Смотрите :ref:`валидацию объектов модели <validating-objects>`, чтобы узнать как работает ``clean()``.

source: Considerations regarding model's ``error_messages``
ru: Определение ``error_messages``

source: Error messages defined at the :attr:`form field <django.forms.Field.error_messages>` level or at the :ref:`form Meta <modelforms-overriding-default-fields>` level always take precedence over the error messages defined at the :attr:`model field <django.db.models.Field.error_messages>` level.
ru: Сообщения ошибки из :attr:`form field <django.forms.Field.error_messages>` или :ref:`form Meta <modelforms-overriding-default-fields>` имеют приоритет над сообщениями ошибок из :attr:`model field <django.db.models.Field.error_messages>`.

source: Error messages defined on :attr:`model fields <django.db.models.Field.error_messages>` are only used when the ``ValidationError`` is raised during the :ref:`model validation <validating-objects>` step and no corresponding error messages are defined at the form level.
ru: Ошибки из :attr:`model fields <django.db.models.Field.error_messages>` используются для ``ValidationError``, если ошибка была вызвана при :ref:`валидации модели <validating-objects>` и в форме не определенно сообщения для этой ошибки.

source: You can override the error messages from ``NON_FIELD_ERRORS`` raised by model validation by adding the :data:`~django.core.exceptions.NON_FIELD_ERRORS` key to the ``error_messages`` dictionary of the ``ModelForm``’s inner ``Meta`` class::
ru: Вы можете переопределить сообщения об ошибке для ``NON_FIELD_ERRORS``, который были вызваны при валидации модели, определив ключ :data:`~django.core.exceptions.NON_FIELD_ERRORS` в атрибут ``error_messages`` класса ``ModelForm.Meta``::

source: The ``save()`` method
ru: Метод ``save()``

source: Every ``ModelForm`` also has a ``save()`` method. This method creates and saves a database object from the data bound to the form. A subclass of ``ModelForm`` can accept an existing model instance as the keyword argument ``instance``; if this is supplied, ``save()`` will update that instance. If it's not supplied, ``save()`` will create a new instance of the specified model:
ru: Каждая форма, созданная с помощью ``ModelForm``, обладает методом ``save()``. Этот метод создаёт и сохраняет объект в базе данных, используя для этого данные, введённые в форму. Класс, унаследованный от ``ModelForm``, может принимать существующий экземпляр модели через именованный аргумент ``instance``. Если такой аргумент указан, то ``save()`` обновит переданную модель. В противном случае, ``save()`` создаст новый экземпляр указанной модели:

source: Note that if the form :ref:`hasn't been validated <validation-on-modelform>`, calling ``save()`` will do so by checking ``form.errors``. A ``ValueError`` will be raised if the data in the form doesn't validate -- i.e., if ``form.errors`` evaluates to ``True``.
ru: Обратите внимание, если форма :ref:`не была проверена <validation-on-modelform>`, вызов ``save()`` выполнит ее, обратившись к ``form.errors``. Если данные не верны, будет вызвано исключение ``ValueError`` -- то есть, если ``form.errors`` равно ``True``.

source: If an optional field doesn't appear in the form's data, the resulting model instance uses the model field :attr:`~django.db.models.Field.default`, if there is one, for that field. This behavior doesn't apply to fields that use :class:`~django.forms.CheckboxInput`, :class:`~django.forms.CheckboxSelectMultiple`, or :class:`~django.forms.SelectMultiple` (or any custom widget whose :meth:`~django.forms.Widget.value_omitted_from_data` method always returns ``False``) since an unchecked checkbox and unselected ``<select multiple>`` don't appear in the data of an HTML form submission. Use a custom form field or widget if you're designing an API and want the default fallback behavior for a field that uses one of these widgets.
ru: Если данные формы не содержат значение необязательного поля, полученный экземпляр модели будет использовать значение :attr:`~django.db.models.Field.default`, если такое указанно для поля. Такое поведение не используется для :class:`~django.forms.CheckboxInput`, :class:`~django.forms.CheckboxSelectMultiple` или :class:`~django.forms.SelectMultiple` (или любой другой виджет, метод :meth:`~django.forms.Widget.value_omitted_from_data` которого всегда возвращает ``False``) т.к. не отмеченный "чекбокс" или ``<select multiple>`` не передаются при отправке HTML формы. Используйте собственные виджеты и поля формы, если вы проектируете API и хотите, чтобы использовалось значение по умолчанию для полей с этими виджетами.

source: This ``save()`` method accepts an optional ``commit`` keyword argument, which accepts either ``True`` or ``False``. If you call ``save()`` with ``commit=False``, then it will return an object that hasn't yet been saved to the database. In this case, it's up to you to call ``save()`` on the resulting model instance. This is useful if you want to do custom processing on the object before saving it, or if you want to use one of the specialized :ref:`model saving options <ref-models-force-insert>`. ``commit`` is ``True`` by default.
ru: Метод ``save()`` принимает необязательный именованный аргумент ``commit``, который может иметь значения ``True`` или ``False``. При вызове ``save()`` с ``commit=False`` метод вернёт объект, который ещё не был сохранён в базе данных. В этом случае, вам самостоятельно придётся вызвать метод ``save()`` у полученного объекта. Это бывает полезно, когда требуется выполнить дополнительные действия над объектом до его сохранения или если вам требуется воспользоваться одним из :ref:`параметров сохранения модели <ref-models-force-insert>`. Атрибут ``commit`` по умолчанию имеет значение ``True``.

source: Another side effect of using ``commit=False`` is seen when your model has a many-to-many relation with another model. If your model has a many-to-many relation and you specify ``commit=False`` when you save a form, Django cannot immediately save the form data for the many-to-many relation. This is because it isn't possible to save many-to-many data for an instance until the instance exists in the database.
ru: Использование ``commit=False`` также полезно в случае, когда ваша модель имеет связь "многие-ко-многим" с другой моделью. Для такой модели, если метод ``save()`` вызван с аргументом ``commit=False``, то Django не может немедленно сохранить данные для такой связи, т.к. невозможно создать связи для объекта, который не сохранен в базе данных.

source: To work around this problem, every time you save a form using ``commit=False``, Django adds a ``save_m2m()`` method to your ``ModelForm`` subclass. After you've manually saved the instance produced by the form, you can invoke ``save_m2m()`` to save the many-to-many form data. For example:
ru: Чтобы решить эту задачу, каждый раз, когда вы сохраняете форму, указывая ``commit=False``, Django добавляет метод ``save_m2m()`` к вашему классу ``ModelForm``. После того, как вы вручную сохранили экземпляр формы, вы можете вызвать метод ``save_m2m()`` для сохранения данных, связанных через "многие-ко-многим". Например:

source: Calling ``save_m2m()`` is only required if you use ``save(commit=False)``. When you use a simple ``save()`` on a form, all data -- including many-to-many data -- is saved without the need for any additional method calls. For example:
ru: Вызов метода ``save_m2m()`` требуется только в случае, если вы используете ``save(commit=False)``. Если вы просто используете ``save()`` для формы, то все данные (включая связи "многие-ко-многим"), будут сохранены, не требуя для этого дополнительных действий. Например:

source: Other than the ``save()`` and ``save_m2m()`` methods, a ``ModelForm`` works exactly the same way as any other ``forms`` form. For example, the ``is_valid()`` method is used to check for validity, the ``is_multipart()`` method is used to determine whether a form requires multipart file upload (and hence whether ``request.FILES`` must be passed to the form), etc. See :ref:`binding-uploaded-files` for more information.
ru: Если не принимать во внимание методы ``save()`` и ``save_m2m()``, то ``ModelForm`` работает аналогично обычной ``Form``. Например, метод ``is_valid()`` используется для проверки данных, метод ``is_multipart()`` используется для определения загрузки файла (в этом случае ``request.FILES`` должен быть передан форме) и так далее. Обратитесь к документу :ref:`binding-uploaded-files` для получения подробностей.

source: Selecting the fields to use
ru: Указываем какие поля использовать

source: It is strongly recommended that you explicitly set all fields that should be edited in the form using the ``fields`` attribute. Failure to do so can easily lead to security problems when a form unexpectedly allows a user to set certain fields, especially when new fields are added to a model. Depending on how the form is rendered, the problem may not even be visible on the web page.
ru: Настоятельно рекомендуем явно указать все поля отображаемые в форме, используя параметр ``fields``. Иначе по ошибке, при добавлении нового поля в модель, можно позволить его редактировать пользователям и таким образом создать уязвимость. В зависимости от способа рендеринга формы, такая ошибка может быть не легко заметна на сайте.

source: The alternative approach would be to include all fields automatically, or blacklist only some. This fundamental approach is known to be much less secure and has led to serious exploits on major websites (e.g. `GitHub <https://github.com/blog/1068-public-key-security-vulnerability-and-mitigation>`_).
ru: Самый простой способ указать поля - автоматически добавить все или исключить определенные. Но такой способ не безопасен (например, случай на `GitHub <https://github.com/blog/1068-public-key-security-vulnerability-and-mitigation>`_).

source: There are, however, two shortcuts available for cases where you can guarantee these security concerns do not apply to you:
ru: Но если вы уверены в том, что делаете, вот как использовать этот подход:

source: Set the ``fields`` attribute to the special value ``'__all__'`` to indicate that all fields in the model should be used. For example::
ru: В параметре ``fields`` указать специальное значение ``'__all__'``, которое указывает использовать все поля модели. Например::

source: Set the ``exclude`` attribute of the ``ModelForm``’s inner ``Meta`` class to a list of fields to be excluded from the form.
ru: Используйте атрибут ``exclude`` внутреннего класса ``ModelForm.Meta``. Этот атрибут, если он указан, должен содержать список имён полей, которые не должны отображаться на форме.

source: Since the ``Author`` model has the 3 fields ``name``, ``title`` and ``birth_date``, this will result in the fields ``name`` and ``birth_date`` being present on the form.
ru: Так как модель ``Author`` содержит три поля: 'name', 'title ' и 'birth_date', то форма будут отображать поля ``name`` и ``birth_date``.

source: If either of these are used, the order the fields appear in the form will be the order the fields are defined in the model, with ``ManyToManyField`` instances appearing last.
ru: При использовании одного из этих способов, порядок полей в форме будет аналогичен порядку полей в модели, ``ManyToManyField`` поля будут в конце.

source: In addition, Django applies the following rule: if you set ``editable=False`` on the model field, *any* form created from the model via ``ModelForm`` will not include that field.
ru: Если поле модели содержит ``editable=False``, *каждая* форма, созданная по модели с помощью ``ModelForm``, не будет включать в себя это поле.

source: Any fields not included in a form by the above logic will not be set by the form's ``save()`` method. Also, if you manually add the excluded fields back to the form, they will not be initialized from the model instance.
ru: Поля, которые не определены в форме, не будут учитываться при вызове метода ``save()``. Также, если вы вручную добавите в форму исключенные поля, то они не будут заполняться из экземпляра модели.
