Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/topics/forms/modelforms.po
Languages: ru

source: Django will prevent any attempt to save an incomplete model, so if the model does not allow the missing fields to be empty, and does not provide a default value for the missing fields, any attempt to ``save()`` a ``ModelForm`` with missing fields will fail. To avoid this failure, you must instantiate your model with initial values for the missing, but required fields::
ru: Django будет препятствовать всем попыткам сохранить неполную модель. Таким образом, если модель требует заполнения определённых полей и для них не предоставлено значение по умолчанию, то сохранить форму для такой модели не получится. Для решения этой проблемы вам потребуется создать экземпляр такой модели, передав ему начальные значения для обязательных, но незаполненных полей::

source: Alternatively, you can use ``save(commit=False)`` and manually set any extra required fields::
ru: В качестве альтернативы, вы можете использовать ``save(commit=False)`` и вручную определить все необходимые поля::

source: See the `section on saving forms`_ for more details on using ``save(commit=False)``.
ru: Обратитесь к разделу `section on saving forms`_ для подробностей по использованию ``save(commit=False)``.

source: Overriding the default fields
ru: Переопределение стандартных типов полей или виджетов

source: The default field types, as described in the `Field types`_ table above, are sensible defaults. If you have a ``DateField`` in your model, chances are you'd want that to be represented as a ``DateField`` in your form. But ``ModelForm`` gives you the flexibility of changing the form field for a given model.
ru: Стандартные типы полей, описанные выше, имеют целесообразные настройки по умолчанию. Если ваша модель имеет поля типа ``DateField``, то скорее всего вы пожелаете, чтобы форма использовала поле ``DateField`` для его отображения. Но класс ``ModelForm`` представляет широкие возможности по управлению типами полей формы, а также виджетами для их представления.

source: To specify a custom widget for a field, use the ``widgets`` attribute of the inner ``Meta`` class. This should be a dictionary mapping field names to widget classes or instances.
ru: Для того, чтобы указать собственный виджет для поля, следует использовать атрибут ``widgets`` внутреннего класса ``Meta``. Его значением должен быть словарь, ключами которого являются имена полей, а значениями — классы или экземпляры виджетов.

source: For example, if you want the ``CharField`` for the ``name`` attribute of ``Author`` to be represented by a ``<textarea>`` instead of its default ``<input type="text">``, you can override the field's widget::
ru: Например, если необходимо использовать ``CharField`` для того, чтобы поле ``name`` модели ``Author`` было представлено в виде ``<textarea>`` вместо стандартного ``<input type="text">``, то вы можете переопределить виджет поля::

source: The ``widgets`` dictionary accepts either widget instances (e.g., ``Textarea(...)``) or classes (e.g., ``Textarea``).
ru: Ещё раз напомним, что аргумент ``widgets`` принимает словарь с экземплярами (т.е., ``Textarea(...)``) или классами (т.е., ``Textarea``) виджетов.

source: Similarly, you can specify the ``labels``, ``help_texts`` and ``error_messages`` attributes of the inner ``Meta`` class if you want to further customize a field.
ru: Аналогично можно переопределить параметры ``labels``, ``help_texts`` и ``error_messages`` указав в ``Meta``.

source: For example if you wanted to customize the wording of all user facing strings for the ``name`` field::
ru: Например, для переопределим параметры поля ``name``::

source: You can also specify ``field_classes`` to customize the type of fields instantiated by the form.
ru: Вы также можете указать ``field_classes``, чтобы настроить типы полей, которые будут использовать формой.

source: For example, if you wanted to use ``MySlugFormField`` for the ``slug`` field, you could do the following::
ru: Например, если вы хотите использовать ``MySlugFormField`` для поля ``slug``, вы можете сделать следующее::

source: Finally, if you want complete control over of a field -- including its type, validators, required, etc. -- you can do this by declaratively specifying fields like you would in a regular ``Form``.
ru: Если вы желаете продолжить настойку поля, включая его тип, метку и так далее, то вы можете декларативно указать поля, как это делается при использовании ``Form``.

source: If you want to specify a field's validators, you can do so by defining the field declaratively and setting its ``validators`` parameter::
ru: Чтобы переопределить валидаторы поля, укажите их в аргументе ``validators``::

source: When you explicitly instantiate a form field like this, it is important to understand how ``ModelForm`` and regular ``Form`` are related.
ru: Когда вы явно создаете поле формы, необходимо знать как связанны ``ModelForm`` и ``Form``.

source: ``ModelForm`` is a regular ``Form`` which can automatically generate certain fields. The fields that are automatically generated depend on the content of the ``Meta`` class and on which fields have already been defined declaratively. Basically, ``ModelForm`` will **only** generate fields that are **missing** from the form, or in other words, fields that weren't defined declaratively.
ru: ``ModelForm`` это дочерний класс ``Form``, который может автоматически создавать поля формы. При создании полей учитываются параметры класса ``Meta`` и явно определенные поля формы. ``ModelForm`` автоматически создаст **только** те поля, которые **отсутствуют** в форме.

source: Fields defined declaratively are left as-is, therefore any customizations made to ``Meta`` attributes such as ``widgets``, ``labels``, ``help_texts``, or ``error_messages`` are ignored; these only apply to fields that are generated automatically.
ru: Явно определенные в классе поля создаются как есть, параметры ``Meta``, такие как ``widgets``, ``labels``, ``help_texts`` или ``error_messages``, игнорируются, они учитываются только для создании дополнительных полей.

source: Similarly, fields defined declaratively do not draw their attributes like ``max_length`` or ``required`` from the corresponding model. If you want to maintain the behavior specified in the model, you must set the relevant arguments explicitly when declaring the form field.
ru: При явном создании поля, Django предполагает, что вы будете определять поведение формы в целом. Следовательно, стандартные атрибуты модели (такие как ``max_length`` или ``required``) не передаются полям формы. Если вам потребуется обеспечить поведение, определённое в модели, вам потребуется явно установить соответствующие аргументы при определении поля формы.

source: For example, if the ``Article`` model looks like this::
ru: Например, если модель ``Article`` выглядит так::

source: and you want to do some custom validation for ``headline``, while keeping the ``blank`` and ``help_text`` values as specified, you might define ``ArticleForm`` like this::
ru: и вы желаете выполнить свою проверку поля ``headline``, оставляя неизменными атрибуты ``blank`` и ``help_text``, вы можете определить ``ArticleForm`` следующим образом::

source: You must ensure that the type of the form field can be used to set the contents of the corresponding model field. When they are not compatible, you will get a ``ValueError`` as no implicit conversion takes place.
ru: Тип поля формы должен работать с типом значения соответствующего поля модели. Если они не соответствуют - вы получите ``ValueError``.

source: See the :doc:`form field documentation </ref/forms/fields>` for more information on fields and their arguments.
ru: Обратитесь к `документации на поля формы </ref/forms/fields>`_ для получения дополнительной информации о полях и их аргументах.

source: Enabling localization of fields
ru: Локализация в полях

source: By default, the fields in a ``ModelForm`` will not localize their data. To enable localization for fields, you can use the ``localized_fields`` attribute on the ``Meta`` class.
ru: По умолчанию поля в ``ModelForm`` не локализируют свои данные. Для локализации полей можно использовать параметр ``localized_fields`` класса ``Meta``.

source: If ``localized_fields`` is set to the special value ``'__all__'``, all fields will be localized.
ru: Если в ``localized_fields`` указать ``'__all__'``, будут локализированы все поля.

source: Form inheritance
ru: Наследование форм

source: As with basic forms, you can extend and reuse ``ModelForms`` by inheriting them. This is useful if you need to declare extra fields or extra methods on a parent class for use in a number of forms derived from models. For example, using the previous ``ArticleForm`` class::
ru: Аналогично обычным формам, вы можете наследоваться ``ModelForm``. Это удобно когда надо добавить дополнительные поля или методы к базовому классу и использовать результат для создания других модельных форм. Например, для класса ``ArticleForm``::

source: This creates a form that behaves identically to ``ArticleForm``, except there's some extra validation and cleaning for the ``pub_date`` field.
ru: Мы создали форму, аналогичную ``ArticleForm``, добавив дополнительную проверку и обработку для поля ``pub_date``.

source: You can also subclass the parent's ``Meta`` inner class if you want to change the ``Meta.fields`` or ``Meta.exclude`` lists::
ru: Вы также можете наследовать внутренний класс ``Meta``, если требуется внести изменения в списки ``Meta.fields`` или ``Meta.exclude``::

source: This adds the extra method from the ``EnhancedArticleForm`` and modifies the original ``ArticleForm.Meta`` to remove one field.
ru: Здесь мы добавили метод из ``EnhancedArticleForm`` и изменили оригинальный ``ArticleForm.Meta``, убрав одно поле.

source: There are a couple of things to note, however.
ru: Тем не менее, надо уточнить несколько моментов.

source: Normal Python name resolution rules apply. If you have multiple base classes that declare a ``Meta`` inner class, only the first one will be used. This means the child's ``Meta``, if it exists, otherwise the ``Meta`` of the first parent, etc.
ru: Применяются стандартные правила языка Python для разрешения имён. Если ваш класс унаследован от нескольких базовых классов, которые обладают внутренним классом ``Meta``, и для него не определён собственный ``Meta`` класс, то этот класс будет унаследован из первого базового.

source: It's possible to inherit from both ``Form`` and ``ModelForm`` simultaneously, however, you must ensure that ``ModelForm`` appears first in the MRO. This is because these classes rely on different metaclasses and a class can only have one metaclass.
ru: Можно унаследоваться одновременно от ``Form`` и ``ModelForm``, однако, ``ModelForm`` должен быть первым в MRO. Т.к. эти классы используют разные мета-классы, а класс может использовать только один метакласс.

source: It's possible to declaratively remove a ``Field`` inherited from a parent class by setting the name to be ``None`` on the subclass.
ru: Можно декларативно удалить ``Field`` родительского класса, указав в названии ``None`` в дочернем классе.

source: You can only use this technique to opt out from a field defined declaratively by a parent class; it won't prevent the ``ModelForm`` metaclass from generating a default field. To opt-out from default fields, see :ref:`modelforms-selecting-fields`.
ru: Таким способом можно исключить только те поля, которые были декларативно описаны в родительском классе. Поле ``ModelForm`` будет в любом случае созданы мета-классом. Чтобы переопределить их, используйте метод описанный в :ref:`modelforms-selecting-fields`.

source: Providing initial values
ru: Передача начальных значений

source: As with regular forms, it's possible to specify initial data for forms by specifying an ``initial`` parameter when instantiating the form. Initial values provided this way will override both initial values from the form field and values from an attached model instance. For example::
ru: Аналогично обычным формам, есть возможность указать начальные данные, передав параметр ``initial`` при создании экземпляра формы. Предоставленные таким образом начальные данные переопределят начальные данные самих полей формы и значения из подключенного экземпляра модели. Например::

source: ModelForm factory function
ru: Функция-фабрика модельных форм

source: You can create forms from a given model using the standalone function :func:`~django.forms.models.modelform_factory`, instead of using a class definition. This may be more convenient if you do not have many customizations to make::
ru: Вы можете создать форму по модели используя функцию :func:`~django.forms.models.modelform_factory`, вместо создания класса. В некоторых случаях это более удобный способ::

source: This can also be used to make simple modifications to existing forms, for example by specifying the widgets to be used for a given field::
ru: Можно указать определенные настройки для формы, например отображаемые поля::

source: The fields to include can be specified using the ``fields`` and ``exclude`` keyword arguments, or the corresponding attributes on the ``ModelForm`` inner ``Meta`` class. Please see the ``ModelForm`` :ref:`modelforms-selecting-fields` documentation.
ru: Указать используемые поля можно с помощью аргументов ``fields`` и ``exclude``. Смотрите описание ``ModelForm`` :ref:`modelforms-selecting-fields`.

source: ... or enable localization for specific fields::
ru: ... или включить локализацию для полей::

source: Model formsets
ru: Наборы модельных форм

source: Like :doc:`regular formsets </topics/forms/formsets>`, Django provides a couple of enhanced formset classes that make it easy to work with Django models. Let's reuse the ``Author`` model from above::
ru: Аналогично :doc:`наборам обычных форм </topics/forms/formsets>`, Django представляет ряд расширенных классов наборов форм, которые упрощают взаимодействие с моделями Django. Давайте воспользуемся моделью ``Author``::

source: Using ``fields`` restricts the formset to use only the given fields. Alternatively, you can take an "opt-out" approach, specifying which fields to exclude::
ru: Использование аргумента``fields`` ограничивает набор форм указанным списком полей. В качестве альтернативы можно определить список полей, которые не должны отображаться на формах. Сделать это можно с помощью аргумента ``exclude``::

source: This will create a formset that is capable of working with the data associated with the ``Author`` model. It works just like a regular formset::
ru: Этот код создаст набор форм, которые будут работать с данными модели ``Author``. По функционалу набор модельных форм аналогичен набору обычных форм::

source: :func:`~django.forms.models.modelformset_factory` uses :func:`~django.forms.formsets.formset_factory` to generate formsets. This means that a model formset is just an extension of a basic formset that knows how to interact with a particular model.
ru: :func:`~django.forms.models.modelformset_factory` использует фабрику обычных форм :func:`~django.forms.formsets.formset_factory` для создания набора форм. Это означает, что функционал модельных форм является надстройкой над функционалом набора обычных форм.

source: Changing the queryset
ru: Изменение выборки

source: By default, when you create a formset from a model, the formset will use a queryset that includes all objects in the model (e.g., ``Author.objects.all()``). You can override this behavior by using the ``queryset`` argument::
ru: По умолчанию, при создании набора модельных форм используется выборка, которая содержит все объекты модели (т.е., ``Author.objects.all()``). Такое поведение можно скорректировать, используя аргумент ``queryset``::

source: Alternatively, you can create a subclass that sets ``self.queryset`` in ``__init__``::
ru: Также вы можете унаследоваться от класса набора модельных форм и определить ``self.queryset`` в конструкторе, указав необходимые параметры выборки::

source: Then, pass your ``BaseAuthorFormSet`` class to the factory function::
ru: Теперь передадим ваш класс ``BaseAuthorFormSet`` в функцию фабрики::

source: If you want to return a formset that doesn't include *any* pre-existing instances of the model, you can specify an empty QuerySet::
ru: Если требуется создать пустой набор форм, т.е. который не включает *ни одну* существующую модель, то передайте в набор пустую выборку::

source: Changing the form
ru: Изменение формы

source: By default, when you use ``modelformset_factory``, a model form will be created using :func:`~django.forms.models.modelform_factory`. Often, it can be useful to specify a custom model form. For example, you can create a custom model form that has custom validation::
ru: По умолчанию, когда вы используете ``modelformset_factory``, форма будет создана с помощью :func:`~django.forms.models.modelform_factory`. Часто необходимо указать свою форму. Например, форму с собственной валидацией::

source: Then, pass your model form to the factory function::
ru: Для этого передайте вашу форму в функцию фабрики::

source: It is not always necessary to define a custom model form. The ``modelformset_factory`` function has several arguments which are passed through to ``modelform_factory``, which are described below.
ru: Вам не обязательно создавать свою форму. Функция ``modelformset_factory`` принимает различный аргументы, которые будут переданы в ``modelform_factory``.

source: Specifying widgets to use in the form with ``widgets``
ru: Указываем виджеты полей с помощью ``widgets``

source: Using the ``widgets`` parameter, you can specify a dictionary of values to customize the ``ModelForm``’s widget class for a particular field. This works the same way as the ``widgets`` dictionary on the inner ``Meta`` class of a ``ModelForm`` works::
ru: Аргумент ``widgets`` позволяет указать словарь переопределяющий виджеты для полей ``ModelForm``. Он работает аналогично параметру ``widgets`` класса ``Meta`` ``ModelForm``::

source: Enabling localization for fields with ``localized_fields``
ru: Включить локализацию для полей с помощью ``localized_fields``

source: Using the ``localized_fields`` parameter, you can enable localization for fields in the form.
ru: Используя ``localized_fields`` можно включить локализацию для полей формы.

source: As with regular formsets, it's possible to :ref:`specify initial data <formsets-initial-data>` for forms in the formset by specifying an ``initial`` parameter when instantiating the model formset class returned by :func:`~django.forms.models.modelformset_factory`. However, with model formsets, the initial values only apply to extra forms, those that aren't attached to an existing model instance. If the extra forms with initial data aren't changed by the user, they won't be validated or saved.
ru: Аналогично набору обычных форм, есть возможность :ref:`указать начальные данные <formsets-initial-data>` для форм набора, передав параметр ``initial`` при создании экземпляра набора, возвращенного :func:`~django.forms.models.modelformset_factory`. Тем не менее, в случае набора модельных форм, начальными значениями заполняются только пустые, т.е. новые, формы.

source: Saving objects in the formset
ru: Сохранение объектов набора форм

source: As with a ``ModelForm``, you can save the data as a model object. This is done with the formset's ``save()`` method:
ru: Аналогично ``ModelForm``, вы можете сохранять данные в модели. Для этого надо использовать метод ``save()`` набора форм:

source: The ``save()`` method returns the instances that have been saved to the database. If a given instance's data didn't change in the bound data, the instance won't be saved to the database and won't be included in the return value (``instances``, in the above example).
ru: Метод ``save()`` возвращает экземпляры объектов, которые были сохранены в базе данных. Те объекты, данные которых не изменились, не сохраняются в базе данных и не отображаются в возвращаемом значении (``instances`` из предыдущего примера).

source: When fields are missing from the form (for example because they have been excluded), these fields will not be set by the ``save()`` method. You can find more information about this restriction, which also holds for regular ``ModelForms``, in `Selecting the fields to use`_.
ru: Когда форма содержит не все поля модели (например, потому что некоторые из них были явно исключены), то отсутствующие поля не будут сохранены через метод ``save()``. Подробнее об этом ограничении модельных форм написано в :ref:`Указываем какие поля использовать <modelforms-selecting-fields>`.

source: Pass ``commit=False`` to return the unsaved model instances:
ru: Передайте ``commit=False``, чтобы получить экземпляры моделей, которые ещё не сохранены в базе данных:

source: This gives you the ability to attach data to the instances before saving them to the database. If your formset contains a ``ManyToManyField``, you'll also need to call ``formset.save_m2m()`` to ensure the many-to-many relationships are saved properly.
ru: Это позволяет вам добавлять данные к экземплярам моделей перед их сохранением в базе данных. Если ваш набор форм содержит ``ManyToManyField``, вам также потребуется вызвать метод ``formset.save_m2m()`` для того, чтобы обеспечить сохранение связей «многие-ко-многим».

source: After calling ``save()``, your model formset will have three new attributes containing the formset's changes:
ru: После вызова ``save()``, в класс набора форм будут добавлены атрибуты, содержащие все изменения:

source: Limiting the number of editable objects
ru: Ограничение количества редактируемых объектов

source: As with regular formsets, you can use the ``max_num`` and ``extra`` parameters to :func:`~django.forms.models.modelformset_factory` to limit the number of extra forms displayed.
ru: Как и в случае набора обычных форм, вы можете использовать аргументы ``max_num`` и ``extra`` функции :func:`~django.forms.models.modelformset_factory` для ограничения числа дополнительно отображаемых форм.

source: ``max_num`` does not prevent existing objects from being displayed::
ru: Аргумент ``max_num`` не препятствует отображению существующих объектов::

source: Also, ``extra=0`` doesn't prevent creation of new model instances as you can :ref:`add additional forms with JavaScript <understanding-the-managementform>` or just send additional POST data. Formsets `don't yet provide functionality <https://code.djangoproject.com/ticket/26142>`_ for an "edit only" view that prevents creation of new instances.
ru: Также ``extra=0`` не предотвращает создание нового экземпляра формы т.к. вы можете :ref:`добавить форму с помощью JavaScript <understanding-the-managementform>` или просто отправить дополнительные POST данные. Набор форм `пока не предоставляет возможности <https://code.djangoproject.com/ticket/26142>`_ создавать представления "только для редактирования", которые не позволяют создавать новые объекты.

source: If the value of ``max_num`` is greater than the number of existing related objects, up to ``extra`` additional blank forms will be added to the formset, so long as the total number of forms does not exceed ``max_num``::
ru: Если значение ``max_num`` больше чем количество существующих объектов, то к будет добавлено ``extra`` пустых форм к набору. Так будет происходить до достижения максимального количества форм, ограниченного параметром ``max_num``::

source: A ``max_num`` value of ``None`` (the default) puts a high limit on the number of forms displayed (1000). In practice this is equivalent to no limit.
ru: Присвоение ``max_num`` значения ``None`` (по умолчанию) устанавливает ограничение на количество отображаемых набором форм равное 1000. На практике это аналогично безлимитному количеству.

source: Using a model formset in a view
ru: Использование набора модельных форм в представлении
