Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/topics/forms/modelforms.po
Languages: ru

source: Model formsets are very similar to formsets. Let's say we want to present a formset to edit ``Author`` model instances::
ru: Наборы модельных форм во многом похожи на наборы обычных форм. Для отображения набора форм для редактирования экземпляров модели ``Author``::

source: As you can see, the view logic of a model formset isn't drastically different than that of a "normal" formset. The only difference is that we call ``formset.save()`` to save the data into the database. (This was described above, in :ref:`saving-objects-in-the-formset`.)
ru: Как вы можете видеть, логика представления не сильно отличается отличается логики обычного набора. Отличием является вызов ``formset.save()`` для сохранения данных. (Это было описано ранее в :ref:`saving-objects-in-the-formset`.)

source: Overriding ``clean()`` on a ``ModelFormSet``
ru: Переопределение ``clean()`` у ``ModelFormSet``

source: Just like with ``ModelForms``, by default the ``clean()`` method of a ``ModelFormSet`` will validate that none of the items in the formset violate the unique constraints on your model (either ``unique``, ``unique_together`` or ``unique_for_date|month|year``). If you want to override the ``clean()`` method on a ``ModelFormSet`` and maintain this validation, you must call the parent class's ``clean`` method::
ru: Подобно ``ModelForms``, по умолчанию метод ``clean()`` класса ``ModelFormSet`` будет проверять все данные на нарушение ограничений уникальности, определённых в вашей модели (``unique``, ``unique_together`` или ``unique_for_date|month|year``). Желая сохранить данный функционал при переопределении метода ``clean()``, следует вызывать метод ``clean()`` базового класса::

source: Also note that by the time you reach this step, individual model instances have already been created for each ``Form``. Modifying a value in ``form.cleaned_data`` is not sufficient to affect the saved value. If you wish to modify a value in ``ModelFormSet.clean()`` you must modify ``form.instance``::
ru: На этом этапе уже будут созданы экземпляры модели для каждой формы. Поменяв ``form.cleaned_data``, вы не поменяете сохраняемые значения. Для этого в ``ModelFormSet.clean()`` необходимо изменить ``form.instance``::

source: Using a custom queryset
ru: Использование собственной выборки

source: As stated earlier, you can override the default queryset used by the model formset::
ru: Как было сказано ранее, в можете переопределить стандартную выборку, которая используется набором модельных форм::

source: Note that we pass the ``queryset`` argument in both the ``POST`` and ``GET`` cases in this example.
ru: Следует отметить, что мы передаём аргумент ``queryset`` в обе ветки ``POST`` и ``GET`` в этом примере.

source: Using the formset in the template
ru: Использование набора форм в шаблоне

source: There are three ways to render a formset in a Django template.
ru: Существует три способа отображения набора форм в шаблоне Django.

source: First, you can let the formset do most of the work::
ru: Во-первых, вы можете позволить набору форм самому сделать всю работу::

source: Second, you can manually render the formset, but let the form deal with itself::
ru: Во-вторых, в можете вручную вывести набор форм, но позволить его формам отображаться самостоятельно::

source: When you manually render the forms yourself, be sure to render the management form as shown above. See the :ref:`management form documentation <understanding-the-managementform>`.
ru: При самостоятельном отображении форм, не забудьте отобразить техническую форму, как было показано выше. Обратитесь к документации на :ref:`технические формы <understanding-the-managementform>`.

source: Third, you can manually render each field::
ru: В-третьих, вы можете вывести все поля::

source: If you opt to use this third method and you don't iterate over the fields with a ``{% for %}`` loop, you'll need to render the primary key field. For example, if you were rendering the ``name`` and ``age`` fields of a model::
ru: Если вы предпочтёте третий способ и не будете использовать ``{% for %}`` для итерации по полям, то вам понадобится вывести поле для первичного ключа. Рассмотрим случай, когда требуется вывести поля ``name`` и ``age`` модели::

source: Notice how we need to explicitly render ``{{ form.id }}``. This ensures that the model formset, in the ``POST`` case, will work correctly. (This example assumes a primary key named ``id``. If you've explicitly defined your own primary key that isn't called ``id``, make sure it gets rendered.)
ru: Обратите внимание на то, как мы явно выводим ``{{ form.id }}``. Это гарантирует, что набор модельных форм, в случае ``POST``, будет работать правильно. (Этот пример предполагает, что первичный ключ имеет имя ``id``. Если вы изменили имя первичного ключа, то учтите это в данном примере.)

source: Inline formsets
ru: Встраиваемые наборы форм

source: Inline formsets is a small abstraction layer on top of model formsets. These simplify the case of working with related objects via a foreign key. Suppose you have these two models::
ru: Встраиваемые наборы форм являются небольшим абстрактным слоем над набором модельных форм. Они упрощают работу со связанными через внешний ключ объектами. Предположим, у вас есть следующие две модели::

source: If you want to create a formset that allows you to edit books belonging to a particular author, you could do this::
ru: Если вам требуется создать набор форм для редактирования книг, принадлежащих определенному автору, вы можете сделать следующее::

source: :func:`~django.forms.models.inlineformset_factory` uses :func:`~django.forms.models.modelformset_factory` and marks ``can_delete=True``.
ru: :func:`~django.forms.models.inlineformset_factory` использует :func:`~django.forms.models.modelformset_factory` и устанавливает ``can_delete=True``.

source: :ref:`Manually rendered can_delete and can_order <manually-rendered-can-delete-and-can-order>`.
ru: :ref:`Ручное управление can_delete и can_order <manually-rendered-can-delete-and-can-order>`.

source: Overriding methods on an ``InlineFormSet``
ru: Переопределение методов в ``InlineFormSet``

source: When overriding methods on ``InlineFormSet``, you should subclass :class:`~models.BaseInlineFormSet` rather than :class:`~models.BaseModelFormSet`.
ru: Переопределяя методы ``InlineFormSet``, лучше наследоваться от :class:`~models.BaseInlineFormSet`, чем от :class:`~models.BaseModelFormSet`.

source: For example, if you want to override ``clean()``::
ru: Например, если вы хотите переопределить ``clean()``::

source: See also :ref:`model-formsets-overriding-clean`.
ru: Смотрите также :ref:`model-formsets-overriding-clean`.

source: Then when you create your inline formset, pass in the optional argument ``formset``::
ru: Потом при создании набора форм укажите аргумент ``formset``::

source: More than one foreign key to the same model
ru: Более одного внешнего ключа к одной модели

source: If your model contains more than one foreign key to the same model, you'll need to resolve the ambiguity manually using ``fk_name``. For example, consider the following model::
ru: Если ваша модель имеет больше одного внешнего ключа на одну и ту же модель, вам следует разрешить эту путаницу, указав ``fk_name``. Например, рассмотрим следующую модель::

source: To resolve this, you can use ``fk_name`` to :func:`~django.forms.models.inlineformset_factory`::
ru: Чтобы разрешить эту неопределенность, вы можете использовать ``fk_name`` в :func:`~django.forms.models.inlineformset_factory`::

source: Using an inline formset in a view
ru: Использование вторичного набора форм в представлении

source: You may want to provide a view that allows a user to edit the related objects of a model. Here's how you can do that::
ru: Вам может понадобиться создать представление, которое позволит пользователю редактировать связанные объекты модели. Вот как это можно сделать::

source: Notice how we pass ``instance`` in both the ``POST`` and ``GET`` cases.
ru: Следует отметить, что мы передаём ``instance`` в обоих (``POST`` и ``GET``) случаях.

source: Specifying widgets to use in the inline form
ru: Определение виджетов используемых в наборе форм

source: ``inlineformset_factory`` uses ``modelformset_factory`` and passes most of its arguments to ``modelformset_factory``. This means you can use the ``widgets`` parameter in much the same way as passing it to ``modelformset_factory``. See `Specifying widgets to use in the form with widgets`_ above.
ru: ``inlineformset_factory`` использует ``modelformset_factory`` и передает большинство аргументов в ``modelformset_factory``. Вы можете использовать параметр ``widgets``как и для ``modelformset_factory``. Смотрите `Specifying widgets to use in the form with widgets`_ выше.
