Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/faq/admin.po
Languages: ru

source: FAQ: The admin
ru: FAQ: Админка

source: I can't log in. When I enter a valid username and password, it just brings up the login page again, with no error messages.
ru: Я не могу войти. Когда я ввожу правильные логин и пароль, меня снова перенаправляет на страницу входа без каких-либо сообщений об ошибках.

source: I can't log in. When I enter a valid username and password, it brings up the login page again, with a "Please enter a correct username and password" error.
ru: Я не могу войти. Когда я ввожу корректные логин и пароль, меня перенаправляет на страницу входа с ошибкой "Пожалуйста, укажите правильные логин и пароль".

source: If you're sure your username and password are correct, make sure your user account has :attr:`~django.contrib.auth.models.User.is_active` and :attr:`~django.contrib.auth.models.User.is_staff` set to True. The admin site only allows access to users with those two fields both set to True.
ru: Если вы всё же уверены, что логин и пароль правильные, то проверьте, что ваш аккаунт активен (:attr:`~django.contrib.auth.models.User.is_active`) и имеет нужные привилегии (:attr:`~django.contrib.auth.models.User.is_staff` = True). Входить в админку могут только пользователи, у которых эти два поля установлены в True.

source: How do I automatically set a field's value to the user who last edited the object in the admin?
ru: Как я могу автоматически устанавливать значение поля для пользователя, который последним редактировал объект?

source: The :class:`~django.contrib.admin.ModelAdmin` class provides customization hooks that allow you to transform an object as it saved, using details from the request. By extracting the current user from the request, and customizing the :meth:`~django.contrib.admin.ModelAdmin.save_model` hook, you can update an object to reflect the user that edited it. See :ref:`the documentation on ModelAdmin methods <model-admin-methods>` for an example.
ru: Класс :class:`~django.contrib.admin.ModelAdmin` позволяет управлять сохранением объекта, используя информацию из запроса. Получив оттуда текущего пользователя и изменив метод :meth:`~django.contrib.admin.ModelAdmin.save_model`, вы можете отредактировать поля объекта нужным образом. Подробнее можно посмотреть в :ref:`the documentation on ModelAdmin methods <model-admin-methods>`.

source: How do I limit admin access so that objects can only be edited by the users who created them?
ru: Как запретить редактировать записи чужих пользователей?

source: The :class:`~django.contrib.admin.ModelAdmin` class also provides customization hooks that allow you to control the visibility and editability of objects in the admin. Using the same trick of extracting the user from the request, the :meth:`~django.contrib.admin.ModelAdmin.get_queryset` and :meth:`~django.contrib.admin.ModelAdmin.has_change_permission` can be used to control the visibility and editability of objects in the admin.
ru: Класс :class:`~django.contrib.admin.ModelAdmin` предоставляет настройки, которые управляют видимостью и возможностью редактировать объекты в админке. Используя их и получая пользователя из запроса, :meth:`~django.contrib.admin.ModelAdmin.get_queryse` и :meth:`~django.contrib.admin.ModelAdmin.has_change_permission` могут быть использованы для обеспечения нужного доступа.

source: My admin-site CSS and images showed up fine using the development server, but they're not displaying when using mod_wsgi.
ru: CSS и картинки для админки не подключаются через mod_wsgi, однако на сервере разработки всё выглядит отлично.

source: See :ref:`serving the admin files <serving-the-admin-files>` in the "How to use Django with mod_wsgi" documentation.
ru: Смотри :ref:`serving the admin files <serving-the-admin-files>` в разделе "How to use Django with mod_wsgi".

source: My "list_filter" contains a ManyToManyField, but the filter doesn't display.
ru: Фильтр "list_filter" содержит отношение многие-ко-многим, но он не показывается.

source: Django won't bother displaying the filter for a ``ManyToManyField`` if there are fewer than two related objects.
ru: Django не будет отображать фильтр ``ManyToManyField``, если есть менее двух связанных объектов.

source: For example, if your :attr:`~django.contrib.admin.ModelAdmin.list_filter` includes :doc:`sites </ref/contrib/sites>`, and there's only one site in your database, it won't display a "Site" filter. In that case, filtering by site would be meaningless.
ru: Например, если :attr:`~django.contrib.admin.ModelAdmin.list_filter` включает в себя :doc:`sites </ref/contrib/sites>`, и есть только один сайт в базе данных, то фильтра "Site" вы не увидите, так как в этом случае он будет бесполезен.

source: Some objects aren't appearing in the admin.
ru: Некоторые объекты не появляются в админке.

source: Inconsistent row counts may be caused by missing foreign key values or a foreign key field incorrectly set to :attr:`null=False <django.db.models.Field.null>`. If you have a record with a :class:`~django.db.models.ForeignKey` pointing to a non-existent object and that foreign key is included is :attr:`~django.contrib.admin.ModelAdmin.list_display`, the record will not be shown in the admin changelist because the Django model is declaring an integrity constraint that is not implemented at the database level.
ru: Неверное количество строк может быть вызвано отсутствием значения для внешнего ключа или его неверной установкой через атрибут :attr:`null=False <django.db.models.Field.null>`. Если у вас есть запись с классом :class:`~django.db.models.ForeignKey`, указывающим на несуществующий объект, и этот ключ включён в список :attr:`~django.contrib.admin.ModelAdmin.list_display`, то запись может не показываться потому что модель Django не может найти соответствия на уровне базы данных.

source: How can I customize the functionality of the admin interface?
ru: Как я могу изменить функциональность интерфейса администратора?

source: You've got several options. If you want to piggyback on top of an add/change form that Django automatically generates, you can attach arbitrary JavaScript modules to the page via the model's class Admin :ref:`js parameter <modeladmin-asset-definitions>`. That parameter is a list of URLs, as strings, pointing to JavaScript modules that will be included within the admin form via a ``<script>`` tag.
ru: У вас есть несколько настроек. Если вам нужна наверху комбинация из форм добавить/изменить, которые Django генерирует, то вы можете подключить JavaScript модуль через админ-класс модели, указав параметр :ref:`js parameter <modeladmin-asset-definitions>`. В нём содержится список адресов js модулей, которые будут подключены через тег ``<script>``.

source: If you want more flexibility than simply tweaking the auto-generated forms, feel free to write custom views for the admin. The admin is powered by Django itself, and you can write custom views that hook into the authentication system, check permissions and do whatever else they need to do.
ru: Если вам нужно нечто большее, чем правка автоматически создаваемых форм, то вы можете написать собственное представление для админки. То, что идёт в комплекте с Django, легко переопределяется самописными модулями, например, система аутентификации и проверки прав пользователей или что-либо ещё.

source: If you want to customize the look-and-feel of the admin interface, read the next question.
ru: Если вы хотите изменить внешний вид админки, то ознакомьтесь со следующими частыми вопросами.

source: The dynamically-generated admin site is ugly! How can I change it?
ru: Сгенерированная админка ужасна! Как её поменять?

source: We like it, but if you don't agree, you can modify the admin site's presentation by editing the CSS stylesheet and/or associated image files. The site is built using semantic HTML and plenty of CSS hooks, so any changes you'd like to make should be possible by editing the stylesheet.
ru: А нам она нравится, но если вы не согласны с нами, то можете изменить CSS и картинки, которые к ней относятся. Сайт построен на семантическом HTML и большом количестве CSS хуков, так что изменение внешнего вида должно свестись только к изменению таблиц стилей.

source: What browsers are supported for using the admin?
ru: Какие браузеры поддерживаются админкой?

source: The admin provides a fully-functional experience to `YUI's A-grade`_ browsers, with the notable exception of IE6, which is not supported.
ru: Поддерживаются все браузеры из `YUI's A-grade`_ за исключением IE6.

source: There *may* be minor stylistic differences between supported browsers—for example, some browsers may not support rounded corners. These are considered acceptable variations in rendering.
ru: Между отображениями в разных браузерах *могут быть* небольшие стилистические различия. Например, некоторые браузеры могут не поддерживать скруглённые уголки. Это считается приемлемыми различиями в отображении.
