Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/faq/general.po
Languages: ru

source: FAQ: General
ru: FAQ: Общие вопросы

source: Why does this project exist?
ru: Почему существует этот проект?

source: Django grew from a very practical need: World Online, a newspaper Web operation, is responsible for building intensive Web applications on journalism deadlines. In the fast-paced newsroom, World Online often has only a matter of hours to take a complicated Web application from concept to public launch.
ru: Появление Django было вызвано вполне конкретными потребностями - новостной компании World Online были необходимы инструменты разработки высоконагруженных веб-приложений в сфере журналистики. Время, отводимое на разработку и запуск сложных веб-приложений в условиях стремительно меняющегося новостного пространства, зачастую измеряется несколькими часами.

source: At the same time, the World Online Web developers have consistently been perfectionists when it comes to following best practices of Web development.
ru: Вместе с этим разработчики из компании World Online традиционно были сторонниками использования передовых технологий веб-разработки.

source: In fall 2003, the World Online developers (Adrian Holovaty and Simon Willison) ditched PHP and began using Python to develop its websites. As they built intensive, richly interactive sites such as Lawrence.com, they began to extract a generic Web development framework that let them build Web applications more and more quickly. They tweaked this framework constantly, adding improvements over two years.
ru: Осенью 2003 года Адриан Холоватый (Adrian Holovaty) и Саймон Уиллисон (Simon Willison), работавшие в то время в компании World Online, прекращают использование PHP и переходят на Python для разработки сайтов. По мере создания высоконагруженных и интерактивных сайтов, таких как Lawrence.com, начала формироваться общая платформа (фреймворк), позволяющая тратить все меньшее количество времени на разработку веб-приложений. На протяжении двух последующих лет разработчики непрерывно совершенствовали эту платформу.

source: In summer 2005, World Online decided to open-source the resulting software, Django. Django would not be possible without a whole host of open-source projects -- `Apache`_, `Python`_, and `PostgreSQL`_ to name a few -- and we're thrilled to be able to give something back to the open-source community.
ru: Летом 2005 года компания World Online решила выпустить разработанный фреймворк в качестве проекта с открытыми исходными кодами, получившего название Django. Создание Django было бы невозможным без использования ряда других свободных проектов, таких как `Apache <http://httpd.apache.org/>`_, `Python <http://www.python.org/>`_, `PostgreSQL <http://www.postgresql.org/>`_ и др. Нам очень приятно осознание того, что мы вносим свой вклад в движение open-source.

source: What does "Django" mean, and how do you pronounce it?
ru: Что означает название "Django" и как оно произносится?

source: Django is named after `Django Reinhardt`_, a jazz manouche guitarist from the 1930s to early 1950s. To this day, he's considered one of the best guitarists of all time.
ru: Фреймворк получил свое название в честь музыканта `Джанго Рейнхардта <http://ru.wikipedia.org/wiki/Django_Reinhardt>`_ (Django Reinhardt), представителя так называемого "цыганского джаза". Расцвет карьеры Рейнхардта пришелся на период с тридцатых по начало пятидесятых годов двадцатого века. В наше время он считается одним из лучших гитаристов в истории.

source: Listen to his music. You'll like it.
ru: Послушайте его музыку. Вам понравится.

source: Django is pronounced **JANG**-oh. Rhymes with FANG-oh. The "D" is silent.
ru: Название фреймворка Django произносится **ДЖЭНГО**

source: We've also recorded an `audio clip of the pronunciation`_.
ru: Вы также можете `услышать, как это произносится <http://red-bean.com/~adrian/django_pronunciation.mp3>`_.

source: Is Django stable?
ru: Надежен ли Django?

source: Yes, it's quite stable. Companies like Disqus, Instagram, Pinterest, and Mozilla have been using Django for many years. Sites built on Django have weathered traffic spikes of over 50 thousand hits per second.
ru: Да. Этот фреймворк достаточно надежен. Компании, такие как Disqus, Instagram, Pinterest и Mozilla, использует Django уже на протяжении нескольких лет. Сайты, созданные на основе Django, выдерживают нагрузку, превышающую 50 тысяч запросов в секунду.

source: Does Django scale?
ru: Масштабируем ли Django?

source: Yes. Compared to development time, hardware is cheap, and so Django is designed to take advantage of as much hardware as you can throw at it.
ru: Да. Аппаратное обеспечение стоит относительно дешево по сравнению с затратами времени, требуемого на разработку продукта. По этой причине Django был разработан с целью повышения эффективности использования всех имеющихся в вашем распоряжении аппаратных средств.

source: Django uses a "shared-nothing" architecture, which means you can add hardware at any level -- database servers, caching servers or Web/application servers.
ru: В Django используется так называемая "неразделяемая" архитектура (англ. shared-nothing), то есть архитектура без совместно используемых ресурсов, которая позволяет добавлять аппаратное обеспечение на любом уровне - будь то сервера баз данных, сервера кэширования, сервера приложений, веб-сервера и т.д.

source: The framework cleanly separates components such as its database layer and application layer. And it ships with a simple-yet-powerful :doc:`cache framework </topics/cache>`.
ru: Фреймворк четко разделяет уровень работы с базами данных и уровень приложений. Также в нем используется простая, но эффективная :doc:`система кэширования </topics/cache>`.

source: Who's behind this?
ru: Кто за этим стоит?

source: Django was originally developed at World Online, the Web department of a newspaper in Lawrence, Kansas, USA. Django's now run by an international `team of volunteers <https://www.djangoproject.com/foundation/teams/>`_.
ru: Изначально Django был разработан компанией World Online, веб-подразделением американского новостного издания, располагающегося в г. Лоуренс, шт. Канзас, США. Сейчас Django поддерживается усилиями международного :doc:`сообщества разработчиков <https://www.djangoproject.com/foundation/teams/>`.

source: Which sites use Django?
ru: Какие сайты используют Django?

source: `DjangoSites.org`_ features a constantly growing list of Django-powered sites.
ru: На `DjangoSites.org <http://djangosites.org>`_ представлен постоянно увеличивающийся перечень сайтов, разработанных с использованием Django.

source: Django appears to be a MVC framework, but you call the Controller the "view", and the View the "template". How come you don't use the standard names?
ru: Похоже на то, что в Django используется подход MVC. Однако в качестве контроллера здесь выступает "представление", а роль представления, определяемого в MVC, играет "шаблон". Почему же нельзя использовать общую терминологию?

source: Well, the standard names are debatable.
ru: Вообще единая терминология является предметом отдельной дискуссии.

source: In our interpretation of MVC, the "view" describes the data that gets presented to the user. It's not necessarily *how* the data *looks*, but *which* data is presented. The view describes *which data you see*, not *how you see it.* It's a subtle distinction.
ru: В нашей трактовке MVC "представление" определяет данные, которые получает пользователь. Оно описывает, *какие именно данные* предоставляются, а не то, *как это делается*. Другими словами, представление характеризует "содержание" данных, а не их "форму".

source: So, in our case, a "view" is the Python callback function for a particular URL, because that callback function describes which data is presented.
ru: Представление в Django - это функция (в терминах Python), вызываемая при обращения к конкретному URL и возвращающая необходимые данные.

source: Furthermore, it's sensible to separate content from presentation -- which is where templates come in. In Django, a "view" describes which data is presented, but a view normally delegates to a template, which describes *how* the data is presented.
ru: Целесообразно отделять сами данные от формы их представления. Для этого в Django используются шаблоны. Шаблон получает от представления определенные данные и отображает их в том или ином виде.

source: Where does the "controller" fit in, then? In Django's case, it's probably the framework itself: the machinery that sends a request to the appropriate view, according to the Django URL configuration.
ru: А что же тогда выполняет функции "контроллера"? В качестве контроллера можно рассматривать сам фреймворк, реализующий механизм вызова необходимого представления в соответствии с конфигурацией URL.

source: If you're hungry for acronyms, you might say that Django is a "MTV" framework -- that is, "model", "template", and "view." That breakdown makes much more sense.
ru: Если вы любите аббревиатуры, то можно сказать что в Django реализована концепция "MTV" - "модель-шаблон-представление" ("model-template-view"). Такая формулировка более полно соответствует Django.

source: At the end of the day, of course, it comes down to getting stuff done. And, regardless of how things are named, Django gets stuff done in a way that's most logical to us.
ru: В конце концов, на практике вопросы соотнесения формулировок отходят на второй план. Вне зависимости от используемых терминов Django позволяет нам решать задачи наиболее понятным способом.

source: <Framework X> does <feature Y> -- why doesn't Django?
ru: В <фреймворке X> реализована <возможность Y>. Почему этого нет в Django?

source: We're well aware that there are other awesome Web frameworks out there, and we're not averse to borrowing ideas where appropriate. However, Django was developed precisely because we were unhappy with the status quo, so please be aware that "because <Framework X> does it" is not going to be sufficient reason to add a given feature to Django.
ru: Мы прекрасно знаем, что существуют другие клевые веб-фреймворки, и мы не прочь позаимствовать при необходимости у них идеи. Тем не менее, Django создавался для решения конкретных задач, так так нас не устраивало существовавшее положение дел. Поэтому примите, пожалуйста, к сведению, что заявления "а вот <фреймворк X> позволяет делать то-то и то-то" не являются достаточным основанием для включения данного функционала в Django.

source: Why did you write all of Django from scratch, instead of using other Python libraries?
ru: Почему Django был создан с нуля вместо того, чтобы использовать другие библиотеки Python?

source: When Django was originally written, Adrian and Simon spent quite a bit of time exploring the various Python Web frameworks available.
ru: Несколько лет назад, когда создавался Django, Адриан и Саймон потратили много времени на анализ существовавших тогда веб-фреймворков на Python,

source: In our opinion, none of them were completely up to snuff.
ru: Ни один из них не в должной мере удовлетворял всем требованиям.

source: We're picky. You might even call us perfectionists. (With deadlines.)
ru: Мы требовательны. Нас даже можно назвать перфекционистами. (с дедлайнами)

source: Over time, we stumbled across open-source libraries that did things we'd already implemented. It was reassuring to see other people solving similar problems in similar ways, but it was too late to integrate outside code: We'd already written, tested and implemented our own framework bits in several production settings -- and our own code met our needs delightfully.
ru: В процессе разработки Django мы узнавали о других свободных библиотеках в этой области. Нас обнадеживало то, что другие люди решают подобные задачи схожими путями, но было слишком поздно включать в Django сторонние наработки. К тому времени Django был уже разработан, протестирован и применялся в нескольких проектах. Наша собственная разработка полностью удовлетворяло требованиям.

source: In most cases, however, we found that existing frameworks/tools inevitably had some sort of fundamental, fatal flaw that made us squeamish. No tool fit our philosophies 100%.
ru: В большинстве случаев оказывалось, что существующие фреймворки/инструменты имели существенные недостатки, которые нас категорически не устраивали. Ни один из них не соответствовал нашим принципам на 100%.

source: Like we said: We're picky.
ru: Ведь мы требовательны.

source: We've documented our philosophies on the :doc:`design philosophies page </misc/design-philosophies>`.
ru: Наши взгляды нашли отражение в :doc:`принципах разработки </misc/design-philosophies>`.

source: Is Django a content-management-system (CMS)?
ru: Является ли Django системой управления контентом (CMS)?

source: No, Django is not a CMS, or any sort of "turnkey product" in and of itself. It's a Web framework; it's a programming tool that lets you build websites.
ru: Нет, Django - это не CMS, и его нельзя рассматривать в качестве продукта готового к использованию "из коробки". Django - это веб-фреймворк, программный инструмент, позволяющий разрабатывать сайты.

source: For example, it doesn't make much sense to compare Django to something like Drupal_, because Django is something you use to *create* things like Drupal.
ru: Скажем так, неправильно сравнивать Django с чем-нибудь вроде `Drupal <http://drupal.org/>`_ потому, что используя Django вы может создавать продукты, аналогичные Drupal.

source: Of course, Django's automatic admin site is fantastic and timesaving -- but the admin site is one module of Django the framework. Furthermore, although Django has special conveniences for building "CMS-y" apps, that doesn't mean it's not just as appropriate for building "non-CMS-y" apps (whatever that means!).
ru: Конечно, в Django имеются мощные и автоматизированные средства администрирования, позволяющие экономить время. Но "админка" - это просто один из модулей, входящих в состав Django. Не смотря на то, что в Django легко создать систему управления контентом, неправильно считать, что он не применим для решения других задач.

source: How can I download the Django documentation to read it offline?
ru: Как воспользоваться локальной версией документации Django?

source: The Django docs are available in the ``docs`` directory of each Django tarball release. These docs are in reST (reStructuredText) format, and each text file corresponds to a Web page on the official Django site.
ru: Документация располагается в папке ``docs`` архива с Django. Документация приведена в формате reST (reStructuredText). Каждый текстовый файл соответствует странице официального веб-сайта Django.

source: Because the documentation is `stored in revision control`_, you can browse documentation changes just like you can browse code changes.
ru: В связи с тем, что документация размещена в `репозитории GitHub <https://github.com/django/django/tree/master/docs/>`_ вы можете отслеживать изменения.

source: Technically, the docs on Django's site are generated from the latest development versions of those reST documents, so the docs on the Django site may offer more information than the docs that come with the latest Django release.
ru: В принципе, документация на сайте Django генерируется на основе последней версии этих reST документов. По этой причине, онлайн-документация может быть более информативной.

source: How do I cite Django?
ru: Как указать ссылку на Django?

source: It's difficult to give an official citation format, for two reasons: citation formats can vary wildly between publications, and citation standards for software are still a matter of some debate.
ru: Установить единый формат для указания ссылок на источник сложно по двум причинам: во-первых, требования к указаниям на источники очень различаются от публикации к публикации, а во-вторых, стандарты оформления ссылок на программные продукты продолжают оставаться предметом обсуждений.

source: For example, `APA style`_, would dictate something like::
ru: Например, в соответствии с `требованиями <http://www.apastyle.org>`_ Американской психологической ассоциации ссылка должна выглядеть следующим образом:

source: However, the only true guide is what your publisher will accept, so get a copy of those guidelines and fill in the gaps as best you can.
ru: Все-таки стоит руководствоваться требованиями к оформлению ссылок, установленных издательством, с которым вы сотрудничаете. Поэтому следует обратиться в издательство для получения конкретных рекомендаций к оформлению ссылок и максимально полно выполнить эти рекомендации.

source: If your referencing style guide requires a publisher name, use "Django Software Foundation".
ru: Если в рекомендациях требуется указание наименования издательской организации, используйте "Django Software Foundation".

source: If you need a publishing location, use "Lawrence, Kansas".
ru: Если необходимо указать место публикации, используйте "Lawrence, Kansas".

source: If you need a web address, use https://djangoproject.com.
ru: Если вам необходим веб-адрес, используйте https://djangoproject.com.

source: If you need a name, just use "Django", without any tagline.
ru: Если необходимо название, просто используйте "Django"

source: If you need a publication date, use the year of release of the version you're referencing (e.g., 2013 for v1.5)
ru: Если вам необходима дата публикации, используйте год и номер версии Django, на который вы ссылаетесь (например: 2013 г., версия 1.5)
