Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/faq/troubleshooting.po
Languages: ru

source: Troubleshooting
ru: Поиск и устранение неисправностей

source: This page contains some advice about errors and problems commonly encountered during the development of Django applications.
ru: Эта страница содержит несколько советов по поводу ошибок и проблем, обычно возникающих в процессе разработки приложений на Django.

source: :doc:`django-admin </ref/django-admin>` should be on your system path if you installed Django via ``python setup.py``. If it's not on your path, you can find it in ``site-packages/django/bin``, where ``site-packages`` is a directory within your Python installation. Consider symlinking to :doc:`django-admin </ref/django-admin>` from some place on your path, such as :file:`/usr/local/bin`.
ru: :doc:`django-admin </ref/django-admin>` должен уже быть доступным по путям, если вы устанавливали Django с помощью ``python setup.py``. В противном случае этот скрипт можно найти в ``site-packages/django/bin``, где ``site-packages`` - каталог с установленным Python. Настоятельно советуем сделать символическую ссылку :doc:`django-admin </ref/django-admin>` куда-нибудь в :file:`/usr/local/bin`.

source: If ``django-admin`` doesn't work but ``django-admin.py`` does, you're probably using a version of Django that doesn't match the version of this documentation. ``django-admin`` is new in Django 1.7.
ru: Если ``django-admin`` не работает, а ``django-admin.py`` работает, скорее всего вы используете версию Django, которая не соответствует этой документации. ``django-admin`` была добавлена Django 1.7.

source: Mac OS X permissions
ru: Права доступа на Mac OS X

source: If you're using Mac OS X, you may see the message "permission denied" when you try to run ``django-admin``. This is because, on Unix-based systems like OS X, a file must be marked as "executable" before it can be run as a program. To do this, open Terminal.app and navigate (using the ``cd`` command) to the directory where :doc:`django-admin </ref/django-admin>` is installed, then run the command ``sudo chmod +x django-admin``.
ru: Если у вас Mac OS X, то при запуске ``django-admin`` можете получить сообщение "permission denied". Это происходит потому что в Unix-подобных системах (например, OS X) надо явно указать скрипту, что он является исполняемым. Чтобы это сделать откройте терминал и перейдите (с помощью команды ``cd``) в каталог, где установлен :doc:`django-admin </ref/django-admin>`, затем выполните ``sudo chmod +x django-admin``.

source: Miscellaneous
ru: Разное

source: I'm getting a ``UnicodeDecodeError``. What am I doing wrong?
ru: Я получил ``UnicodeDecodeError``. Что я делаю не так?

source: This class of errors happen when a bytestring containing non-ASCII sequences is transformed into a Unicode string and the specified encoding is incorrect. The output generally looks like this::
ru: Такую ошибку можно получить, если байтовую строку с не-ASCII символами преобразовывать в Unicode строку, используя не правильную кодировку. Обычно ошибка выглядит следующим образом::

source: The resolution mostly depends on the context, however here are two common pitfalls producing this error:
ru: Решение обычно зависит от контекста, но вот две распространенные причины появления ошибки:

source: Your system locale may be a default ASCII locale, like the "C" locale on UNIX-like systems (can be checked by the ``locale`` command). If it's the case, please refer to your system documentation to learn how you can change this to a UTF-8 locale.
ru: Система по умолчанию использует ASCII локаль, такую как "C" в UNIX-системах (можно проверить командой ``locale``). Если это так, ищите в документации вашей ОС как изменить локаль на UTF-8.

source: You created raw bytestrings, which is easy to do on Python 2::
ru: Вы создали байтовую строку, что очень просто в Python 2::

source: Either use the ``u''`` prefix or even better, add the ``from __future__ import unicode_literals`` line at the top of your file so that your code will be compatible with Python 3.2 which doesn't support the ``u''`` prefix.
ru: используйте префикс ``u''``, или лучше добавьте ``from __future__ import unicode_literals`` в начале файла и ваш код будет совместим с Python 3.2 без использования перфикса ``u''``.

source: Related resources:
ru: Близкие по теме ресурсы:

source: :doc:`Unicode in Django </ref/unicode>`
ru: :doc:`Unicode в Django </ref/unicode>`
