Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/faq/usage.po
Languages: ru

source: FAQ: Using Django
ru: FAQ: Использование Django

source: Why do I get an error about importing DJANGO_SETTINGS_MODULE?
ru: Что за ошибка при импорте DJANGO_SETTINGS_MODULE?

source: Make sure that:
ru: Проверьте:

source: The environment variable DJANGO_SETTINGS_MODULE is set to a fully-qualified Python module (i.e. "mysite.settings").
ru: Переменная окружения DJANGO_SETTINGS_MODULE указана полностью (например, "mysite.settings") на существующий модуль.

source: Said module is on ``sys.path`` (``import mysite.settings`` should work).
ru: Пропишите модуль в ``sys.path`` (``import mysite.settings`` должно помочь).

source: The module doesn't contain syntax errors (of course).
ru: Модуль синтаксически верен и успешно компилируется.

source: I can't stand your template language. Do I have to use it?
ru: Мне не нравится язык шаблонов, я обязательно должен использовать именно его?

source: We happen to think our template engine is the best thing since chunky bacon, but we recognize that choosing a template language runs close to religion. There's nothing about Django that requires using the template language, so if you're attached to Jinja2, Mako, or whatever, feel free to use those.
ru: Нам нравится наш язык шаблонов, но утверждать что он единственно верный - сродни религии. В Django нет привязки к нему, так что вы можете подключить Jinja2, Mako и пр.

source: Do I have to use your model/database layer?
ru: Мне обязательно нужно пользоваться слоем с вашей реализацией моделей?

source: Nope. Just like the template system, the model/database layer is decoupled from the rest of the framework.
ru: Нет, как и с языком шаблонов, модели отделены от всего фреймворка.

source: The one exception is: If you use a different database library, you won't get to use Django's automatically-generated admin site. That app is coupled to the Django database layer.
ru: Небольшое уточнение: если вы используете стороннюю библиотеку для работы с базой данных, то сгенерировать админку автоматически уже не получится. Это приложение связано с моделями Django.

source: How do I use image and file fields?
ru: Как использовать поля для загрузки картинок и файлов?

source: Using a :class:`~django.db.models.FileField` or an :class:`~django.db.models.ImageField` in a model takes a few steps:
ru: Для них предназначены специальные классы (:class:`~django.db.models.FileField` и :class:`~django.db.models.ImageField`). Использовать их можно так:

source: In your settings file, you'll need to define :setting:`MEDIA_ROOT` as the full path to a directory where you'd like Django to store uploaded files. (For performance, these files are not stored in the database.) Define :setting:`MEDIA_URL` as the base public URL of that directory. Make sure that this directory is writable by the Web server's user account.
ru: В файле настроек нужно указать :setting:`MEDIA_ROOT` - полный путь к каталогу, где Django будет хранить загруженные файлы. Для быстродействия не стоит хранить их в базе данных. Определите :setting:`MEDIA_URL` - базовый URL к этому каталогу и убедитесь, что у веб-сервера есть права на запись туда файлов.

source: Add the :class:`~django.db.models.FileField` or :class:`~django.db.models.ImageField` to your model, defining the :attr:`~django.db.models.FileField.upload_to` option to specify a subdirectory of :setting:`MEDIA_ROOT` to use for uploaded files.
ru: В полях типа :class:`~django.db.models.FileField` или :class:`~django.db.models.ImageField` вашей модели установите :attr:`~django.db.models.FileField.upload_to` равным пути к каталогу, в котором будут сохраняться файлы. Путь должен быть относительным к :setting:`MEDIA_ROOT`.

source: All that will be stored in your database is a path to the file (relative to :setting:`MEDIA_ROOT`). You'll most likely want to use the convenience :attr:`~django.db.models.fields.files.FieldFile.url` attribute provided by Django. For example, if your :class:`~django.db.models.ImageField` is called ``mug_shot``, you can get the absolute path to your image in a template with ``{{ object.mug_shot.url }}``.
ru: Всё, что будет сохранено в базу данных - путь к файлу (относительно :setting:`MEDIA_ROOT`). Для удобного получения URL к файлу можно использовать :attr:`~django.db.models.fields.files.FieldFile.url`. Например, если поле типа :class:`~django.db.models.ImageField` называется ``mug_shot``, то получить абсолютный путь в шаблоне можно следующим образом ``{{ object.mug_shot.url }}``.

source: How do I make a variable available to all my templates?
ru: Как сделать переменную доступной во всех шаблонах?

source: Sometimes your templates just all need the same thing. A common example would be dynamically-generated menus. At first glance, it seems logical to simply add a common dictionary to the template context.
ru: Порой это действительно нужно, например, в динамически создаваемом меню. На первый взгляд выглядит разумным просто добавить общий словарь в контекст шаблона.

source: The correct solution is to use a ``RequestContext``. Details on how to do this are here: :ref:`subclassing-context-requestcontext`.
ru: Однако верное решение состоит в использовании ``RequestContext``. Подробнее можно посмотреть в :ref:`subclassing-context-requestcontext`.
