Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/topics/class-based-views/generic-display.po
Languages: ru

source: Then we'd write our new view -- ``get_object`` is the method that retrieves the object -- so we simply override it and wrap the call::
ru: Затем мы создадим наше новое представление: ``get_object``-- это метод, который получает и возвращает "рабочий" объект, таким образом, нам нужно лишь переопределить его(не забыв вызвать метод родительского класса)::

source: The URLconf here uses the named group ``pk`` - this name is the default name that ``DetailView`` uses to find the value of the primary key used to filter the queryset.
ru: В URLconf указана именованная группа ``pk``. Это имя является именем по умолчанию, которое использует ``DetailView`` для определения значения первичного ключа и последующей фильтрации объектов в запросе (в queryset).

source: If you want to call the group something else, you can set ``pk_url_kwarg`` on the view. More details can be found in the reference for :class:`~django.views.generic.detail.DetailView`
ru: Если вы хотите задать для группы другое имя, вы можете указать его в атрибуте ``pk_url_kwarg`` представления. За подробностями обращайтесь к дополнительной информации для :class:`~django.views.generic.detail.DetailView`.
