Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/topics/class-based-views/generic-display.po
Languages: ru

source: Class-based generic views
ru: Общие(generic) представления-классы

source: Writing Web applications can be monotonous, because we repeat certain patterns again and again. Django tries to take away some of that monotony at the model and template layers, but Web developers also experience this boredom at the view level.
ru: При создании вэб-приложений мы часто снова и снова повторяем определенные шаблоны в разработке, что делает саму разработку скучной и монотонной. Django старается избавить нас от этой монотонности при работе с моделями и шаблонами, но и на уровне создания представлений часто возникают такие же проблемы.

source: Django's *generic views* were developed to ease that pain. They take certain common idioms and patterns found in view development and abstract them so that you can quickly write common views of data without having to write too much code.
ru: *Общие представления(generic views)* Django были разработаны, чтобы избавить нас от этой скуки. В их основе лежит набор идиом и шаблонов, базирующийся на практическом опыте создания представлений, который дает нам абстрактный каркас для быстрого создания собственных представлений, без необходимости писать лишний, повторяющийся код.

source: We can recognize certain common tasks, like displaying a list of objects, and write code that displays a list of *any* object. Then the model in question can be passed as an extra argument to the URLconf.
ru: Мы можем выделить некоторые общие задачи, такие как отображение списка объектов, и написать код, который будет отображает список *любых* объектов. Затем мы можем указать модель, хранящую нужные объекты, и передать ее как дополнительный аргумент в URLconf.

source: Django ships with generic views to do the following:
ru: Django содержит встроенный набор общих представлений, которые могут делать следующее:

source: Display list and detail pages for a single object. If we were creating an application to manage conferences then a ``TalkListView`` and a ``RegisteredUserListView`` would be examples of list views. A single talk page is an example of what we call a "detail" view.
ru: Отображать список и страницу подробной информации для одиночного объекта. Если бы мы создавали приложение для управления обсуждениями, то ``TalkListView`` и ``RegisteredUserListView`` могли бы использоваться как представления для отображения списков. Отдельная страница с обсуждениями, может быть примером того, что мы зазываем "подробное(detail)" представление.

source: Present date-based objects in year/month/day archive pages, associated detail, and "latest" pages.
ru: Представлять объекты-даты в указателях год/месяц/день в архиве страниц, связанные детальные данные, и страницы "последние(latest)".

source: Allow users to create, update, and delete objects -- with or without authorization.
ru: Позволять пользователям(как авторизованным так и нет) создавать, обновлять и удалять объекты.

source: Taken together, these views provide easy interfaces to perform the most common tasks developers encounter.
ru: Собранные вместе, эти представления предоставляют разработчику интерфейс для решения наиболее часто встречаемых задач.

source: Extending generic views
ru: Расширение общих представлений

source: There's no question that using generic views can speed up development substantially. In most projects, however, there comes a moment when the generic views no longer suffice. Indeed, the most common question asked by new Django developers is how to make generic views handle a wider array of situations.
ru: Нет сомнений, что использование общих представлений может существенно ускорить разработку . Однако, в большинстве проектов, наступает момент, когда общие представления перестают быть эффективными и достаточными. Действительно, наиболее распространенный вопрос, который задают новые Django разработчики, как заставить базовые представления обрабатывать более широкий спектр ситуаций.

source: This is one of the reasons generic views were redesigned for the 1.3 release - previously, they were just view functions with a bewildering array of options; now, rather than passing in a large amount of configuration in the URLconf, the recommended way to extend generic views is to subclass them, and override their attributes or methods.
ru: Это одна из причин, по которой общие представления были переработаны в версии 1.3 . Раньше они были просто функциями-представлениями с огромным массивом возможных передаваемых параметров. Сейчас, вместо передачи параметров конфигурации в файл URLconf, рекомендуемый способ расширения общих представлений, это использование их в качестве родительских классов в пользовательских классах с последующим переопределением их атрибутов и методов.

source: That said, generic views will have a limit. If you find you're struggling to implement your view as a subclass of a generic view, then you may find it more effective to write just the code you need, using your own class-based or functional views.
ru: Тем не менее, общие представления имеют свои пределы. Если реализация вашего представления, как подкласса общего представления вызывает большие трудности, то вероятнее более эффективным будет написание необходимого вам кода с использованием ваших собственных представлений-классов или представлений-функций.

source: More examples of generic views are available in some third party applications, or you could write your own as needed.
ru: Больше примеров использования общих представлений вы можете найти в некоторых приложениях сторонних разработчиков, или создать свое собственное, выполняющее ваши задачи.

source: Generic views of objects
ru: Общие представления и отображение объектов

source: :class:`~django.views.generic.base.TemplateView` certainly is useful, but Django's generic views really shine when it comes to presenting views of your database content. Because it's such a common task, Django comes with a handful of built-in generic views that make generating list and detail views of objects incredibly easy.
ru: Класс :class:`~django.views.generic.base.TemplateView` безусловно очень полезен, но настоящая мощь общих представлений Django раскрывается при создании представлениий для работы с содержимым базы данных. Так как такая задача возникает часто, Django предлагает полезный и удобный набор встроенных общих представлений-классов, который позволяют с легкостью отображать список объектов или конкретный объект.

source: Let's start by looking at some examples of showing a list of objects or an individual object.
ru: Давайте начнем с рассмотрения примеров, показывающих получение списка объектов или индивидуального объекта.

source: We'll be using these models::
ru: Мы будем использовать следующие модели::

source: Now we need to define a view::
ru: Теперь мы должны определить представление::

source: Finally hook that view into your urls::
ru: Ну и наконец, привяжем представление к url::

source: That's all the Python code we need to write. We still need to write a template, however. We could explicitly tell the view which template to use by adding a ``template_name`` attribute to the view, but in the absence of an explicit template Django will infer one from the object's name. In this case, the inferred template will be ``"books/publisher_list.html"`` -- the "books" part comes from the name of the app that defines the model, while the "publisher" bit is just the lowercased version of the model's name.
ru: Это весь код на Python, который нам необходимо написать. Хотя, нам еще необходим шаблон. Мы можем явно указать в представлении, какой шаблон мы хотим использовать. Для этого мы должны добавить в представление атрибут ``template_name``, с указанием имени шаблона. Если если явно не указывать этот атрибут, Django "вычислит" его из названия объекта. В данном случае, таким "вычисленным" шаблоном будет ``"books/publisher_list.html"`` -- часть "books" берется из имени приложения, определяющего модель, а часть "publisher" - это просто название модели в нижнем регистре.

source: Thus, when (for example) the :class:`django.template.loaders.app_directories.Loader` template loader is enabled in :setting:`TEMPLATE_LOADERS`, a template location could be: /path/to/project/books/templates/books/publisher_list.html
ru: Таким образом, если (например) в настройках :setting:`TEMPLATE_LOADERS` "включен" класс загрузчика :class:`django.template.loaders.app_directories.Loader`, то путь к шаблону будет следующим : /path/to/project/books/templates/books/publisher_list.html

source: This template will be rendered against a context containing a variable called ``object_list`` that contains all the publisher objects. A very simple template might look like the following::
ru: При обработке шаблона (рэндеринге), будет использоваться контекст, содержащий переменную ``object_list``. Это переменная хранит список всех объектов издателей(publisher). Очень простой шаблон мог бы выглядить так::

source: That's really all there is to it. All the cool features of generic views come from changing the attributes set on the generic view. The :doc:`generic views reference</ref/class-based-views/index>` documents all the generic views and their options in detail; the rest of this document will consider some of the common ways you might customize and extend generic views.
ru: Это действительно все, что нужно сделать. Все крутые "фичи" общих представлений-классов можно получить лишь устанавливая значения определенных атрибутов в представлении. В разделе :doc:`общие представления </ref/class-based-views/index>` вы найдете детальное описание всех общих представлений; в оставшейся части раздела мы рассмотрим общие подходы в расширении и модификации общих представлений.

source: Making "friendly" template contexts
ru: Создание "дружелюбного" контента для шаблона

source: You might have noticed that our sample publisher list template stores all the publishers in a variable named ``object_list``. While this works just fine, it isn't all that "friendly" to template authors: they have to "just know" that they're dealing with publishers here.
ru: Вы должны были обратить внимание, что в нашем примере список издателей хранится в переменной с именем ``object_list``. И хотя все прекрасно работает, с нашей стороны это не сильно "дружелюбно" к разработчикам шаблонов: они должны "как-то понять", что имеют здесь дело со списком издателей.

source: Well, if you're dealing with a model object, this is already done for you. When you are dealing with an object or queryset, Django is able to populate the context using the lower cased version of the model class' name. This is provided in addition to the default ``object_list`` entry, but contains exactly the same data, i.e. ``publisher_list``.
ru: Что ж, если вы имеете дело с моделью, - то считайте что все уже сделано. Если вы оперируете запросом(queryset) или объектом, Django способно добавить в контекст переменную с именем модели в нижнем регистре. Эта переменная предоставляется в дополнение к стандартному значению ``object_list``, и содержит то же самое значение, н-р, ``publisher_list``.

source: If this still isn't a good match, you can manually set the name of the context variable. The ``context_object_name`` attribute on a generic view specifies the context variable to use::
ru: Если и этот вариант вас не устраивает, то имя переменной контекста можно задать вручную. Для этой цели служит атрибут ``context_object_name``, который определяет имя переменной в контексте::

source: Providing a useful ``context_object_name`` is always a good idea. Your coworkers who design templates will thank you.
ru: Задать переменной контекста понятное имя(отражающее его предназначение) - это всегда замечательно. Ваши коллеги, занимающиеся разработкой шаблонов, будут вам благодарны.

source: Adding extra context
ru: Добавление дополнительного контента

source: Often you simply need to present some extra information beyond that provided by the generic view. For example, think of showing a list of all the books on each publisher detail page. The :class:`~django.views.generic.detail.DetailView` generic view provides the publisher to the context, but how do we get additional information in that template.
ru: Часто возникает потребность передать в контекст некоторые дополнительные данные, помимо тех, что автоматически предоставляются представлением. Н-р, представим что нам необходимо отобразить список всех книг на странице с детальной информацией об издателе. Представление-класс :class:`~django.views.generic.detail.DetailView` предоставляет нам только переменную контекста, содержащую данные об издателе, но как нам передать дополнительную информацию в шаблон?

source: However, there is; you can subclass :class:`~django.views.generic.detail.DetailView` and provide your own implementation of the ``get_context_data`` method. The default implementation of this that comes with :class:`~django.views.generic.detail.DetailView` simply adds in the object being displayed to the template, but you can override it to send more::
ru: Вот решение: вы можете создать подкласс от :class:`~django.views.generic.detail.DetailView` и переопределить в нем метод ``get_context_data``. Реализация метода по умолчанию (в классе :class:`~django.views.generic.detail.DetailView`) просто добавляет объект, который будет доступен в шаблоне. Но переопределив метод, вы можете добавить любые дополнительные данные(расширить контекст)::

source: Generally, get_context_data will merge the context data of all parent classes with those of the current class. To preserve this behavior in your own classes where you want to alter the context, you should be sure to call get_context_data on the super class. When no two classes try to define the same key, this will give the expected results. However if any class attempts to override a key after parent classes have set it (after the call to super), any children of that class will also need to explictly set it after super if they want to be sure to override all parents. If you're having trouble, review the method resolution order of your view.
ru: В общем случае, метод get_context_data объединяет(сливает вместе) данные контекста всех родительских классов с данными текущего класса. Чтобы сохранить такое поведение в пользовательских классах, в которых вы собираетесь изменять контекст, вы должны в начале вызвать метод get_context_data родительского класса. Если нет двух классов, которые пытаются определить одинаковый ключ, - вы получите желаемый результат. Однако, если есть некий класс, который пытается переопределить ключ, установленный родительскими классами(после вызова super), то любой потомок этого класса также должен явно установить такой ключ(после вызова super), если необходимо гарантировать полное переопределение данных родителей. Если у вас возникли проблемы, просмотрите mro(method resolution order) вашего представления.

source: Viewing subsets of objects
ru: Отображение подмножеств объектов

source: Now let's take a closer look at the ``model`` argument we've been using all along. The ``model`` argument, which specifies the database model that the view will operate upon, is available on all the generic views that operate on a single object or a collection of objects. However, the ``model`` argument is not the only way to specify the objects that the view will operate upon -- you can also specify the list of objects using the ``queryset`` argument::
ru: Давай теперь рассмотрим подробнее аргумент ``model``, который мы уже активно использовали. Аргумент ``model``, определяющий модель базы данных, с которой работает данное представление, доступен во всех общих представлениях-классах, которые предназначены для отображения единичного объекта или списка объектов. Тем не менее, аргумент ``model`` это не единственный способ, указать представлению с какими данными оно должно работать. Вы также можете указать необходимый список объектов используя аргумент ``queryset``::

source: Specifying ``model = Publisher`` is really just shorthand for saying ``queryset = Publisher.objects.all()``. However, by using ``queryset`` to define a filtered list of objects you can be more specific about the objects that will be visible in the view (see :doc:`/topics/db/queries` for more information about :class:`~django.db.models.query.QuerySet` objects, and see the :doc:`class-based views reference </ref/class-based-views/index>` for the complete details).
ru: Запись ``model = Publisher`` это всего лишь сокращенный вариант записи ``queryset = Publisher.objects.all()``. Однако, используя ``queryset`` вы можете в полной мере использовать механизмы выборки данных, фильтрации , предоставив вашему представлению более конкретный список объектов, с которым оно должно работать. (смотри :doc:`/topics/db/queries` для дополнительной информацией о классе :class:`~django.db.models.query.QuerySet`, а также :doc:`class-based views reference </ref/class-based-views/index>` за подробностями).

source: To pick a simple example, we might want to order a list of books by publication date, with the most recent first::
ru: Вот простой пример: нам необходимо упорядочить список книг по дате публикации, в порядке "новизны" публикации::

source: That's a pretty simple example, but it illustrates the idea nicely. Of course, you'll usually want to do more than just reorder objects. If you want to present a list of books by a particular publisher, you can use the same technique::
ru: Это очень простой пример, но он прекрасно иллюстрирует саму основную идею. Конечно, на практике вам может потребоваться реализовать нечто более сложное, чем простая сортировка объектов. Если мы хотим получить список книг определенного издателя, мы можем использовать аналогичную технику::

source: Notice that along with a filtered ``queryset``, we're also using a custom template name. If we didn't, the generic view would use the same template as the "vanilla" object list, which might not be what we want.
ru: Обратите внимание, что вместе с созданием отфильтрованной выборки объектов с использованием ``queryset``, мы также используем другое(пользовательское) имя шаблона. Если мы этого не сделаем, представление будет использовать тот же шаблон, что и для отображения "родного" списка объектов, что нас не устраивает.

source: Also notice that this isn't a very elegant way of doing publisher-specific books. If we want to add another publisher page, we'd need another handful of lines in the URLconf, and more than a few publishers would get unreasonable. We'll deal with this problem in the next section.
ru: Также обратите внимание, что это не очень элегантный способ отобразить список книг для конкретного издателя. Если мы захотим добавить страницу о другом издателе, нам придется добавить дополнительные строки кода в URLconf, а добавление более чем несколько издателей обернется непомерно высокими накладными расходами. Мы разберемся с этой проблемой в следующем разделе.

source: If you get a 404 when requesting ``/books/acme/``, check to ensure you actually have a Publisher with the name 'ACME Publishing'. Generic views have an ``allow_empty`` parameter for this case. See the :doc:`class-based-views reference</ref/class-based-views/index>` for more details.
ru: Если при запросе к ``/books/acme/`` вы получаете ошибку 404, убедитесь, что для модели Publisher существует издатель с именем 'ACME Publishing'. Общие представления-классы предоставляют на этот случай параметр ``allow_empty``. Смотрите подробнее в :doc:`class-based-views reference</ref/class-based-views/index>` .

source: Dynamic filtering
ru: Динамическое фильтрование

source: Another common need is to filter down the objects given in a list page by some key in the URL. Earlier we hard-coded the publisher's name in the URLconf, but what if we wanted to write a view that displayed all the books by some arbitrary publisher?
ru: Другой часто встречающейся задачей является необходимость отфильтровать список объектов по переданному в URL ключу. Ранее мы жестко прописывали имя издателя в URLconf, но что если нам необходимо написать представление, отображающее все книги некоторого произвольного издателя?

source: Handily, the ``ListView`` has a :meth:`~django.views.generic.list.MultipleObjectMixin.get_queryset` method we can override. Previously, it has just been returning the value of the ``queryset`` attribute, but now we can add more logic.
ru: Для этого удобно воспользоваться методом :meth:`~django.views.generic.list.MultipleObjectMixin.get_queryset` класса ``ListView``, который мы можем переопределить для наших целей. Без переопределения метод возвращает значение атрибута ``queryset``, но мы собираемся расширить его поведение.

source: The key part to making this work is that when class-based views are called, various useful things are stored on ``self``; as well as the request (``self.request``) this includes the positional (``self.args``) and name-based (``self.kwargs``) arguments captured according to the URLconf.
ru: Ключевым моментом в выполнении этой работы, является понимание того, что при вызове представления-класса, в его ссылке на экземпляр ``self`` сохраняется много "полезных вещей". Н-р, там сохраняется экземпляр текущего запроса (request (в ``self.request``)), а так же список позиционных (``self.args``) и именованных (``self.kwargs``) аргументов, которые "отлавливаются" из строки запроса в URLconf.

source: Here, we have a URLconf with a single captured group::
ru: Вот, например, у нас есть строка в URLconf, "захватывающая" одиночную группу::

source: Next, we'll write the ``PublisherBookList`` view itself::
ru: Теперь мы напишем само представление ``PublisherBookList``::

source: As you can see, it's quite easy to add more logic to the queryset selection; if we wanted, we could use ``self.request.user`` to filter using the current user, or other more complex logic.
ru: Как вы можете видеть, добавление дополнительной логики в генерацию queryset, - это совсем несложно. Если бы нам потребовалось, мы могли бы использовать значение ``self.request.user`` чтобы отфильтровать данные с учетом текущего пользователя, или добавить любую другую более сложную логику.

source: We can also add the publisher into the context at the same time, so we can use it in the template::
ru: Одновременно мы можем также добавить издателя в контекст, и затем использовать это значение в шаблоне ::

source: Performing extra work
ru: Решение дополнительных задач

source: The last common pattern we'll look at involves doing some extra work before or after calling the generic view.
ru: Последний пример, который мы рассмотрим, покажет как выполнить дополнительную работу до или после вызова общего представления-класса.

source: Imagine we had a ``last_accessed`` field on our ``Author`` object that we were using to keep track of the last time anybody looked at that author::
ru: Представьте, что у нас есть поле ``last_accessed`` в объекте ``Author``, которое отслеживает информацию о том, когда в последний раз, кто-либо интересовался данным автором::

source: The generic ``DetailView`` class, of course, wouldn't know anything about this field, but once again we could easily write a custom view to keep that field updated.
ru: Разумеется, класс ``DetailView`` ничего не знает об этом поле, но мы можем без проблем написать пользовательское представление-класс, которое будет отслеживать обновление этого поля.

source: First, we'd need to add an author detail bit in the URLconf to point to a custom view::
ru: Первое, мы должны добавить запись в URLconf для отображения информации об авторе, и связать ее с нашим представлением::
