Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/topics/class-based-views/intro.po
Languages: ru

source: Introduction to class-based views
ru: Введение в представления-классы (Class-based views, CBV)

source: Class-based views provide an alternative way to implement views as Python objects instead of functions. They do not replace function-based views, but have certain differences and advantages when compared to function-based views:
ru: Представления, основанные на классах, представляют собой альтернативный путь реализации представлений. Вместо функций здесь используются объекты Python. Этот способ не лучше и не хуже, он другой. Вот основные отличия:

source: Organization of code related to specific HTTP methods (``GET``, ``POST``, etc.) can be addressed by separate methods instead of conditional branching.
ru: Организация обработки специфичных для HTTP методов (``GET``, ``POST``, и т.д.) разнесена по соответствующим методам, вместо того, чтобы писать кучу условий.

source: Object oriented techniques such as mixins (multiple inheritance) can be used to factor code into reusable components.
ru: Объектно-ориентированные технологии, такие как миксины (примеси, множественное наследование) позволяют выделять код в компоненты, которые могут повторно использоваться.

source: The relationship and history of generic views, class-based views, and class-based generic views
ru: Связь и история обобщённых представлений, представлений, основанных на классах, а также обобщённых представлений, основанных на классах.

source: In the beginning there was only the view function contract, Django passed your function an :class:`~django.http.HttpRequest` and expected back an :class:`~django.http.HttpResponse`. This was the extent of what Django provided.
ru: В самом начале были только функции: Django передавал ей :class:`~django.http.HttpRequest` и ожидал получения :class:`~django.http.HttpResponse`. Это всё, что было предусмотрено.

source: Early on it was recognized that there were common idioms and patterns found in view development. Function-based generic views were introduced to abstract these patterns and ease view development for the common cases.
ru: Ранее были найдены общие шаблоны в разработке представлений. Обобщённые представления, основанные на функциях, были выделены в абстрактные шаблоны, подходящие для большинства случаев.

source: Class-based generic views were created with the same objective as function-based generic views, to make view development easier. However, the way the solution is implemented, through the use of mixins, provides a toolkit that results in class-based generic views being more extensible and flexible than their function-based counterparts.
ru: Представления, основанные на классах, были созданы для решения той же задачи, что и обобщённые функции-представления: упростить разработку. Однако, реализовано это было с помощью примесей: наборов классов, которые делают обобщённые представления-классы более расширяемыми и гибкими в настройке, нежели соответствующие функции.

source: Using class-based views
ru: Использование представлений, основанных на классах

source: At its core, a class-based view allows you to respond to different HTTP request methods with different class instance methods, instead of with conditionally branching code inside a single view function.
ru: По своей сути представления, основанные на классах, позволяют реагировать на различные методы HTTP запроса различными методами объекта, а не городить ветвление внутри одной функции.

source: So where the code to handle HTTP ``GET`` in a view function would look something like::
ru: Для примера возьмём обработку ``GET`` запроса в функции::

source: In a class-based view, this would become::
ru: Теперь та же реализация через классы::

source: It is worth noting that what your method returns is identical to what you return from a function-based view, namely some form of :class:`~django.http.HttpResponse`. This means that :doc:`http shortcuts </topics/http/shortcuts>` or :class:`~django.template.response.TemplateResponse` objects are valid to use inside a class-based view.
ru: Стоит отметить, что этот метод возвращает результат, который идентичен результату функции, а именно :class:`~django.http.HttpResponse`. Это означает, что :doc:`http shortcuts </topics/http/shortcuts>` или объекты :class:`~django.template.response.TemplateResponse` можно использовать внутри представлений-классов.

source: While a minimal class-based view does not require any class attributes to perform its job, class attributes are useful in many class-based designs, and there are two ways to configure or set class attributes.
ru: В то время как минимальное представление, основанное на классах, не нуждается в каких-либо атрибутах этого класса, они могут быть полезны во многих внутренних методах. Есть два способа их установки.

source: The first is the standard Python way of subclassing and overriding attributes and methods in the subclass. So that if your parent class had an attribute ``greeting`` like this::
ru: Первым является стандартный для Python механизм наследования и переопределения атрибутов или методов. Так, если родительский класс имеет атрибут ``greeting``, то выглядеть это будет как-то так::

source: You can override that in a subclass::
ru: Вы можете переопределить это в наследнике::

source: Another option is to configure class attributes as keyword arguments to the :meth:`~django.views.generic.base.View.as_view` call in the URLconf::
ru: Другим способом является указание параметра с соответствующим именем при вызове :meth:`~django.views.generic.base.View.as_view` в URLconf::

source: While your class is instantiated for each request dispatched to it, class attributes set through the :meth:`~django.views.generic.base.View.as_view` entry point are configured only once at the time your URLs are imported.
ru: Хотя ваш класс инициализируется для обработки каждого запроса, атрибуты в методе :meth:`~django.views.generic.base.View.as_view` задаются только раз при импорте URL`ов.

source: Using mixins
ru: Использование примесей (mixins)

source: Mixins are a form of multiple inheritance where behaviors and attributes of multiple parent classes can be combined.
ru: Примеси представляют собой форму множественного наследования, в котором поведение и атрибуты всех родителей соединены в один класс.

source: For example, in the generic class-based views there is a mixin called :class:`~django.views.generic.base.TemplateResponseMixin` whose primary purpose is to define the method :meth:`~django.views.generic.base.TemplateResponseMixin.render_to_response`. When combined with the behavior of the :class:`~django.views.generic.base.View` base class, the result is a :class:`~django.views.generic.base.TemplateView` class that will dispatch requests to the appropriate matching methods (a behavior defined in the ``View`` base class), and that has a :meth:`~django.views.generic.base.TemplateResponseMixin.render_to_response` method that uses a :attr:`~django.views.generic.base.TemplateResponseMixin.template_name` attribute to return a :class:`~django.template.response.TemplateResponse` object (a behavior defined in the ``TemplateResponseMixin``).
ru: Например, в Django есть примесь под названием :class:`~django.views.generic.base.TemplateResponseMixin`, основной задачей которого является определение метода :meth:`~django.views.generic.base.TemplateResponseMixin.render_to_response`. Когда она будет объединена с поведением базового класса :class:`~django.views.generic.base.View`, получится класс :class:`~django.views.generic.base.TemplateView`, который обрабатывает запрос соответствующим методом (реализация находится в классе ``View``), а затем передаётся в :meth:`~django.views.generic.base.TemplateResponseMixin.render_to_response`, который, используя атрибут :attr:`~django.views.generic.base.TemplateResponseMixin.template_name`, возвращает объект :class:`~django.template.response.TemplateResponse` (реализовано в ``TemplateResponseMixin``).

source: Mixins are an excellent way of reusing code across multiple classes, but they come with some cost. The more your code is scattered among mixins, the harder it will be to read a child class and know what exactly it is doing, and the harder it will be to know which methods from which mixins to override if you are subclassing something that has a deep inheritance tree.
ru: Примеси - великолепный путь для повторного использования общего кода, однако у них есть некоторые минусы. Чем больше реализация методов будет размазана по примесям, тем сложнее будет читать дочерний класс и понимать что же он всё-таки делает, какие методы откуда берутся и какие методы уже перекрыты в родительских классах.

source: Note also that you can only inherit from one generic view - that is, only one parent class may inherit from :class:`~django.views.generic.base.View` and the rest (if any) should be mixins. Trying to inherit from more than one class that inherits from ``View`` - for example, trying to use a form at the top of a list and combining :class:`~django.views.generic.edit.ProcessFormView` and :class:`~django.views.generic.list.ListView` - won't work as expected.
ru: Стоит отметить, что можно унаследоваться только от одного обобщённого класса, т.к. каждый из них наследуется от :class:`~django.views.generic.base.View`; остальные должны быть примеси. Попытка скрестить более чем один обобщённый класс, например, :class:`~django.views.generic.edit.ProcessFormView` и :class:`~django.views.generic.list.ListView`, не будет работать так, как вы ожидаете.

source: Handling forms with class-based views
ru: Обработка форм с помощью представлений-классов

source: A basic function-based view that handles forms may look something like this::
ru: Обработка формы через представление-функцию выглядит как-то так::

source: A similar class-based view might look like::
ru: Код, выполняющий тоже самое, но реализованный через классы::

source: Decorating class-based views
ru: Декорирование представлений-классов

source: The extension of class-based views isn't limited to using mixins. You can also use decorators. Since class-based views aren't functions, decorating them works differently depending on if you're using ``as_view()`` or creating a subclass.
ru: Расширение представлений-классов не ограничивается использованием миксинов, также можно подключить декораторы. Так как представления-классы не являются функциями, то работа с ними несколько отличается в зависимости от того вызываете ли вы ``as_view()`` или создаёте дочерний класс.

source: Decorating in URLconf
ru: Декорирование в URLconf

source: This approach applies the decorator on a per-instance basis. If you want every instance of a view to be decorated, you need to take a different approach.
ru: Этот подход работает только когда нужно обернуть только один вызов, в противном случае следует действовать по-другому.

source: Decorating the class
ru: Декорирование классов

source: To decorate every instance of a class-based view, you need to decorate the class definition itself. To do this you apply the decorator to the :meth:`~django.views.generic.base.View.dispatch` method of the class.
ru: Для декорирования каждого метода представления-класса, вам нужно было бы обернуть каждый метод. В Django это сделано проще: надо всего лишь декорировать метод :meth:`~django.views.generic.base.View.dispatch`.

source: A method on a class isn't quite the same as a standalone function, so you can't just apply a function decorator to the method -- you need to transform it into a method decorator first. The ``method_decorator`` decorator transforms a function decorator into a method decorator so that it can be used on an instance method. For example::
ru: Метод класса не то же самое, что и обычная функция, к нему просто так применить декоратор не получится -- нужно сначала преобразовать его в метод-декоратор. Для этого существует декоратор ``method_decorator``, которым можно воспользоваться как-то так::

source: Or, more succinctly, you can decorate the class instead and pass the name of the method to be decorated as the keyword argument ``name``::
ru: Также вы можете декорировать класс, указав название методы, которые необходимо декорировать, в аргументе ``name``::

source: If you have a set of common decorators used in several places, you can define a list or tuple of decorators and use this instead of invoking ``method_decorator()`` multiple times. These two classes are equivalent::
ru: Если у вас есть список декораторов, которые используются в нескольких местах, вы можете указать список или кортеж декораторов и использовать его в ``method_decorator()`` несколько раз. Следующие два класса одинаковы::

source: The decorators will process a request in the order they are passed to the decorator. In the example, ``never_cache()`` will process the request before ``login_required()``.
ru: Декораторы обрабатывают запрос в указанном порядке. В нашем примере ``never_cache()`` выполнится перед ``login_required()``.

source: ``method_decorator`` passes ``*args`` and ``**kwargs`` as parameters to the decorated method on the class. If your method does not accept a compatible set of parameters it will raise a ``TypeError`` exception.
ru: ``method_decorator`` передаёт ``*args`` и ``**kwargs`` как параметры в декорированный метод. Если ваш метод не сможет их принять, то будет сгенерировано исключение ``TypeError``.
