Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/howto/auth-remote-user.po
Languages: ru

source: Authentication using ``REMOTE_USER``
ru: Аутентификация при помощи ``REMOTE_USER``

source: This document describes how to make use of external authentication sources (where the Web server sets the ``REMOTE_USER`` environment variable) in your Django applications. This type of authentication solution is typically seen on intranet sites, with single sign-on solutions such as IIS and Integrated Windows Authentication or Apache and `mod_authnz_ldap`_, `CAS`_, `Cosign`_, `WebAuth`_, `mod_auth_sspi`_, etc.
ru: Документ описывает использование внешних источников аутентификации (когда на веб-сервере установлена переменная ``REMOTE_USER``) в приложениях Django. Этот тип аутентификации является типичным для интранет-сайтов, использующих такие решения как IIS и Integrated Windows Authentication или Apache и `mod_authnz_ldap`_, `CAS`_, `Cosign`_, `WebAuth`_, `mod_auth_sspi`_.

source: When the Web server takes care of authentication it typically sets the ``REMOTE_USER`` environment variable for use in the underlying application. In Django, ``REMOTE_USER`` is made available in the :attr:`request.META <django.http.HttpRequest.META>` attribute. Django can be configured to make use of the ``REMOTE_USER`` value using the ``RemoteUserMiddleware`` or ``PersistentRemoteUserMiddleware``, and :class:`~django.contrib.auth.backends.RemoteUserBackend` classes found in :mod:`django.contrib.auth`.
ru: Для обеспечения наибольшей безопасности Web-сервер устанавливает переменную окружения ``REMOTE_USER`` и использует её в базовом приложении. В Django, ``REMOTE_USER`` доступна в атрибуте :attr:`request.META <django.http.HttpRequest.META>`. Настройте Django для того, чтобы задействовать переменную ``REMOTE_USER``, используя ``RemoteUserMiddleware``, ``PersistentRemoteUserMiddleware`` и :class:`~django.contrib.auth.backends.RemoteUserBackend` из :mod:`django.contrib.auth`.

source: Configuration
ru: Конфигурирование

source: Next, you must replace the :class:`~django.contrib.auth.backends.ModelBackend` with :class:`~django.contrib.auth.backends.RemoteUserBackend` in the :setting:`AUTHENTICATION_BACKENDS` setting::
ru: Затем заменить :class:`~django.contrib.auth.backends.ModelBackend` на :class:`~django.contrib.auth.backends.RemoteUserBackend` в настройках :setting:`AUTHENTICATION_BACKENDS`::

source: With this setup, ``RemoteUserMiddleware`` will detect the username in ``request.META['REMOTE_USER']`` and will authenticate and auto-login that user using the :class:`~django.contrib.auth.backends.RemoteUserBackend`.
ru: С такими настройками ``RemoteUserMiddleware`` обнаружит имя пользователя в запросе ``request.META['REMOTE_USER']``, аутентифицирует его и выполнит вход, используя :class:`~django.contrib.auth.backends.RemoteUserBackend`.

source: Be aware that this particular setup disables authentication with the default ``ModelBackend``. This means that if the ``REMOTE_USER`` value is not set then the user is unable to log in, even using Django's admin interface. Adding ``'django.contrib.auth.backends.ModelBackend'`` to the ``AUTHENTICATION_BACKENDS`` list will use ``ModelBackend`` as a fallback if ``REMOTE_USER`` is absent, which will solve these issues.
ru: Обратите внимание, что такие настройки отключат авторизацию через ``ModelBackend``. Это означает, что при пустом ``REMOTE_USER`` пользователь не сможет авторизоваться, даже в интерфейсе администратора Django. Добавление ``'django.contrib.auth.backends.ModelBackend'`` в список ``AUTHENTICATION_BACKENDS`` позволит использовать ``ModelBackend`` в случае пустого ``REMOTE_USER``, что решит проблему.

source: Django's user management, such as the views in ``contrib.admin`` and the :djadmin:`createsuperuser` management command, doesn't integrate with remote users. These interfaces work with users stored in the database regardless of ``AUTHENTICATION_BACKENDS``.
ru: Управление пользователями в Django -- представления из ``contrib.admin`` и команда :djadmin:`createsuperuser`,не работают со сторонними пользователями, только с пользователями в базе данных, независимо от значения настройки ``AUTHENTICATION_BACKENDS``.

source: Since the ``RemoteUserBackend`` inherits from ``ModelBackend``, you will still have all of the same permissions checking that is implemented in ``ModelBackend``.
ru: Поскольку ``RemoteUserBackend`` наследуется от ``ModelBackend``, вам всё равно придётся проверять процедуру аутентификации, реализованную при помощи ``ModelBackend``.

source: If your authentication mechanism uses a custom HTTP header and not ``REMOTE_USER``, you can subclass ``RemoteUserMiddleware`` and set the ``header`` attribute to the desired ``request.META`` key. For example::
ru: Если механизм аутентификации использует обычные HTTP-заголовки и не содержит ``REMOTE_USER``, вы можете создать подкласс ``RemoteUserMiddleware`` и установить атрибут ``header`` с ключом ``request.META``. Например::

source: Be very careful if using a ``RemoteUserMiddleware`` subclass with a custom HTTP header. You must be sure that your front-end web server always sets or strips that header based on the appropriate authentication checks, never permitting an end-user to submit a fake (or "spoofed") header value. Since the HTTP headers ``X-Auth-User`` and ``X-Auth_User`` (for example) both normalize to the ``HTTP_X_AUTH_USER`` key in ``request.META``, you must also check that your web server doesn't allow a spoofed header using underscores in place of dashes.
ru: Будьте осторожны при наследовании от ``RemoteUserMiddleware`` и использовании собственного HTTP заголовка. Вы должны быть уверенны, что внешний(front-end) веб-сервер всегда устанавливает или удаляет этот заголовок при проверке авторизации, не позволяя пользователю явно передать неверное или поддельное значение. Т.к. HTTP заголовки ``X-Auth-User`` и ``X-Auth_User`` (например) приводятся к ``HTTP_X_AUTH_USER`` в ``request.META``, веб сервер также должен предотвращать подделку этих заголовков, путем использования подчеркивания вместо дефиса.

source: This warning doesn't apply to ``RemoteUserMiddleware`` in its default configuration with ``header = 'REMOTE_USER'``, since a key that doesn't start with ``HTTP_`` in ``request.META`` can only be set by your WSGI server, not directly from an HTTP request header.
ru: Это замечание не относится к параметрам по умолчанию для ``RemoteUserMiddleware``(``header = 'REMOTE_USER'``), т.к. ключ без ``HTTP_`` в ``request.META`` может быть установлен только WSGI сервером, а не HTTP заголовком запроса.

source: If you need more control, you can create your own authentication backend that inherits from :class:`~django.contrib.auth.backends.RemoteUserBackend` and override one or more of its attributes and methods.
ru: При необходимости большего контроля допускается создание собственного бэкенда(backend) аутентификации, который должен наследоваться от :class:`~django.contrib.auth.backends.RemoteUserBackend` и отменять кое-что:

source: Using ``REMOTE_USER`` on login pages only
ru: Использование ``REMOTE_USER`` только на странице авторизации

source: The ``RemoteUserMiddleware`` authentication middleware assumes that the HTTP request header ``REMOTE_USER`` is present with all authenticated requests. That might be expected and practical when Basic HTTP Auth with ``htpasswd`` or other simple mechanisms are used, but with Negotiate (GSSAPI/Kerberos) or other resource intensive authentication methods, the authentication in the front-end HTTP server is usually only set up for one or a few login URLs, and after successful authentication, the application is supposed to maintain the authenticated session itself.
ru: ``RemoteUserMiddleware`` предполагает, что HTTP заголовок ``REMOTE_USER`` присутствует для всех запросов. Это удобно для Basic HTTP Auth с помощью ``htpasswd``, или других простых механизмов, но для Negotiate (GSSAPI/Kerberos), или других сложных механизмов авторизации, авторизация на "front-end" HTTP сервере используется только для нескольких URL-ов страниц входа, и после успешной авторизации предполагается, что приложения будет самостоятельно работать с сессией.

source: :class:`~django.contrib.auth.middleware.PersistentRemoteUserMiddleware` provides support for this use case. It will maintain the authenticated session until explicit logout by the user. The class can be used as a drop-in replacement of :class:`~django.contrib.auth.middleware.RemoteUserMiddleware` in the documentation above.
ru: :class:`~django.contrib.auth.middleware.PersistentRemoteUserMiddleware` предоставляет такую возможность. Сессия пользователя поддерживается, пока пользователь явно не выполнит выход. Этот класс может использоваться вместо :class:`~django.contrib.auth.middleware.RemoteUserMiddleware`.
