Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/howto/custom-management-commands.po
Languages: ru

source: Applications can register their own actions with ``manage.py``. For example, you might want to add a ``manage.py`` action for a Django app that you're distributing. In this document, we will be building a custom ``closepoll`` command for the ``polls`` application from the :doc:`tutorial</intro/tutorial01>`.
ru: Проект может быть расширен собственными командами для ``manage.py``. Например, вы можете добавить действие для развёртывания. Здесь же мы будем реализовывать действие ``closepoll`` для приложения ``polls`` из :doc:`tutorial</intro/tutorial01>`.

source: In this example, the ``closepoll`` command will be made available to any project that includes the ``polls`` application in :setting:`INSTALLED_APPS`.
ru: В этом примере команда ``closepoll`` будет доступна для любого проекта, который импортирует приложение ``polls`` в :setting:`INSTALED_APPS`.

source: The ``_private.py`` module will not be available as a management command.
ru: Модуль ``_private.py`` не доступен как команда для ``manage.py``.

source: The ``closepoll.py`` module has only one requirement -- it must define a class ``Command`` that extends :class:`BaseCommand` or one of its :ref:`subclasses<ref-basecommand-subclasses>`.
ru: Для модуля ``closepoll.py`` должно быть соблюдено лишь одно требование - наличие в нём класса ``Command``, который унаследован от :class:`BaseCommand` или его :ref:`потомков<ref-basecommand-subclasses>`.

source: Standalone scripts
ru: Автономные скрипты

source: Custom management commands are especially useful for running standalone scripts or for scripts that are periodically executed from the UNIX crontab or from Windows scheduled tasks control panel.
ru: Собственные команды могут быть полезны для реализации отдельных скриптов, например, для планировщика Windows или crontab.

source: To implement the command, edit ``polls/management/commands/closepoll.py`` to look like this::
ru: Для реализации команды отредактируйте ``polls/management/commands/closepoll.py`` следующим образом::

source: When you are using management commands and wish to provide console output, you should write to ``self.stdout`` and ``self.stderr``, instead of printing to ``stdout`` and ``stderr`` directly. By using these proxies, it becomes much easier to test your custom command. Note also that you don't need to end messages with a newline character, it will be added automatically, unless you specify the ``ending`` parameter::
ru: При реализации команды вы должны использовать ``self.stdout`` и ``self.stderr`` вместо ``stdout`` и ``stderr``. Использование такого перенаправления может помочь при тестировании скрипта. Кстати, стоит помнить, что символ перевода строки ставится по умолчанию, если вы не указали другой в параметре ``ending``::

source: Accepting optional arguments
ru: Получение необязательных аргументов

source: The same ``closepoll`` could be easily modified to delete a given poll instead of closing it by accepting additional command line options. These custom options can be added in the :meth:`~BaseCommand.add_arguments` method like this::
ru: Аналогичный ``closepoll`` может быть легко изменён на удаление указанного голосования вместо его закрытия, для этого надо указать дополнительные аргументы при запуске команды. Такие дополнительные опции можно добавить в метод :meth:`~BaseCommand.add_arguments` примерно так::

source: The option (``delete`` in our example) is available in the options dict parameter of the handle method. See the :py:mod:`argparse` Python documentation for more about ``add_argument`` usage.
ru: Параметр (``delete`` в нашем случае) доступен в словаре параметров метода ``handle()``. Подробнее можно посмотреть в документации по :py:mod:`argparse`, где говорится про использование ``add_argument``.

source: Management commands and locales
ru: Команды и локализация

source: Testing
ru: Тестирование

source: Information on how to test custom management commands can be found in the :ref:`testing docs <topics-testing-management-commands>`.
ru: Информация, о том как тестировать команды управления, может быть найдена в :ref:`соответствующей документации <topics-testing-management-commands>`.

source: Command objects
ru: Объект команды

source: The base class from which all management commands ultimately derive.
ru: Базовый класс для всех команд.

source: Use this class if you want access to all of the mechanisms which parse the command-line arguments and work out what code to call in response; if you don't need to change any of that behavior, consider using one of its :ref:`subclasses<ref-basecommand-subclasses>`.
ru: Используйте этот класс, если хотите добраться до всех механизмов, которые занимаются разбором аргументов командной строки и возвратом значения. Если вам не нужно вносить изменения в поведение, используйте один из его :ref:`подклассов<ref-basecommand-subclasses>`.

source: Subclassing the :class:`BaseCommand` class requires that you implement the :meth:`~BaseCommand.handle` method.
ru: Наследование от :class:`BaseCommand` подразумевает, что будет реализован метод :meth:`~BaseCommand.handle`.

source: Attributes
ru: Атрибуты

source: All attributes can be set in your derived class and can be used in :class:`BaseCommand`’s :ref:`subclasses<ref-basecommand-subclasses>`.
ru: Все перечисленные атрибуты могут использоваться в производных от :class:`BaseCommand` :ref:`классах<ref-basecommand-subclasses>`.

source: A short description of the command, which will be printed in the help message when the user runs the command ``python manage.py help <command>``.
ru: Краткое описание команды, которое будет выведено в справочном сообщении при выполнении ``python manage.py help <command>``.

source: If your command defines mandatory positional arguments, you can customize the message error returned in the case of missing arguments. The default is output by :py:mod:`argparse` ("too few arguments").
ru: Если ваша команда определяет обязательные позиционные аргументы, вы можете настроить возвращаемое сообщение об ошибке, возвращаемое в случае пропуска аргументов. По умолчанию, возвращается ответ от :py:mod:`argparse` ("too few arguments").

source: A boolean indicating whether the command outputs SQL statements; if ``True``, the output will automatically be wrapped with ``BEGIN;`` and ``COMMIT;``. Default value is ``False``.
ru: Булево значение, которое определяет будет ли команда выводить SQL выражения. Если установлено в ``True``, то весь вывод будет автоматически заключён между ``BEGIN;`` и ``COMMIT;``. Значение по умолчанию - ``False``.

source: A boolean; if ``True``, the entire Django project will be checked for potential problems prior to executing the command. Default value is ``True``.
ru: При ``True`` Django выполнит проверку всего проекта на наличие проблем перед выполнением команды. По умолчанию ``True``.

source: An instance attribute that helps create colored output when writing to ``stdout`` or ``stderr``. For example::
ru: Атрибут экземпляра команды, который помогает выделять цветом вывод в ``stdout`` или ``stderr``. Например::

source: See :ref:`syntax-coloring` to learn how to modify the color palette and to see the available styles (use uppercased versions of the "roles" described in that section).
ru: Смотрите :ref:`syntax-coloring`, чтобы узнать доступные стили и как поменять цвета (используйте названия "ролей", описанных в этом разделе, в верхнем регистре).

source: Methods
ru: Методы

source: :class:`BaseCommand` has a few methods that can be overridden but only the :meth:`~BaseCommand.handle` method must be implemented.
ru: :class:`BaseCommand` содержит несколько методов, которые могут быть переопределены, однако для минимальной работы команды требуется только реализация метода :meth:`~BaseCommand.handle`.

source: Implementing a constructor in a subclass
ru: Переопределение конструктора

source: If you implement ``__init__`` in your subclass of :class:`BaseCommand`, you must call :class:`BaseCommand`’s ``__init__``::
ru: Если вы переопределяете ``__init__``, убедитесь, что вызываете в нём ``__init__`` базового класса :class:`BaseCommand`::

source: Entry point to add parser arguments to handle command line arguments passed to the command. Custom commands should override this method to add both positional and optional arguments accepted by the command. Calling ``super()`` is not needed when directly subclassing ``BaseCommand``.
ru: Точка входа для добавления аргументов парсера для обработки аргументов командной строки. Команды должны переопределять этот метод для добавления как позиционных, так и необязательных аргументов, принимаемых командой. Вызов ``super()`` не требуется при прямом наследовании ``BaseCommand``.

source: Returns the Django version, which should be correct for all built-in Django commands. User-supplied commands can override this method to return their own version.
ru: Возвращает версию Django, которая необходима для работы всех встроенных команд Django. Пользовательские команды могут переопределить этот метод и вернуть свою версию.

source: Calling a management command in your code
ru: Вызов команды в коде

source: The actual logic of the command. Subclasses must implement this method.
ru: Собственно, логика команды. Ваш подкласс обязательно должен реализовывать этот метод.

source: If ``app_configs`` and ``tags`` are both ``None``, all system checks are performed. ``tags`` can be a list of check tags, like ``compatibility`` or ``models``.
ru: Если ``app_configs`` и ``tags`` равны ``None``, выполняется полная проверка. ``tags`` может содержкать список тегов, указывающих что проверять, например, ``compatibility`` или ``models``.

source: A management command which takes one or more installed application labels as arguments, and does something with each of them.
ru: Служебная команда, которая принимает в качестве аргументов имена установленных приложений и выполняет с ними однотипные действия.

source: Rather than implementing :meth:`~BaseCommand.handle`, subclasses must implement :meth:`~AppCommand.handle_app_config`, which will be called once for each application.
ru: Вместо реализации :meth:`~BaseCommand.handle`, реализуйте метод :meth:`~AppCommand.handle_app_config`, который будет вызываться для каждого приложения.

source: Perform the command's actions for ``app_config``, which will be an :class:`~django.apps.AppConfig` instance corresponding to an application label given on the command line.
ru: Выполняет действия для ``app_config``, который является объектом :class:`~django.apps.AppConfig` приложения, которое было указано при выполнении команды.

source: A management command which takes one or more arbitrary arguments (labels) on the command line, and does something with each of them.
ru: Команда, которая принимает один или несколько аргументов в командной строке (меток) и что-то делает с ними.

source: Rather than implementing :meth:`~BaseCommand.handle`, subclasses must implement :meth:`~LabelCommand.handle_label`, which will be called once for each label.
ru: Вместо реализации :meth:`~BaseCommand.handle` нужно реализовать :meth:`~LabelCommand.handle_label`, который будет вызываться для каждого аргумента.

source: Perform the command's actions for ``label``, which will be the string as given on the command line.
ru: Выполняет действие для ``label``, которая была передана через командную строку.

source: Command exceptions
ru: Исключение команды

source: Exception class indicating a problem while executing a management command.
ru: Этот класс сигнализирует о неожиданных ситуациях при выполнении команды.

source: If this exception is raised during the execution of a management command from a command line console, it will be caught and turned into a nicely-printed error message to the appropriate output stream (i.e., stderr); as a result, raising this exception (with a sensible description of the error) is the preferred way to indicate that something has gone wrong in the execution of a command.
ru: Если это исключение произошло в ходе выполнения команды из консоли, то оно будет преобразовано в понятное сообщение об ошибке и выведено в стандартный поток ошибок (например, stderr). Генерация этого исключения (с подробным описанием ошибки) - предпочтительный способ сообщения об исключительной ситуации в ходе выполнения команды.
