Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/howto/custom-template-tags.po
Languages: ru

source: Our ``current_time`` function could thus be written like this::
ru: Функцию ``current_time`` можно переписать следующим образом::

source: A few things to note about the ``simple_tag`` helper function:
ru: Несколько вещей которые следует помнить о функции ``simple_tag``:

source: Checking for the required number of arguments, etc., has already been done by the time our function is called, so we don't need to do that.
ru: Проверка количества обязательных аргументов и др. выполняется до вызова функции, вам не нужно этого делать.

source: The quotes around the argument (if any) have already been stripped away, so we just receive a plain string.
ru: Кавычки вокруг строк уже удалены, аргумент будет содержать готовую строку.

source: If the argument was a template variable, our function is passed the current value of the variable, not the variable itself.
ru: Если аргумент является переменной шаблона, наша функция получит ее значение.

source: Unlike other tag utilities, ``simple_tag`` passes its output through :func:`~django.utils.html.conditional_escape` if the template context is in autoescape mode, to ensure correct HTML and protect you from XSS vulnerabilities.
ru: В отличии от других утилит тегов, ``simple_tag`` обрабатывает результат функцией :func:`~django.utils.html.conditional_escape`, если контекст шаблона в режиме автоматического экранирования, чтобы убедиться в правильности HTML и защитить вас от XSS атак.

source: If additional escaping is not desired, you will need to use :func:`~django.utils.safestring.mark_safe` if you are absolutely sure that your code does not contain XSS vulnerabilities. For building small HTML snippets, use of :func:`~django.utils.html.format_html` instead of ``mark_safe()`` is strongly recommended.
ru: Если экранирование не нужно, вы можете использовать функцию :func:`~django.utils.safestring.mark_safe`, если вы абсолютно уверены, что ваш код не содержит XSS уязвимостей. Для создание небольших кусков HTML настоятельно рекомендуется использовать :func:`~django.utils.html.format_html` вместо ``mark_safe()``.

source: If your template tag needs to access the current context, you can use the ``takes_context`` argument when registering your tag::
ru: Если тегу необходим текущий контекст, используйте параметр ``takes_context`` при регистрации тега::

source: Note that the first argument *must* be called ``context``.
ru: Заметим, что первый параметр *должен* называться ``context``.

source: For more information on how the ``takes_context`` option works, see the section on :ref:`inclusion tags<howto-custom-template-tags-inclusion-tags>`.
ru: Подробности о параметре ``takes_context`` смотрите в разделе о :ref:`включающих тегах<howto-custom-template-tags-inclusion-tags>`.

source: If you need to rename your tag, you can provide a custom name for it::
ru: Если вам нужно изменить название тега, передайте его параметром::

source: ``simple_tag`` functions may accept any number of positional or keyword arguments. For example::
ru: Теги, зарегистрированные через ``simple_tag`` могут принимать любое количество позиционных или именованных аргументов. Например::

source: Then in the template any number of arguments, separated by spaces, may be passed to the template tag. Like in Python, the values for keyword arguments are set using the equal sign ("``=``") and must be provided after the positional arguments. For example:
ru: Теперь в тег можно передать любое количество позиционных аргументов, разделенных пробелами. Как и в Python, значения для именованных аргументов можно указать, используя знак "``=``" после именованных аргументов. Например:

source: It's possible to store the tag results in a template variable rather than directly outputting it. This is done by using the ``as`` argument followed by the variable name. Doing so enables you to output the content yourself where you see fit:
ru: Вы можете добавить результат в переменную шаблона, используя аргумент ``as`` и название переменной, и использовать его при необходимости:

source: Inclusion tags
ru: Включающие теги

source: Another common type of template tag is the type that displays some data by rendering *another* template. For example, Django's admin interface uses custom template tags to display the buttons along the bottom of the "add/change" form pages. Those buttons always look the same, but the link targets change depending on the object being edited -- so they're a perfect case for using a small template that is filled with details from the current object. (In the admin's case, this is the ``submit_row`` tag.)
ru: Еще один тип тегов -- это теги, которые выполняют *другой* шаблон и показывают результат. Например, интерфейс администратора Django использует включающий тег для отображения кнопок под формой на страницах добавления/редактирования объектов. Эти кнопки выглядят всегда одинаково, но ссылки зависят от текущего объекта -- небольшой шаблон, который выполняется с данными из текущего объекта, удобно использовать в данном случае. (В приложении администратора это тег ``submit_row``.)

source: These sorts of tags are called "inclusion tags".
ru: Такие теги называются "включающие теги".

source: Writing inclusion tags is probably best demonstrated by example. Let's write a tag that outputs a list of choices for a given ``Poll`` object, such as was created in the :ref:`tutorials <creating-models>`. We'll use the tag like this:
ru: Лучше пояснить на примере. Давайте создадим тег, который выводит список вариантов ответов для объекта модели ``Poll``, которая использовалась в :ref:`учебнике <creating-models>`. Мы будем использовать его следующим образом:

source: ...and the output will be something like this:
ru: ...результат будет выглядеть приблизительно следующим образом:

source: First, define the function that takes the argument and produces a dictionary of data for the result. The important point here is we only need to return a dictionary, not anything more complex. This will be used as a template context for the template fragment. Example::
ru: Первым делом, создадим функцию, которая принимает аргумент и возвращает словарь с данными. Заметим, что все что нам нужно, это вернуть словарь и ничего более сложного. Он будет использоваться как контекст для включаемого фрагмента шаблона. Например::

source: Next, create the template used to render the tag's output. This template is a fixed feature of the tag: the tag writer specifies it, not the template designer. Following our example, the template is very simple:
ru: Теперь создадим шаблон, который будет использоваться для генерации результата. Этот шаблон полностью относится к тегу: создатель тега определяет его, не создатель шаблонов(template designer). Для нашего примера шаблон будет очень простым:

source: Now, create and register the inclusion tag by calling the ``inclusion_tag()`` method on a ``Library`` object. Following our example, if the above template is in a file called ``results.html`` in a directory that's searched by the template loader, we'd register the tag like this::
ru: Теперь создадим и зарегистрируем тег, используя метод ``inclusion_tag()`` объекта ``Library``. Для нашего примера, если шаблон тега называется ``results.html``, мы зарегистрируем тег следующим образом::

source: Alternatively it is possible to register the inclusion tag using a :class:`django.template.Template` instance::
ru: Также можно зарегистрировать включающий тег используя экземпляр :class:`django.template.Template`::

source: ...when first creating the function.
ru: ...при создании функции.

source: Sometimes, your inclusion tags might require a large number of arguments, making it a pain for template authors to pass in all the arguments and remember their order. To solve this, Django provides a ``takes_context`` option for inclusion tags. If you specify ``takes_context`` in creating a template tag, the tag will have no required arguments, and the underlying Python function will have one argument -- the template context as of when the tag was called.
ru: В некоторых случаях тег может требовать большого количества параметров. Может быть проблематично запомнить все параметры и их порядок. Чтобы решить эту проблему Django предоставляет параметр ``takes_context`` для включающего тега. Если указать ``takes_context`` при создании тега, тег не будет содержать обязательные аргументы, а функция Python будет принимать один аргумент -- контекст текущего шаблона.

source: For example, say you're writing an inclusion tag that will always be used in a context that contains ``home_link`` and ``home_title`` variables that point back to the main page. Here's what the Python function would look like::
ru: Например, предположим вы создаете тег, который будет использоваться в шаблонах с контекстом всегда содержащим переменные ``home_link`` и ``home_title``. Вот как может выглядеть такой тег::

source: Note that the first parameter to the function *must* be called ``context``.
ru: Заметим, что первый параметр *должен* называться ``context``.

source: In that ``register.inclusion_tag()`` line, we specified ``takes_context=True`` and the name of the template. Here's what the template ``link.html`` might look like:
ru: При вызове ``register.inclusion_tag()`` мы указали ``takes_context=True`` и название включаемого шаблона. Вот как может выглядеть шаблон ``link.html``:

source: Then, any time you want to use that custom tag, load its library and call it without any arguments, like so:
ru: Для использования тега необходимо загрузить библиотеку тегов и вызвать тег без аргументов:

source: Note that when you're using ``takes_context=True``, there's no need to pass arguments to the template tag. It automatically gets access to the context.
ru: Заметим, что при использовании ``takes_context=True`` необязательно передавать аргументы. Тег будет иметь доступ ко всему контексту шаблона.

source: The ``takes_context`` parameter defaults to ``False``. When it's set to ``True``, the tag is passed the context object, as in this example. That's the only difference between this case and the previous ``inclusion_tag`` example.
ru: Параметр ``takes_context`` по умолчанию равен ``False``. Если он равен ``True``, в тег будет передан объект контекста.

source: ``inclusion_tag`` functions may accept any number of positional or keyword arguments. For example::
ru: ``inclusion_tag`` может принимать любое количество позиционных и именованных аргументов. Например::

source: Advanced custom template tags
ru: Создание собственного шаблонного тега

source: Sometimes the basic features for custom template tag creation aren't enough. Don't worry, Django gives you complete access to the internals required to build a template tag from the ground up.
ru: Иногда не достаточно базовых инструментов для создания тегов. Не волнуйтесь, Django предоставляет полный доступ к внутренностям шаблонизатора, что позволяет создать свой тег с нуля.

source: A quick overview
ru: Краткий обзор

source: The template system works in a two-step process: compiling and rendering. To define a custom template tag, you specify how the compilation works and how the rendering works.
ru: Система шаблонов работает в два этапа: компиляция и выполнение. Создавая собственный тег вы определяете как выполняется компиляция и выполнение тега.

source: When Django compiles a template, it splits the raw template text into ''nodes''. Each node is an instance of ``django.template.Node`` and has a ``render()`` method. A compiled template is, simply, a list of ``Node`` objects. When you call ``render()`` on a compiled template object, the template calls ``render()`` on each ``Node`` in its node list, with the given context. The results are all concatenated together to form the output of the template.
ru: Когда Django компилирует шаблон, содержимое шаблона разбивается на "узлы" (nodes). Каждый узел это экземпляр ``django.template.Node`` с методом ``render()``. Откомпилированный шаблон это просто список объектов ``Node``. Когда вы вызываете метод ``render()`` откомпилированного объекта шаблона, шаблон просто вызывает ``render()`` для каждого объекта ``Node`` в списке узлов с переданным контекстом. Результаты объединяются для получения окончательного результата.

source: Thus, to define a custom template tag, you specify how the raw template tag is converted into a ``Node`` (the compilation function), and what the node's ``render()`` method does.
ru: Таким образом, создавая собственный тег, вы указываете как "сырой" тег шаблона конвертируется в объект ``Node`` (функцию компиляции) и что делает метод ``render()``.

source: Writing the compilation function
ru: Создание функции компиляции

source: For each template tag the template parser encounters, it calls a Python function with the tag contents and the parser object itself. This function is responsible for returning a ``Node`` instance based on the contents of the tag.
ru: Для каждого тега, с которым сталкивается парсер шаблона, вызывается его функция Python с содержимым тега и объектом парсера. Эта функция должна вернуть экземпляр ``Node``.

source: For example, let's write a full implementation of our simple template tag, ``{% current_time %}``, that displays the current date/time, formatted according to a parameter given in the tag, in :func:`~time.strftime` syntax. It's a good idea to decide the tag syntax before anything else. In our case, let's say the tag should be used like this:
ru: Например, давайте создадим тег, ``{% current_time %}``, который отображает текущую дату и время, отформатированные в соответствии с переданным параметром с синтаксисом аналогичным :func:`~time.strftime`. Первым делом следует определиться с синтаксисом тега. В нашем случае тег будет использоваться следующим образом:

source: The parser for this function should grab the parameter and create a ``Node`` object::
ru: Парсер функции должен получить параметр и вернуть объект ``Node``::

source: Notes:
ru: Заметки:

source: ``parser`` is the template parser object. We don't need it in this example.
ru: ``parser`` -- парсер шаблона. Он нам не нужен в данном примере.

source: ``token.contents`` is a string of the raw contents of the tag. In our example, it's ``'current_time "%Y-%m-%d %I:%M %p"'``.
ru: ``token.contents`` -- содержимое тега. В нашем примере это ``'current_time "%Y-%m-%d %I:%M %p"'``.

source: The ``token.split_contents()`` method separates the arguments on spaces while keeping quoted strings together. The more straightforward ``token.contents.split()`` wouldn't be as robust, as it would naively split on *all* spaces, including those within quoted strings. It's a good idea to always use ``token.split_contents()``.
ru: Метод ``token.split_contents()`` разбивает аргументы разделенные пробелами при это не разбивая строки выделенные кавычками. Более простой метод ``token.contents.split()`` может быть не таким полезным и надежным так как разбивает по *всем* пробелам, включая пробелы в кавычках. Лучше всегда использовать ``token.split_contents()``.

source: This function is responsible for raising ``django.template.TemplateSyntaxError``, with helpful messages, for any syntax error.
ru: Эта функция может вызвать исключение ``django.template.TemplateSyntaxError`` в случае синтаксической ошибки при использовании вашего тега.

source: The ``TemplateSyntaxError`` exceptions use the ``tag_name`` variable. Don't hard-code the tag's name in your error messages, because that couples the tag's name to your function. ``token.contents.split()[0]`` will ''always'' be the name of your tag -- even when the tag has no arguments.
ru: Исключение ``TemplateSyntaxError`` использует переменную ``tag_name``. Не вписывайте название тега в сообщение ошибки, потому что это привязывает название тега к функции. ``token.contents.split()[0]`` ''всегда'' содержит название тега -- даже если тег не содержит аргументы.

source: The function returns a ``CurrentTimeNode`` with everything the node needs to know about this tag. In this case, it just passes the argument -- ``"%Y-%m-%d %I:%M %p"``. The leading and trailing quotes from the template tag are removed in ``format_string[1:-1]``.
ru: Функция возвращает экземпляр ``CurrentTimeNode`` передавая в конструктор необходимую информацию с тега. В нашем примере передается ``"%Y-%m-%d %I:%M %p"``. Кавычки удаляются с помощью ``format_string[1:-1]``.

source: The parsing is very low-level. The Django developers have experimented with writing small frameworks on top of this parsing system, using techniques such as EBNF grammars, but those experiments made the template engine too slow. It's low-level because that's fastest.
ru: Парсер -- очень низкоуровневый. Разработчики Django экспериментировали с созданием различных микро-фреймверков поверх системы парсинга, используя техники, такие как грамматика `EBNF <http://ru.wikipedia.org/wiki/%D0%A0%D0%B0%D1%81%D1%88%D0%B8%D1%80%D0%B5%D0%BD%D0%BD%D0%B0%D1%8F_%D1%84%D0%BE%D1%80%D0%BC%D0%B0_%D0%91%D1%8D%D0%BA%D1%83%D1%81%D0%B0_%E2%80%94_%D0%9D%D0%B0%D1%83%D1%80%D0%B0>`_, но эти эксперименты делали систему шаблонов медленной. Парсер низкоуровневый, так как это делает его быстрым.

source: Writing the renderer
ru: Реализация выполнения тега

source: The second step in writing custom tags is to define a ``Node`` subclass that has a ``render()`` method.
ru: Следующим этапом мы создаем подкласс ``Node`` с методом ``render()``.

source: Continuing the above example, we need to define ``CurrentTimeNode``::
ru: В продолжение нашего примера создадим класс ``CurrentTimeNode``::

source: ``__init__()`` gets the ``format_string`` from ``do_current_time()``. Always pass any options/parameters/arguments to a ``Node`` via its ``__init__()``.
ru: ``__init__()`` принимает аргумент ``format_string`` из ``do_current_time()``. Всегда передавайте параметры в ``Node`` через ``__init__()``.

source: The ``render()`` method is where the work actually happens.
ru: Метод ``render()`` выполняет основную работу.

source: ``render()`` should generally fail silently, particularly in a production environment. In some cases however, particularly if ``context.template.engine.debug`` is ``True``, this method may raise an exception to make debugging easier. For example, several core tags raise ``django.template.TemplateSyntaxError`` if they receive the wrong number or type of arguments.
ru: ``render()`` не должен вызывать исключений, особенно на боевом сервере. Однако, в некоторых случаях, особенно при :setting:`TEMPLATE_DEBUG` равном ``True``, метод может вызывать исключения для упрощения отладки. Например, некоторые встроенные теги вызывают ``django.template.TemplateSyntaxError``, если передать неверное количество или тип аргументов.

source: Ultimately, this decoupling of compilation and rendering results in an efficient template system, because a template can render multiple contexts without having to be parsed multiple times.
ru: Разделение компиляции и выполнения эффективно так как позволяет выполнить шаблон с несколькими контекстами без надобности выполнять парсинг каждый раз.

source: Auto-escaping considerations
ru: Работа с автоматическим экранированием

source: The output from template tags is **not** automatically run through the auto-escaping filters (with the exception of :meth:`~django.template.Library.simple_tag` as described above). However, there are still a couple of things you should keep in mind when writing a template tag.
ru: Вывод тега **не** экранируется(за исключением :meth:`~django.template.Library.simple_tag`). Однако, есть несколько вещей которые следует помнить.

source: If the ``render()`` function of your template stores the result in a context variable (rather than returning the result in a string), it should take care to call ``mark_safe()`` if appropriate. When the variable is ultimately rendered, it will be affected by the auto-escape setting in effect at the time, so content that should be safe from further escaping needs to be marked as such.
ru: Если метод ``render()`` добавляет переменную в контекст (вместо того, чтобы вернуть строку), он должен пометить ее как безопасную используя функцию ``mark_safe()``, если это необходимо. В конечном итоге к переменной будет применяться автоматическое экранирование при выводе в шаблоне, так что необходимо пометить ее как безопасную чтобы избежать повторного экранирования значения.

source: Also, if your template tag creates a new context for performing some sub-rendering, set the auto-escape attribute to the current context's value. The ``__init__`` method for the ``Context`` class takes a parameter called ``autoescape`` that you can use for this purpose. For example::
ru: Если тег создает новый контекст, необходимо установить параметр автоматического экранирования со значением текущего контекста. Метод ``__init__`` класса ``Context`` принимает аргумент ``autoescape``, который вы можете использовать. Например::

source: This is not a very common situation, but it's useful if you're rendering a template yourself. For example::
ru: Это не совсем обычная ситуация, но может быть полезно если вы самостоятельно выполняете шаблон. Например::

source: If we had neglected to pass in the current ``context.autoescape`` value to our new ``Context`` in this example, the results would have *always* been automatically escaped, which may not be the desired behavior if the template tag is used inside a :ttag:`{% autoescape off %}<autoescape>` block.
ru: Если бы мы не передали значение ``context.autoescape`` в новый ``Context``, результат *всегда* экранировался бы, что может быть неуместным при использовании тега в блоке :ttag:`{% autoescape off %}<autoescape>`.

source: Thread-safety considerations
ru: Учитываем потокобезопасность

source: Once a node is parsed, its ``render`` method may be called any number of times. Since Django is sometimes run in multi-threaded environments, a single node may be simultaneously rendering with different contexts in response to two separate requests. Therefore, it's important to make sure your template tags are thread safe.
ru: После парсинга тега и создания узла его метод ``render`` может быть вызван любое количество раз. Так как Django может выполняться в мультипоточном окружении, один узел может выполняться с несколькими контекстами для различных запросов. По этом важно удостовериться что ваши шаблонные теги являются потокобезопасными.

source: To make sure your template tags are thread safe, you should never store state information on the node itself. For example, Django provides a builtin :ttag:`cycle` template tag that cycles among a list of given strings each time it's rendered:
ru: Чтобы ваш шаблонный тег был потокобезопасный, вы не должны сохранять информацию о состоянии в узле. Например, Django предоставляет тег :ttag:`cycle`, который переключается между аргументами при каждом вызове:

source: A naive implementation of ``CycleNode`` might look something like this::
ru: Реализация ``CycleNode`` могла бы выглядеть следующим образом::

source: But, suppose we have two templates rendering the template snippet from above at the same time:
ru: Однако, предположим что одновременно выполняется два экземпляра шаблона представленного выше:

source: Thread 1 performs its first loop iteration, ``CycleNode.render()`` returns 'row1'
ru: Поток 1 выполняет первую итерацию по циклу, ``CycleNode.render()`` возвращает 'row1'

source: Thread 2 performs its first loop iteration, ``CycleNode.render()`` returns 'row2'
ru: Поток 2 выполняет первую итерацию по циклу, ``CycleNode.render()`` возвращает 'row2'

source: Thread 1 performs its second loop iteration, ``CycleNode.render()`` returns 'row1'
ru: Поток 1 выполняет вторую итерацию по циклу, ``CycleNode.render()`` возвращает 'row1'

source: Thread 2 performs its second loop iteration, ``CycleNode.render()`` returns 'row2'
ru: Поток 2 выполняет вторую итерацию по циклу, ``CycleNode.render()`` возвращает 'row2'
