Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/howto/custom-model-fields.po
Languages: ru

source: As always, you should document your field type, so users will know what it is. In addition to providing a docstring for it, which is useful for developers, you can also allow users of the admin app to see a short description of the field type via the :doc:`django.contrib.admindocs </ref/contrib/admin/admindocs>` application. To do this simply provide descriptive text in a :attr:`~Field.description` class attribute of your custom field. In the above example, the description displayed by the ``admindocs`` application for a ``HandField`` will be 'A hand of cards (bridge style)'.
ru: Конечно же вам необходимо задокументировать ваше поле, чтобы пользователи знали как его использовать. В дополнение к docstring, который удобен для разработчиков, вы можете предоставить описание поля, которое будет отображаться в разделе документации в интерфейсе администратора, созданном с :doc:`django.contrib.admindocs </ref/contrib/admin/admindocs>`. Для этого укажите описание в атрибуте :attr:`~Field.description` класса поля. В нашем примере описание поля ``HandField`` в приложении ``admindocs`` будет - 'A hand of cards (bridge style)'.

source: In the :mod:`django.contrib.admindocs` display, the field description is interpolated with ``field.__dict__`` which allows the description to incorporate arguments of the field. For example, the description for :class:`~django.db.models.CharField` is::
ru: На страницах :mod:`django.contrib.admindocs` описание поля включает ``field.__dict__``, что позволяет включить описание аргументов. Например, описание :class:`~django.db.models.CharField` выглядит следующим образом::

source: Useful methods
ru: Полезные методы

source: Once you've created your :class:`~django.db.models.Field` subclass, you might consider overriding a few standard methods, depending on your field's behavior. The list of methods below is in approximately decreasing order of importance, so start from the top.
ru: После того как вы создали свой подкласс :class:`~django.db.models.Field`, можно переходить к переопределению методов, которые определяют поведение вашего поля. Методы описанные ниже идут в порядке убывания важности.

source: Custom database types
ru: Типы полей базы данных

source: Say you've created a PostgreSQL custom type called ``mytype``. You can subclass ``Field`` and implement the :meth:`~Field.db_type` method, like so::
ru: Предположим вы создали собственный тип поля для PostgreSQL - ``mytype``. Вы можете использовать его в Django, унаследовав ``Field`` и добавив следующий метод :meth:`~Field.db_type`::

source: Once you have ``MytypeField``, you can use it in any model, just like any other ``Field`` type::
ru: Создав ``MytypeField`` вы можете использовать его в моделях так же, как и другие подтипы ``Field``::

source: If you aim to build a database-agnostic application, you should account for differences in database column types. For example, the date/time column type in PostgreSQL is called ``timestamp``, while the same column in MySQL is called ``datetime``. The simplest way to handle this in a :meth:`~Field.db_type` method is to check the ``connection.settings_dict['ENGINE']`` attribute.
ru: Если вы создаете приложение независимое от используемой базы данных, учитывайте, что разные базы данных используют различные типа полей. Например, поле даты/времени в PostgreSQL называется ``timestamp``, а в MySQL -- ``datetime``. Самый простой способ: проверять значение `connection.settings_dict['ENGINE']`` в методе :meth:`~Field.db_type`.

source: For example::
ru: Например::

source: The :meth:`~Field.db_type` and :meth:`~Field.rel_db_type` methods are called by Django when the framework constructs the ``CREATE TABLE`` statements for your application -- that is, when you first create your tables. The methods are also called when constructing a ``WHERE`` clause that includes the model field -- that is, when you retrieve data using QuerySet methods like ``get()``, ``filter()``, and ``exclude()`` and have the model field as an argument. They are not called at any other time, so it can afford to execute slightly complex code, such as the ``connection.settings_dict`` check in the above example.
ru: Методы :meth:`~Field.db_type` и :meth:`~Field.rel_db_type` используются Django при создании ``CREATE TABLE`` запросов -- когда вы создаете таблицы в базе данных для приложения. Также при создании условий в ``WHERE``, которые используют поле -- это когда вы используете методы QuerySet для получения данных, такие как ``get()``, ``filter()`` или ``exclude()``, и используете ваше поле в качестве аргумента. Больше нигде этот метод не используется, вы можете использовать достаточно сложный код, как проверка ``connection.settings_dict`` в примере выше.

source: Some database column types accept parameters, such as ``CHAR(25)``, where the parameter ``25`` represents the maximum column length. In cases like these, it's more flexible if the parameter is specified in the model rather than being hard-coded in the ``db_type()`` method. For example, it wouldn't make much sense to have a ``CharMaxlength25Field``, shown here::
ru: Некоторые типы полей принимают параметры, например ``CHAR(25)``, где ``25`` указывают максимальный размер колонки. В этом случае лучше указывать параметр в модели, чем хардкодить в методе ``db_type()``. Например, глупо создавать поле ``CharMaxlength25Field``::

source: The better way of doing this would be to make the parameter specifiable at run time -- i.e., when the class is instantiated. To do that, just implement ``Field.__init__()``, like so::
ru: Лучше позволить указывать параметр при определении поля -- то есть при создании класса модели. Для этого переопределите метод ``Field.__init__()``::

source: Finally, if your column requires truly complex SQL setup, return ``None`` from :meth:`.db_type`. This will cause Django's SQL creation code to skip over this field. You are then responsible for creating the column in the right table in some other way, of course, but this gives you a way to tell Django to get out of the way.
ru: В конце концов, если поле требует действительно сложный SQL код при создании, верните ``None`` в методе :meth:`.db_type`. В этом случае Django пропустит создание этого поля в базе данных. Вам придется создать поле каким либо другим способом.

source: The :meth:`~Field.rel_db_type` method is called by fields such as ``ForeignKey`` and ``OneToOneField`` that point to another field to determine their database column data types. For example, if you have an ``UnsignedAutoField``, you also need the foreign keys that point to that field to use the same data type::
ru: Метод :meth:`~Field.rel_db_type` вызывается полями ``ForeignKey`` и ``OneToOneField``, которые указывают на другие поля, чтобы узнать тип поля в базе данных. Например, у вас есть поле ``UnsignedAutoField``, и вам необходимо, чтобы поле, которое ссылаются на ваше поле, использовали такой же тип поля::

source: Converting values to Python objects
ru: Преобразование значений базы данных в объекты Python

source: If your custom :class:`~Field` class deals with data structures that are more complex than strings, dates, integers, or floats, then you may need to override :meth:`~Field.from_db_value` and :meth:`~Field.to_python`.
ru: Если ваш подкласс :class:`~Field` работает со структурами более сложными, чем строка, дата и число, вам следует переопределить :meth:`~Field.from_db_value` и :meth:`~Field.to_python`.

source: If present for the field subclass, ``from_db_value()`` will be called in all circumstances when the data is loaded from the database, including in aggregates and :meth:`~django.db.models.query.QuerySet.values` calls.
ru: Если поле содержит метод ``from_db_value()``, он будет вызываться при всех операциях загрузки данных с базы данных, включая агрегации и вызовы :meth:`~django.db.models.query.QuerySet.values`.

source: ``to_python()`` is called by deserialization and during the :meth:`~django.db.models.Model.clean` method used from forms.
ru: ``to_python()`` вызывается при десериализации и при вызове метода :meth:`~django.db.models.Model.clean` в формах.

source: As a general rule, ``to_python()`` should deal gracefully with any of the following arguments:
ru: Метод ``to_python()`` должен корректно обрабатывать следующие типы значения:

source: An instance of the correct type (e.g., ``Hand`` in our ongoing example).
ru: Объект нужного типа (например, ``Hand`` в нашем примере).

source: A string
ru: Строка

source: ``None`` (if the field allows ``null=True``)
ru: ``None`` (если поле содержит ``null=True``)

source: In our ``HandField`` class, we're storing the data as a VARCHAR field in the database, so we need to be able to process strings and ``None`` in the ``from_db_value()``. In ``to_python()``, we need to also handle ``Hand`` instances::
ru: В нашем ``HandField`` мы сохраняем значение в поле VARCHAR, и в ``from_db_value()`` должны обрабатывать строки и ``None``. В ``to_python()`` также объекты ``Hand``::

source: Notice that we always return a ``Hand`` instance from these methods. That's the Python object type we want to store in the model's attribute.
ru: Помните, что мы всегда возвращаем объект ``Hand`` из этого метода. Это объект Python, который мы хотим сохранить в модели.

source: For ``to_python()``, if anything goes wrong during value conversion, you should raise a :exc:`~django.core.exceptions.ValidationError` exception.
ru: Если ``to_python()`` не может выполнить преобразование значения, вызовите исключение :exc:`~django.core.exceptions.ValidationError`.

source: Converting Python objects to query values
ru: Преобразование объектов Python в значения в запросе

source: Since using a database requires conversion in both ways, if you override :meth:`~Field.to_python` you also have to override :meth:`~Field.get_prep_value` to convert Python objects back to query values.
ru: Т.к. использование базы данных требует преобразования значения в оба ннаправления, если вы переопределили :meth:`~Field.to_python` ва следует переопределить и :meth:`~Field.get_prep_value` чтобы преобразовать объект Python обратно в значение для запроса.

source: If your custom field uses the ``CHAR``, ``VARCHAR`` or ``TEXT`` types for MySQL, you must make sure that :meth:`.get_prep_value` always returns a string type. MySQL performs flexible and unexpected matching when a query is performed on these types and the provided value is an integer, which can cause queries to include unexpected objects in their results. This problem cannot occur if you always return a string type from :meth:`.get_prep_value`.
ru: Если ваше поле использует типы ``CHAR``, ``VARCHAR`` или ``TEXT`` MySQL, метод :meth:`.get_prep_value` всегда должен возвращать строку. MySQL выполняет довольно непредсказуемое сравнение типов, если передать число, что может привести к неожиданными результатам запроса. Этой проблемы можно избежать возвращая всегда строку из :meth:`.get_prep_value`.

source: Converting query values to database values
ru: Преобразование значения из запроса в значение базы данных

source: Some data types (for example, dates) need to be in a specific format before they can be used by a database backend. :meth:`~Field.get_db_prep_value` is the method where those conversions should be made. The specific connection that will be used for the query is passed as the ``connection`` parameter. This allows you to use backend-specific conversion logic if it is required.
ru: Некоторые типы данных (например, даты) должны быть в определенном формате при передаче в бэкенд базы данных. Эти преобразования должны быть выполнены в :meth:`~Field.get_db_prep_value`. Объект подключения к базе данных передается в аргументе ``connection``. Это позволяет выполнить преобразование, которое зависит от используемой базы данных.

source: For example, Django uses the following method for its :class:`BinaryField`::
ru: Например, Django использует следующий метод для :class:`BinaryField`::

source: In case your custom field needs a special conversion when being saved that is not the same as the conversion used for normal query parameters, you can override :meth:`~Field.get_db_prep_save`.
ru: Если ваше поле требует дополнительного преобразования данных при сохранении, переопределите для этого метод :meth:`~Field.get_db_prep_save`.

source: Preprocessing values before saving
ru: Обработка данных перед сохранением

source: If you want to preprocess the value just before saving, you can use :meth:`~Field.pre_save`. For example, Django's :class:`~django.db.models.DateTimeField` uses this method to set the attribute correctly in the case of :attr:`~django.db.models.DateField.auto_now` or :attr:`~django.db.models.DateField.auto_now_add`.
ru: Вы должны переопределить метод :meth:`~Field.pre_save`, если хотите изменить значение перед сохранением. Например, поле :class:`~django.db.models.DateTimeField` использует этот метод для установки значения при :attr:`~django.db.models.DateField.auto_now` или :attr:`~django.db.models.DateField.auto_now_add`.

source: If you do override this method, you must return the value of the attribute at the end. You should also update the model's attribute if you make any changes to the value so that code holding references to the model will always see the correct value.
ru: Если вы переопределяете этот метод, необходимо вернуть значение атрибута в конце. Вы также должны обновить атрибут модели, если изменяли значение.

source: Specifying the form field for a model field
ru: Определение поля формы для поля модели

source: To customize the form field used by :class:`~django.forms.ModelForm`, you can override :meth:`~Field.formfield`.
ru: Чтобы переопределить поле формы, которое будет использоваться :class:`~django.forms.ModelForm`, вы можете переопределить :meth:`~Field.formfield`.

source: The form field class can be specified via the ``form_class`` and ``choices_form_class`` arguments; the latter is used if the field has choices specified, the former otherwise. If these arguments are not provided, :class:`~django.forms.CharField` or :class:`~django.forms.TypedChoiceField` will be used.
ru: Класс поля формы можно указать аргументами ``form_class`` и ``choices_form_class``(используется, если для поля указан список возможных значений). Если аргументы не указаны, будут использоваться :class:`~django.forms.CharField` или :class:`~django.forms.TypedChoiceField`.

source: All of the ``kwargs`` dictionary is passed directly to the form field's ``__init__()`` method. Normally, all you need to do is set up a good default for the ``form_class`` (and maybe ``choices_form_class``) argument and then delegate further handling to the parent class. This might require you to write a custom form field (and even a form widget). See the :doc:`forms documentation </topics/forms/index>` for information about this.
ru: Словарь ``kwargs`` передается в конструктор ``__init__()`` поля формы. Скорее всего вам понадобится определить необходимые аргументы для ``form_class``(и возможно ``choices_form_class``) и передать дальнейшую обработку в метод родительского класса. Возможно вам понадобиться создать собственный тип поля формы (и возможно даже свой виджет). Смотрите :doc:`раздел о формах </topics/forms/index>`.

source: Continuing our ongoing example, we can write the :meth:`~Field.formfield` method as::
ru: Продолжая наш пример, мы можем создать следующий метод :meth:`~Field.formfield`::

source: This assumes we've imported a ``MyFormField`` field class (which has its own default widget). This document doesn't cover the details of writing custom form fields.
ru: Подразумевается, что мы уже импортировали класс поля ``MyFormField`` (который содержит свой собственный виджет). Этот раздел не описывает создание собственного поля формы.

source: Emulating built-in field types
ru: Эмуляция встроенных полей

source: If you have created a :meth:`.db_type` method, you don't need to worry about :meth:`.get_internal_type` -- it won't be used much. Sometimes, though, your database storage is similar in type to some other field, so you can use that other field's logic to create the right column.
ru: Если вы определили метод :meth:`.db_type`, нет необходимости использовать :meth:`.get_internal_type` -- он не будет использоваться. Иногда одни типы полей работают так же, как и другие на уровне базы данных, в таких случаях вы можете использовать этот метод.

source: No matter which database backend we are using, this will mean that :djadmin:`migrate` and other SQL commands create the right column type for storing a string.
ru: Без разницы какую базу данных мы используем, :djadmin:`migrate` и другие SQL выберут правильный тип поля в базе данных.

source: If :meth:`.get_internal_type` returns a string that is not known to Django for the database backend you are using -- that is, it doesn't appear in ``django.db.backends.<db_name>.base.DatabaseWrapper.data_types`` -- the string will still be used by the serializer, but the default :meth:`~Field.db_type` method will return ``None``. See the documentation of :meth:`~Field.db_type` for reasons why this might be useful. Putting a descriptive string in as the type of the field for the serializer is a useful idea if you're ever going to be using the serializer output in some other place, outside of Django.
ru: Если :meth:`.get_internal_type` возвращает строку, которая неизвестна Django -- то есть отсутствует в ``django.db.backends.<db_name>.base.DatabaseWrapper.data_types`` -- она все равно будет использована сериализатором, но метод :meth:`~Field.db_type` по умолчанию вернет ``None``. Смотрите описание :meth:`~Field.db_type` чтобы понять, в каких случаях это может быть полезно. Возвращение строки, описывающей поле для сериализатора, может быть полезным, если вы собираетесь использовать результат сериализации не только в Django.

source: Converting field data for serialization
ru: Преобразование значения поля для сериалайзера

source: Some general advice
ru: Несколько советов

source: Writing a custom field can be a tricky process, particularly if you're doing complex conversions between your Python types and your database and serialization formats. Here are a couple of tips to make things go more smoothly:
ru: Создание собственного поля может быть непростой задачей, особенно при сложном преобразовании данных в объекты Python, значения для базы данных и сериализатора. Вот несколько советов как упросить эту задачу:

source: Look at the existing Django fields (in :file:`django/db/models/fields/__init__.py`) for inspiration. Try to find a field that's similar to what you want and extend it a little bit, instead of creating an entirely new field from scratch.
ru: Посмотрите на существующие поля в Django (в :file:`django/db/models/fields/__init__.py`). Постарайтесь найти поле, похожее на то, что вам необходимо, это лучше, чем создавать свое поле с нуля.

source: Put a ``__str__()`` method on the class you're wrapping up as a field. There are a lot of places where the default behavior of the field code is to call ``str()`` on the value. (In our examples in this document, ``value`` would be a ``Hand`` instance, not a ``HandField``). So if your ``__str__()`` method automatically converts to the string form of your Python object, you can save yourself a lot of work.
ru: Добавьте метод ``__str__()`` в класс, который вы используете для значений вашего поля. Во многих случаях используется функция ``str()`` при обработке значений. (В нашем примере, ``value`` будет объект ``Hand``, не ``HandField``). Если метод ``__str__()`` преобразует объект Python в строку, это сохранит вам много времени.

source: Writing a ``FileField`` subclass
ru: Создание подкласса ``FileField``

source: In addition to the above methods, fields that deal with files have a few other special requirements which must be taken into account. The majority of the mechanics provided by ``FileField``, such as controlling database storage and retrieval, can remain unchanged, leaving subclasses to deal with the challenge of supporting a particular type of file.
ru: В дополнение к вышеописанным методам, поля, которые работают с файлами, требуют дополнительной работы. Основной функционал ``FileField``, такой как сохранение и получения данных в БД, можно оставить без изменений, определив лишь операции, необходимые для работы с различными типами файлов.

source: Django provides a ``File`` class, which is used as a proxy to the file's contents and operations. This can be subclassed to customize how the file is accessed, and what methods are available. It lives at ``django.db.models.fields.files``, and its default behavior is explained in the :doc:`file documentation </ref/files/file>`.
ru: Django предоставляет класс ``File``, который используется как прокси при работе с файлами. Можно унаследоваться от него и переопределить работу с файлом. Он находится в ``django.db.models.fields.files`` и описан в :doc:`разделе о файлах </ref/files/file>`.

source: Once a subclass of ``File`` is created, the new ``FileField`` subclass must be told to use it. To do so, simply assign the new ``File`` subclass to the special ``attr_class`` attribute of the ``FileField`` subclass.
ru: После создания подкласса ``File`` новый подкласс ``FileField`` может использовать его. Просто укажите подкласс ``File`` в атрибуте ``attr_class`` подкласса ``FileField``.

source: A few suggestions
ru: Несколько советов

source: In addition to the above details, there are a few guidelines which can greatly improve the efficiency and readability of the field's code.
ru: В дополнение ко всему сказанному выше, вот несколько советов, которые помогут улучшить ваш код.

source: The source for Django's own ``ImageField`` (in ``django/db/models/fields/files.py``) is a great example of how to subclass ``FileField`` to support a particular type of file, as it incorporates all of the techniques described above.
ru: Пример встроенного в Django поля ``ImageField`` (в ``django/db/models/fields/files.py``) - хороший пример переопределения ``FileField``, изучите его.

source: Cache file attributes wherever possible. Since files may be stored in remote storage systems, retrieving them may cost extra time, or even money, that isn't always necessary. Once a file is retrieved to obtain some data about its content, cache as much of that data as possible to reduce the number of times the file must be retrieved on subsequent calls for that information.
ru: Кэшируйте объект файла при любой возможности. Так как файлы могут хранится во внешнем хранилище, получение их может потребовать дополнительного времени и даже денег. После получения файла закэшируйте как можно большую его часть, чтобы сократить количество операций необходимых для его последующего чтения.
