Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/howto/custom-template-tags.po
Languages: ru

source: Custom template tags and filters
ru: Собственные шаблонные теги и фильтры

source: Django's template language comes with a wide variety of :doc:`built-in tags and filters </ref/templates/builtins>` designed to address the presentation logic needs of your application. Nevertheless, you may find yourself needing functionality that is not covered by the core set of template primitives. You can extend the template engine by defining custom tags and filters using Python, and then make them available to your templates using the :ttag:`{% load %}<load>` tag.
ru: Шаблонизатор Django содержит большое количество :doc:`встроенных тегов и фильтров </ref/templates/builtins>`. Тем не менее, вам может понадобиться добавить собственный функционал к шаблонам. Вы можете сделать это добавив собственную библиотеку тегов и фильтров используя Python, затем добавить ее в шаблон с помощью тега :ttag:`{% load %}<load>`.

source: Code layout
ru: Добавление собственной библиотеки

source: The most common place to specify custom template tags and filters is inside a Django app. If they relate to an existing app, it makes sense to bundle them there; otherwise, they can be added to a new app. When a Django app is added to :setting:`INSTALLED_APPS`, any tags it defines in the conventional location described below are automatically made available to load within templates.
ru: Обычно шаблонные теги и фильтры располагаются в приложении Django. Если они связаны с существующим приложением, это логично расположить его там. Иначе можно добавить их в новое приложение. Если приложение Django добавлено :setting:`INSTALLED_APPS`, все библиотеки тегов, расположенные в определенном модуле приложения, будут доступны для загрузки в шаблонах.

source: The app should contain a ``templatetags`` directory, at the same level as ``models.py``, ``views.py``, etc. If this doesn't already exist, create it - don't forget the ``__init__.py`` file to ensure the directory is treated as a Python package.
ru: Приложение должно содержать каталог ``templatetags`` на том же уровне что и ``models.py``, ``views.py`` и др. Если он не существует, создайте его. Не забудьте создать файл ``__init__.py`` чтобы каталог мог использоваться как пакет Python.

source: Development server won't automatically restart
ru: Сервер для разработки не перезапускается автоматически

source: After adding the ``templatetags`` module, you will need to restart your server before you can use the tags or filters in templates.
ru: После добавления модуля ``templatetags`` вам необходимо перезапустить сервер, чтобы использовать теги и фильтры в шаблонах.

source: Your custom tags and filters will live in a module inside the ``templatetags`` directory. The name of the module file is the name you'll use to load the tags later, so be careful to pick a name that won't clash with custom tags and filters in another app.
ru: Выше теги и фильтры будут находиться в модуле пакета ``templatetags``. Название модуля будет использоваться при загрузке библиотеки в шаблоне, так что убедитесь что оно не совпадает с названиями библиотек других приложений.

source: For example, if your custom tags/filters are in a file called ``poll_extras.py``, your app layout might look like this::
ru: Например, если теги/фильтры находятся в файле ``poll_extras.py``, ваше приложение может выглядеть следующим образом::

source: And in your template you would use the following:
ru: И в шаблоне вы будете использовать:

source: The app that contains the custom tags must be in :setting:`INSTALLED_APPS` in order for the :ttag:`{% load %}<load>` tag to work. This is a security feature: It allows you to host Python code for many template libraries on a single host machine without enabling access to all of them for every Django installation.
ru: Приложение содержащее собственные теги и фильтры должно быть добавлено в :setting:`INSTALLED_APPS`, чтобы тег :ttag:`{% load %}<load>` мог загрузить его. Это сделано в целях безопасности.

source: There's no limit on how many modules you put in the ``templatetags`` package. Just keep in mind that a :ttag:`{% load %}<load>` statement will load tags/filters for the given Python module name, not the name of the app.
ru: Не имеет значение сколько модулей добавлено в пакет ``templatetags``. Помните что тег :ttag:`{% load %}<load>` использует название модуля, а не название приложения.

source: To be a valid tag library, the module must contain a module-level variable named ``register`` that is a ``template.Library`` instance, in which all the tags and filters are registered. So, near the top of your module, put the following::
ru: Библиотека тегов должна содержать переменную ``register`` равную экземпляру ``template.Library``, в которой регистрируются все определенные теги и фильтры. Так что в начале вашего модуля укажите следующие строки::

source: Alternatively, template tag modules can be registered through the ``'libraries'`` argument to :class:`~django.template.backends.django.DjangoTemplates`. This is useful if you want to use a different label from the template tag module name when loading template tags. It also enables you to register tags without installing an application.
ru: Модуль с шаблонными тегами можно также зарегистрировать через аргумент ``'libraries'`` класса :class:`~django.template.backends.django.DjangoTemplates`. Это полезно, если вы хотите изменить название библиотеки тегов. Также вы можете зарегистрировать библиотеку без установки приложения.

source: Behind the scenes
ru: За кулисами

source: For a ton of examples, read the source code for Django's default filters and tags. They're in ``django/template/defaultfilters.py`` and ``django/template/defaulttags.py``, respectively.
ru: Вы можете найти большое количество примеров в исходном коде встроенных тегов и фильтров Django. Они находятся в файлах ``django/template/defaultfilters.py`` и ``django/template/defaulttags.py``.

source: For more information on the :ttag:`load` tag, read its documentation.
ru: Подробности о теге :ttag:`load` читайте в этой документации.

source: Writing custom template filters
ru: Создание собственного шаблонного фильтра

source: Custom filters are just Python functions that take one or two arguments:
ru: Фильтры это просто функции Python, которые принимают один или несколько аргументов:

source: The value of the variable (input) -- not necessarily a string.
ru: Входящее значение -- не обязательно строка.

source: The value of the argument -- this can have a default value, or be left out altogether.
ru: Значение аргументов -- можно указать значение по умолчанию или вообще не использовать аргументы.

source: For example, in the filter ``{{ var|foo:"bar" }}``, the filter ``foo`` would be passed the variable ``var`` and the argument ``"bar"``.
ru: Например, при ``{{ var|foo:"bar" }}`` функция фильтра ``foo`` будет выполнена со значением переменной ``var`` и аргументом ``"bar"``.

source: Since the template language doesn't provide exception handling, any exception raised from a template filter will be exposed as a server error. Thus, filter functions should avoid raising exceptions if there is a reasonable fallback value to return. In case of input that represents a clear bug in a template, raising an exception may still be better than silent failure which hides the bug.
ru: Исключение, вызванное в шаблонном фильтре, приведет к серверной ошибке. По этому фильтр должен избегать исключений, если можно вернуть какое-то значение по умолчанию. Если же переданное значение явно ведет к багу, лучше вызвать исключение, чем скрыть баг.

source: Here's an example filter definition::
ru: Пример фильтра::

source: And here's an example of how that filter would be used:
ru: И пример как его использовать:

source: Most filters don't take arguments. In this case, just leave the argument out of your function. Example::
ru: Большинство фильтров не принимают аргументы. Например::

source: Registering custom filters
ru: Регистрация фильтров

source: Once you've written your filter definition, you need to register it with your ``Library`` instance, to make it available to Django's template language::
ru: Создав функцию фильтра, ее необходимо зарегистрировать в экземпляре ``Library``, чтобы использовать в шаблонах Django::

source: The ``Library.filter()`` method takes two arguments:
ru: Метод ``Library.filter()`` принимает два аргумента:

source: The name of the filter -- a string.
ru: Название фильтра -- строка.

source: The compilation function -- a Python function (not the name of the function as a string).
ru: Функция компиляции -- функция Python (не название функции строкой).

source: You can use ``register.filter()`` as a decorator instead::
ru: Вы можете использовать ``register.filter()`` как декоратор::

source: If you leave off the ``name`` argument, as in the second example above, Django will use the function's name as the filter name.
ru: Если вы не укажете аргумент ``name``, как показано во втором примере, Django будет использовать название функции в качестве названия фильтра.

source: Finally, ``register.filter()`` also accepts three keyword arguments, ``is_safe``, ``needs_autoescape``, and ``expects_localtime``. These arguments are described in :ref:`filters and auto-escaping <filters-auto-escaping>` and :ref:`filters and time zones <filters-timezones>` below.
ru: Также ``register.filter()`` принимает три именованных аргумента: ``is_safe``, ``needs_autoescape`` и ``expects_localtime``. Эти аргументы описан в разделе :ref:`фильтры и автоматическое экранирование <filters-auto-escaping>` и в разделе :ref:`фильтры и часовые пояса <filters-timezones>` далее.

source: Template filters that expect strings
ru: Шаблонные фильтры, которые обрабатывают строки

source: If you're writing a template filter that only expects a string as the first argument, you should use the decorator ``stringfilter``. This will convert an object to its string value before being passed to your function::
ru: Если вы создали фильтр, который работает только со строками, используйте декоратор ``stringfilter``. Он преобразует объект в строковое значение перед передачей в функцию::

source: This way, you'll be able to pass, say, an integer to this filter, and it won't cause an ``AttributeError`` (because integers don't have ``lower()`` methods).
ru: В этом случае вы можете передать число в фильтр и это не вызовет исключение ``AttributeError`` (так как число не содержит метод ``lower()``).

source: Filters and auto-escaping
ru: Фильтры и автоматическое экранирование

source: **Safe strings** are strings that have been marked safe from further escaping at output time. Any necessary escaping has already been done. They're commonly used for output that contains raw HTML that is intended to be interpreted as-is on the client side.
ru: **Безопасные строки** -- строки, которые были помечены как безопасные. Указывают на то, что последующее экранирование не требуется. Они обычно используются для строк, которые содержат готовый HTML, которые необходимо отобразить на странице.

source: Template filter code falls into one of two situations:
ru: При создании фильтра вы можете столкнуться со следующими ситуациями:

source: Your filter does not introduce any HTML-unsafe characters (``<``, ``>``, ``'``, ``"`` or ``&``) into the result that were not already present. In this case, you can let Django take care of all the auto-escaping handling for you. All you need to do is set the ``is_safe`` flag to ``True`` when you register your filter function, like so::
ru: Ваш фильтр не добавляет никаких не экранированных HTML-символов (``<``, ``>``, ``'``, ``"`` or ``&``) в результат. В таком случае вы можете полностью положиться на политику автоматического экранирования Django. Для этого передайте параметр ``is_safe`` с значением ``True`` при регистрации функции фильтра::

source: This flag tells Django that if a "safe" string is passed into your filter, the result will still be "safe" and if a non-safe string is passed in, Django will automatically escape it, if necessary.
ru: Этот параметр указывает Django что фильтр никак не изменяет "безопасность" переданной строки. То есть, если передать в фильтр "безопасную" строку, результат также будет "безопасным" для Django, если же передать "небезопасную" строку, Django автоматически экранирует результат фильтра.

source: You can think of this as meaning "this filter is safe -- it doesn't introduce any possibility of unsafe HTML."
ru: Другими словами можно сказать "этот фильтр безопасный -- он никаким образом не добавляет небезопасный HTML в результат."

source: For example, suppose you have a filter that adds the string ``xx`` to the end of any input. Since this introduces no dangerous HTML characters to the result (aside from any that were already present), you should mark your filter with ``is_safe``::
ru: Например, у вас есть фильтр, который добавляет ``xx`` к концу переданного значения. Так как он не добавляет небезопасных HTML-символов в результат (кроме тех, которые присутствуют в переданном значении), вы должные пометить его с параметром ``is_safe``::

source: When this filter is used in a template where auto-escaping is enabled, Django will escape the output whenever the input is not already marked as "safe".
ru: Если фильтр используется в шаблоне с включенным автоматическим экранированием, Django выполнит экранирование результата если входящие данные не были отмечены как "безопасные".

source: By default, ``is_safe`` is ``False``, and you can omit it from any filters where it isn't required.
ru: По умолчанию ``is_safe`` равен ``False``.

source: Be careful when deciding if your filter really does leave safe strings as safe. If you're *removing* characters, you might inadvertently leave unbalanced HTML tags or entities in the result. For example, removing a ``>`` from the input might turn ``<a>`` into ``<a``, which would need to be escaped on output to avoid causing problems. Similarly, removing a semicolon (``;``) can turn ``&amp;`` into ``&amp``, which is no longer a valid entity and thus needs further escaping. Most cases won't be nearly this tricky, but keep an eye out for any problems like that when reviewing your code.
ru: Будьте внимательны определяя безопасен ваш фильтр или нет. Если вы *удаляете* символы, вы можете случайно оставить открытые HTML теги или сущности(entities) в результате. Например, при удалении ``>`` из входящих данных ``<a>`` может превратиться в ``<a``, который должен быть экранирован. Аналогично, удаление точки с запятой (``;``) может превратить ``&amp;`` в ``&amp``, что не является правильной HTML-сущностью и должно быть экранировано. Большинство случаев будут не такими сложными, но вы должны быть внимательными.

source: Marking a filter ``is_safe`` will coerce the filter's return value to a string. If your filter should return a boolean or other non-string value, marking it ``is_safe`` will probably have unintended consequences (such as converting a boolean False to the string 'False').
ru: Параметр ``is_safe`` принуждает фильтр вернуть строку. Если ваш фильтр возвращает булево значение или не строку, использование ``is_safe`` может привести к непредвиденным последствиям (например, конвертирование False в строку 'False').

source: Alternatively, your filter code can manually take care of any necessary escaping. This is necessary when you're introducing new HTML markup into the result. You want to mark the output as safe from further escaping so that your HTML markup isn't escaped further, so you'll need to handle the input yourself.
ru: Фильтр самостоятельно заботится об экранировании результата. Это необходимо если вы добавляете новый HTML в результат. В таком случае результат должен быть помечен как безопасный чтобы избежать последующего экранирования.

source: To mark the output as a safe string, use :func:`django.utils.safestring.mark_safe`.
ru: Для этого используйте функцию :func:`django.utils.safestring.mark_safe`.

source: Be careful, though. You need to do more than just mark the output as safe. You need to ensure it really *is* safe, and what you do depends on whether auto-escaping is in effect. The idea is to write filters that can operate in templates where auto-escaping is either on or off in order to make things easier for your template authors.
ru: Но будьте осторожны. Необходимо не просто пометить результат как безопасный. Вы должны убедиться что результат *действительно* безопасен независимо от того, включено автоматическое экранирование или нет. Идея в том, чтобы фильтр правильно работал как при включенном автоматическом экранировании, так и выключенном.

source: In order for your filter to know the current auto-escaping state, set the ``needs_autoescape`` flag to ``True`` when you register your filter function. (If you don't specify this flag, it defaults to ``False``). This flag tells Django that your filter function wants to be passed an extra keyword argument, called ``autoescape``, that is ``True`` if auto-escaping is in effect and ``False`` otherwise. It is recommended to set the default of the ``autoescape`` parameter to ``True``, so that if you call the function from Python code it will have escaping enabled by default.
ru: Для того, чтобы фильтр знал включено ли автоматическое экранирование, передайте параметр ``needs_autoescape`` со значением ``True`` при регистрации функций фильтра. (По умолчанию значение равно ``False``). Этот параметр указывает Django что необходимо передать именованный аргумент ``autoescape`` при вызове функции фильтра, который равен ``True``, если включено автоматическое экранирование, иначе ``False``. Рекомендуем по умолчанию указать ``True`` в ``autoescape``, чтобы при вызове функции в коде, экранирование было включено.

source: For example, let's write a filter that emphasizes the first character of a string::
ru: Например, давайте создадим фильтр, который выделяет первый символ строки::

source: The ``needs_autoescape`` flag and the ``autoescape`` keyword argument mean that our function will know whether automatic escaping is in effect when the filter is called. We use ``autoescape`` to decide whether the input data needs to be passed through ``django.utils.html.conditional_escape`` or not. (In the latter case, we just use the identity function as the "escape" function.) The ``conditional_escape()`` function is like ``escape()`` except it only escapes input that is **not** a ``SafeData`` instance. If a ``SafeData`` instance is passed to ``conditional_escape()``, the data is returned unchanged.
ru: Параметр ``needs_autoescape`` и аргумент ``autoescape`` информируют фильтр о том, было ли включено автоматическое экранирование при вызове фильтра. Аргумент ``autoescape`` указывает необходимо ли использовать ``django.utils.html.conditional_escape`` для входящих данных. (В нашем примере мы использовали его для определения функции "escape".) Функция ``conditional_escape()`` как и ``escape()``, но использует экранирование только для **не** безопасных(``SafeData``) строк. Если передать объект ``SafeData`` функция ``conditional_escape()`` вернет его без изменений.

source: Finally, in the above example, we remember to mark the result as safe so that our HTML is inserted directly into the template without further escaping.
ru: Также мы пометили результат как безопасный и он будет вставлен непосредственно в шаблон без повторного экранирования.

source: There's no need to worry about the ``is_safe`` flag in this case (although including it wouldn't hurt anything). Whenever you manually handle the auto-escaping issues and return a safe string, the ``is_safe`` flag won't change anything either way.
ru: В этом случае нет необходимости беспокоиться о параметре ``is_safe``. Так как вы самостоятельно учитываете автоматическое экранирование, параметр ``is_safe`` ничего не изменит.

source: Avoiding XSS vulnerabilities when reusing built-in filters
ru: Защита от XSS уязвимостей при использовании встроенных фильтров.

source: Django's built-in filters have ``autoescape=True`` by default in order to get the proper autoescaping behavior and avoid a cross-site script vulnerability.
ru: Фильтры Django используют ``autoescape=True``, чтобы избежать XSS уязвимостей.

source: In older versions of Django, be careful when reusing Django's built-in filters as ``autoescape`` defaults to ``None``. You'll need to pass ``autoescape=True`` to get autoescaping.
ru: В предыдущих версиях Django ``autoescape`` равен ``None`` по умолчанию, будьте осторожны при использовании фильтров в коде. Вам необходимо передать ``autoescape=True``, чтобы активировать экранирование.

source: For example, if you wanted to write a custom filter called ``urlize_and_linebreaks`` that combined the :tfilter:`urlize` and :tfilter:`linebreaksbr` filters, the filter would look like::
ru: Например, если вы хотите написать фильтр ``urlize_and_linebreaks``, который использует фильтры :tfilter:`urlize` и :tfilter:`linebreaksbr`, он будет выглядеть следующим образом::

source: Then:
ru: Тогда:

source: would be equivalent to:
ru: можно использовать вместо:

source: Filters and time zones
ru: Фильтры и временные зоны

source: If you write a custom filter that operates on :class:`~datetime.datetime` objects, you'll usually register it with the ``expects_localtime`` flag set to ``True``::
ru: Если вы создаете фильтр, который обрабатывает объекты :class:`~datetime.datetime`, скорее всего вы будете использовать параметр ``expects_localtime`` со значением ``True``::

source: When this flag is set, if the first argument to your filter is a time zone aware datetime, Django will convert it to the current time zone before passing it to your filter when appropriate, according to :ref:`rules for time zones conversions in templates <time-zones-in-templates>`.
ru: Если этот флаг установлен и первый аргумент вашего фильтра является значением времени с часовым поясом, Django преобразует это значение в текущий часовой пояс перед тем как передать в фильтр, в соответствии с :ref:`правилами преобразования часовых поясов в шаблонах <time-zones-in-templates>`.

source: Writing custom template tags
ru: Создание собственного шаблонного тега

source: Tags are more complex than filters, because tags can do anything. Django provides a number of shortcuts that make writing most types of tags easier. First we'll explore those shortcuts, then explain how to write a tag from scratch for those cases when the shortcuts aren't powerful enough.
ru: Теги сложнее чем фильтры, они позволяют делать что угодно. Django предоставляет инструменты, которые упрощают создания различных тегов. Первым делом мы изучим их, затем узнаем как создать тег с нуля.

source: Simple tags
ru: Простые теги

source: Many template tags take a number of arguments -- strings or template variables -- and return a result after doing some processing based solely on the input arguments and some external information. For example, a ``current_time`` tag might accept a format string and return the time as a string formatted accordingly.
ru: Большинство тегов принимают определенное количество аргументов -- строки или переменные шаблона -- и возвращают строку после обработки аргументов. Например, тег ``current_time`` принимает строку с форматом и возвращает время строкой в этом формате.

source: To ease the creation of these types of tags, Django provides a helper function, ``simple_tag``. This function, which is a method of ``django.template.Library``, takes a function that accepts any number of arguments, wraps it in a ``render`` function and the other necessary bits mentioned above and registers it with the template system.
ru: Для создания подобных тегов, Django предоставляет функцию ``simple_tag``. Эта функция, которая является методом ``django.template.Library``, принимает функцию принимающую любое количество аргументов, оборачивает функцией ``render`` и регистрирует в системе шаблонов.
