Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/howto/custom-model-fields.po
Languages: ru

source: Writing custom model fields
ru: Создание собственных полей для модели

source: Introduction
ru: Предисловие

source: The :doc:`model reference </topics/db/models>` documentation explains how to use Django's standard field classes -- :class:`~django.db.models.CharField`, :class:`~django.db.models.DateField`, etc. For many purposes, those classes are all you'll need. Sometimes, though, the Django version won't meet your precise requirements, or you'll want to use a field that is entirely different from those shipped with Django.
ru: :doc:`Раздел о моделях </topics/db/models>` описывает, как использовать стандартные поля модели Django -- :class:`~django.db.models.CharField`, :class:`~django.db.models.DateField`, и т.д. В большинстве случаев эти классы - все что вам будет нужно. Однако в некоторых случаях предоставленные Django поля модели не предоставляют необходимый функционал.

source: Django's built-in field types don't cover every possible database column type -- only the common types, such as ``VARCHAR`` and ``INTEGER``. For more obscure column types, such as geographic polygons or even user-created types such as `PostgreSQL custom types`_, you can define your own Django ``Field`` subclasses.
ru: Встроенные поля не покрывают все возможные типы полей базы данных -- только стандартные типы, такие как ``VARCHAR`` и ``INTEGER``. Для остальных типов полей, такие как хранящие географические полигоны или `собственные типы полей в PostgreSQL <http://www.postgresql.org/docs/8.2/interactive/sql-createtype.html>`_, вы можете создать собственный подкласс для ``Field``.

source: Alternatively, you may have a complex Python object that can somehow be serialized to fit into a standard database column type. This is another case where a ``Field`` subclass will help you use your object with your models.
ru: Также вы можете создать поле для хранения сложного Python объекта в стандартном поле. Это другая проблема, которую помогает решить подкласс ``Field``.

source: Our example object
ru: Описание примера

source: Creating custom fields requires a bit of attention to detail. To make things easier to follow, we'll use a consistent example throughout this document: wrapping a Python object representing the deal of cards in a hand of Bridge_. Don't worry, you don't have to know how to play Bridge to follow this example. You only need to know that 52 cards are dealt out equally to four players, who are traditionally called *north*, *east*, *south* and *west*. Our class looks something like this::
ru: Создание собственного поля требует внимания к деталям. Для простоты понимания мы будем использовать один и тот же пример в этом разделе: объект, который содержит состояние карт на руках для карточной игры `Бридж <http://ru.wikipedia.org/wiki/%D0%91%D1%80%D0%B8%D0%B4%D0%B6>`_. Не беспокойтесь, вам не обязательно знать правила этой игры. Все что вам необходимо знать -- 52 делятся поровну между четырьмя игроками, которых традиционно называют *north*, *east*, *south* и *west*. Наш класс выглядит следующим образом::

source: This is just an ordinary Python class, with nothing Django-specific about it. We'd like to be able to do things like this in our models (we assume the ``hand`` attribute on the model is an instance of ``Hand``)::
ru: Это простой класс Python, ничего Django-специфического. Мы хотим использовать нашу модель следующим образом (предполагается, что атрибут модели ``hand`` это объект ``Hand``)::

source: We assign to and retrieve from the ``hand`` attribute in our model just like any other Python class. The trick is to tell Django how to handle saving and loading such an object.
ru: Получение и назначение значений атрибута ``hand`` нашей модели аналогично любому другому классу в Python. Хитрость заключается в том, чтобы научить Django сохранять и загружать наш объект.

source: In order to use the ``Hand`` class in our models, we **do not** have to change this class at all. This is ideal, because it means you can easily write model support for existing classes where you cannot change the source code.
ru: Для использования класса ``Hand`` в наших моделях, мы **не должны** изменять этот класс. Таким образом можно использовать в моделях существующие классы, которые мы не можем изменить.

source: You might only be wanting to take advantage of custom database column types and deal with the data as standard Python types in your models; strings, or floats, for example. This case is similar to our ``Hand`` example and we'll note any differences as we go along.
ru: В некоторых случаях вы захотите использовать возможности определенных типов полей базы данных, но использовать стандартные типы Python: строки, числа и др. Этот случай похож на наш пример с классом ``Hand`` и мы укажем на все отличия.

source: Background theory
ru: Теория

source: Database storage
ru: Хранение в базе данных

source: The simplest way to think of a model field is that it provides a way to take a normal Python object -- string, boolean, ``datetime``, or something more complex like ``Hand`` -- and convert it to and from a format that is useful when dealing with the database (and serialization, but, as we'll see later, that falls out fairly naturally once you have the database side under control).
ru: Основное предназначение поля модели -- это преобразование объекта Python (строка, булево значение, ``datetime``, или что-либо более сложное, как ``Hand``) в формат удобный для хранения в базе данных и обратно (и сериализация, но, как мы увидим далее, это решается естественным способом при решении проблем преобразования данных для базы данных).

source: Fields in a model must somehow be converted to fit into an existing database column type. Different databases provide different sets of valid column types, but the rule is still the same: those are the only types you have to work with. Anything you want to store in the database must fit into one of those types.
ru: Значение поля модели должно быть преобразовано в один из доступных типов полей базы данных. Различные базы данных предоставляют различные типы полей, но правило остается одно: вы можете работать только с этими типами. Все, что вы хотите сохранить в базе данных, должно быть преобразовано в один из доступных типов данных.

source: Normally, you're either writing a Django field to match a particular database column type, or there's a fairly straightforward way to convert your data to, say, a string.
ru: Скорее всего, вы создаете поле модели для использования типа поля конкретной базы данных, или же преобразуете данные, предположим, в строку.

source: For our ``Hand`` example, we could convert the card data to a string of 104 characters by concatenating all the cards together in a pre-determined order -- say, all the *north* cards first, then the *east*, *south* and *west* cards. So ``Hand`` objects can be saved to text or character columns in the database.
ru: Для нашего примера с ``Hand``, мы можем преобразовать данные о картах в строку из 104 символов соединив все карты вместе в определенном порядке -- скажем, сначала все карты *north*, затем карты *east*, *south* и *west*. Таким образом объект ``Hand`` будет сохранен в текстовом поле базы данных.

source: What does a field class do?
ru: Что делает класс поля?

source: All of Django's fields (and when we say *fields* in this document, we always mean model fields and not :doc:`form fields </ref/forms/fields>`) are subclasses of :class:`django.db.models.Field`. Most of the information that Django records about a field is common to all fields -- name, help text, uniqueness and so forth. Storing all that information is handled by ``Field``. We'll get into the precise details of what ``Field`` can do later on; for now, suffice it to say that everything descends from ``Field`` and then customizes key pieces of the class behavior.
ru: Все поля в Django(и когда мы говорим *поля* в этом разделе, мы всегда подразумеваем поля модели, а не :doc:`поля формы </ref/forms/fields>`) являются подклассами :class:`django.db.models.Field`. Большинство информации о поле, которую хранит Django, общая для всех типов полей -- название, описание, уникальность и др. Вся эта информация хранится в ``Field``. Мы рассмотрим возможности ``Field`` чуть позже, сейчас же запомним, что все поля наследуются от ``Field`` и переопределяют поведение этого класса.

source: It's important to realize that a Django field class is not what is stored in your model attributes. The model attributes contain normal Python objects. The field classes you define in a model are actually stored in the ``Meta`` class when the model class is created (the precise details of how this is done are unimportant here). This is because the field classes aren't necessary when you're just creating and modifying attributes. Instead, they provide the machinery for converting between the attribute value and what is stored in the database or sent to the :doc:`serializer </topics/serialization>`.
ru: Важно понять, что класс поля -- это не то, что хранится в атрибуте модели. Атрибуты модели содержат объекты Python. Классы полей, которые вы указали в модели, на самом деле сохраняются в классе ``Meta`` при создании класса модели. Вот почему мы не используем классы полей при редактировании атрибутов экземпляра модели, их задача преобразовывать значение атрибутов в данные сохраняемые в базе данных или передаваемые в :doc:`сериализатор </topics/serialization>`.

source: Keep this in mind when creating your own custom fields. The Django ``Field`` subclass you write provides the machinery for converting between your Python instances and the database/serializer values in various ways (there are differences between storing a value and using a value for lookups, for example). If this sounds a bit tricky, don't worry -- it will become clearer in the examples below. Just remember that you will often end up creating two classes when you want a custom field:
ru: Будьте внимательны при создании собственного поля. Подкласс ``Field`` предоставляет несколько способов преобразования объектов Python в значение для базы/сериализации (например, сохраняемое значение и значение для фильтра по полю отличаются). Не волнуйтесь если звучит слишком сложно -- мы во всем разберемся на примере чуть ниже. Просто запомните, что скорее всего вам придется создавать два класса:

source: The first class is the Python object that your users will manipulate. They will assign it to the model attribute, they will read from it for displaying purposes, things like that. This is the ``Hand`` class in our example.
ru: Первый класс будет использоваться пользователями. Экземпляр этого класса будет использоваться для отображения, работы с данными, при изменении значения поля модели. В нашем примере это класс ``Hand``.

source: The second class is the ``Field`` subclass. This is the class that knows how to convert your first class back and forth between its permanent storage form and the Python form.
ru: Второй класс -- это подкласс ``Field``. Это класс, который отвечает за преобразование вашего первого класса в значение для хранения в базе данных и обратно в объект Python.

source: Writing a field subclass
ru: Создание подкласса поля

source: When planning your :class:`~django.db.models.Field` subclass, first give some thought to which existing :class:`~django.db.models.Field` class your new field is most similar to. Can you subclass an existing Django field and save yourself some work? If not, you should subclass the :class:`~django.db.models.Field` class, from which everything is descended.
ru: При создании подкласса :class:`~django.db.models.Field`, сначала подумайте, не похож ли он на уже существующее поле. Можете ли унаследоваться от существующего поля Django и сэкономить этим свое время? Если нет, создавайте подкласс :class:`~django.db.models.Field`.

source: Initializing your new field is a matter of separating out any arguments that are specific to your case from the common arguments and passing the latter to the ``__init__()`` method of :class:`~django.db.models.Field` (or your parent class).
ru: При создании конструктора важно разделить аргументы специфические для вашего поля и те, которые следует передать в метод ``__init__()`` :class:`~django.db.models.Field`(или вашего родительского класса).

source: In our example, we'll call our field ``HandField``. (It's a good idea to call your :class:`~django.db.models.Field` subclass ``<Something>Field``, so it's easily identifiable as a :class:`~django.db.models.Field` subclass.) It doesn't behave like any existing field, so we'll subclass directly from :class:`~django.db.models.Field`::
ru: Назовем наше поле ``HandField``. (Хорошая практика называть подклассы :class:`~django.db.models.Field` как ``<Something>Field``, таким образом легко определить, какой класс является подклассом :class:`~django.db.models.Field`.) Оно не похоже ни на одно встроенное в Django поле, поэтому мы создаем подкласс :class:`~django.db.models.Field`::

source: Our ``HandField`` accepts most of the standard field options (see the list below), but we ensure it has a fixed length, since it only needs to hold 52 card values plus their suits; 104 characters in total.
ru: ``HandField`` принимает большинство стандартных аргументов (смотрите список ниже), но мы явно указываем длину поля так как нам необходимо хранить только значения 52 карт и их принадлежность, всего 104 символа.

source: Many of Django's model fields accept options that they don't do anything with. For example, you can pass both :attr:`~django.db.models.Field.editable` and :attr:`~django.db.models.DateField.auto_now` to a :class:`django.db.models.DateField` and it will simply ignore the :attr:`~django.db.models.Field.editable` parameter (:attr:`~django.db.models.DateField.auto_now` being set implies ``editable=False``). No error is raised in this case.
ru: Большинство полей модели в Django принимают параметры, которые они совсем не используют. Например, вы можете передать :attr:`~django.db.models.Field.editable` и :attr:`~django.db.models.DateField.auto_now` в :class:`django.db.models.DateField`, аргумент :attr:`~django.db.models.Field.editable` будет проигнорирован (:attr:`~django.db.models.DateField.auto_now`устанавливает ``editable=False``). Вы не получите ошибку.

source: This behavior simplifies the field classes, because they don't need to check for options that aren't necessary. They just pass all the options to the parent class and then don't use them later on. It's up to you whether you want your fields to be more strict about the options they select, or to use the simpler, more permissive behavior of the current fields.
ru: Такое поведение упрощает классы полей, так как они не должны проверять все аргументы. Они просто передают их в родительский класс и больше не используют. Вы можете использовать более строгие правила и проверять все входящие аргументы или же использовать более простой и гибкий путь, как это делают встроенные классы.

source: The ``Field.__init__()`` method takes the following parameters:
ru: Метод ``Field.__init__()`` принимает следующие параметры:

source: ``rel``: Used for related fields (like :class:`ForeignKey`). For advanced use only.
ru: ``rel``: Используется для внешних ключей (таких как :class:`ForeignKey`). Для опытных пользователей.

source: ``serialize``: If ``False``, the field will not be serialized when the model is passed to Django's :doc:`serializers </topics/serialization>`. Defaults to ``True``.
ru: ``serialize``: При ``False``, поле не будет сериализовано при передачи модели в :doc:`сериализатор Django </topics/serialization>`. По умолчанию ``True``.

source: :attr:`~django.db.models.Field.db_tablespace`: Only for index creation, if the backend supports :doc:`tablespaces </topics/db/tablespaces>`. You can usually ignore this option.
ru: :attr:`~django.db.models.Field.db_tablespace`: Используется только при создании индекса, если база данных поддерживает :doc:`табличное пространство </topics/db/tablespaces>`. В большинстве случаев вы можете проигнорировать этот параметр.

source: :attr:`~django.db.models.Field.auto_created`: ``True`` if the field was automatically created, as for the :class:`~django.db.models.OneToOneField` used by model inheritance. For advanced use only.
ru: :attr:`~django.db.models.Field.auto_created`: True, если поле создается автоматически, например, используется полем :class:`~django.db.models.OneToOneField`. Для опытных пользователей.

source: All of the options without an explanation in the above list have the same meaning they do for normal Django fields. See the :doc:`field documentation </ref/models/fields>` for examples and details.
ru: Аргументы без описания аналогичны соответствующим аргументам стандартных полей, смотрите :doc:`раздел о полях модели </ref/models/fields>` for examples and details.

source: Field deconstruction
ru: Деконструкция поля

source: The counterpoint to writing your ``__init__()`` method is writing the ``deconstruct()`` method. This method tells Django how to take an instance of your new field and reduce it to a serialized form - in particular, what arguments to pass to ``__init__()`` to re-create it.
ru: Метод ``deconstruct()`` является дополнением к методу ``__init__()``. Этот метод указывает Django как сериализировать экземпляр поля, а точнее -- какие аргументы передать в ``__init__()`` чтобы воссоздать его.

source: If you haven't added any extra options on top of the field you inherited from, then there's no need to write a new ``deconstruct()`` method. If, however, you're changing the arguments passed in ``__init__()`` (like we are in ``HandField``), you'll need to supplement the values being passed.
ru: Если вы не добавляли аргументы в дочерний класс встроенного поля, вам не нужно переопределять метод ``deconstruct()``. Однако, если вы изменили аргументы ``__init__()`` (как мы сделали это в поле ``HandField``), вам необходимо добавить их.

source: The contract of ``deconstruct()`` is simple; it returns a tuple of four items: the field's attribute name, the full import path of the field class, the positional arguments (as a list), and the keyword arguments (as a dict). Note this is different from the ``deconstruct()`` method :ref:`for custom classes <custom-deconstruct-method>` which returns a tuple of three things.
ru: Формат ответа ``deconstruct()`` простой. Он должен возвращать кортеж из четырех элементов: имя атрибута поля, полный путь импорта класса поля, позиционные аргументы (списком) и именованные аргументы (словарем). Обратите внимание, это отличается от метода ``deconstruct()`` для :ref:`собственного класса <custom-deconstruct-method>`, которые должен вернуть кортеж из трех элементов.

source: As a custom field author, you don't need to care about the first two values; the base ``Field`` class has all the code to work out the field's attribute name and import path. You do, however, have to care about the positional and keyword arguments, as these are likely the things you are changing.
ru: Создавая свое поле, вам не стоит беспокоится о первых двух значениях, базовый класс ``Field`` сам определит их. Вам необходимо указать позиционные и именованные аргументы, скорее всего именно их вы и будете переопределять в своем поле.

source: For example, in our ``HandField`` class we're always forcibly setting max_length in ``__init__()``. The ``deconstruct()`` method on the base ``Field`` class will see this and try to return it in the keyword arguments; thus, we can drop it from the keyword arguments for readability::
ru: Например, в нашем классе ``HandField`` мы определяем ``max_length`` в ``__init__()``. Метод ``deconstruct()`` базового класса ``Field`` вернет его в именованных аргументах. Но мы можем удалить его для читабельности::

source: If you add a new keyword argument, you need to write code to put its value into ``kwargs`` yourself::
ru: Если вы добавили именованный аргумент, вам следует вернуть его в ``kwargs``::

source: More complex examples are beyond the scope of this document, but remember - for any configuration of your Field instance, ``deconstruct()`` must return arguments that you can pass to ``__init__`` to reconstruct that state.
ru: Более сложные примеры выходят за рамки этой документации, но помните - для любой конфигурации поля, ``deconstruct()`` должен вернуть аргументы, которые можно передать в ``__init__``, чтобы воссоздать экземпляр поля.

source: Pay extra attention if you set new default values for arguments in the ``Field`` superclass; you want to make sure they're always included, rather than disappearing if they take on the old default value.
ru: Обратите внимание на новые значения по умолчанию для аргументов ``Field``. Вы захотите чтобы они сохранились, а не перезаписались старыми значениями по умолчанию.

source: In addition, try to avoid returning values as positional arguments; where possible, return values as keyword arguments for maximum future compatibility. Of course, if you change the names of things more often than their position in the constructor's argument list, you might prefer positional, but bear in mind that people will be reconstructing your field from the serialized version for quite a while (possibly years), depending how long your migrations live for.
ru: Также, старайтесь не возвращать позиционные аргументы, при возможности используйте именованные для максимальной совместимости в будущем. Конечно, если вы меняете названия аргументов чаще, чем их порядок, вам лучше использовать позиционные аргументы. Но не забываете, что люди будут воссоздавать ваше поле из сериализованного состояния в течении достаточно долгого периода (возможно годами), в зависимости от того, как долго будут существовать миграции.

source: You can see the results of deconstruction by looking in migrations that include the field, and you can test deconstruction in unit tests by just deconstructing and reconstructing the field::
ru: Вы можете посмотреть результат деконструкции в миграции, которая включает поле. Вы можете проверить деконструкцию в тестах просто воссоздавая поле:

source: Changing a custom field's base class
ru: Изменение базового класса собственного поля

source: You can't change the base class of a custom field because Django won't detect the change and make a migration for it. For example, if you start with::
ru: Вы не можете изменить базовый класс собственного поля т.к. Django не сможет определить эти изменения и не создаст миграцию. Например, у вас было поле::

source: and then decide that you want to use ``TextField`` instead, you can't change the subclass like this::
ru: затем вы решили использовать ``TextField``, вы не можете просто изменить класс::

source: Instead, you must create a new custom field class and update your models to reference it::
ru: Вам следует создать новый класс поля и использовать его в вашей модели::

source: As discussed in :ref:`removing fields <migrations-removing-model-fields>`, you must retain the original ``CustomCharField`` class as long as you have migrations that reference it.
ru: Как уже упоминалось об :ref:`удалении полей <migrations-removing-model-fields>`, вы должны хранить начальный класс ``CustomCharField`` пока проект содержит миграции, которые ссылаются на этот класс.

source: Documenting your custom field
ru: Документирование собственного поля
