Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/howto/custom-template-tags.po
Languages: ru

source: The CycleNode is iterating, but it's iterating globally. As far as Thread 1 and Thread 2 are concerned, it's always returning the same value. This is obviously not what we want!
ru: CycleNode работает, но итерация происходит глобально. Так как Поток 1 и Поток 2 связаны, они используют одни значения. Это точно не то, что вам нужно!

source: To address this problem, Django provides a ``render_context`` that's associated with the ``context`` of the template that is currently being rendered. The ``render_context`` behaves like a Python dictionary, and should be used to store ``Node`` state between invocations of the ``render`` method.
ru: Для решения этой проблемы Django предоставляет ``render_context`` в контексте текущего шаблона. ``render_context`` работает как и словарь в Python и должен использоваться для хранения состояния узлов между вызовами метода ``render``.

source: Let's refactor our ``CycleNode`` implementation to use the ``render_context``::
ru: Давайте перепишем ``CycleNode`` чтобы использовать ``render_context``::

source: Note that it's perfectly safe to store global information that will not change throughout the life of the ``Node`` as an attribute. In the case of ``CycleNode``, the ``cyclevars`` argument doesn't change after the ``Node`` is instantiated, so we don't need to put it in the ``render_context``. But state information that is specific to the template that is currently being rendered, like the current iteration of the ``CycleNode``, should be stored in the ``render_context``.
ru: Заметим, что вполне безопасно сохранять в атрибутах объекта ``Node`` информацию, которая не изменяется. В случае ``CycleNode``, параметр ``cyclevars`` не изменяется после создания экземпляра ``Node``, и нет необходимости хранить его в ``render_context``. Но информация, которая относится к конкретному шаблону, например текущая итерация узла ``CycleNode``, должна сохраняться в ``render_context``.

source: Notice how we used ``self`` to scope the ``CycleNode`` specific information within the ``render_context``. There may be multiple ``CycleNodes`` in a given template, so we need to be careful not to clobber another node's state information. The easiest way to do this is to always use ``self`` as the key into ``render_context``. If you're keeping track of several state variables, make ``render_context[self]`` a dictionary.
ru: Обратите внимание как мы используем ``self`` для привязки состояния к текущему узлу в ``render_context``. В шаблоне может быть несколько ``CycleNode``, и важно не нарушить состояние других узлов. Самый просто способ это использовать ``self`` в качестве ключа в ``render_context``. Если вам необходимо хранить несколько переменных, используйте в ``render_context[self]`` словарь.

source: Registering the tag
ru: Регистрация тега

source: Finally, register the tag with your module's ``Library`` instance, as explained in :ref:`writing custom template filters<howto-writing-custom-template-tags>` above. Example::
ru: Теперь зарегистрируем тег в экземпляре ``Library`` вашего модуля, как описано :ref:`выше<howto-writing-custom-template-tags>`. Например::

source: The ``tag()`` method takes two arguments:
ru: Метод ``tag()`` принимает два аргумента:

source: The name of the template tag -- a string. If this is left out, the name of the compilation function will be used.
ru: Название шаблонного тега -- строкой. Если параметр не указан, используется название функции.

source: As with filter registration, it is also possible to use this as a decorator::
ru: Как и для регистрации фильтра, можно использовать как декоратор::

source: If you leave off the ``name`` argument, as in the second example above, Django will use the function's name as the tag name.
ru: Если не указать параметр ``name``, как во втором примере, Django будет использовать название функции в качестве названия тега.

source: Passing template variables to the tag
ru: Передача переменных шаблона в тег

source: Although you can pass any number of arguments to a template tag using ``token.split_contents()``, the arguments are all unpacked as string literals. A little more work is required in order to pass dynamic content (a template variable) to a template tag as an argument.
ru: Хоть вы и можете передать любое количество аргументов в шаблонный тег используя ``token.split_contents()``, все аргументы передаются как строка. Чтобы передать значение переменной шаблона, необходимо немного усложнить код.

source: While the previous examples have formatted the current time into a string and returned the string, suppose you wanted to pass in a :class:`~django.db.models.DateTimeField` from an object and have the template tag format that date-time:
ru: Тег из примера выше форматирует текущее время и возвращает строку. Предположим вы хотите передать объект :class:`~django.db.models.DateTimeField` и отформатировать это значение:

source: Initially, ``token.split_contents()`` will return three values:
ru: ``token.split_contents()`` вернет три значения:

source: The tag name ``format_time``.
ru: Название тега ``format_time``.

source: The string ``'blog_entry.date_updated'`` (without the surrounding quotes).
ru: Строку ``'blog_entry.date_updated'`` (без кавычек).

source: The formatting string ``'"%Y-%m-%d %I:%M %p"'``. The return value from ``split_contents()`` will include the leading and trailing quotes for string literals like this.
ru: Строку форматирования ``'"%Y-%m-%d %I:%M %p"'``. Значение из ``split_contents()`` будет содержать кавычки для таких переменных.

source: Now your tag should begin to look like this::
ru: Теперь ваш тег будет выглядеть следующим образом::

source: You also have to change the renderer to retrieve the actual contents of the ``date_updated`` property of the ``blog_entry`` object. This can be accomplished by using the ``Variable()`` class in ``django.template``.
ru: Теперь вам следует изменить метод ``render`` узла чтобы получить значение атрибута ``date_updated`` объекта ``blog_entry``. Это может быть выполнено с использованием класса ``Variable()`` из ``django.template``.

source: To use the ``Variable`` class, simply instantiate it with the name of the variable to be resolved, and then call ``variable.resolve(context)``. So, for example::
ru: Чтобы использовать класс ``Variable``, создайте экземпляр указав название переменной, потом вызовите ``variable.resolve(context)``. Например::

source: Variable resolution will throw a ``VariableDoesNotExist`` exception if it cannot resolve the string passed to it in the current context of the page.
ru: Будет вызвано исключение ``VariableDoesNotExist`` если невозможно найти значение переменной в текущем контексте.

source: Setting a variable in the context
ru: Добавление переменной в контекст

source: The above examples simply output a value. Generally, it's more flexible if your template tags set template variables instead of outputting values. That way, template authors can reuse the values that your template tags create.
ru: Предыдущие примеры тегов просто выводят значение. Более гибкий способ - это добавить значение в переменную контекста вместо вывода результата. Таким образом автор шаблона может использовать результат выполнения тега несколько раз.

source: To set a variable in the context, just use dictionary assignment on the context object in the ``render()`` method. Here's an updated version of ``CurrentTimeNode`` that sets a template variable ``current_time`` instead of outputting it::
ru: Чтобы добавить переменную в контекст, просто добавьте значение в контекст как в словарь в методе ``render()``. Вот обновленная версия ``CurrentTimeNode``, которая устанавливает переменную ``current_time`` вместо вывода результата::

source: Note that ``render()`` returns the empty string. ``render()`` should always return string output. If all the template tag does is set a variable, ``render()`` should return the empty string.
ru: Заметим, что ``render()`` возвращает пустую строку. ``render()`` всегда должен возвращать строку. Если все, что делает тег, это добавление переменной в контекст, метод ``render()`` должен вернуть пустую строку.

source: Here's how you'd use this new version of the tag:
ru: Вот как вы можете использовать новую версию тега:

source: Variable scope in context
ru: Область видимости переменной в контексте

source: Any variable set in the context will only be available in the same ``block`` of the template in which it was assigned. This behavior is intentional; it provides a scope for variables so that they don't conflict with context in other blocks.
ru: Любая переменная, добавленная в контекст будет доступна только в блоке(``block``) шаблона, в котором она была добавлена. Так сделано намерено, чтобы переменные не конфликтовали с контекстом другого блока.

source: But, there's a problem with ``CurrentTimeNode2``: The variable name ``current_time`` is hard-coded. This means you'll need to make sure your template doesn't use ``{{ current_time }}`` anywhere else, because the ``{% current_time %}`` will blindly overwrite that variable's value. A cleaner solution is to make the template tag specify the name of the output variable, like so:
ru: Но есть одна проблема в ``CurrentTimeNode2``: название переменной ``current_time`` "вшито" в тег. Это означает, что вы должны убедиться, что переменная ``{{ current_time }}`` не используется в шаблоне, потому что ``{% current_time %}`` перезапишет ее. Правильное решение -- позволить указывать название переменной при вызове тега:

source: To do that, you'll need to refactor both the compilation function and ``Node`` class, like so::
ru: Чтобы это сделать вам нужно изменить код функции компиляции и подкласса ``Node``::

source: The difference here is that ``do_current_time()`` grabs the format string and the variable name, passing both to ``CurrentTimeNode3``.
ru: Разница в том, что ``do_current_time()`` получает формат строки и название переменной и передает в конструктор ``CurrentTimeNode3``.

source: Parsing until another block tag
ru: Создание блочного тега

source: Template tags can work in tandem. For instance, the standard :ttag:`{% comment %}<comment>` tag hides everything until ``{% endcomment %}``. To create a template tag such as this, use ``parser.parse()`` in your compilation function.
ru: Шаблонные теги могут работать вместе. Например, встроенный тег :ttag:`{% comment %}<comment>` скрывает содержимое до тега ``{% endcomment %}``. Чтобы создать подобный тег, используйте ``parser.parse()`` в функции компиляции тега.

source: Here's how a simplified ``{% comment %}`` tag might be implemented::
ru: Вот простая реализация тега ``{% comment %}``::

source: The actual implementation of :ttag:`{% comment %}<comment>` is slightly different in that it allows broken template tags to appear between ``{% comment %}`` and ``{% endcomment %}``. It does so by calling ``parser.skip_past('endcomment')`` instead of ``parser.parse(('endcomment',))`` followed by ``parser.delete_first_token()``, thus avoiding the generation of a node list.
ru: Реализация :ttag:`{% comment %}<comment>` немного отличается от нашего примера, позволяя использовать неправильные теги между ``{% comment %}`` и ``{% endcomment %}``. Для этого используется ``parser.skip_past('endcomment')`` вместо ``parser.parse(('endcomment',))`` перед ``parser.delete_first_token()``, такой вариант не генерирует список узлов.

source: ``parser.parse()`` takes a tuple of names of block tags ''to parse until''. It returns an instance of ``django.template.NodeList``, which is a list of all ``Node`` objects that the parser encountered ''before'' it encountered any of the tags named in the tuple.
ru: ``parser.parse()`` принимает кортеж названий тегов для "парсинга, пока они не встретятся". Функция вернет объект ``django.template.NodeList``, который является списком объектов ``Node`` встреченных ''до'' любого из тегов указанных в кортеже.

source: In ``"nodelist = parser.parse(('endcomment',))"`` in the above example, ``nodelist`` is a list of all nodes between the ``{% comment %}`` and ``{% endcomment %}``, not counting ``{% comment %}`` and ``{% endcomment %}`` themselves.
ru: В ``"nodelist = parser.parse(('endcomment',))"`` из нашего примера, ``nodelist`` -- это список всех узлов встреченных между ``{% comment %}`` и ``{% endcomment %}``, не включая ``{% comment %}`` и ``{% endcomment %}``.

source: After ``parser.parse()`` is called, the parser hasn't yet "consumed" the ``{% endcomment %}`` tag, so the code needs to explicitly call ``parser.delete_first_token()``.
ru: После вызова ``parser.parse()`` парсер не "обрабатывает" тег ``{% endcomment %}``, поэтому необходимо вызвать ``parser.delete_first_token()``.

source: ``CommentNode.render()`` simply returns an empty string. Anything between ``{% comment %}`` and ``{% endcomment %}`` is ignored.
ru: ``CommentNode.render()`` просто возвращает пустую строку. Все между ``{% comment %}`` и ``{% endcomment %}`` игнорируется.

source: Parsing until another block tag, and saving contents
ru: Обработка блочного тега с сохранением содержимого

source: In the previous example, ``do_comment()`` discarded everything between ``{% comment %}`` and ``{% endcomment %}``. Instead of doing that, it's possible to do something with the code between block tags.
ru: В примере выше, ``do_comment()`` игнорирует содержимое между ``{% comment %}`` и ``{% endcomment %}``. Вместо этого можно выполнить какие-либо операции над содержимым блочного тега.

source: For example, here's a custom template tag, ``{% upper %}``, that capitalizes everything between itself and ``{% endupper %}``.
ru: Например, у нас есть тег ``{% upper %}``, который преобразует содержимое до тега ``{% endupper %}`` в верхний регистр.

source: Usage:
ru: Пример использования:

source: As in the previous example, we'll use ``parser.parse()``. But this time, we pass the resulting ``nodelist`` to the ``Node``::
ru: Как и в предыдущем примере мы будем использовать ``parser.parse()``. Но в этот раз полученный ``nodelist`` передадим в ``Node``::

source: The only new concept here is the ``self.nodelist.render(context)`` in ``UpperNode.render()``.
ru: Новым здесь является вызов ``self.nodelist.render(context)`` в ``UpperNode.render()``.

source: For more examples of complex rendering, see the source code of :ttag:`{% for %}<for>` in ``django/template/defaulttags.py`` and :ttag:`{% if %}<if>` in ``django/template/smartif.py``.
ru: Более сложные примеры ищите в исходном коде реализации :ttag:`{% for %}<for>` в ``django/template/defaulttags.py`` и :ttag:`{% if %}<if>` в ``django/template/smartif.py``.
