Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/howto/error-reporting.po
Languages: ru

source: Error reporting
ru: Отчёты об ошибках

source: When you're running a public site you should always turn off the :setting:`DEBUG` setting. That will make your server run much faster, and will also prevent malicious users from seeing details of your application that can be revealed by the error pages.
ru: Когда ваш сайт работает публично вы всегда должны отключать опцию отладки :setting:`DEBUG`. Это сделает запуск вашего сервера намного быстрее и избавит посетителей от созерцания детальной информации, отображаемой на странице в случае ошибок.

source: Email reports
ru: Уведомления на email

source: Server errors
ru: Ошибки сервера

source: In order to send email, Django requires a few settings telling it how to connect to your mail server. At the very least, you'll need to specify :setting:`EMAIL_HOST` and possibly :setting:`EMAIL_HOST_USER` and :setting:`EMAIL_HOST_PASSWORD`, though other settings may be also required depending on your mail server's configuration. Consult :doc:`the Django settings documentation </ref/settings>` for a full list of email-related settings.
ru: Для отправки электронного уведомления Django потребуется указать несколько параметров для успешного подключения к почтовому серверу. По крайней мере, нужно указать имя хоста (:setting:`EMAIL_HOST`) и, возможно, имя пользователя (:setting:`EMAIL_HOST_USER`) и его пароль (:setting:`EMAIL_HOST_PASSWORD`), хотя могут потребоваться и другие настройки , это зависит от конфигурации почтового сервера. См. :doc:`документацию по настройке проекта </ref/settings>`, где приведён полный список возможных опций.

source: By default, Django will send email from root@localhost. However, some mail providers reject all email from this address. To use a different sender address, modify the :setting:`SERVER_EMAIL` setting.
ru: По-умолчанию Django отправит отчёт на адрес root@localhost. Однако некоторые провайдеры отбрасывают любые запросы на этот адрес. Для указания другого адреса исправьте настройки параметра :setting:`SERVER_EMAIL`.

source: To activate this behavior, put the email addresses of the recipients in the :setting:`ADMINS` setting.
ru: Чтобы включить такое поведение укажите почтовые адреса в секции :setting:`ADMINS`.

source: Server error emails are sent using the logging framework, so you can customize this behavior by :doc:`customizing your logging configuration </topics/logging>`.
ru: При отправке отчётов об ошибках задействуется логгирование, так что вы можете управлять и его поведением с помощью :doc:`соответствующих настроек </topics/logging>`.

source: 404 errors
ru: 404 ошибка

source: Django can also be configured to email errors about broken links (404 "page not found" errors). Django sends emails about 404 errors when:
ru: Django может уведомлять вас о неработающих ссылках (ошибка 404 "страница не найдена"). Сообщения о 404 ошибках отправляются при условии, что:

source: :setting:`DEBUG` is ``False``;
ru: параметр :setting:`DEBUG` установлен в ``False``;

source: Your :setting:`MIDDLEWARE` setting includes :class:`django.middleware.common.BrokenLinkEmailsMiddleware`.
ru: В настройках :setting:`MIDDLEWARE` содержится :class:`django.middleware.common.BrokenLinkEmailsMiddleware`.

source: :class:`~django.middleware.common.BrokenLinkEmailsMiddleware` must appear before other middleware that intercepts 404 errors, such as :class:`~django.middleware.locale.LocaleMiddleware` or :class:`~django.contrib.flatpages.middleware.FlatpageFallbackMiddleware`. Put it towards the top of your :setting:`MIDDLEWARE` setting.
ru: :class:`~django.middleware.common.BrokenLinkEmailsMiddleware` должен выполняться перед другими мидлварами обрабатывающими 404 ошибки, такими как :class:`~django.middleware.locale.LocaleMiddleware` или :class:`~django.contrib.flatpages.middleware.FlatpageFallbackMiddleware`. Поместите его выше в настройках :setting:`MIDDLEWARE`.

source: You can tell Django to stop reporting particular 404s by tweaking the :setting:`IGNORABLE_404_URLS` setting. It should be a list of compiled regular expression objects. For example::
ru: Вы можете отключить отчёты о 404 ошибке, настроив :setting:`IGNORABLE_404_URLS`. Это должен быть список со скомпилированными объектами регулярных выражений. Например::

source: In this example, a 404 to any URL ending with ``.php`` or ``.cgi`` will *not* be reported. Neither will any URL starting with ``/phpmyadmin/``.
ru: В этом примере уведомление об ошибке 404 *не будет* присылаться, если URL страницы заканчивается на ``.php`` или ``.cgi``. Также в исключения добавлена директория ``/phpmyadmin/``.

source: The following example shows how to exclude some conventional URLs that browsers and crawlers often request::
ru: В приведённом ниже примере показано как добавить в исключения некоторые URL, которые часто запрашиваются браузером и поисковыми роботами::

source: (Note that these are regular expressions, so we put a backslash in front of periods to escape them.)
ru: (Заметьте, что это регулярные выражения, и нужно ставить обратный слэш, чтобы экранировать значения.)

source: If you'd like to customize the behavior of :class:`django.middleware.common.BrokenLinkEmailsMiddleware` further (for example to ignore requests coming from web crawlers), you should subclass it and override its methods.
ru: Если хочется изменить дальнейшее поведение :class:`django.middleware.common.BrokenLinkEmailsMiddleware` (изначально игнорирует запросы от поисковых роботов), необходимо переопределить методы в его подклассах.

source: 404 errors are logged using the logging framework. By default, these log records are ignored, but you can use them for error reporting by writing a handler and :doc:`configuring logging </topics/logging>` appropriately.
ru: При отправке 404 ошибки задействуется логгирование. Изначально записи игнорируются, но могут быть использованы для отправки отчётов при записи с помощью обработчика и :doc:`настройки логгирования </topics/logging>`.

source: Filtering error reports
ru: Фильтрация сообщений об ошибках

source: Filtering sensitive data is a hard problem, and it's nearly impossible to guarantee that sensitive data won't leak into an error report. Therefore, error reports should only be available to trusted team members and you should avoid transmitting error reports unencrypted over the Internet (such as through email).
ru: Фильтрация конфиденциальной информации -- это сложная задача, и нет никакой гарантии, что она не появится в отчете об ошибке. По этому отчеты об ошибках должны быть доступны только доверенным членам команды и не передаваться в открытом виде через интернет(например по почте).

source: Filtering sensitive information
ru: Фильтрация конфиденциальной информации

source: Error reports are really helpful for debugging errors, so it is generally useful to record as much relevant information about those errors as possible. For example, by default Django records the `full traceback`_ for the exception raised, each `traceback frame`_’s local variables, and the :class:`~django.http.HttpRequest`’s :ref:`attributes<httprequest-attributes>`.
ru: Отчёты об ошибках весьма полезны для отладки, поэтому лучше записывать как можно больше соответствующей информации о различных инцидентах. Например, изначально Django сохраняет `полную трассировочную информацию <http://en.wikipedia.org/wiki/Stack_trace>`_ о вызванных исключениях, каждую локальную переменную `кадра трассировки <http://en.wikipedia.org/wiki/Stack_frame>`_ и :ref:`атрибуты<httprequest-attributes>` класса :class:`~django.http.HttpRequest`.

source: However, sometimes certain types of information may be too sensitive and thus may not be appropriate to be kept track of, for example a user's password or credit card number. So in addition to filtering out settings that appear to be sensitive as described in the :setting:`DEBUG` documentation, Django offers a set of function decorators to help you control which information should be filtered out of error reports in a production environment (that is, where :setting:`DEBUG` is set to ``False``): :func:`sensitive_variables` and :func:`sensitive_post_parameters`.
ru: Однако, некоторая информация может быть конфиденциальной и совершенно не подходит для отслеживания, к таким моментам можно отнести пароль пользователя или номер кредитной карты. Django предлагает несколько декораторов для контроля информации, которая должна быть отфильтрована при отправке отчётов на боевом сервере (то есть там, где :setting:`DEBUG` установлен в ``False``): :func:`sensitive_variables` и :func:`sensitive_post_parameters`.

source: If a function (either a view or any regular callback) in your code uses local variables susceptible to contain sensitive information, you may prevent the values of those variables from being included in error reports using the ``sensitive_variables`` decorator::
ru: Если функция (или представление регулярного выражения) в вашем коде использует локальные переменные, содержащие конфиденциальную информацию, вы можете предотвратить появление этих переменных при отправке отчётов при помощи декоратора ``sensitive_variables``::

source: In the above example, the values for the ``user``, ``pw`` and ``cc`` variables will be hidden and replaced with stars (`**********`) in the error reports, whereas the value of the ``name`` variable will be disclosed.
ru: В данном выше примере значения переменных ``user``, ``pw`` и ``cc`` будут скрыты и заменены на символы звёздочки (`**********`) в отчёте, в то время как значение переменной ``name`` будет открытым.

source: To systematically hide all local variables of a function from error logs, do not provide any argument to the ``sensitive_variables`` decorator::
ru: Систематическое скрытие всех локальных переменных функции из журнала ошибок (error logs) не требует никаких аргументов декоратора ``sensitive_variables``::

source: When using multiple decorators
ru: При использовании нескольких декораторов

source: If the variable you want to hide is also a function argument (e.g. '``user``’ in the following example), and if the decorated function has multiple decorators, then make sure to place ``@sensitive_variables`` at the top of the decorator chain. This way it will also hide the function argument as it gets passed through the other decorators::
ru: Если переменная, значение которой вы хотите скрыть, также является аргументом функции (как '``user``' в приведённом примере), и декорируемая функция имеет множество декораторов, убедитесь, что ``@sensitive_variables`` находится на самом верху цепочки. Это позволит также скрыть аргументы функции, взаимодействующие с другими декораторами::

source: If one of your views receives an :class:`~django.http.HttpRequest` object with :attr:`POST parameters<django.http.HttpRequest.POST>` susceptible to contain sensitive information, you may prevent the values of those parameters from being included in the error reports using the ``sensitive_post_parameters`` decorator::
ru: Если одно из представлений объекта :class:`~django.http.HttpRequest` с атрибутом :attr:`POST parameters<django.http.HttpRequest.POST>` подтверждает содержание конфиденциальной информации, вы можете предотвратить включение этих данных в отчёт, используя декоратор ``sensitive_post_parameters`` ::

source: In the above example, the values for the ``pass_word`` and ``credit_card_number`` POST parameters will be hidden and replaced with stars (`**********`) in the request's representation inside the error reports, whereas the value of the ``name`` parameter will be disclosed.
ru: В данном выше примере значения ``pass_word`` и ``credit_card_number`` в POST запросе будут скрыты и заменены звёздочками (`**********`) при представлении запроса в отчёте об ошибках, в то время как параметр ``name`` будет открытым.

source: To systematically hide all POST parameters of a request in error reports, do not provide any argument to the ``sensitive_post_parameters`` decorator::
ru: Систематическое скрытие всех POST параметров из журнала ошибок (error logs) не требует никаких аргументов декоратора ``sensitive_post_parameters`` ::

source: All POST parameters are systematically filtered out of error reports for certain :mod:`django.contrib.auth.views` views (``login``, ``password_reset_confirm``, ``password_change``, and ``add_view`` and ``user_change_password`` in the ``auth`` admin) to prevent the leaking of sensitive information such as user passwords.
ru: Все POST параметры систематически фильтруются в отчёте об ошибках в представлении :mod:`django.contrib.auth.views` (``login``, ``password_reset_confirm``, ``password_change``, и ``add_view`` и ``user_change_password`` в системе аутентификации) для предотвращения утечки конфиденциальной информации, такой как пароли пользователей.

source: Custom error reports
ru: Настройка отчета об ошибке

source: All :func:`sensitive_variables` and :func:`sensitive_post_parameters` do is, respectively, annotate the decorated function with the names of sensitive variables and annotate the ``HttpRequest`` object with the names of sensitive POST parameters, so that this sensitive information can later be filtered out of reports when an error occurs. The actual filtering is done by Django's default error reporter filter: :class:`django.views.debug.SafeExceptionReporterFilter`. This filter uses the decorators' annotations to replace the corresponding values with stars (`**********`) when the error reports are produced. If you wish to override or customize this default behavior for your entire site, you need to define your own filter class and tell Django to use it via the :setting:`DEFAULT_EXCEPTION_REPORTER_FILTER` setting::
ru: Декораторы :func:`sensitive_variables` и :func:`sensitive_post_parameters` отмечают небезопасные аргументы и POST аргументы объекта ``HttpRequest``, которые передаются в функцию. При формировании отчета об ошибке эти данные фильтруются. Фильтрация выполняется классом :class:`django.views.debug.SafeExceptionReporterFilter`. Этот класс заменит отмеченные декоратором данные "звездочками" (`**********`) при формировании отчета. Вы можете создать собственный класс фильтрации и указать его в настройке :setting:`DEFAULT_EXCEPTION_REPORTER_FILTER`::

source: You may also control in a more granular way which filter to use within any given view by setting the ``HttpRequest``’s ``exception_reporter_filter`` attribute::
ru: Также можно указать класс фильтрации для конкретного ``HttpRequest`` определив атрибут ``exception_reporter_filter``::

source: Your custom filter class needs to inherit from :class:`django.views.debug.SafeExceptionReporterFilter` and may override the following methods:
ru: Ваш класс фильтрации должен наследоваться от :class:`django.views.debug.SafeExceptionReporterFilter` и может переопределить следующие методы:

source: Returns ``True`` to activate the filtering operated in the other methods. By default the filter is active if :setting:`DEBUG` is ``False``.
ru: Возвращает ``True``, указывая фильтровать данные или нет. По умолчанию фильтрация выполняется при :setting:`DEBUG` равном ``False``.

source: Returns the filtered dictionary of POST parameters. By default it replaces the values of sensitive parameters with stars (`**********`).
ru: Возвращает отфильтрованный словарь POST параметров. По умолчанию заменяет небезопасные данные "звездочками" (`**********`).

source: Returns the filtered dictionary of local variables for the given traceback frame. By default it replaces the values of sensitive variables with stars (`**********`).
ru: Возвращает отфильтрованный словарь локальных переменных. По умолчанию заменяет небезопасные данные "звездочками" (`**********`).

source: You can also set up custom error reporting by writing a custom piece of :ref:`exception middleware <exception-middleware>`. If you do write custom error handling, it's a good idea to emulate Django's built-in error handling and only report/log errors if :setting:`DEBUG` is ``False``.
ru: Вы также можете изменить формирование для отчета создав :ref:`собственный мидлвар обработки ошибок <exception-middleware>`. Советуем сохранить поведение Django и возвращать отчет об ошибке только при :setting:`DEBUG` равном ``False``.
