Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/howto/legacy-databases.po
Languages: ru

source: Integrating Django with a legacy database
ru: Интеграция Django с унаследованной базой данных

source: While Django is best suited for developing new applications, it's quite possible to integrate it into legacy databases. Django includes a couple of utilities to automate as much of this process as possible.
ru: Несмотря на то, что Django нацелена на разработку новых приложений, довольно несложно подключить к ней базу данных, унаследованную от другого проекта. Django предоставляет ряд утилит для автоматизации данного процесса, насколько это возможно.

source: This document assumes you know the Django basics, as covered in the :doc:`tutorial </intro/tutorial01>`.
ru: Этот документ предполагает, что вы знакомы с основами Django, которые описаны в :doc:`учебнике </intro/tutorial01>`.

source: Once you've got Django set up, you'll follow this general process to integrate with an existing database.
ru: После настройки Django следуйте стандартному процессу для интеграции с существующей базой данных.

source: Give Django your database parameters
ru: Предоставьте Django параметры вашей базы данных

source: You'll need to tell Django what your database connection parameters are, and what the name of the database is. Do that by editing the :setting:`DATABASES` setting and assigning values to the following keys for the ``'default'`` connection:
ru: Вам потребуется указать параметры соединения с вашей базой данных и её имя. Делается это редактированием параметра :setting:`DATABASES`, указав значения для следующих ключей соединения ``'default'``:

source: Auto-generate the models
ru: Автоматическая генерация моделей

source: Django comes with a utility called :djadmin:`inspectdb` that can create models by introspecting an existing database. You can view the output by running this command::
ru: Django представляет утилиту :djadmin:`inspectdb`, которая может создавать модели по существующей базе данных. Вы можете посмотреть результат, запустив следующую команду::

source: Save this as a file by using standard Unix output redirection::
ru: Сохраните его в файл, используя стандартный механизм перенаправления Unix::

source: This feature is meant as a shortcut, not as definitive model generation. See the :djadmin:`documentation of inspectdb <inspectdb>` for more information.
ru: Такой подход является вспомогательными. Обратитесь к :djadmin:`документации на inspectdb <inspectdb>` для подробностей.

source: Once you've cleaned up your models, name the file ``models.py`` and put it in the Python package that holds your app. Then add the app to your :setting:`INSTALLED_APPS` setting.
ru: После приведения моделей в нормальный вид, сохраните их в файле ``models.py``, разместив его в пакете, который хранит ваше приложение. Затем добавьте ваше приложение в :setting:`INSTALLED_APPS`.

source: By default, :djadmin:`inspectdb` creates unmanaged models. That is, ``managed = False`` in the model's ``Meta`` class tells Django not to manage each table's creation, modification, and deletion::
ru: По умолчанию :djadmin:`inspectdb` создает модели с ``managed = False`` в классе ``Meta``. Это указывает Django не управлять созданием, изменением и удалением таблицей модели::

source: Install the core Django tables
ru: Установка основных таблиц Django

source: Next, run the :djadmin:`migrate` command to install any extra needed database records such as admin permissions and content types::
ru: Теперь, запустите команду :djadmin:`migrate` для добавления в базу данных необходимых записей, таких как права пользователей и типы контента::

source: Test and tweak
ru: Тестирование и настройка

source: Those are the basic steps -- from here you'll want to tweak the models Django generated until they work the way you'd like. Try accessing your data via the Django database API, and try editing objects via Django's admin site, and edit the models file accordingly.
ru: Это были основные шаги. Теперь вам может потребоваться изменить созданные модели, чтобы они работали так, как вам необходимо. Попробуйте обратиться к данным через API баз данных Django, отредактировать их с помощью интерфейса администратора или изменить сам файл с моделями.
