Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/howto/outputting-pdf.po
Languages: ru

source: Outputting PDFs with Django
ru: Генерация PDF на Django

source: This document explains how to output PDF files dynamically using Django views. This is made possible by the excellent, open-source ReportLab_ Python PDF library.
ru: Здесь рассказывается как генерировать PDF с помощью представлений Django. Это возможно благодаря чудесной открытой библиотеке ReportLab.

source: The advantage of generating PDF files dynamically is that you can create customized PDFs for different purposes -- say, for different users or different pieces of content.
ru: Преимущество динамической генерации PDF заключается в том, например, что вы можете создавать разный документ для разных пользователей.

source: For example, Django was used at kusports.com_ to generate customized, printer-friendly NCAA tournament brackets, as PDF files, for people participating in a March Madness contest.
ru: Например, Django использовали на kusports.com для генерации турнирной таблицы NCAA, которую можно распечатать как обычный PDF-файл.

source: Install ReportLab
ru: Установка ReportLab

source: The ReportLab library is `available on PyPI`_. A `user guide`_ (not coincidentally, a PDF file) is also available for download. You can install ReportLab with ``pip``:
ru: Библиотека ReportLab доступна на `PyPI <https://pypi.python.org/pypi/reportlab>`_. `Документация <http://www.reportlab.com/docs/reportlab-userguide.pdf>`_ не случайно это PDF файл) также доступна для загрузки. Вы можете установить ReportLab с помощью ``pip``:

source: Test your installation by importing it in the Python interactive interpreter::
ru: Проверьте правильность установки с помощью импорта в интерактивном интерпретаторе::

source: If that command doesn't raise any errors, the installation worked.
ru: Если не вылезло никакой ошибки, значит установка прошла успешно.

source: Write your view
ru: Пишем собственное представление.

source: Here's a "Hello World" example::
ru: Пример "Hello World"::

source: The code and comments should be self-explanatory, but a few things deserve a mention:
ru: Код и комментарии должны быть очевидными, но несколько моментов заслуживают внимания:

source: Finally, it's important to call ``showPage()`` and ``save()`` on the PDF file.
ru: Наконец, важно вызвать ``showPage()`` и ``save()``.

source: ReportLab is not thread-safe. Some of our users have reported odd issues with building PDF-generating Django views that are accessed by many people at the same time.
ru: ReportLab не потокобезопасна. Пользователи могут мешать друг другу в процессе построения PDF.

source: Other formats
ru: Другие форматы

source: Notice that there isn't a lot in these examples that's PDF-specific -- just the bits using ``reportlab``. You can use a similar technique to generate any arbitrary format that you can find a Python library for. Also see :doc:`/howto/outputting-csv` for another example and some techniques you can use when generated text-based formats.
ru: Обратите внимание, что не так много специфики PDF в генерации документов - для ``ReportLab`` это всего лишь биты. Вы можете использовать подобную технику для генерации файла любого формата для которого есть соответствующая библиотека. В :doc:`/howto/outputting-csv` есть ещё примеры создания текстового формата.

source: Django Packages provides a `comparison of packages <https://djangopackages.org/grids/g/pdf/>`_ that help generate PDF files from Django.
ru: Django Packages предоставляет `сравнение библиотек <https://djangopackages.org/grids/g/pdf/>`_ для создания PDF файлов.
