Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/howto/upgrade-version.po
Languages: ru

source: Upgrading Django to a newer version
ru: Обновление Django до новой версии

source: While it can be a complex process at times, upgrading to the latest Django version has several benefits:
ru: Время от времени эта процедура может быть сложной, но обновление до последней версии Django имеет ряд преимуществ:

source: New features and improvements are added.
ru: Добавление новой функциональности и различных улучшений

source: Bugs are fixed.
ru: Закрытие старых багов

source: Upgrading as each new Django release is available makes future upgrades less painful by keeping your code base up to date.
ru: Если вы будете обновлять Django при выходе каждого нового релиза, это сделает процедуру последующих обновлений менее болезненной и сохранит ваш код в актуальном состоянии.

source: Here are some things to consider to help make your upgrade process as smooth as possible.
ru: Ниже изложено несколько вещей, призванных сделать обновление настолько мягким, насколько это вообще возможно.

source: Required Reading
ru: Обязательно к прочтению

source: If it's your first time doing an upgrade, it is useful to read the :doc:`guide on the different release processes </internals/release-process>`.
ru: Если это ваше первое обновление, полезно будет прочесть :doc:`guide on the different release processes </internals/release-process>`.

source: Afterwards, you should familiarize yourself with the changes that were made in the new Django version(s):
ru: Впоследствии вы можете ознакомиться с изменениями, которые были сделаны в новых версиях(версии) Django:

source: Read the :doc:`release notes </releases/index>` for each 'final' release from the one after your current Django version, up to and including the version to which you plan to upgrade.
ru: Прочтите :doc:`описание изменений </releases/index>` каждого 'финального' релиза, начиная с релиза вашей версии Django вплоть до того, на который желаете обновиться.

source: Look at the :doc:`deprecation timeline</internals/deprecation>` for the relevant versions.
ru: Взгляните на :doc:`срок поддержки </internals/deprecation>` интересующей вас версии.

source: Pay particular attention to backwards incompatible changes to get a clear idea of what will be needed for a successful upgrade.
ru: Уделите особое внимание обратной совместимости, чтобы получить чёткое представление о том, что необходимо для успешного обновления.

source: If you're upgrading through more than one feature version (e.g. A.B to A.B+2), it's usually easier to upgrade through each feature release incrementally (A.B to A.B+1 to A.B+2) rather than to make all the changes for each feature release at once. For each feature release, use the latest patch release (A.B.C).
ru: Если вы обновляетесь более чем на несколько версий (например с A.B до A.B+2), обычно проще обновлять версию за версией (с A.B до A.B+1, затем A.B+2), чем до последней версии сразу. Для каждой версии используйте последнюю минорную версию (A.B.C).

source: The same incremental upgrade approach is recommended when upgrading from one LTS to the next.
ru: Аналогичный подход рекомендуется при обновлении с одной LTS версии до следующей.

source: Dependencies
ru: Зависимости

source: In most cases it will be necessary to upgrade to the latest version of your Django-related dependencies as well. If the Django version was recently released or if some of your dependencies are not well-maintained, some of your dependencies may not yet support the new Django version. In these cases you may have to wait until new versions of your dependencies are released.
ru: В большинстве случаев необходимо также обновить пакеты, которые связаны с Django. В случае, если версия Django была выпущена недавно или же какие-то из связанных с ним пакетов недостаточно протестированы, некоторые из таких пакетов могут не поддерживаться в новой версии Django. В таком случае вы можете подождать выхода версии, в которой необходимая функциональность будет реализована.

source: Resolving deprecation warnings
ru: Исправление предупреждений об устаревании(deprecation warning)

source: Before upgrading, it's a good idea to resolve any deprecation warnings raised by your project while using your current version of Django. Fixing these warnings before upgrading ensures that you're informed about areas of the code that need altering.
ru: Перед обновлением следует исправить все предупреждения об устаревании функционала, которые возвращает текущая версия Django на вашем проекте. Исправляя эти ошибки вы узнаете какие части кода затронет обновление.

source: If you're not using the Django test runner, you may need to also ensure that any console output is not captured which would hide deprecation warnings. For example, if you use `py.test`:
ru: Если вы не используете исполнитель тестов Django, убедитесь, что вывод в консоль не перехватывается, это может скрыть предупреждения. Например, если вы используете `py.test`:

source: Resolve any deprecation warnings with your current version of Django before continuing the upgrade process.
ru: Исправьте все предупреждения об устаревании для вашей текущей версии Django и затем продолжите процесс обновления.

source: Third party applications might use deprecated APIs in order to support multiple versions of Django, so deprecation warnings in packages you've installed don't necessarily indicate a problem. If a package doesn't support the latest version of Django, consider raising an issue or sending a pull request for it.
ru: Сторонние приложения могут использовать устаревший API, чтобы поддерживать несколько версий Django, поэтому предупреждения в сторонних приложениях не всегда указывают на проблему. Если приложение не поддерживает последнюю версию Django, вам следует создать задачу или отправить "pull request" для этого приложения.

source: Installation
ru: Установка

source: Once you're ready, it is time to :doc:`install the new Django version </topics/install>`. If you are using virtualenv_ and it is a major upgrade, you might want to set up a new environment with all the dependencies first.
ru: Теперь пора перейти к :doc:`установке новой версии Django </topics/install>`. Если вы работаете с virtualenv_ и предстоит крупное обновление, можете сначала установить новое окружение со всеми связанными с Django пакетами.

source: Testing
ru: Тестирование

source: When the new environment is set up, :doc:`run the full test suite </topics/testing/overview>` for your application. Again, it's useful to turn on deprecation warnings on so they're shown in the test output (you can also use the flag if you test your app manually using ``manage.py runserver``):
ru: После настройки нового виртуального окружения :doc:`запустите набор тестов </topics/testing/overview>`, чтобы проверить ваши приложения. Полезно включить вывод предупреждений, чтобы отображать такие сообщения при тестировании (также можно протестировать приложение вручную при запуске ``manage.py runserver``):

source: After you have run the tests, fix any failures. While you have the release notes fresh in your mind, it may also be a good time to take advantage of new features in Django by refactoring your code to eliminate any deprecation warnings.
ru: После запуска тестов, исправьте неработающие участки кода. Пока описание нового релиза ещё не выветрилось из вашей памяти, используйте этот момент, чтобы протестировать новые возможности Django и переписать код, помеченный в свежем релизе как устаревший.

source: Deployment
ru: Развёртывание

source: When you are sufficiently confident your app works with the new version of Django, you're ready to go ahead and :doc:`deploy </howto/deployment/index>` your upgraded Django project.
ru: Когда вы удостоверитесь в том, что ваше приложение работает с новой версией Django, можете двигаться дальше к :doc:`развёртыванию </howto/deployment/index>` вашего обновлённого проекта.

source: If you are using caching provided by Django, you should consider clearing your cache after upgrading. Otherwise you may run into problems, for example, if you are caching pickled objects as these objects are not guaranteed to be pickle-compatible across Django versions. A past instance of incompatibility was caching pickled :class:`~django.http.HttpResponse` objects, either directly or indirectly via the :func:`~django.views.decorators.cache.cache_page` decorator.
ru: Если вы используете систему кэширования, предоставляемую Django, рекомендуется очистить кэш после обновления. В противном случае у вас могут появиться проблемы, например, если вы кэшируете неизменяемые объекты, мы не можем гарантировать, что они будут совместимы с различными версиями Django. К таким моментам можно отнести кэширование объектов :class:`~django.http.HttpResponse` как непосредственное, так и посредством декоратора :func:`~django.views.decorators.cache.cache_page`.
