Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/intro/contributing.po
Languages: ru

source: A good way to do this is to write your new tests first, before making any changes to the code. This style of development is called `test-driven development`__ and can be applied to both entire projects and single patches. After writing your tests, you then run them to make sure that they do indeed fail (since you haven't fixed that bug or added that feature yet). If your new tests don't fail, you'll need to fix them so that they do. After all, a regression test that passes regardless of whether a bug is present is not very helpful at preventing that bug from reoccurring down the road.
ru: Хороший способ сделать это, во-первых, писать новые тесты перед внесением любых изменений в код. Этот тип разработки называется `разработкой через тестирование <https://en.wikipedia.org/wiki/Test-driven_development>`_ и может быть применена как к целым проектам, так и к отдельным патчам. После написания тестов, Вам нужно запустить их, чтобы убедиться, что они действительно проваливаются (ведь Вы еще не исправили ошибку или не добавили эту возможность). Если Ваши новые тесты не проваливаются, то необходимо исправить их так, чтобы они это делали. Ведь регрессионный тест, который проходит независимо от присутствия ошибки, бесполезен для предотвращения повторения этой ошибки в будущем.

source: Now for our hands-on example.
ru: Теперь приступим к практическому примеру.

source: Writing some tests for ticket #24788
ru: Написание тестов для тикета #24788

source: Ticket :ticket:`24788` proposes a small feature addition: the ability to specify the class level attribute ``prefix`` on Form classes, so that::
ru: Тикет :ticket:`24788` предлагает небольшое расширение функциональности: возможность указать атрибут класса ``prefix`` для классов Form:

source: In order to resolve this ticket, we'll add a ``prefix`` attribute to the ``BaseForm`` class. When creating instances of this class, passing a prefix to the ``__init__()`` method will still set that prefix on the created instance. But not passing a prefix (or passing ``None``) will use the class-level prefix. Before we make those changes though, we're going to write a couple tests to verify that our modification functions correctly and continues to function correctly in the future.
ru: В целях решения этого тикета, мы добавим атрибут ``prefix`` для класса ``BaseForm``. При создании экземпляров класса передача префикса в метод ``__init__()`` должна устанавливать этот префикс у создаваемого экземпляра. Если не передавать префикс (или передать ``None``) будет использоваться префикс уровня класса. Перед внесением этих изменений напишем пару тестов, что бы убедиться что наша модификация функционирует правильно и будет функционировать правильно в будущем.

source: Navigate to Django's ``tests/forms_tests/tests/`` folder and open the ``test_forms.py`` file. Add the following code on line 1674 right before the ``test_forms_with_null_boolean`` function::
ru: Перейдите в Django-каталог ``tests/forms_tests/tests/`` и откройте файл ``test_forms.py``. Добавьте следующий код в строку 1674 непосредственно перед функцией ``test_forms_with_null_boolean``:

source: This new test checks that setting a class level prefix works as expected, and that passing a ``prefix`` parameter when creating an instance still works too.
ru: Этот новый тест проверяет, что установка префикса уровня класса работает так, как ожидалось, и что установка параметра ``prefix`` тоже работает.

source: But this testing thing looks kinda hard...
ru: Но вся эта суть тестирования выглядит сложновато...

source: If you've never had to deal with tests before, they can look a little hard to write at first glance. Fortunately, testing is a *very* big subject in computer programming, so there's lots of information out there:
ru: Если Вы никогда не имели дело с тестами прежде, они могут выглядеть, на первый взгляд, немного сложными в написании. К счастью, тестирование - это *очень* обширная тема в компьютерном программировании, поэтому она освещена во множестве источников информации:

source: A good first look at writing tests for Django can be found in the documentation on :doc:`/topics/testing/overview`.
ru: Для начала о написании тестов для Django можно почитать в документации в :doc:`/topics/testing/overview`.

source: Dive Into Python (a free online book for beginning Python developers) includes a great `introduction to Unit Testing`__.
ru: Погружение в Python (бесплатная онлайн-книга для начинающих Python-разработчиков) включает в себя великолепное `Введение в модульное тестирование <http://www.diveintopython3.net/unit-testing.html>`_.

source: After reading those, if you want something a little meatier to sink your teeth into, there's always the Python :mod:`unittest` documentation.
ru: После изучения вышеперечисленного, если вам нужно что-то "позабористей", всегда есть документация на :mod:`unittest`.

source: Running your new test
ru: Запуск Вашего нового теста

source: Remember that we haven't actually made any modifications to ``BaseForm`` yet, so our tests are going to fail. Let's run all the tests in the ``forms_tests`` folder to make sure that's really what happens. From the command line, ``cd`` into the Django ``tests/`` directory and run:
ru: Помните, что мы до сих пор не вносили никаких изменений в класс ``BaseForm``, поэтому наши тесты будут терпеть неудачу. Давайте запустим все тесты в директории ``forms_tests``, чтобы убедится, что это действительно так. В командной строке перейдите в директорию ``tests/`` и запустите:

source: If the tests ran correctly, you should see one failure corresponding to the test method we added. If all of the tests passed, then you'll want to make sure that you added the new test shown above to the appropriate folder and class.
ru: Если тесты запущены правильно, вы должны увидеть один сбой, соответствующий методу тестирования, который мы добавили. Если все тесты прошли, то Вы должны удостовериться, что добавили новый тест именно так, как показано выше, в соответствующую папку и класс.

source: Writing the code for your ticket
ru: Написание кода для Вашего тикета

source: Next we'll be adding the functionality described in ticket :ticket:`24788` to Django.
ru: Далее мы будем добавлять в Django функциональность, описанную в тикете :ticket:`24788`.

source: Writing the code for ticket #24788
ru: Написание кода для тикета #24788

source: Navigate to the ``django/django/forms/`` folder and open the ``forms.py`` file. Find the ``BaseForm`` class on line 72 and add the ``prefix`` class attribute right after the ``field_order`` attribute::
ru: Перейдите в папку ``django/django/forms/`` и откройте файл ``forms.py``. Найдите класс ``BaseForm`` на строке 72 и добавьте атрибут ``prefix`` после существующего атрибута ``field_order``:

source: Verifying your test now passes
ru: Запустим тестирование еще раз

source: Once you're done modifying Django, we need to make sure that the tests we wrote earlier pass, so we can see whether the code we wrote above is working correctly. To run the tests in the ``forms_tests`` folder, ``cd`` into the Django ``tests/`` directory and run:
ru: Как только Вы закончите изменение Django, то должны убедиться в том, что предварительно написанные тесты успешно выполняются, подтверждая корректность написанного вами кода. Чтобы запустить тесты из папки ``forms_tests``, перейдите в Django-директорию ``tests/`` и запустите:

source: Oops, good thing we wrote those tests! You should still see one failure with the following exception::
ru: Ой, хорошо, что мы написали эти тесты! Вы должны по-прежнему видеть один провал со следующим исключением:

source: We forgot to add the conditional statement in the ``__init__`` method. Go ahead and change ``self.prefix = prefix`` that is now on line 87 of ``django/forms/forms.py``, adding a conditional statement::
ru: Мы забыли добавить условный оператор в метод ``__init__``. Идем дальше и меняем ``self.prefix = prefix``, который теперь находится в строке 87 ``django/forms/forms.py``, добавляя условный оператор:

source: Re-run the tests and everything should pass. If it doesn't, make sure you correctly modified the ``BaseForm`` class as shown above and copied the new test correctly.
ru: Повторный запустите тесты и все должно пройти. Если этого не произошло, убедитесь, что правильно изменили класс ``BaseForm`` так, как показано выше, и правильно скопируйте новые тесты.

source: Running Django's test suite for the second time
ru: Запуск коллекции тестов Django во второй раз

source: Once you've verified that your patch and your test are working correctly, it's a good idea to run the entire Django test suite just to verify that your change hasn't introduced any bugs into other areas of Django. While successfully passing the entire test suite doesn't guarantee your code is bug free, it does help identify many bugs and regressions that might otherwise go unnoticed.
ru: Как только Вы удостоверились, что Ваш патч и тестирование работают правильно, было бы неплохо запустить всю коллекцию Django-тестов, просто для того, чтобы убедиться, что Ваши изменения не внесли какие-либо ошибки в другие места Django. И хотя успешное выполнение всей коллекции тестов не гарантирует, что ваш код не содержит ошибок, он помогает идентифицировать множество ошибок и регрессий, которые в противном случае могли остаться незамеченными.

source: To run the entire Django test suite, ``cd`` into the Django ``tests/`` directory and run:
ru: Чтобы запустить всю коллекцию тестов Django, перейдите в директорию ``tests/`` и запустите:

source: As long as you don't see any failures, you're good to go.
ru: Пока Вы не видите каких-либо сбоев, всё идёт хорошо.

source: Writing Documentation
ru: Написание документации

source: This is a new feature, so it should be documented. Add the following section on line 1068 (at the end of the file) of ``django/docs/ref/forms/api.txt``::
ru: Если это новая функциональность, то она должна быть документирована. Добавьте следующий раздел в строку 1068 (в конце файла) файла ``django/docs/ref/forms/api.txt``:

source: Since this new feature will be in an upcoming release it is also added to the release notes for Django 1.9, on line 164 under the "Forms" section in the file ``docs/releases/1.9.txt``::
ru: Поскольку эта новая функция будет в предстоящей версии, она также добавляется к заметкам о выпуске для Django 1.9, в строке 164 в разделе "Forms" в файле ``docs/releases/1.9.txt``:

source: For more information on writing documentation, including an explanation of what the ``versionadded`` bit is all about, see :doc:`/internals/contributing/writing-documentation`. That page also includes an explanation of how to build a copy of the documentation locally, so you can preview the HTML that will be generated.
ru: Для более подробной информации о написании документации, в том числе объяснению того, что такое ``versionadded``, см. :doc:`/internals/contributing/writing-documentation`. Эта страница также включает объяснение того, как построить копию документации локально так, чтобы Вы могли просматривать сгенерированный HTML.

source: Previewing your changes
ru: Предварительный просмотр ваших изменений

source: Now it's time to go through all the changes made in our patch. To display the differences between your current copy of Django (with your changes) and the revision that you initially checked out earlier in the tutorial:
ru: Теперь пришло время просмотреть все изменения сделанные в вашем патче. Для отображения разницы между вашей копией Django (с вашими изменениями) и ревизией, полученной вами в начале этого руководства, запустите:

source: Use the arrow keys to move up and down.
ru: Используйте клавиши со стрелками для перемещения вверх и вниз.

source: When you're done previewing the patch, hit the ``q`` key to return to the command line. If the patch's content looked okay, it's time to commit the changes.
ru: Как только закончите любоваться патчем, нажмите клавишу ``q`` для возврата обратно в командную строку. Если содержимое патча выглядел хорошо, значит наступило время зафиксировать изменения.

source: Committing the changes in the patch
ru: Фиксируем изменения, внесенные патчем

source: To commit the changes:
ru: Для фиксации изменений:

source: This opens up a text editor to type the commit message. Follow the :ref:`commit message guidelines <committing-guidelines>` and write a message like:
ru: Откроется текстовый редактор для ввода сообщения, описывающего фиксацию. Следуя :ref:`рекомендациям по составлению сообщений фиксации <committing-guidelines>`, напишите сообщения типа:

source: Pushing the commit and making a pull request
ru: Отправка зафиксированных изменений в удаленный репозиторий и создание запроса на включение

source: After committing the patch, send it to your fork on GitHub (substitute "ticket_24788" with the name of your branch if it's different):
ru: После фиксации изменений, вносимых патчем, синхронизируйте вашу копию репозитория с GitHub (замените "ticket_24788" на ваше имя ветки, если оно отличается):

source: You can create a pull request by visiting the `Django GitHub page <https://github.com/django/django/>`_. You'll see your branch under "Your recently pushed branches". Click "Compare & pull request" next to it.
ru: Вы можете создать запрос на включение, посетив `страницу Django на GitHub <https://github.com/django/django/>`_. Вы увидите свою ветку в разделе "Your recently pushed branches". Нажмите "Compare & pull request" рядом с ней.

source: Please don't do it for this tutorial, but on the next page that displays a preview of the patch, you would click "Create pull request".
ru: Пожалуйста не делайте этого во время изучения этого руководства, но на следующей странице вы должны были бы нажать на "Create pull request".

source: Next steps
ru: Следующий шаг

source: Congratulations, you've learned how to make a pull request to Django! Details of more advanced techniques you may need are in :doc:`/internals/contributing/writing-code/working-with-git`.
ru: Поздравляю, вы научились создавать запрос на включение ваших наработок в Django! Подробная информация о более сложных методах, которые могут вам понадобиться, находится в :doc:`/internals/contributing/writing-code/working-with-git`.

source: Now you can put those skills to good use by helping to improve Django's codebase.
ru: Теперь вы можете эффективно использовать эти навыки, помогая улучшить кодовую базу Django.

source: More information for new contributors
ru: Дополнительная информация для новых контрибьютеров

source: Before you get too into writing patches for Django, there's a little more information on contributing that you should probably take a look at:
ru: Прежде чем Вы приступите к написанию патчей для Django, ознакомьтесь с дополнительной информацией для участников сообщества:

source: You should make sure to read Django's documentation on :doc:`claiming tickets and submitting patches </internals/contributing/writing-code/submitting-patches>`. It covers Trac etiquette, how to claim tickets for yourself, expected coding style for patches, and many other important details.
ru: Вы должны обязательно прочитать Django-документацию об :doc:`утверждении тикетов и принятии патчей </internals/contributing/writing-code/submitting-patches>`. Она охватывает правила этикета в Trac, получение тикетов для себя, ожидаемый стиль кодирования для патчей, и многие другие важные детали.

source: First time contributors should also read Django's :doc:`documentation for first time contributors</internals/contributing/new-contributors/>`. It has lots of good advice for those of us who are new to helping out with Django.
ru: Новые участники также должны прочитать :doc:`Django-документацию для новых котрибьютеров</internals/contributing/new-contributors/>`. Там вы найдете много хороших советов от тех из нас, кто уже помогал Django.

source: After those, if you're still hungry for more information about contributing, you can always browse through the rest of :doc:`Django's documentation on contributing</internals/contributing/index>`. It contains a ton of useful information and should be your first source for answering any questions you might have.
ru: После этого, если Вас всё еще будет мучить жажда получения дополнительных сведений о вкладе в Django, то Вы всегда можете просмотреть остальную :doc:`Django-документацию по содействию</internals/contributing/index>`. Она содержит массу полезной информации и должна стать Вашим первым источником для ответов на любые возникшие вопросы.

source: Finding your first real ticket
ru: Поиск Вашего первого реального тикета

source: Once you've looked through some of that information, you'll be ready to go out and find a ticket of your own to write a patch for. Pay special attention to tickets with the "easy pickings" criterion. These tickets are often much simpler in nature and are great for first time contributors. Once you're familiar with contributing to Django, you can move on to writing patches for more difficult and complicated tickets.
ru: Когда вы изучите документацию и решите, что уже готовы к написанию патча, вам пройдется приступить к поиску тикета. Обратите особое внимание на тикеты с критерием "easy pickings". Эти задачи, как правило, гораздо проще по своей природе и великолепно подходят для новоиспечённых контрибьютеров. Когда Вы поближе познакомитесь с контрибуцией в Django, то можете переходить к написанию патчей для более трудных и сложных тикетов.

source: If you just want to get started already (and nobody would blame you!), try taking a look at the list of `easy tickets that need patches`__ and the `easy tickets that have patches which need improvement`__. If you're familiar with writing tests, you can also look at the list of `easy tickets that need tests`__. Just remember to follow the guidelines about claiming tickets that were mentioned in the link to Django's documentation on :doc:`claiming tickets and submitting patches </internals/contributing/writing-code/submitting-patches>`.
ru: Если Вы просто хотите начать работу сейчас (и никто не будет Вас в этом винить!), то попробуйте взглянуть на списки `easy tickets that need patches <https://code.djangoproject.com/query?status=new&status=reopened&has_patch=0&easy=1&col=id&col=summary&col=status&col=owner&col=type&col=milestone&order=priority>`_ и `easy tickets that have patches which need improvement <https://code.djangoproject.com/query?status=new&status=reopened&needs_better_patch=1&easy=1&col=id&col=summary&col=status&col=owner&col=type&col=milestone&order=priority>`_. Если Вы знакомы с написанием тестов, то можете также взглянуть на список `easy tickets that need tests <https://code.djangoproject.com/query?status=new&status=reopened&needs_tests=1&easy=1&col=id&col=summary&col=status&col=owner&col=type&col=milestone&order=priority>`_. Только не забывайте следовать рекомендациям, упомянутым в Django-документации об :doc:`утверждении тикетов и принятии патчей </internals/contributing/writing-code/submitting-patches>` о том, как зарезервировать тикеты.

source: What's next after creating a pull request?
ru: Что происходит после создания запроса на включение?

source: After a ticket has a patch, it needs to be reviewed by a second set of eyes. After submitting a pull request, update the ticket metadata by setting the flags on the ticket to say "has patch", "doesn't need tests", etc, so others can find it for review. Contributing doesn't necessarily always mean writing a patch from scratch. Reviewing existing patches is also a very helpful contribution. See :doc:`/internals/contributing/triaging-tickets` for details.
ru: После того, как тикет был запатчен, он должен быть рассмотрен посторонним взглядом. После загрузки патча или его отправки, не забудьте обновить метаданные тикета путем установки флагов "has patch", "doesn't need tests" и т. д., чтобы другие могли найти его для проведения ревью. Вклад не обязательно всегда означает написание патча с нуля. Ревью существующих патчей тоже очень полезный вклад. См. подробнее :doc:`/internals/contributing/triaging-tickets`.
