Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/intro/contributing.po
Languages: ru

source: Writing your first patch for Django
ru: Составление Вашего первого патча для Django

source: Introduction
ru: Введение

source: Interested in giving back to the community a little? Maybe you've found a bug in Django that you'd like to see fixed, or maybe there's a small feature you want added.
ru: Заинтересованы в небольшой обратной помощи сообществу? Может быть Вы нашли ошибку в Django, которую хотели бы видеть исправленной, либо имеете небольшое новшество, которое хотели бы добавить.

source: Contributing back to Django itself is the best way to see your own concerns addressed. This may seem daunting at first, but it's really pretty simple. We'll walk you through the entire process, so you can learn by example.
ru: Обратное содействие в Django - сам по себе лучший способ увидеть внутренние проблемы. Это может показаться сложным на первый взгляд, но это действительно довольно просто. Мы проведем Вас через весь процесс так, что Вы сможете научиться на этом примере.

source: Who's this tutorial for?
ru: Для кого это руководство?

source: If you are looking for a reference on how to submit patches, see the :doc:`/internals/contributing/writing-code/submitting-patches` documentation.
ru: Если вам нужно руководство как отправлять патчи, смотрите :doc:`/internals/contributing/writing-code/submitting-patches`.

source: For this tutorial, we expect that you have at least a basic understanding of how Django works. This means you should be comfortable going through the existing tutorials on :doc:`writing your first Django app</intro/tutorial01>`. In addition, you should have a good understanding of Python itself. But if you don't, `Dive Into Python`__ is a fantastic (and free) online book for beginning Python programmers.
ru: Для использования этого руководства, у Вас должно быть хотя бы общее понимание того, как устроен Django. Как минимум, Вы должны пройти и усвоить руководство по :doc:`написанию Вашего первого приложения Django</intro/tutorial01>`. Кроме того, Вы должны хорошо понимать сам Python. Но, если нет, то `Dive Into Python <http://www.diveintopython3.net/>`_ - это прекрасная (и свободная) онлайн-книга для начинающих Python-программистов.

source: Those of you who are unfamiliar with version control systems and Trac will find that this tutorial and its links include just enough information to get started. However, you'll probably want to read some more about these different tools if you plan on contributing to Django regularly.
ru: Те из вас, кто незнаком с системами контроля версий и Trac, увидят, что это руководство и его ссылки содержат достаточно информации, чтобы начать работу. Впрочем, Вы, вероятно, захотите узнать больше об этих различных инструментах, если планируете содействовать Django постоянно.

source: For the most part though, this tutorial tries to explain as much as possible, so that it can be of use to the widest audience.
ru: На самом деле то руководство затрагивает довольно много тем, стараясь быть полезным для самой широкой аудитории.

source: Where to get help:
ru: Где получить помощь:

source: If you're having trouble going through this tutorial, please post a message to |django-developers| or drop by `#django-dev on irc.freenode.net`__ to chat with other Django users who might be able to help.
ru: Если у Вас возникли проблемы с данным руководством, пожалуйста, отправьте сообщение на |django-developers| или посетите канал `#django-dev на irc.freenode.net <irc://irc.freenode.net/django-dev>`_ , чтобы пообщаться с другими пользователями Django, которые могут быть в состоянии помочь.

source: What does this tutorial cover?
ru: Какие вопросы охватывает данное руководство?

source: We'll be walking you through contributing a patch to Django for the first time. By the end of this tutorial, you should have a basic understanding of both the tools and the processes involved. Specifically, we'll be covering the following:
ru: Мы будем двигаться к Вашему пониманию того, как отсылать патч для Django в первый раз. К концу этого руководства Вы должны будете иметь базовое понимание как инструментов, так и связанных процессов. В частности, рассмотрим следующее:

source: Installing Git.
ru: Установка Git.

source: How to download a development copy of Django.
ru: Как скачать разрабатываемую копию Django.

source: Running Django's test suite.
ru: Запуск коллекции тестов Django.

source: Writing a test for your patch.
ru: Написание теста для патча.

source: Writing the code for your patch.
ru: Написание кода для патча.

source: Testing your patch.
ru: Тестирование Вашего патча.

source: Submitting a pull request.
ru: Отправка запроса на включение (pull request).

source: Where to look for more information.
ru: Где искать дополнительные сведения.

source: Once you're done with the tutorial, you can look through the rest of :doc:`Django's documentation on contributing</internals/contributing/index>`. It contains lots of great information and is a must read for anyone who'd like to become a regular contributor to Django. If you've got questions, it's probably got the answers.
ru: Как только Вы закончите изучать это руководство, то можете полистать напоследок :doc:`Django-документацию по содействию</internals/contributing/index>`. Материал содержит много полезной информации и является обязательным для прочтения всем, кто хотел бы стать постоянным автором Django. Если у вас остались вопросы, наверняка, там есть на них ответы.

source: Python 3 required!
ru: Только Python 3!

source: The current version of Django doesn't support Python 2.7. Get Python 3 at `Python's download page <https://www.python.org/downloads/>`_ or with your operating system's package manager.
ru: Текущая версия Django не поддерживает Python 2.7. Скачайте Python 3 со `страницы загрузки Python <https://www.python.org/downloads/>`_ или воспользуйтесь пакетным менеджером вашей операционной системы.

source: For Windows users
ru: Для пользователей Windows

source: When installing Python on Windows, make sure you check the option "Add python.exe to Path", so that it is always available on the command line.
ru: Для того что бы Python был доступен в командной строке, при установке отметьте опцию "Add python.exe to Path".

source: Code of Conduct
ru: Кодекс поведения

source: As a contributor, you can help us keep the Django community open and inclusive. Please read and follow our `Code of Conduct <https://www.djangoproject.com/conduct/>`_.
ru: Как контрибьютор Вы должны помогать сообществу Django оставаться открытым и инклюзивным. Пожалуйста, прочитайте и соблюдайте наш `Кодекс поведения <https://www.djangoproject.com/conduct/>`_.

source: Installing Git
ru: Установка Git

source: For this tutorial, you'll need Git installed to download the current development version of Django and to generate patch files for the changes you make.
ru: Для этого руководства Вам потребуется установить git, чтобы загрузить текущую разрабатываемую версию Django, а также для создания патч-файлов Ваших изменений.

source: To check whether or not you have Git installed, enter ``git`` into the command line. If you get messages saying that this command could not be found, you'll have to download and install it, see `Git's download page`__.
ru: Чтобы проверить, доступен ли git или Вы ещё не устанавливали его, введите ``git`` в командной строке. Если Вы получите сообщение о том, что эта команда не может быть найдена, Вам придется скачать и установить его, см. `страницу скачивания Git <http://git-scm.com/download>`_.

source: If you're not that familiar with Git, you can always find out more about its commands (once it's installed) by typing ``git help`` into the command line.
ru: Если Вы не знакомы с git, то всегда можете узнать подробнее о командах (после его установки) путем ввода ``git help`` в командной строке.

source: Getting a copy of Django's development version
ru: Получение копии разрабатываемой версии Django

source: The first step to contributing to Django is to get a copy of the source code. First, `fork Django on GitHub <https://github.com/django/django/fork>`__. Then, from the command line, use the ``cd`` command to navigate to the directory where you'll want your local copy of Django to live.
ru: Первым шагом к внесению вклада в Django, является получение копии исходного кода. Во-первых, `сделайте копию репозитория Django на GitHub <https://github.com/django/django/fork>`__. Затем в командной строке, используя команду ``cd``, перейдите в каталог, который хотите использовать для хранения локальной копии Django.

source: Download the Django source code repository using the following command:
ru: Скачайте исходный код репозитория Django, используя команду:

source: Now that you have a local copy of Django, you can install it just like you would install any package using ``pip``. The most convenient way to do so is by using a *virtual environment* (or virtualenv) which is a feature built into Python that allows you to keep a separate directory of installed packages for each of your projects so that they don't interfere with each other.
ru: Теперь у Вас есть локальная копия Django. Его можно установить так же как и любой пакет, используя ``pip``. Удобнее всего это делать используя встроенное в Python *виртуальное окружение* (или virtualenv), которое позволяет создать отдельный каталог для пакетов для каждого из ваших проектов, во избежании конфликтов между ними.

source: It's a good idea to keep all your virtualenvs in one place, for example in ``.virtualenvs/`` in your home directory. Create it if it doesn't exist yet:
ru: Хорошей идеей будет хранить все ваши виртуальные окружения в одном месте, например ``.virtualenvs/`` в Вашей домашней директории. Создайте ее, если ее еще нет:

source: Now create a new virtualenv by running:
ru: Создайте новое виртуальное окружение, запустив:

source: The path is where the new environment will be saved on your computer.
ru: Путь указывает куда ваше новое окружение будет сохранено.

source: For Ubuntu users
ru: Для пользователей Ubuntu

source: On some versions of Ubuntu the above command might fail. Use the ``virtualenv`` package instead, first making sure you have ``pip3``:
ru: В некоторых версиях Ubuntu указанная выше команда может завершиться неудачей. Вместо этого используйте пакет ``virtualenv``, предварительно убедившись, что у вас есть ``pip3``:

source: The final step in setting up your virtualenv is to activate it:
ru: Последним шагом в настройке виртуального окружения является его активация:

source: If the ``source`` command is not available, you can try using a dot instead:
ru: Если команда ``source`` недоступна, можно попробовать вместо нее использовать точку:

source: To activate your virtualenv on Windows, run:
ru: Для активации виртуального окружения в Windows запустите:

source: You have to activate the virtualenv whenever you open a new terminal window. virtualenvwrapper__ is a useful tool for making this more convenient.
ru: Вы должны активировать виртуальное окружение всякий раз, когда вы открываете новое окно терминала. `virtualenvwrapper <https://virtualenvwrapper.readthedocs.io/en/latest/>`_ - полезный инструмент, позволяющий сделать это более удобным.

source: Anything you install through ``pip`` from now on will be installed in your new virtualenv, isolated from other environments and system-wide packages. Also, the name of the currently activated virtualenv is displayed on the command line to help you keep track of which one you are using. Go ahead and install the previously cloned copy of Django:
ru: Все, что вы установили с помощью ``pip``, теперь будет установлено в вашем новом виртуальном окружении, изолированном от других окружений и общесистемных пакетов. Кроме того, в командной строке отображается имя активированного в настоящий момент виртуального окружения, чтобы было проще отслеживать, какое из них вы используете. Теперь установим ранее клонированную копию Django:

source: The installed version of Django is now pointing at your local copy. You will immediately see any changes you make to it, which is of great help when writing your first patch.
ru: Установленная версия Django теперь указывает на вашу локальную копию. Вы сразу увидите любые изменения, которые вы вносите в Django, что очень полезно при написании вашего первого патча.

source: Rolling back to a previous revision of Django
ru: Откат к предыдущей версии Django

source: For this tutorial, we'll be using ticket :ticket:`24788` as a case study, so we'll rewind Django's version history in git to before that ticket's patch was applied. This will allow us to go through all of the steps involved in writing that patch from scratch, including running Django's test suite.
ru: Для этого урока мы будем использовать тикет :ticket:`24788` как учебное случай, поэтому мы отмотаем назад историю Django версий в git, до того, как патч тикета был применён. Это позволит нам пройти через все этапы написания патча с нуля, включая запуск коллекции тестов Django.

source: **Keep in mind that while we'll be using an older revision of Django for this tutorial, you should always use the current version of the master branch when working on your own patch for a ticket!**
ru: **Имейте в виду, что для учебных целей мы будем использовать старую ревизию Django. Но Вы должны всегда использовать текущую разрабатываемую версию Django при работе над своим собственным патчем тикета!**

source: The patch for this ticket was written by Paweł Marczewski, and it was applied to Django as `commit 4df7e8483b2679fc1cba3410f08960bac6f51115`__. Consequently, we'll be using the revision of Django just prior to that, `commit 4ccfc4439a7add24f8db4ef3960d02ef8ae09887`__.
ru: Патч для этого тикета был написан Павлом Марджевски, и был применён в Django как `коммит 4df7e8483b2679fc1cba3410f08960bac6f51115 <https://github.com/django/django/commit/4df7e8483b2679fc1cba3410f08960bac6f51115>`_. Следовательно, мы будем использовать еще более раннюю ревизию Django - `коммит 4ccfc4439a7add24f8db4ef3960d02ef8ae09887 <https://github.com/django/django/commit/4ccfc4439a7add24f8db4ef3960d02ef8ae09887>`_.

source: Navigate into Django's root directory (that's the one that contains ``django``, ``docs``, ``tests``, ``AUTHORS``, etc.). You can then check out the older revision of Django that we'll be using in the tutorial below:
ru: Перейдите в корневой каталог Django (это тот, который содержит ``django``, ``docs``, ``tests``, ``AUTHORS`` и т.п.). Далее мы будем тестировать старую версию Django, используемую в этом руководстве:

source: Running Django's test suite for the first time
ru: Запуск коллекции тестов Django впервые

source: When contributing to Django it's very important that your code changes don't introduce bugs into other areas of Django. One way to check that Django still works after you make your changes is by running Django's test suite. If all the tests still pass, then you can be reasonably sure that your changes haven't completely broken Django. If you've never run Django's test suite before, it's a good idea to run it once beforehand just to get familiar with what its output is supposed to look like.
ru: При внесении изменений непосредственно в Django, очень важно, чтобы ваш код с изменениями не вызывал ошибок в других местах Django. Один из способов убедиться в том, что Django по-прежнему работает после внесения изменений - запустить коллекцию тестов Django. Пока все тесты проходят, Вы можете быть уверены, что Ваши изменения ещё не разрушают целостность Django. Если Вы до этого никогда не запускали коллекцию тестов Django, то неплох будет запустить их хотя бы раз, чтобы знать, как должен выглядеть их вывод.

source: Before running the test suite, install its dependencies by first ``cd``-ing into the Django ``tests/`` directory and then running:
ru: Перед первым запуском коллекции тестов нужно устранить зависимости, установив недостающие пакеты. Используя команду ``cd``, перейдите в каталог Django ``tests/`` и запустите:

source: If you encounter an error during the installation, your system might be missing a dependency for one or more of the Python packages. Consult the failing package's documentation or search the Web with the error message that you encounter.
ru: Если во время установки вы столкнетесь в ошибками - в вашей системе могут остаться не устраненные зависимости от одного или нескольких пакетов Python. Проконсультируйтесь с документацией отказавшего пакета или поищите в Интернете сообщение об ошибке, с которой вы столкнулись.

source: Now we are ready to run the test suite. If you're using GNU/Linux, macOS, or some other flavor of Unix, run:
ru: Сейчас все готово для запуска коллекции тестов. Если Вы используете GNU/Linux, macOS или Unix-подобную систему, запустите:

source: Now sit back and relax. Django's entire test suite has over 9,600 different tests, so it can take anywhere from 5 to 15 minutes to run, depending on the speed of your computer.
ru: Теперь посидите сложа руки и расслабьтесь. Вся коллекция тестов Django имеет более 9600 различных проверок, так что это может занять от 5 до 15 минут, в зависимости от скорости Вашего компьютера.

source: While Django's test suite is running, you'll see a stream of characters representing the status of each test as it's run. ``E`` indicates that an error was raised during a test, and ``F`` indicates that a test's assertions failed. Both of these are considered to be test failures. Meanwhile, ``x`` and ``s`` indicated expected failures and skipped tests, respectively. Dots indicate passing tests.
ru: Пока тесты Django выполняются, Вы увидите поток символов, показывающий состояние выполняемого в данный момент теста. ``E`` указывает, что произошла ошибка во время тестирования, а ``F`` - что тест вернул не тот результат, который ожидался. Оба этих результата означают, то тест провален. Между тем, ``x`` и ``s`` указывают на ожидаемые неудачи и пропущенные тесты соответственно. Точки показывают удачное прохождение тестов.

source: Skipped tests are typically due to missing external libraries required to run the test; see :ref:`running-unit-tests-dependencies` for a list of dependencies and be sure to install any for tests related to the changes you are making (we won't need any for this tutorial). Some tests are specific to a particular database backend and will be skipped if not testing with that backend. SQLite is the database backend for the default settings. To run the tests using a different backend, see :ref:`running-unit-tests-settings`.
ru: Пропускается тест, как правило, из-за отсутствия внешних библиотек, необходимых для его запуска. Посмотрите :ref:`running-unit-tests-dependencies` для получения списка зависимостей и обязательно установите всё для тестов, связанных с изменениями, которые Вы делаете (для этого руководства ничего делать не нужно). Некоторые тесты специфичны для конкретной СУБД и пропускаются если тестирование проходит на другой. По умолчанию используется бекенд SQLite. Если вам нужно пройти тестирование для разный бекендов баз данных, см. :ref:`running-unit-tests-settings`.

source: Once the tests complete, you should be greeted with a message informing you whether the test suite passed or failed. Since you haven't yet made any changes to Django's code, the entire test suite **should** pass. If you get failures or errors make sure you've followed all of the previous steps properly. See :ref:`running-unit-tests` for more information. There will be a couple failures related to deprecation warnings that you can ignore. These failures have since been fixed in Django.
ru: По завершение тестирования Вы должны увидеть сообщение, уведомляющее о том, что тесты пройдены либо они провалились. Поскольку Вы ещё не сделали каких либо изменений в коде Django, то всё тестирование **должно** быть успешным. Если Вы получаете отказы или ошибки, убедитесь в том, что выполнили предыдущие шаги правильно. См. :ref:`running-unit-tests` для получения дополнительной информации. Будет несколько сбоев, связанных с предупреждениями об устаревании, которые вы можете игнорировать. Сейчас эти сбои уже исправлены.

source: Note that the latest Django master may not always be stable. When developing against master, you can check `Django's continuous integration builds`__ to determine if the failures are specific to your machine or if they are also present in Django's official builds. If you click to view a particular build, you can view the "Configuration Matrix" which shows failures broken down by Python version and database backend.
ru: Заметьте, что последняя ревизия основной ветки Django не всегда может быть стабильной. Во время разработки в эту ветку, Вы можете проверить `непрерывное интегрированное построение Django <https://djangoci.com/>`_ чтобы определить, являются ли сбои специфичными для Вашей машины, или они также присутствуют в официальной сборке Django. Если Вы щёлкните на просмотр конкретной сборки, то сможете увидеть "Матрицу Конфигураций", которая отображает сбои для версий Python и бекендов баз данных.

source: For this tutorial and the ticket we're working on, testing against SQLite is sufficient, however, it's possible (and sometimes necessary) to :ref:`run the tests using a different database <running-unit-tests-settings>`.
ru: Для данного руководства и этого тикета, над которым мы работаем, тестирование с SQLite является достаточным, однако, можно (и иногда нужно) сделать :ref:`запуск тестов с использованием различных баз данных <running-unit-tests-settings>`.

source: Creating a branch for your patch
ru: Создание отдельной ветки для вашего патча

source: Before making any changes, create a new branch for the ticket:
ru: Перед внесением изменений создайте новую ветку для вашего тикета:

source: You can choose any name that you want for the branch, "ticket_24788" is an example. All changes made in this branch will be specific to the ticket and won't affect the main copy of the code that we cloned earlier.
ru: Для вашей ветки вы можете выбрать любое имя, например "ticket_24788". Все изменения, сделанные в этой ветке, будут относится к тикету, и не повлияют на ранее скопированную основную копию кода.

source: Writing some tests for your ticket
ru: Написание тестов для Вашего тикета

source: In most cases, for a patch to be accepted into Django it has to include tests. For bug fix patches, this means writing a regression test to ensure that the bug is never reintroduced into Django later on. A regression test should be written in such a way that it will fail while the bug still exists and pass once the bug has been fixed. For patches containing new features, you'll need to include tests which ensure that the new features are working correctly. They too should fail when the new feature is not present, and then pass once it has been implemented.
ru: В большинстве случаев, патч, который будет принят в Django, должен включать тесты. Для патчей, исправляющих ошибки, это означает написание регрессионного тестирования, чтобы гарантировать, что эта ошибка больше не появится в Django. Регрессионный тест должен быть написан таким образом, чтобы он не мог быть выполнен, пока ошибка существует и пройден после того, как ошибка была исправлена. Для патчей, содержащих новые возможности, Вам необходимо включить тесты, которые гарантируют, что эти новые возможности работают правильно. Тесты тоже должны завершаться ошибкой, если новая возможность отсутствует, а после её реализации проходить успешно.
