Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/intro/overview.po
Languages: ru

source: Django at a glance
ru: Знакомство с Django

source: Because Django was developed in a fast-paced newsroom environment, it was designed to make common Web-development tasks fast and easy. Here's an informal overview of how to write a database-driven Web app with Django.
ru: Поскольку Django был разработан в бурлящей среде новостного агентства, он призван сделать веб-разработку простой и быстрой. Далее представлен вводный обзор того, как можно писать веб-приложения при помощи Django.

source: The goal of this document is to give you enough technical specifics to understand how Django works, but this isn't intended to be a tutorial or reference -- but we've got both! When you're ready to start a project, you can :doc:`start with the tutorial </intro/tutorial01>` or :doc:`dive right into more detailed documentation </topics/index>`.
ru: Цель данного документа: предоставить вам достаточное количество технической информации для понимания основ работы Django, но следует иметь ввиду, что этот обзор не является учебником или справочником -- хотя у нас всё это есть! Когда вы будете готовы к созданию своего первого проекта, вы можете :doc:`начать с учебного руководства </intro/tutorial01>` или окунуться :doc:`в море подробнейшей информации </topics/index>`.

source: Design your model
ru: Проектирование модели

source: Although you can use Django without a database, it comes with an `object-relational mapper`_ in which you describe your database layout in Python code.
ru: Хотя вы вполне можете обойтись без использования базы данных, Django предоставляет `object-relational mapper`_ для описания формата БД в виде кода на языке Python.

source: The :doc:`data-model syntax </topics/db/models>` offers many rich ways of representing your models -- so far, it's been solving many years' worth of database-schema problems. Here's a quick example:
ru: :doc:`Синтаксис моделей данных </topics/db/models>` предлагает множество различных способов представления ваших данных, что помогает решать стандартные задачи по использованию БД. Вот небольшой пример:

source: Install it
ru: Настройка базы данных

source: Next, run the Django command-line utility to create the database tables automatically:
ru: Теперь выполните команду для автоматического создания таблиц базы данных:

source: The :djadmin:`migrate` command looks at all your available models and creates tables in your database for whichever tables don't already exist, as well as optionally providing :doc:`much richer schema control </topics/migrations>`.
ru: Команда :djadmin:`migrate` ищет все имеющиеся у вас модели и создает на их основе недостающие таблицы в БД. Также при необходимости предоставляет :doc:`более продвинутый контроль над изменениями в структуре данных </topics/migrations>`.

source: Enjoy the free API
ru: Наслаждайтесь свободным API

source: With that, you've got a free, and rich, :doc:`Python API </topics/db/queries>` to access your data. The API is created on the fly, no code generation necessary:
ru: Дело в том, что вам доступен развитый и бесплатный :doc:`Python API </topics/db/queries>` для доступа к вашим данным. API создаётся на лету, без предварительной генерации кода:

source: A dynamic admin interface: it's not just scaffolding -- it's the whole house
ru: Динамический административный интерфейс: это не просто строительный материал -- это готовый дом

source: Once your models are defined, Django can automatically create a professional, production ready :doc:`administrative interface </ref/contrib/admin/index>` -- a website that lets authenticated users add, change and delete objects. It's as easy as registering your model in the admin site:
ru: Как только вы определите свои модели, Django может автоматически создать удобный :doc:`интерфейс администратора </ref/contrib/admin/index>`, позволяющий авторизованным пользователям добавлять, удалять и изменять объекты. Для этого следует зарегистрировать свою модель:

source: The philosophy here is that your site is edited by a staff, or a client, or maybe just you -- and you don't want to have to deal with creating backend interfaces just to manage content.
ru: Задумка заключается в том, что редактировать разделы могут служащие или клиенты, или, может быть, только вы -- и при этом вам не хотелось бы иметь дело с созданием бэкенд интерфейсов (backend interfaces) только лишь для управления контентом.

source: One typical workflow in creating Django apps is to create models and get the admin sites up and running as fast as possible, so your staff (or clients) can start populating data. Then, develop the way data is presented to the public.
ru: Обычным рабочим моментом при создании сайта на Django, является написание моделей и получение прав администратора для того, чтобы как можно скорее приступить к работе. Так ваши сотрудники (или клиенты) могут сразу же начать наполнение сайта данными, а вы параллельно продолжите подготавливать сайт для публикации.

source: Design your URLs
ru: Проектирование схемы URL

source: A clean, elegant URL scheme is an important detail in a high-quality Web application. Django encourages beautiful URL design and doesn't put any cruft in URLs, like ``.php`` or ``.asp``.
ru: Красивая, элегантная схема URL является важной составляющей высококачественного веб-приложения. Django поощряет создание красивых схем URL и не захламляет их мусором, подобным ``.php`` или же ``.asp.``

source: To design URLs for an app, you create a Python module called a :doc:`URLconf </topics/http/urls>`. A table of contents for your app, it contains a simple mapping between URL patterns and Python callback functions. URLconfs also serve to decouple URLs from Python code.
ru: Проектируя модель URL для своего приложения, вы создаёте модуль Python, называемый :doc:`менеджером URL-ов </topics/http/urls>`. Оглавление вашего приложения представляет из себя простое соответствие между URL-адресом и вызываемой функцией на Python. URLconfs служит для выделения URL адресов из кода на Python.

source: Here's what a URLconf might look like for the ``Reporter``/``Article`` example above:
ru: Вот таким образом может выглядеть схема URL для классов ``Reporter``/``Article``, представленных выше:

source: The code above maps URL paths to Python callback functions ("views"). The path strings use parameter tags to "capture" values from the URLs. When a user requests a page, Django runs through each path, in order, and stops at the first one that matches the requested URL. (If none of them matches, Django calls a special-case 404 view.) This is blazingly fast, because the paths are compiled into regular expressions at load time.
ru: Код выше описывает URL-ы для вызова соответствующих функций Python (соответствующего представления, "views"). Теги с параметрами используются для "захвата" значения из URL-адреса. Когда пользователь запрашивает страницу, Django проходит по всем шаблонам по порядку и останавливается на первом подходящем (если ни один из шаблонов не подошёл, Django вызовет исключение 404.) Это происходит мгновенно, поскольку регулярные выражения компилируются ещё во время загрузки.

source: Once one of the URL patterns matches, Django calls the given view, which is a Python function. Each view gets passed a request object -- which contains request metadata -- and the values captured in the pattern.
ru: После того, как соответствующий шаблон найден, Django импортирует и вызывает представление, которое является по сути простой функцией на Python. Каждое представление передаёт объект запроса -- он содержит возвращаемые метаданные -- и значения, захваченные шаблонами.

source: For example, if a user requested the URL "/articles/2005/05/39323/", Django would call the function ``news.views.article_detail(request, year=2005, month=5, pk=39323)``.
ru: К примеру, если пользователь запросил URL "/articles/2005/05/39323/", Django должен вернуть функцию ``news.views.article_detail(request, year=2005, month=5, pk=39323)``.

source: Write your views
ru: Написание представлений

source: Each view is responsible for doing one of two things: Returning an :class:`~django.http.HttpResponse` object containing the content for the requested page, or raising an exception such as :class:`~django.http.Http404`. The rest is up to you.
ru: Каждое представление отвечает за выполнение одной из двух вещей: возвращение объекта :class:`~django.http.HttpResponse`, представляющего содержимое запрашиваемой страницы, или вызов исключения такого как :class:`~django.http.Http404`. Остальное зависит от вас.

source: Generally, a view retrieves data according to the parameters, loads a template and renders the template with the retrieved data. Here's an example view for ``year_archive`` from above:
ru: Как правило, представление извлекает данные в соответствии с заданными параметрами, загружает шаблон и отображает этот шаблон вместе с полученными данными. Это пример представления ``year_archive``, представленного выше:

source: This example uses Django's :doc:`template system </topics/templates>`, which has several powerful features but strives to stay simple enough for non-programmers to use.
ru: В примере используется :doc:`язык шаблонов </topics/templates>` Django, который имеет несколько сильных особенностей, но вместе с тем остаётся простым в использовании даже для не-программистов.

source: Design your templates
ru: Проектирование шаблонов

source: The code above loads the ``news/year_archive.html`` template.
ru: Код, представленный выше, возвращает шаблон ``news/year_archive.html``.

source: Django has a template search path, which allows you to minimize redundancy among templates. In your Django settings, you specify a list of directories to check for templates with :setting:`DIRS <TEMPLATES-DIRS>`. If a template doesn't exist in the first directory, it checks the second, and so on.
ru: Django включает пути поиска по шаблонам, что позволяет свести к минимуму избыточность html-кода. В настройках Django нужно указать список каталогов, откуда Django сможет загружать шаблоны. Это делается с помощью настройки :setting:`DIRS <TEMPLATES-DIRS>`. Если шаблон не будет найден в первом каталоге, Django проверит второй и все последующие.

source: Let's say the ``news/year_archive.html`` template was found. Here's what that might look like:
ru: Скажем, шаблон ``news/year_archive.html`` был найден. Вот как он может выглядеть:

source: Variables are surrounded by double-curly braces. ``{{ article.headline }}`` means "Output the value of the article's headline attribute." But dots aren't used only for attribute lookup. They also can do dictionary-key lookup, index lookup and function calls.
ru: Переменные всегда окружены двумя фигурными скобками. ``{{ article.headline }}`` означает "вывести переменную, хранящую заголовок статьи." Хотя точка используется не только для доступа к атрибутам: с её помощью можно провести поиск в словаре, поиск индекса и вызов функции.

source: Note ``{{ article.pub_date|date:"F j, Y" }}`` uses a Unix-style "pipe" (the "|" character). This is called a template filter, and it's a way to filter the value of a variable. In this case, the date filter formats a Python datetime object in the given format (as found in PHP's date function).
ru: Примечательно, что ``{{ article.pub_date|date:"F j, Y" }}`` использует Unix-стиль "pipe" (символ вертикальной черты "|"). Это называется шаблонным фильтром и это хороший способ для фильтрации значений переменной. В примере фильтр даты приводит объект datetime к нужному виду (как нахождение функции даты в PHP).

source: You can chain together as many filters as you'd like. You can write :ref:`custom template filters <howto-writing-custom-template-filters>`. You can write :doc:`custom template tags </howto/custom-template-tags>`, which run custom Python code behind the scenes.
ru: Вы можете последовательно применить столько фильтров, сколько вам будет нужно. Вы можете писать :ref:`собственные шаблонные фильтры <howto-writing-custom-template-filters>`. Вы можете писать :doc:`собственные шаблонные теги </howto/custom-template-tags>`, которые будут неявно выполнять ваш код.

source: Finally, Django uses the concept of "template inheritance". That's what the ``{% extends "base.html" %}`` does. It means "First load the template called 'base', which has defined a bunch of blocks, and fill the blocks with the following blocks." In short, that lets you dramatically cut down on redundancy in templates: each template has to define only what's unique to that template.
ru: Наконец, Django использует концепцию "наследования шаблонов": это достигается путём включения базового шаблона ``{% extends "base.html" %}``. И это значит, что первым будет загружен шаблон 'base', в котором определено множество различных блоков, которые в свою очередь также могут содержать в себе какие-то блоки. Короче говоря, это позволяет намного сократить количество html-шаблонов страниц: каждый новый шаблон должен включать уникальные элементы, присущие только ему.

source: Here's what the "base.html" template, including the use of :doc:`static files </howto/static-files/index>`, might look like:
ru: Базовый шаблон "base.html", включающий использование :doc:`статических файлов </howto/static-files/index>`, может выглядеть следующим образом:

source: Simplistically, it defines the look-and-feel of the site (with the site's logo), and provides "holes" for child templates to fill. This makes a site redesign as easy as changing a single file -- the base template.
ru: Проще говоря, он определяет внешний вид сайта (подгружает логотип), а также оставляет место для заполнения блоков в дочерних шаблонах. Это позволяет свести редизайн всего сайта к изменению единственного файла -- базового шаблона.

source: It also lets you create multiple versions of a site, with different base templates, while reusing child templates. Django's creators have used this technique to create strikingly different mobile versions of sites -- simply by creating a new base template.
ru: Также этот подход позволит вам создавать несколько версий сайта, использующих различные базовые шаблоны, в то время как дочерние шаблоны останутся неизменными. Создатели Django использовали этот подход для написания отдельного шаблона для мобильных устройств -- просто создав новый базовый шаблон.

source: Note that you don't have to use Django's template system if you prefer another system. While Django's template system is particularly well-integrated with Django's model layer, nothing forces you to use it. For that matter, you don't have to use Django's database API, either. You can use another database abstraction layer, you can read XML files, you can read files off disk, or anything you want. Each piece of Django -- models, views, templates -- is decoupled from the next.
ru: Обратите внимание на то, что вы можете не использовать язык шаблонов Django, если отдаёте предпочтение какому-то иному. Хотя язык шаблонов Django как нельзя лучше подходит при создании моделей Django, никто не заставляет вас использовать его. Если уж на то пошло, знайте, что вы даже вправе не пользоваться API баз данных Django. Вы можете использовать другой уровень абстракции базы данных, вы можете читать XML-файлы, вы можете читать файлы с диска, да и вообще делать всё, что угодно. Каждая часть Django -- модели, представления, шаблоны -- отделены друг от друга.

source: This is just the surface
ru: Это просто вершина айсберга

source: This has been only a quick overview of Django's functionality. Some more useful features:
ru: Это был только краткий обзор возможностей Django. Вот ещё несколько полезных особенностей, о которых следовало бы знать:

source: A :doc:`caching framework </topics/cache>` that integrates with memcached or other backends.
ru: :doc:`Система кэширования </topics/cache>`, интегрированная с memcached или другими бэкэндами кэширования.

source: A :doc:`syndication framework </ref/contrib/syndication>` that makes creating RSS and Atom feeds as easy as writing a small Python class.
ru: :doc:`Фреймворк syndication </ref/contrib/syndication>`, позволяющий сделать создание RSS и Atom фидов таким же простым делом, как написание небольшого класса на Python.

source: More sexy automatically-generated admin features -- this overview barely scratched the surface.
ru: Более изящный, генерируемый автоматически, административный интерфейс -- этот обзор лишь едва коснулся его описания.

source: The next obvious steps are for you to `download Django`_, read :doc:`the tutorial </intro/tutorial01>` and join `the community`_. Thanks for your interest!
ru: Следующими вашими шагами будут `установка Django <https://www.djangoproject.com/download/>`_, чтение :doc:`руководства </intro/tutorial01>` и присоединение `к англоязычному <https://www.djangoproject.com/community/>`_ или `к русскоязычному <http://djbook.ru/forum/>`_ сообществам. Благодарим вас за проявленный интерес!
