Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/intro/tutorial03.po
Languages: ru

source: Writing your first Django app, part 3
ru: Создаём своё первое приложение с Django, часть 3

source: This tutorial begins where :doc:`Tutorial 2 </intro/tutorial02>` left off. We're continuing the Web-poll application and will focus on creating the public interface -- "views."
ru: Продолжаем начатое во :doc:`второй части </intro/tutorial02>` учебника. Мы продолжим разрабатывать приложение для голосования и сосредоточимся на создании страниц сайта -- "представлений".

source: Overview
ru: Обзор

source: A view is a "type" of Web page in your Django application that generally serves a specific function and has a specific template. For example, in a blog application, you might have the following views:
ru: Представление -- это "тип" страниц вашего приложения, которое является функцией для обработки запроса и использует шаблон для генерации страницы. Например, блог может состоять из следующих представлений:

source: Blog homepage -- displays the latest few entries.
ru: Главная страница -- показывает несколько последних записей блога.

source: Entry "detail" page -- permalink page for a single entry.
ru: Страница записи -- страница отображения одной записи блога.

source: Year-based archive page -- displays all months with entries in the given year.
ru: Страница-архив записей по годам -- показывает все месяца года и записи блога, сгруппированные по этим месяцам.

source: Month-based archive page -- displays all days with entries in the given month.
ru: Страница-архив записей по месяцам -- показывает все дни месяца и записи блога, сгруппированные по этим дням.

source: Day-based archive page -- displays all entries in the given day.
ru: Страница-архив записей по дням -- показывает все записи за указанный день.

source: Comment action -- handles posting comments to a given entry.
ru: Форма комментариев -- предоставляет возможность добавить комментарий к записи блога.

source: In our poll application, we'll have the following four views:
ru: В нашем приложении для голосования мы реализуем следующие представления:

source: Question "index" page -- displays the latest few questions.
ru: Главная страница вопросов -- показывает несколько последних вопросов.

source: Question "detail" page -- displays a question text, with no results but with a form to vote.
ru: Страница вопроса -- показывает вопрос без результатов но с формой для ответа.

source: Question "results" page -- displays results for a particular question.
ru: Страница результата опроса -- показывает результаты опроса.

source: Vote action -- handles voting for a particular choice in a particular question.
ru: Обрабатывает процесс опроса -- обрабатывает ответ на вопрос.

source: Now in your time on the web you may have come across such beauties as "ME2/Sites/dirmod.asp?sid=&type=gen&mod=Core+Pages&gid=A6CD4967199A42D9B65B1B". You will be pleased to know that Django allows us much more elegant *URL patterns* than that.
ru: В наше время в интернете можно наткнуться на такие прелести как "ME2/Sites/dirmod.asp?sid=&type=gen&mod=Core+Pages&gid=A6CD4967199A42D9B65B1B". Рады вам сообщить, что Django позволяет использовать более элегантные *URL шаблоны* чем этот.

source: To get from a URL to a view, Django uses what are known as 'URLconfs'. A URLconf maps URL patterns to views.
ru: Чтобы из URL-а получить представление, Django используется так называемый 'URLconf'. URLconf определяет соответствие URL-шаблонов и представлений.

source: This tutorial provides basic instruction in the use of URLconfs, and you can refer to :doc:`/topics/http/urls` for more information.
ru: В этом разделе мы опишем основы использования настроек URL-ов, больше информации вы можете найти в разделе :doc:`/topics/http/urls`.

source: Writing more views
ru: Добавь парочку представлений

source: Now let's add a few more views to ``polls/views.py``. These views are slightly different, because they take an argument:
ru: Теперь создадим еще парочку представлений в ``polls/views.py``. Эти представления немного отличаются, так как принимают аргументы:

source: Wire these new views into the ``polls.urls`` module by adding the following :func:`~django.urls.path` calls:
ru: Привяжем наше представление новостей в модуле ``polls.urls`` добавив вызов :func:`~django.urls.path`:

source: Take a look in your browser, at "/polls/34/". It'll run the ``detail()`` method and display whatever ID you provide in the URL. Try "/polls/34/results/" and "/polls/34/vote/" too -- these will display the placeholder results and voting pages.
ru: Откройте страницу "/polls/34/". Будет выполнена функция `detail()` и показан ID, который вы указали в URL. Откройте "/polls/34/results/" и "/polls/34/vote/" -- вы увидите наши будущие страницы результатов и голосования.

source: When somebody requests a page from your website -- say, "/polls/34/", Django will load the ``mysite.urls`` Python module because it's pointed to by the :setting:`ROOT_URLCONF` setting. It finds the variable named ``urlpatterns`` and traverses the patterns in order. After finding the match at ``'polls/'``, it strips off the matching text (``"polls/"``) and sends the remaining text -- ``"34/"`` -- to the 'polls.urls' URLconf for further processing. There it matches ``'<int:question_id>/'``, resulting in a call to the ``detail()`` view like so::
ru: При запросе страницы -- например, "/polls/34/", Django загружает модуль ``mysite.urls`` т.к. он указан в :setting:`ROOT_URLCONF`. Находит переменную ``urlpatterns`` и перебирает все параметры переменных по порядку. Когда находит ``'polls/'``, отрезает найденный текст (``"polls/"``) и отправляет оставшийся -- ``"34/"`` -- в URLconf из 'polls.urls' для последующей обработки. Там находит соответствие с ``'<int:question_id>/'``, в результате чего вызывается представление ``detail()``::

source: The ``question_id=34`` part comes from ``<int:question_id>``. Using angle brackets "captures" part of the URL and sends it as a keyword argument to the view function. The ``:question_id>`` part of the string defines the name that will be used to identify the matched pattern, and the ``<int:`` part is a converter that determines what patterns should match this part of the URL path.
ru: Аргумент ``question_id='34'`` получен из ``<int:question_id>`. Использование скобок позволяет распознать часть URL и передать в представление. ``:question_id>`` определяет название переменной при передаче, ``<int:`` определяет какой шаблон должен использоваться при распознавании части URL.

source: There's no need to add URL cruft such as ``.html`` -- unless you want to, in which case you can do something like this::
ru: Нет необходимости добавлять в URL всякий хлам, вроде ``.html``, пока это вам не понадобится. В таком случае добавьте что-то вроде::

source: But, don't do that. It's silly.
ru: Но не делайте так. Это глупо.

source: Write views that actually do something
ru: Добавим функционал в наши представления

source: Each view is responsible for doing one of two things: returning an :class:`~django.http.HttpResponse` object containing the content for the requested page, or raising an exception such as :exc:`~django.http.Http404`. The rest is up to you.
ru: Каждое представление должно выполнить одно из двух действий: вернуть экземпляр :class:`~django.http.HttpResponse` с содержимым страницы, или вызвать исключения такое как :exc:`~django.http.Http404`. Все остальное на ваше усмотрение.

source: Your view can read records from a database, or not. It can use a template system such as Django's -- or a third-party Python template system -- or not. It can generate a PDF file, output XML, create a ZIP file on the fly, anything you want, using whatever Python libraries you want.
ru: Ваше представление может обращаться к базе данных или нет. Может использовать систему шаблонов Django -- или любую другую -- или не использовать. Может генерировать PDF файл, возвращать XML, создавать ZIP архив "на лету", все что угодно, используя любые библиотеки Python.

source: All Django wants is that :class:`~django.http.HttpResponse`. Or an exception.
ru: Все что нужно Django -- это :class:`~django.http.HttpResponse`. Или исключение.

source: Because it's convenient, let's use Django's own database API, which we covered in :doc:`Tutorial 2 </intro/tutorial02>`. Here's one stab at a new ``index()`` view, which displays the latest 5 poll questions in the system, separated by commas, according to publication date:
ru: Мы будем использовать API Django для работы с базой данных, которое мы рассматривали в :doc:`Части 1 </intro/tutorial02>`. Изменим ``index()`` так, чтобы оно отображало последние 5 вопросов разделенные запятой от самого нового к самому старому:

source: There's a problem here, though: the page's design is hard-coded in the view. If you want to change the way the page looks, you'll have to edit this Python code. So let's use Django's template system to separate the design from Python by creating a template that the view can use.
ru: Есть небольшая проблема: внешний вид страницы определяется в представлении. Если вы захотите изменить дизайн страницы, вам придется менять код. Давайте воспользуемся системой шаблонов Django, чтобы отделить представление от кода.

source: First, create a directory called ``templates`` in your ``polls`` directory. Django will look for templates in there.
ru: Для начала создайте каталог ``templates`` в каталоге приложения ``polls``. Django будет искать шаблоны в этом каталоге.

source: Your project's :setting:`TEMPLATES` setting describes how Django will load and render templates. The default settings file configures a ``DjangoTemplates`` backend whose :setting:`APP_DIRS <TEMPLATES-APP_DIRS>` option is set to ``True``. By convention ``DjangoTemplates`` looks for a "templates" subdirectory in each of the :setting:`INSTALLED_APPS`.
ru: Настройка :setting:`TEMPLATES` указывает Django как загружать и выполнять шаблоны. По умолчанию используется бэкенд ``DjangoTemplates``, с опцией :setting:`APP_DIRS <TEMPLATES-APP_DIRS>` равной ``True``. В этом случае ``DjangoTemplates`` проверяет подкаталог "templates" в приложениях, указанных в :setting:`INSTALLED_APPS`.

source: Template namespacing
ru: Пространства имен для шаблонов

source: Put the following code in that template:
ru: Добавьте следующий код в шаблон:

source: Now let's update our ``index`` view in ``polls/views.py`` to use the template:
ru: Теперь изменим наше представление ``index`` в ``polls/views.py``, чтобы использовать шаблон:

source: That code loads the template called ``polls/index.html`` and passes it a context. The context is a dictionary mapping template variable names to Python objects.
ru: Этот код загружает шаблон ``polls/index.html`` и передает ему контекст. Контекст - это словарь, содержащий название переменных шаблона и соответствующие им значения.

source: Load the page by pointing your browser at "/polls/", and you should see a bulleted-list containing the "What's up" question from :doc:`Tutorial 2 </intro/tutorial02>`. The link points to the question's detail page.
ru: Загрузите страницу в браузере по адресу "/polls/", вы должны увидеть список с опросом "What's up" из :doc:`Части 2 </intro/tutorial02>`. Ссылка ведет на страницу опроса.

source: A shortcut: :func:`~django.shortcuts.render`
ru: Функция :func:`~django.shortcuts.render`

source: It's a very common idiom to load a template, fill a context and return an :class:`~django.http.HttpResponse` object with the result of the rendered template. Django provides a shortcut. Here's the full ``index()`` view, rewritten:
ru: Процесс загрузки шаблона, добавления контекста и возврат объекта :class:`~django.http.HttpResponse`, вполне тривиальный. Django предоставляет функцию для всех этих операций. Вот как будет выглядеть наш ``index()``:

source: Note that once we've done this in all these views, we no longer need to import :mod:`~django.template.loader` and :class:`~django.http.HttpResponse` (you'll want to keep ``HttpResponse`` if you still have the stub methods for ``detail``, ``results``, and ``vote``).
ru: Так как мы используем такой подход во всех наших представлениях, нет необходимости импортировать :mod:`~django.template.loader` и :class:`~django.http.HttpResponse` (:class:`~django.http.HttpResponse` еще нужен, если остались старые ``detail``, ``results`` и ``vote``).

source: The :func:`~django.shortcuts.render` function takes the request object as its first argument, a template name as its second argument and a dictionary as its optional third argument. It returns an :class:`~django.http.HttpResponse` object of the given template rendered with the given context.
ru: Функция :func:`~django.shortcuts.render` первым аргументом принимает объект запроса, также название шаблона и необязательный словарь значений контекста. Возвращает объект :class:`~django.http.HttpResponse` содержащий выполненный шаблон с указанным контекстом.

source: Raising a 404 error
ru: Вызов 404 исключения

source: Now, let's tackle the question detail view -- the page that displays the question text for a given poll. Here's the view:
ru: Теперь создадим страницу опроса, которая отображает вопрос и варианты ответа. Вот так будет выглядеть наше представление:

source: The new concept here: The view raises the :exc:`~django.http.Http404` exception if a question with the requested ID doesn't exist.
ru: Представление вызывает исключение :exc:`~django.http.Http404`, если вопрос с указанным ID не существует.

source: We'll discuss what you could put in that ``polls/detail.html`` template a bit later, but if you'd like to quickly get the above example working, a file containing just:
ru: Содержимое шаблона ``polls/detail.html`` обсудим позже, но если хотите прям вот сразу, чтобы все заработало, вот его содержимое:

source: will get you started for now.
ru: чтобы можно было загрузить страницу.

source: A shortcut: :func:`~django.shortcuts.get_object_or_404`
ru: Функция :func:`~django.shortcuts.get_object_or_404`

source: It's a very common idiom to use :meth:`~django.db.models.query.QuerySet.get` and raise :exc:`~django.http.Http404` if the object doesn't exist. Django provides a shortcut. Here's the ``detail()`` view, rewritten:
ru: Вызов :meth:`~django.db.models.query.QuerySet.get` и :exc:`~django.http.Http404` при отсутствии объекта -- обыденные операции. Django предоставляет функцию, которая выполняет эти действия. Вот как будет выглядеть наше представление ``detail()``:

source: The :func:`~django.shortcuts.get_object_or_404` function takes a Django model as its first argument and an arbitrary number of keyword arguments, which it passes to the :meth:`~django.db.models.query.QuerySet.get` function of the model's manager. It raises :exc:`~django.http.Http404` if the object doesn't exist.
ru: Функция :func:`~django.shortcuts.get_object_or_404` первым аргументом принимает Django модель и произвольное количество именованных аргументов, которые передаются в метод :meth:`~django.db.models.query.QuerySet.get` менеджера модели. Если объект не найден, вызывается исключение :exc:`~django.http.Http404`.

source: Philosophy
ru: Философия

source: Why do we use a helper function :func:`~django.shortcuts.get_object_or_404` instead of automatically catching the :exc:`~django.core.exceptions.ObjectDoesNotExist` exceptions at a higher level, or having the model API raise :exc:`~django.http.Http404` instead of :exc:`~django.core.exceptions.ObjectDoesNotExist`?
ru: Зачем мы используем функцию :func:`~django.shortcuts.get_object_or_404` вместо того, чтобы автоматически перехватывать исключения :exc:`~django.core.exceptions.ObjectDoesNotExist` уровнем выше, или вызывать на уровне API моделей исключение :exc:`~django.http.Http404` вместо :exc:`~django.core.exceptions.ObjectDoesNotExist`?

source: Because that would couple the model layer to the view layer. One of the foremost design goals of Django is to maintain loose coupling. Some controlled coupling is introduced in the :mod:`django.shortcuts` module.
ru: Потому что это связывает уровень моделей с уровнем представления. Один из главных принципов проектирования Django -- слабая связанность. Некоторая связанная функциональность находится в модуле :mod:`django.shortcuts`.

source: There's also a :func:`~django.shortcuts.get_list_or_404` function, which works just as :func:`~django.shortcuts.get_object_or_404` -- except using :meth:`~django.db.models.query.QuerySet.filter` instead of :meth:`~django.db.models.query.QuerySet.get`. It raises :exc:`~django.http.Http404` if the list is empty.
ru: Существует также функция :func:`~django.shortcuts.get_list_or_404`, которая работает аналогично :func:`~django.shortcuts.get_object_or_404`, но использует :meth:`~django.db.models.query.QuerySet.filter` вместо :meth:`~django.db.models.query.QuerySet.get`. Вызывает :exc:`~django.http.Http404`, если получен пустой список.

source: Use the template system
ru: Использование системы шаблонов

source: Back to the ``detail()`` view for our poll application. Given the context variable ``question``, here's what the ``polls/detail.html`` template might look like:
ru: Вернемся к представлению ``detail()``. Вот как может выглядеть наш шаблон ``polls/detail.html``, использующий контекстную переменную ``question``:

source: The template system uses dot-lookup syntax to access variable attributes. In the example of ``{{ question.question_text }}``, first Django does a dictionary lookup on the object ``question``. Failing that, it tries an attribute lookup -- which works, in this case. If attribute lookup had failed, it would've tried a list-index lookup.
ru: Система шаблонов использует точку для доступа к атрибутам переменной. Например, для ``{{ question.question_text }}`` Django сначала пытается обратиться к ``question`` как к словарю. При неудаче ищется атрибут переменной, в данном случае он и используется. Если атрибут не найден, будет искаться индекс в списке.

source: Method-calling happens in the :ttag:`{% for %}<for>` loop: ``question.choice_set.all`` is interpreted as the Python code ``question.choice_set.all()``, which returns an iterable of ``Choice`` objects and is suitable for use in the :ttag:`{% for %}<for>` tag.
ru: В теге :ttag:`{% for %}<for>` выполняется вызов метода: ``question.choice_set.all``, интерпретируется как код Python ``question.choice_set.all()``, который возвращает итератор по ``Choice`` для использования в теге :ttag:`{% for %}<for>`.

source: See the :doc:`template guide </topics/templates>` for more about templates.
ru: Подробности о шаблонах смотрите в разделе о :doc:`Языке шаблонов Django </topics/templates>`.

source: Removing hardcoded URLs in templates
ru: Избавляемся от "хардкода" URL-ов в шаблонах

source: Remember, when we wrote the link to a question in the ``polls/index.html`` template, the link was partially hardcoded like this:
ru: Помните, когда мы указывали ссылку в шаблоне ``polls/index.html``, она была прописана прямо в коде:

source: The problem with this hardcoded, tightly-coupled approach is that it becomes challenging to change URLs on projects with a lot of templates. However, since you defined the name argument in the :func:`~django.urls.path` functions in the ``polls.urls`` module, you can remove a reliance on specific URL paths defined in your url configurations by using the ``{% url %}`` template tag:
ru: Проблема в том, что нам будет очень сложно поменять URL-ы в проекте с большим количеством шаблонов. Однако, так как мы указали названия при вызове :func:`~django.urls.path` в модуле ``polls.urls``, мы можем ссылаться на шаблоны URL-ов используя шаблонный тег ``{% url %}``:

source: The way this works is by looking up the URL definition as specified in the ``polls.urls`` module. You can see exactly where the URL name of 'detail' is defined below::
ru: Определение URL-а будет найдено в модуле ``polls.urls``. Вот где определен наш URL с названием 'detail'::

source: If you want to change the URL of the polls detail view to something else, perhaps to something like ``polls/specifics/12/`` instead of doing it in the template (or templates) you would change it in ``polls/urls.py``::
ru: Теперь, если вы захотите поменять URL, например на ``polls/specifics/12/``, вам не придется менять все шаблоны, вы можете сделать это в ``polls/urls.py``::

source: Namespacing URL names
ru: Пространства имен в названиях URL-ов

source: The tutorial project has just one app, ``polls``. In real Django projects, there might be five, ten, twenty apps or more. How does Django differentiate the URL names between them? For example, the ``polls`` app has a ``detail`` view, and so might an app on the same project that is for a blog. How does one make it so that Django knows which app view to create for a url when using the ``{% url %}`` template tag?
ru: Наш проект содержит только одно приложение ``polls``. В реальных проектах может быть 5, 10, 20 и больше приложений. Как же Django понимает где чей URL по его названию? Например, приложение ``polls`` содержит представление ``detail``, аналогичное представление может быть и в приложении для блогов. Как же Django понимает для какого представления создается URL при использовании тега ``{% url %}``?

source: The answer is to add namespaces to your URLconf. In the ``polls/urls.py`` file, go ahead and add an ``app_name`` to set the application namespace:
ru: Для этого используются пространства имен в URLconf. Изменим ``polls/urls.py`` и добавим пространство имен в ``app_name``:

source: Now change your ``polls/index.html`` template from:
ru: Теперь поменяем в шаблоне ``polls/index.html``:

source: to point at the namespaced detail view:
ru: чтобы использовать пространство имен URL-ов:
