Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/intro/tutorial06.po
Languages: ru

source: Writing your first Django app, part 6
ru: Создаём своё первое приложение с Django, часть 6

source: This tutorial begins where :doc:`Tutorial 5 </intro/tutorial05>` left off. We've built a tested Web-poll application, and we'll now add a stylesheet and an image.
ru: Продолжаем начатое в :doc:`пятой части </intro/tutorial05>`. Мы создали протестированное веб приложение для опросов и теперь нам надо добавить стили и картинку.

source: Aside from the HTML generated by the server, web applications generally need to serve additional files — such as images, JavaScript, or CSS — necessary to render the complete web page. In Django, we refer to these files as "static files".
ru: В отличие от HTML, генерируемого сервером, веб приложения обычно нуждаются в обработке дополнительных файлов, таких как изображения, JavaScript или CSS, которые нужны для отображения полной веб страницы. В Django мы называем такие файлы "статикой".

source: For small projects, this isn't a big deal, because you can just keep the static files somewhere your web server can find it. However, in bigger projects -- especially those comprised of multiple apps -- dealing with the multiple sets of static files provided by each application starts to get tricky.
ru: Для маленьких проектов это не является проблемой, так как вы можете просто разместить статичные файлы где-то на своём веб сервере. Однако, для больших проектов, особенно состоящих из множества приложений, взаимодействие с несколькими наборами статичных файлов, предоставляемых каждым приложением, начинает походить на работу фокусника.

source: That's what ``django.contrib.staticfiles`` is for: it collects static files from each of your applications (and any other places you specify) into a single location that can easily be served in production.
ru: Именно для решения этой задачи существует ``django.contrib.staticfiles``. Он собирает статичные файлы из каждого вашего приложения (и из других мест, которые вы укажете) в единое место, которое может легко применяться на боевом сервере.

source: Customize your *app's* look and feel
ru: Настройка вида вашего *приложения*

source: First, create a directory called ``static`` in your ``polls`` directory. Django will look for static files there, similarly to how Django finds templates inside ``polls/templates/``.
ru: Сначала создайте каталог ``static`` в каталоге ``polls``. Django будет искать статичные файлы в нём, аналогично тому как Django ищет шаблоны внутри ``polls/templates/``.

source: Django's :setting:`STATICFILES_FINDERS` setting contains a list of finders that know how to discover static files from various sources. One of the defaults is ``AppDirectoriesFinder`` which looks for a "static" subdirectory in each of the :setting:`INSTALLED_APPS`, like the one in ``polls`` we just created. The admin site uses the same directory structure for its static files.
ru: Параметр конфигурации :setting:`STATICFILES_FINDERS` содержит список модулей, которые знают как получать статичные файлы из различных источников. Одним из стандартных является ``AppDirectoriesFinder``, который ищет каталоги "static" в каждом зарегистрированном приложении, например, созданный нами каталог в ``polls``. Интерфейс администратора использует аналогичную структуру каталогов для своих статичных файлов.

source: Within the ``static`` directory you have just created, create another directory called ``polls`` and within that create a file called ``style.css``. In other words, your stylesheet should be at ``polls/static/polls/style.css``. Because of how the ``AppDirectoriesFinder`` staticfile finder works, you can refer to this static file in Django simply as ``polls/style.css``, similar to how you reference the path for templates.
ru: Внутри созданного каталога ``static`` создайте ещё один каталог с именем ``polls`` и внутри него создайте файл ``style.css``. Другими словами, ваши стили должны быть в файле ``polls/static/polls/style.css``. Из-за особенностей работы ``AppDirectoriesFinder`` вы можете обращаться из шаблона к этому статичному файлу как ``polls/style.css``, аналогично работе с шаблонами.

source: Static file namespacing
ru: Пространство имен для статических файлов

source: Just like templates, we *might* be able to get away with putting our static files directly in ``polls/static`` (rather than creating another ``polls`` subdirectory), but it would actually be a bad idea. Django will choose the first static file it finds whose name matches, and if you had a static file with the same name in a *different* application, Django would be unable to distinguish between them. We need to be able to point Django at the right one, and the easiest way to ensure this is by *namespacing* them. That is, by putting those static files inside *another* directory named for the application itself.
ru: Аналогично шаблонам, мы *можем* просто размещать наши статичные файлы прямо в каталоге ``polls/static`` (не создавая ещё один каталог ``polls`` внутри), но это будет плохой идеей. Django выбирает первый найденный статичный файл с указанным именем и если *другое* приложение имеет статичный файл с таким же именем, Django не сможет понять какой именно был вам нужен. Нам надо явно указать Django нужный, а вложенный каталог даёт нам *именованное пространство* для этого. Следовательно, просто размещайте статичные файлы приложения внутри *другого* каталога с именем, как у приложения.

source: Put the following code in that stylesheet (``polls/static/polls/style.css``):
ru: Разместите следующий код в файле стилей (``polls/static/polls/style.css``):

source: Next, add the following at the top of ``polls/templates/polls/index.html``:
ru: Затем добавьте следующие строки в начало ``polls/templates/polls/index.html``:

source: The ``{% static %}`` template tag generates the absolute URL of static files.
ru: Шаблонный тег ``{% static %}`` генерирует абсолютный URL к статическим файлам.

source: That's all you need to do for development. Reload ``http://localhost:8000/polls/`` and you should see that the question links are green (Django style!) which means that your stylesheet was properly loaded.
ru: Это всё, что вам требуется сделать. Перегрузите страницу ``http://localhost:8000/polls/`` и вы должны увидеть, что ссылки опроса стали зелёными (стиль Django!). Это означает, что ваш файл стилей загрузился нормально.

source: Adding a background-image
ru: Добавление фонового изображения

source: Next, we'll create a subdirectory for images. Create an ``images`` subdirectory in the ``polls/static/polls/`` directory. Inside this directory, put an image called ``background.gif``. In other words, put your image in ``polls/static/polls/images/background.gif``.
ru: Теперь надо создать каталог для изображений. Создайте каталог ``images`` в каталоге ``polls/static/polls/``. Внутри созданного каталога разместите изображение с именем ``background.gif``. Другими словами, поместите ваше изображение в ``polls/static/polls/images/background.gif``.

source: Then, add to your stylesheet (``polls/static/polls/style.css``):
ru: Затем добавьте следующие строки в файл стилей (``polls/static/polls/style.css``):

source: Reload ``http://localhost:8000/polls/`` and you should see the background loaded in the top left of the screen.
ru: Перегрузите страницу ``http://localhost:8000/polls/`` и вы должны увидеть, что фоновое изображение появилось в верхнем левом углу экрана.

source: Of course the ``{% static %}`` template tag is not available for use in static files like your stylesheet which aren't generated by Django. You should always use **relative paths** to link your static files between each other, because then you can change :setting:`STATIC_URL` (used by the :ttag:`static` template tag to generate its URLs) without having to modify a bunch of paths in your static files as well.
ru: Естественно, что шаблонный тег ``{% static %}`` не доступен для использования в статичных файлах, таких как ваш файл стилей, так как эти файлы не создаются с помощью Django. Вы должны всегда использовать **относительные пути** для связывания ваших статичных файлов друг с другом, так как вы можете изменить параметр конфигурации :setting:`STATIC_URL` (используемый шаблонным тегом :ttag:`static` для генерации своих URL) без необходимости менять кучу путей в ваших статичных файлах.

source: These are the **basics**. For more details on settings and other bits included with the framework see :doc:`the static files howto </howto/static-files/index>` and :doc:`the staticfiles reference </ref/contrib/staticfiles>`. :doc:`Deploying static files </howto/static-files/deployment>` discusses how to use static files on a real server.
ru: Это были **основы**. Для получения подробностей о настройках и другой информации обращайтесь к :doc:`ЧаВо по статичным файлам </howto/static-files/index>` и :doc:`справочнику по статике </ref/contrib/staticfiles>`. :doc:`Выкладывание статичных файлов </howto/static-files/deployment>` рассматривает вопросы использования статичных файлов на боевом сервере.

source: When you're comfortable with the static files, read :doc:`part 7 of this tutorial </intro/tutorial07>` to learn how to customize Django's automatically-generated admin site.
ru: Ознакомившись с работой со статическими файлами, вы можете приступить к :doc:`разделу 7 </intro/tutorial07>`, чтобы узнать как настроить интерфейс администратора Django.
