Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/intro/tutorial02.po
Languages: ru

source: Now, let's hop into the interactive Python shell and play around with the free API Django gives you. To invoke the Python shell, use this command:
ru: Теперь, давайте воспользуемся консолью Python и поиграем с API, которое предоставляет Django. Чтобы запустить консоль Python выполните:

source: We're using this instead of simply typing "python", because :file:`manage.py` sets the ``DJANGO_SETTINGS_MODULE`` environment variable, which gives Django the Python import path to your :file:`mysite/settings.py` file.
ru: Мы используем эту команду вместо просто "python", потому что :file:`manage.py` устанавливает переменную окружения ``DJANGO_SETTINGS_MODULE``, которая указывает Django путь импорта для файла :file:`mysite/settings.py`.

source: Bypassing manage.py
ru: Запуск без manage.py

source: If you'd rather not use :file:`manage.py`, no problem. Just set the :envvar:`DJANGO_SETTINGS_MODULE` environment variable to ``mysite.settings``, start a plain Python shell, and set up Django:
ru: Если вы не желаете использовать :file:`manage.py`, не проблема. Просто установите переменную окружения :envvar:`DJANGO_SETTINGS_MODULE` в ``mysite.settings``, запустите интерпретатор Python и инициализируйте Django:

source: If this raises an :exc:`AttributeError`, you're probably using a version of Django that doesn't match this tutorial version. You'll want to either switch to the older tutorial or the newer Django version.
ru: Если вы получили исключение :exc:`AttributeError`, возможно вы используете версию Django, которая не соответствует этому учебнику. Вам следует читать старую версию учебника или обновить Django.

source: You must run ``python`` from the same directory :file:`manage.py` is in, or ensure that directory is on the Python path, so that ``import mysite`` works.
ru: Запустить ``python`` необходимо в каталоге, в котором находится файл :file:`manage.py` (или убедитесь, что каталог находится в путях Python, и ``import mysite`` работает).

source: For more information on all of this, see the :doc:`django-admin documentation </ref/django-admin>`.
ru: Полную информацию обо всем этом смотрите в :doc:`разделе о django-admin </ref/django-admin>`.

source: Once you're in the shell, explore the :doc:`database API </topics/db/queries>`::
ru: Теперь, когда вы в консоли, исследуем :doc:`API базы данных </topics/db/queries>`::

source: Wait a minute. ``<Question: Question object>`` is, utterly, an unhelpful representation of this object. Let's fix that by editing the ``Question`` model (in the ``polls/models.py`` file) and adding a :meth:`~django.db.models.Model.__str__` method to both ``Question`` and ``Choice``:
ru: Одну минуту. ``<Question: Question object>`` -- крайне непрактичное отображение объекта. Давайте исправим это, отредактировав модель ``Question`` (в файле ``polls/models.py``) и добавив метод :meth:`~django.db.models.Model.__str__` для моделей ``Question`` и ``Choice``:

source: It's important to add :meth:`~django.db.models.Model.__str__` methods to your models, not only for your own convenience when dealing with the interactive prompt, but also because objects' representations are used throughout Django's automatically-generated admin.
ru: Важно добавить метод :meth:`~django.db.models.Model.__str__` не только для красивого отображения в консоли, но так же и потому, что Django использует строковое представление объекта в интерфейсе администратора.

source: Note these are normal Python methods. Let's add a custom method, just for demonstration:
ru: Заметим, это стандартные методы Python. Давайте добавим свой метод, просто для демонстрации:

source: Note the addition of ``import datetime`` and ``from django.utils import timezone``, to reference Python's standard :mod:`datetime` module and Django's time-zone-related utilities in :mod:`django.utils.timezone`, respectively. If you aren't familiar with time zone handling in Python, you can learn more in the :doc:`time zone support docs </topics/i18n/timezones>`.
ru: Мы добавили ``import datetime`` и ``from django.utils import timezone`` для использования стандартной библиотеки Python :mod:`datetime` и модуля Django для работы с временными зонами :mod:`django.utils.timezone` соответственно. Если вы не знакомы, как Python работает с временными зонами, вы можете прочитать об этом в :doc:`разделе о поддержке временных зон </topics/i18n/timezones>`.

source: Save these changes and start a new Python interactive shell by running ``python manage.py shell`` again::
ru: Сохраните эти изменения и запустите консоль Python снова, выполнив ``python manage.py shell``::

source: For more information on model relations, see :doc:`Accessing related objects </ref/models/relations>`. For more on how to use double underscores to perform field lookups via the API, see :ref:`Field lookups <field-lookups-intro>`. For full details on the database API, see our :doc:`Database API reference </topics/db/queries>`.
ru: Подробности о работе со связанными объектами смотрите в :doc:`соответствующем разделе </ref/models/relations>`. Подробности об использовании синтаксиса двойного нижнего подчеркивания читайте в разделе о :ref:`фильтрах полей <field-lookups-intro>`. Полная информация об API для работы с базой данных содержится в :doc:`соответствующем разделе </topics/db/queries>`.

source: Introducing the Django Admin
ru: Введение в интерфейс администратор Django

source: Generating admin sites for your staff or clients to add, change, and delete content is tedious work that doesn't require much creativity. For that reason, Django entirely automates creation of admin interfaces for models.
ru: Создание интерфейса администратора для добавления, изменения и удаления содержимого сайта -- в основном скучная не креативная задача. Django значительно автоматизирует и упрощает эту задачу.

source: Django was written in a newsroom environment, with a very clear separation between "content publishers" and the "public" site. Site managers use the system to add news stories, events, sports scores, etc., and that content is displayed on the public site. Django solves the problem of creating a unified interface for site administrators to edit content.
ru: Django создавался для новостных сайтов, у которых есть разделение между публичными страницами и интерфейсом администратора. Менеджеры используют последний для добавления новостей и другого содержимого сайта, это содержимое отображается на сайте. Django позволяет легко создать универсальный интерфейс для редактирования содержимого сайта.

source: The admin isn't intended to be used by site visitors. It's for site managers.
ru: Интерфейс администратора не предназначен для использования пользователями. Он создан для менеджеров и администраторов сайта.

source: Creating an admin user
ru: Создание суперпользователя

source: First we'll need to create a user who can login to the admin site. Run the following command:
ru: Первым делом необходимо создать пользователя, который может заходить на интерфейс администратора. Выполните следующую команду:

source: Enter your desired username and press enter.
ru: Введите имя пользователя и нажмите Enter.

source: You will then be prompted for your desired email address:
ru: Теперь введите email:

source: The final step is to enter your password. You will be asked to enter your password twice, the second time as a confirmation of the first.
ru: И наконец введите пароль.

source: Start the development server
ru: Запускаем сервер для разработки

source: The Django admin site is activated by default. Let's start the development server and explore it.
ru: Интерфейс администратора включен по умолчанию. Давайте запустим встроенный сервер для разработки и посмотрим на него.

source: If the server is not running start it like so:
ru: Если сервер не запущен, выполните:

source: Now, open a Web browser and go to "/admin/" on your local domain -- e.g., http://127.0.0.1:8000/admin/. You should see the admin's login screen:
ru: Откроем "/admin/" локального домена в браузере -- например, http://127.0.0.1:8000/admin/. Вы должны увидеть страницу авторизации интерфейса администратора:

source: Since :doc:`translation </topics/i18n/translation>` is turned on by default, the login screen may be displayed in your own language, depending on your browser's settings and if Django has a translation for this language.
ru: Т.к. :doc:`translation </topics/i18n/translation>` включен по умолчанию, страница авторизации может быть на вашем родном языке, зависит от настроек браузера и наличия перевода для вашего языка.

source: Enter the admin site
ru: Заходим в интерфейс администратора

source: Now, try logging in with the superuser account you created in the previous step. You should see the Django admin index page:
ru: Теперь попробуйте войти в админку. Вы должны видеть следующую страницу Django:

source: You should see a few types of editable content: groups and users. They are provided by :mod:`django.contrib.auth`, the authentication framework shipped by Django.
ru: Вы должны увидеть несколько разделов: группы и пользователи. Они предоставлены приложением авторизации Django :mod:`django.contrib.auth`.

source: Make the poll app modifiable in the admin
ru: Добавим приложение голосования в интерфейс администратора

source: But where's our poll app? It's not displayed on the admin index page.
ru: А где же наше приложение голосования? Оно не отображается в интерфейсе администратора.

source: Just one thing to do: we need to tell the admin that ``Question`` objects have an admin interface. To do this, open the :file:`polls/admin.py` file, and edit it to look like this:
ru: Нам нужно указать, что объекты модели ``Question`` могли редактироваться в интерфейсе администратора. Для этого создадим файл :file:`polls/admin.py`, и отредактируем следующим образом::

source: Explore the free admin functionality
ru: Изучим возможности интерфейса администратора

source: Now that we've registered ``Question``, Django knows that it should be displayed on the admin index page:
ru: После регистрации модели ``Question`` Django отобразит ее на главной странице:

source: Click "Questions". Now you're at the "change list" page for questions. This page displays all the questions in the database and lets you choose one to change it. There's the "What's up?" question we created earlier:
ru: Нажмите "Questions". Вы попали на страницу "списка объектов" для голосований. Эта страница содержит все объекты из базы данных и позволяет выбрать один из них для редактирования. Мы видим голосование "What's up?", которое создали в первой части учебника:

source: Click the "What's up?" question to edit it:
ru: Нажмите "What's up?" чтобы отредактировать его:

source: Things to note here:
ru: Заметим:

source: The form is automatically generated from the ``Question`` model.
ru: Поля формы формируются на основе описания модели ``Question``.

source: The different model field types (:class:`~django.db.models.DateTimeField`, :class:`~django.db.models.CharField`) correspond to the appropriate HTML input widget. Each type of field knows how to display itself in the Django admin.
ru: Для различных типов полей модели (:class:`~django.db.models.DateTimeField`, :class:`~django.db.models.CharField`) используются соответствующие HTML поля. Каждое поле знает как отобразить себя в интерфейсе администратора.

source: Each :class:`~django.db.models.DateTimeField` gets free JavaScript shortcuts. Dates get a "Today" shortcut and calendar popup, and times get a "Now" shortcut and a convenient popup that lists commonly entered times.
ru: К полям :class:`~django.db.models.DateTimeField` добавлен JavaScript виджет. Для даты добавлена кнопка "Сегодня" и календарь, для времени добавлена кнопка "Сейчас" и список распространенных значений.

source: The bottom part of the page gives you a couple of options:
ru: В нижней части страницы мы видим несколько кнопок:

source: Save -- Saves changes and returns to the change-list page for this type of object.
ru: Save -- сохранить изменения и вернуться на страницу списка объектов.

source: Save and continue editing -- Saves changes and reloads the admin page for this object.
ru: Save and continue editing -- сохранить изменения и снова загрузить страницу редактирования текущего объекта.

source: Save and add another -- Saves changes and loads a new, blank form for this type of object.
ru: Save and add another -- Сохранить изменения и перейти на страницу создания нового объекта.

source: Delete -- Displays a delete confirmation page.
ru: Delete -- Показывает страницу подтверждения удаления.

source: If the value of "Date published" doesn't match the time when you created the question in :doc:`Tutorial 1</intro/tutorial01>`, it probably means you forgot to set the correct value for the :setting:`TIME_ZONE` setting. Change it, reload the page and check that the correct value appears.
ru: Если значение "Date published" не совпадает с временем создания объекта в :doc:`Части 1</intro/tutorial01>` учебника, возможно, вы неверно определили настройку :setting:`TIME_ZONE`. Измените ее и перезагрузите страницу.

source: Change the "Date published" by clicking the "Today" and "Now" shortcuts. Then click "Save and continue editing." Then click "History" in the upper right. You'll see a page listing all changes made to this object via the Django admin, with the timestamp and username of the person who made the change:
ru: Измените "Date published", нажав "Today" и "Now". Затем нажмите "Save and continue editing." Теперь нажмите "History" в правом верхнем углу страницы. Вы увидите все изменения объекта, сделанные через интерфейс администратора, время изменений и пользователя, который их сделал:

source: When you're comfortable with the models API and have familiarized yourself with the admin site, read :doc:`part 3 of this tutorial</intro/tutorial03>` to learn about how to add more views to our polls app.
ru: Если вы освоили интерфейс администратора, переходите к :doc:`третьей части этого учебника </intro/tutorial03>`.
