Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/intro/tutorial01.po
Languages: ru

source: Writing your first Django app, part 1
ru: Создаём своё первое приложение с Django, часть 1

source: Let's learn by example.
ru: Давайте учиться на примере.

source: Throughout this tutorial, we'll walk you through the creation of a basic poll application.
ru: Мы создадим проект, состоящий из простого приложения для голосования.

source: It'll consist of two parts:
ru: Проект будет состоять из двух частей:

source: A public site that lets people view polls and vote in them.
ru: Публичный сайт, который отображает пользователям голосования и позволяет им голосовать.

source: An admin site that lets you add, change, and delete polls.
ru: Интерфейс администратора, который позволяет вам добавлять, изменять и удалять голосования.

source: We'll assume you have :doc:`Django installed </intro/install>` already. You can tell Django is installed and which version by running the following command in a shell prompt (indicated by the $ prefix):
ru: Мы предполагаем, что вы уже :doc:`установили Django </intro/install>`. Вы можете проверить это, проверив какая версия установлена, выполнив следующую команду в консоли (обозначена префиксом $):

source: If Django is installed, you should see the version of your installation. If it isn't, you'll get an error telling "No module named django".
ru: Если Django установлен, вы должны увидеть текущую версию. Иначе получите ошибку "No module named django".

source: See :doc:`How to install Django </topics/install>` for advice on how to remove older versions of Django and install a newer one.
ru: Смотрите :doc:`Как установить Django </topics/install>`, чтобы узнать как удалить старую версию Django и установить новую.

source: Where to get help:
ru: Где искать помощь:

source: Creating a project
ru: Создание проекта

source: If this is your first time using Django, you'll have to take care of some initial setup. Namely, you'll need to auto-generate some code that establishes a Django :term:`project` -- a collection of settings for an instance of Django, including database configuration, Django-specific options and application-specific settings.
ru: Если вы используете Django первый раз, вам придется позаботиться о некоторых первоначальных настройках. А именно, сгенерировать основу :term:`проекта <project>` Django -- настройки проекта, базы данных, приложений и др.

source: From the command line, ``cd`` into a directory where you'd like to store your code, then run the following command:
ru: Используя командную строку, перейдите в каталог, где вы хотите хранить код, и выполните следующую команду:

source: This will create a ``mysite`` directory in your current directory. If it didn't work, see :ref:`troubleshooting-django-admin`.
ru: Это создаст каталог ``mysite`` в текущем каталоге. Если нет, смотрите :ref:`troubleshooting-django-admin`.

source: You'll need to avoid naming projects after built-in Python or Django components. In particular, this means you should avoid using names like ``django`` (which will conflict with Django itself) or ``test`` (which conflicts with a built-in Python package).
ru: Вы не должны использовать в качестве названия проекта названия компонентов Python или Django. Это означает, что проект не может называться ``django`` (что конфликтует с Django) или ``test`` (конфликтует со стандартным пакетом Python).

source: Where should this code live?
ru: Где разместить этот код?

source: If your background is in plain old PHP (with no use of modern frameworks), you're probably used to putting code under the Web server's document root (in a place such as ``/var/www``). With Django, you don't do that. It's not a good idea to put any of this Python code within your Web server's document root, because it risks the possibility that people may be able to view your code over the Web. That's not good for security.
ru: Если вы раньше использовали PHP, то, наверное, привыкли размещать код проекта в корневом каталоге сайта на Web-сервере (например, ``/var/www``). C Django вы не должны этого делать. Это плохая идея добавлять код проекта в корень Web-сервера, так как есть риск, что он будет доступен для просмотра. Не делайте этого в целях безопасности.

source: Put your code in some directory **outside** of the document root, such as :file:`/home/mycode`.
ru: Разместите код в каталоге **вне** корневой директории сайта, например :file:`/home/mycode`.

source: Let's look at what :djadmin:`startproject` created::
ru: Давайте посмотрим, что было создано при помощи команды :djadmin:`startproject`::

source: These files are:
ru: Рассмотрим эти файлы:

source: :file:`manage.py`: A command-line utility that lets you interact with this Django project in various ways. You can read all the details about :file:`manage.py` in :doc:`/ref/django-admin`.
ru: :file:`manage.py`: Скрипт, который позволяет вам взаимодействовать с проектом Django. Подробности о :file:`manage.py` читайте в разделе :doc:`/ref/django-admin`.

source: The inner :file:`mysite/` directory is the actual Python package for your project. Its name is the Python package name you'll need to use to import anything inside it (e.g. ``mysite.urls``).
ru: Внутренний каталог :file:`mysite/` - это пакет Python вашего проекта. Его название -- это название пакета Python, которое вы будете использовать для импорта чего-либо из проекта (например, ``mysite.urls``).

source: :file:`mysite/__init__.py`: An empty file that tells Python that this directory should be considered a Python package. If you're a Python beginner, read :ref:`more about packages <tut-packages>` in the official Python docs.
ru: :file:`mysite/__init__.py`: Пустой файл, который указывает Python, что текущий каталог является пакетом Python. (Если вы новичок в Python, читайте :ref:`о покетах <tut-packages>` в официальной документации Python.)

source: :file:`mysite/settings.py`: Settings/configuration for this Django project. :doc:`/topics/settings` will tell you all about how settings work.
ru: :file:`mysite/settings.py`: Настройки/конфигурация проекта. Раздел :doc:`/topics/settings` расскажет вам все о настройках проекта.

source: :file:`mysite/urls.py`: The URL declarations for this Django project; a "table of contents" of your Django-powered site. You can read more about URLs in :doc:`/topics/http/urls`.
ru: :file:`mysite/urls.py`: Конфигурация URL-ов для вашего проекта Django. Это "содержание" всех Django-сайтов. Вы можете прочитать о конфигурации URL-ов в разделе :doc:`/topics/http/urls`.

source: :file:`mysite/wsgi.py`: An entry-point for WSGI-compatible web servers to serve your project. See :doc:`/howto/deployment/wsgi/index` for more details.
ru: :file:`mysite/wsgi.py`: Точка входа вашего проекта для WSGI-совместимых веб-серверов. Подробности читайте в разделе :doc:`/howto/deployment/wsgi/index`.

source: The development server
ru: Сервер для разработки

source: Let's verify your Django project works. Change into the outer :file:`mysite` directory, if you haven't already, and run the following commands:
ru: Давайте проверим, что все заработало. Перейдите во внешний каталог :file:`mysite`, если вы этого еще не сделали, и выполните команду::

source: You'll see the following output on the command line:
ru: Вы увидите следующий вывод::

source: Ignore the warning about unapplied database migrations for now; we'll deal with the database shortly.
ru: Игнорируйте предупреждения о невыполненных миграциях, мы разберемся с этим позже

source: You've started the Django development server, a lightweight Web server written purely in Python. We've included this with Django so you can develop things rapidly, without having to deal with configuring a production server -- such as Apache -- until you're ready for production.
ru: Только что вы запустили сервер для разработки Django, простой Web-сервер написанный на Python. Мы включили его в Django, чтобы вы сразу могли приступить к разработке, без дополнительной настройки боевого веб-сервера -- например, Apache -- пока вам это действительно не понадобится.

source: Now's a good time to note: **don't** use this server in anything resembling a production environment. It's intended only for use while developing. (We're in the business of making Web frameworks, not Web servers.)
ru: Следует заметить: НИКОГДА НЕ используйте этот сервер на "живом" сайте. Он создан исключительно для разработки. (Мы умеем делать Web-фреймворки, не Web-сервера.)

source: Now that the server's running, visit http://127.0.0.1:8000/ with your Web browser. You'll see a "Congratulations!" page, with a rocket taking off. It worked!
ru: Теперь, когда сервер запущен, перейдите на страницу http://127.0.0.1:8000/ в браузере. Вы увидите страницу "Congratulations!" со взлетающей ракетой. Работает!

source: Changing the port
ru: Поменять порт

source: By default, the :djadmin:`runserver` command starts the development server on the internal IP at port 8000.
ru: По умолчанию, команда :djadmin:`runserver` запускает сервер для разработки на локальном IP используя порт 8000.

source: If you want to change the server's port, pass it as a command-line argument. For instance, this command starts the server on port 8080:
ru: Если вы хотите изменить порт, укажите его как аргумент. Например, эта команда запускает сервер используя порт 8080:

source: If you want to change the server's IP, pass it along with the port. For example, to listen on all available public IPs (which is useful if you are running Vagrant or want to show off your work on other computers on the network), use:
ru: Если вы хотите изменить IP сервера, передайте его вместе со значением порта. Чтобы слушать все публичные IP (полезно, если вы используете Vagrant, или хотите показать свою работу на других компьютерах), используйте:

source: **0** is a shortcut for **0.0.0.0**. Full docs for the development server can be found in the :djadmin:`runserver` reference.
ru: **0** короткая версия **0.0.0.0**. Смотрите полное описание команды :djadmin:`runserver`.

source: Automatic reloading of :djadmin:`runserver`
ru: Автоматическая перезагрузка :djadmin:`runserver`

source: The development server automatically reloads Python code for each request as needed. You don't need to restart the server for code changes to take effect. However, some actions like adding files don't trigger a restart, so you'll have to restart the server in these cases.
ru: Dev-сервер самостоятельно перегружается при изменении Python файлов. Однако некоторые действия не перегружают сервер, например, добавление новых файлов. В таких случаях необходимо самостоятельно перегрузить сервер.

source: Creating the Polls app
ru: Создание приложения Polls

source: Now that your environment -- a "project" -- is set up, you're set to start doing work.
ru: Теперь, после создания окружения (проекта), мы можем приступить к работе.

source: Each application you write in Django consists of a Python package that follows a certain convention. Django comes with a utility that automatically generates the basic directory structure of an app, so you can focus on writing code rather than creating directories.
ru: Каждое приложение Django состоит из пакета Python, который следует некоторым соглашениям. Django содержит команду, которая создает структуру для нового приложения, что позволяет вам сосредоточиться на написании кода, а не на создании каталогов.

source: Projects vs. apps
ru: Проекты или приложения

source: Your apps can live anywhere on your :ref:`Python path <tut-searchpath>`. In this tutorial, we'll create our poll app right next to your :file:`manage.py` file so that it can be imported as its own top-level module, rather than a submodule of ``mysite``.
ru: Ваше приложение может находиться где угодно в :ref:`путях Python <tut-searchpath>`. В этом учебнике, мы будем создавать приложение голосования возле файла :file:`manage.py`, и оно может быть импортировано как независимый модуль, а не подмодуль ``mysite``.

source: To create your app, make sure you're in the same directory as :file:`manage.py` and type this command:
ru: Создавая приложение, убедитесь, что вы находитесь в том же каталоге, что и файл :file:`manage.py`, и выполните команду:

source: That'll create a directory :file:`polls`, which is laid out like this::
ru: Эта команда создаст каталог :file:`polls`::

source: This directory structure will house the poll application.
ru: Эти файлы являются частью приложения голосования.

source: Write your first view
ru: Создадим свое первое представление

source: Let's write the first view. Open the file ``polls/views.py`` and put the following Python code in it:
ru: Давайте создадим свое первое представление. Откроем файл ``polls/views.py`` и добавим следующий код:

source: This is the simplest view possible in Django. To call the view, we need to map it to a URL - and for this we need a URLconf.
ru: Это самое простое представление, которое можно создать на Django. Чтобы вызвать представление, нам нужно назначить его на какой-то URL через конфигурацию URL-ов

source: To create a URLconf in the polls directory, create a file called ``urls.py``. Your app directory should now look like::
ru: Чтобы добавить настройки URL-ов в приложение для голосования, создадим файл ``urls.py``. Каталог приложения должен выглядеть следующим образом::

source: In the ``polls/urls.py`` file include the following code:
ru: В файл ``polls/urls.py`` добавим следующий код:

source: The next step is to point the root URLconf at the ``polls.urls`` module. In ``mysite/urls.py``, add an import for ``django.urls.include`` and insert an :func:`~django.urls.include` in the ``urlpatterns`` list, so you have:
ru: Следующий шаг -- добавить ссылку на ``polls.urls`` в главной конфигурации URL-ов. В``mysite/urls.py`` добавим импорт ``django.urls.include``, затем :func:`~django.urls.include` добавим в список ``urlpatterns``. Вы должны получить следующий код:

source: The :func:`~django.urls.include` function allows referencing other URLconfs. Whenever Django encounters :func:`~django.urls.include`, it chops off whatever part of the URL matched up to that point and sends the remaining string to the included URLconf for further processing.
ru: Функция :func:`~django.urls.include` позволяет ссылаться на другие конфигурации URL-ов. Когда Django встречает :func:`~django.urls.include`, обрезается часть URL, которая была распознана до этого момента, а оставшаяся часть отправляется в указанную конфигурация URL-ов для последующей обработки.

source: The idea behind :func:`~django.urls.include` is to make it easy to plug-and-play URLs. Since polls are in their own URLconf (``polls/urls.py``), they can be placed under "/polls/", or under "/fun_polls/", or under "/content/polls/", or any other path root, and the app will still work.
ru: Идея :func:`~django.urls.include` в том, чтобы создать легко подключаемые URL-ы. Т.к. приложение для голосования содержит собственную конфигурацию URL-ов (``polls/urls.py``), они могут быть подключены в "/polls/", или "/fun_polls/", или "/content/polls/", или любой другой путь, и приложение будет работать.

source: Go to http://localhost:8000/polls/ in your browser, and you should see the text "*Hello, world. You're at the polls index.*", which you defined in the ``index`` view.
ru: Откройте в браузере http://localhost:8000/polls/, вы должны увидеть текст "*Hello, world. You're at the polls index.*", который вы указали в представлении ``index``.

source: Arbitrary keyword arguments can be passed in a dictionary to the target view. We aren't going to use this feature of Django in the tutorial.
ru: В представление можно передать предопределенные именованные аргументы. Мы не будет использовать эту возможность в учебнике.

source: When you're comfortable with the basic request and response flow, read :doc:`part 2 of this tutorial </intro/tutorial02>` to start working with the database.
ru: Изучив основы о запросах и ответах, приступим ко :doc:`второй части учебника </intro/tutorial02>`, чтобы начать работать с базой данных.
