Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/intro/tutorial02.po
Languages: ru

source: Writing your first Django app, part 2
ru: Создаём своё первое приложение с Django, часть 2

source: This tutorial begins where :doc:`Tutorial 1 </intro/tutorial01>` left off. We'll setup the database, create your first model, and get a quick introduction to Django's automatically-generated admin site.
ru: Продолжаем начатое в :doc:`первой части </intro/tutorial01>` учебника. Мы настроим базу данных, создадим свою первую модель и посмотрим на автоматически созданный интерфейс администратора.

source: Database setup
ru: Настройка базы данных

source: Now, open up :file:`mysite/settings.py`. It's a normal Python module with module-level variables representing Django settings.
ru: Теперь откроем файл :file:`mysite/settings.py`. Это обычный модуль Python с набором переменных, которые представляют настройки Django.

source: By default, the configuration uses SQLite. If you're new to databases, or you're just interested in trying Django, this is the easiest choice. SQLite is included in Python, so you won't need to install anything else to support your database. When starting your first real project, however, you may want to use a more robust database like PostgreSQL, to avoid database-switching headaches down the road.
ru: По умолчанию в настройках указано использование SQLite. Если вы новичок в базах данных, или просто хотите попробовать Django, это самый простой выбор. SQLite уже включен в Python, и вам не нужно дополнительно что-то устанавливать. Однако, создавая свой первый настоящий проект, вам понадобиться более серьезная база данных, например PostgreSQL.

source: If you wish to use another database, install the appropriate :ref:`database bindings <database-installation>` and change the following keys in the :setting:`DATABASES` ``'default'`` item to match your database connection settings:
ru: Если вы хотите использовать другую базу данных, установите :ref:`необходимые библиотеки <database-installation>` и поменяйте следующие ключи в элементе ``'default'`` настройки :setting:`DATABASES`, чтобы они соответсвовали настройкам подключения к вашей базе данных:

source: :setting:`ENGINE <DATABASE-ENGINE>` -- Either ``'django.db.backends.sqlite3'``, ``'django.db.backends.postgresql'``, ``'django.db.backends.mysql'``, or ``'django.db.backends.oracle'``. Other backends are :ref:`also available <third-party-notes>`.
ru: :setting:`ENGINE <DATABASE-ENGINE>` -- один из ``'django.db.backends.sqlite3'``, ``'django.db.backends.postgresql'``, ``'django.db.backends.mysql'`` или ``'django.db.backends.oracle'``. Также доступны :ref:`дополнительные бэкенды <third-party-notes>`.

source: :setting:`NAME` -- The name of your database. If you're using SQLite, the database will be a file on your computer; in that case, :setting:`NAME` should be the full absolute path, including filename, of that file. The default value, ``os.path.join(BASE_DIR, 'db.sqlite3')``, will store the file in your project directory.
ru: :setting:`NAME` -- название вашей базы данных. Если вы используете SQLite, база данных будет файлов на вашем компьютере, в этом случае :setting:`NAME` содержит абсолютный путь, включая имя, к этому файлу. Значение по умолчанию, ``os.path.join(BASE_DIR, 'db.sqlite3')``, создаст файл в каталоге вашего проекта.

source: If you are not using SQLite as your database, additional settings such as :setting:`USER`, :setting:`PASSWORD`, and :setting:`HOST` must be added. For more details, see the reference documentation for :setting:`DATABASES`.
ru: Если вы используете не SQLite,вам необходимо указать дополнительно :setting:`USER`, :setting:`PASSWORD` и :setting:`HOST`. Подробности смотрите в описании :setting:`DATABASES`.

source: If you're using SQLite, you don't need to create anything beforehand - the database file will be created automatically when it is needed.
ru: Если вы используете SQLite, вам ничего не нужно создавать заранее - файл базы данных будет создан автоматически при необходимости.

source: While you're editing :file:`mysite/settings.py`, set :setting:`TIME_ZONE` to your time zone.
ru: Отредактируйте :file:`mysite/settings.py` и укажите в :setting:`TIME_ZONE` ваш часовой пояс.

source: Also, note the :setting:`INSTALLED_APPS` setting at the top of the file. That holds the names of all Django applications that are activated in this Django instance. Apps can be used in multiple projects, and you can package and distribute them for use by others in their projects.
ru: Также обратите внимание на настройку :setting:`INSTALLED_APPS` в начале файла. Она содержит названия всех приложений Django, которые активированы в вашем проекте. Приложения могут использоваться на разных проектах, вы можете создать пакет, распространить его и позволить другим использовать его на своих проектах.

source: By default, :setting:`INSTALLED_APPS` contains the following apps, all of which come with Django:
ru: По умолчанию, :setting:`INSTALLED_APPS` содержит следующие приложение, которые предоставляются Django:

source: :mod:`django.contrib.admin` -- The admin site. You'll use it shortly.
ru: :mod:`django.contrib.admin` -- интерфейс администратора. Скоро мы его будем использовать.

source: :mod:`django.contrib.auth` -- An authentication system.
ru: :mod:`django.contrib.auth` -- система авторизации.

source: :mod:`django.contrib.contenttypes` -- A framework for content types.
ru: :mod:`django.contrib.contenttypes` -- фреймверк типов даных.

source: :mod:`django.contrib.sessions` -- A session framework.
ru: :mod:`django.contrib.sessions` -- фреймверк сессии.

source: :mod:`django.contrib.messages` -- A messaging framework.
ru: :mod:`django.contrib.messages` -- фреймверк сообщений.

source: :mod:`django.contrib.staticfiles` -- A framework for managing static files.
ru: :mod:`django.contrib.staticfiles` -- фреймверк для работы со статическими файлами.

source: These applications are included by default as a convenience for the common case.
ru: Эти приложения включены по умолчанию для покрытия основных задач.

source: Some of these applications make use of at least one database table, though, so we need to create the tables in the database before we can use them. To do that, run the following command:
ru: Некоторые приложения используют минимум одну таблицу в базе данных, поэтому нам необходимо их создать перед тем, как мы будем их использовать. Для этого выполним следующую команду:

source: The :djadmin:`migrate` command looks at the :setting:`INSTALLED_APPS` setting and creates any necessary database tables according to the database settings in your :file:`mysite/settings.py` file and the database migrations shipped with the app (we'll cover those later). You'll see a message for each migration it applies. If you're interested, run the command-line client for your database and type ``\dt`` (PostgreSQL), ``SHOW TABLES;`` (MySQL), ``.schema`` (SQLite), or ``SELECT TABLE_NAME FROM USER_TABLES;`` (Oracle) to display the tables Django created.
ru: Команда :djadmin:`migrate` проверяет настройку :setting:`INSTALLED_APPS` и создает все необходимые таблицы в базе данных, указанной в :file:`mysite/settings.py`, применяя миграции, которые находятся в приложении (мы расскажем об это ниже). Вы увидите сообщение для кажой примененной миграции. Если вам интересно, запустите консоль базы данных и введите ``\dt`` (PostgreSQL), ``SHOW TABLES;`` (MySQL), ``.schema`` (SQLite), или ``SELECT TABLE_NAME FROM USER_TABLES;`` (Oracle), чтобы посмотреть таблицы, которые создал Django.

source: For the minimalists
ru: Для минималистов

source: Like we said above, the default applications are included for the common case, but not everybody needs them. If you don't need any or all of them, feel free to comment-out or delete the appropriate line(s) from :setting:`INSTALLED_APPS` before running :djadmin:`migrate`. The :djadmin:`migrate` command will only run migrations for apps in :setting:`INSTALLED_APPS`.
ru: Как мы сказали выше, приложения по умолчанию включены для большинства случаев, но не все они могут быть необходимы. Если какое-то приложение вам не нужно, закомментируйте или удалите соответствующие строки из :setting:`INSTALLED_APPS` перед запуском :djadmin:`migrate`. Команда :djadmin:`migrate` выполнит миграции только для приложений из :setting:`INSTALLED_APPS`.

source: Creating models
ru: Создание моделей

source: Now we'll define your models -- essentially, your database layout, with additional metadata.
ru: Теперь создадим ваши модели -- по сути структуру вашей базы данных с дополнительными мета-данными.

source: Philosophy
ru: Философия

source: A model is the single, definitive source of truth about your data. It contains the essential fields and behaviors of the data you're storing. Django follows the :ref:`DRY Principle <dry>`. The goal is to define your data model in one place and automatically derive things from it.
ru: Модель - это основной источник данных. Он содержит набор полей и поведение данных, которые вы храните. Django следует :ref:`принципу DRY<dry>`.. Смысл в том, чтобы определять модели в одном месте.

source: This includes the migrations - unlike in Ruby On Rails, for example, migrations are entirely derived from your models file, and are essentially just a history that Django can roll through to update your database schema to match your current models.
ru: Частью работы с данными также являются миграции. В отличии от Ruby On Rails, например, миграции вынесены из файла моделей и являются просто историей, которую Django может использовать для изменения базы данных в соответствии с текущей структурой моделей.

source: In our simple poll app, we'll create two models: ``Question`` and ``Choice``. A ``Question`` has a question and a publication date. A ``Choice`` has two fields: the text of the choice and a vote tally. Each ``Choice`` is associated with a ``Question``.
ru: В нашем простом приложении голосования, мы создадим две модели: ``Question`` и ``Choice``. ``Question`` содержит вопрос и дату публикации. ``Choice`` содержит: текст ответа и количество голосов. Каждый объект ``Choice`` связан с объектом ``Question``.

source: These concepts are represented by simple Python classes. Edit the :file:`polls/models.py` file so it looks like this:
ru: Эти понятия отображаются простыми классами Python. Отредактируйте файл :file:`polls/models.py`, чтобы он выглядел таким образом:

source: The code is straightforward. Each model is represented by a class that subclasses :class:`django.db.models.Model`. Each model has a number of class variables, each of which represents a database field in the model.
ru: Код очень простой. Каждая модель представлена классом, унаследованным от :class:`django.db.models.Model`. Каждая модель содержит несколько атрибутов, каждый из которых отображает поле в таблице базы данных.

source: Each field is represented by an instance of a :class:`~django.db.models.Field` class -- e.g., :class:`~django.db.models.CharField` for character fields and :class:`~django.db.models.DateTimeField` for datetimes. This tells Django what type of data each field holds.
ru: Каждое поле представлено экземпляром класса :class:`~django.db.models.Field` -- например, :class:`~django.db.models.CharField` для текстовых полей и :class:`~django.db.models.DateTimeField` для полей даты и времени. Это указывает Django какие типы данных хранят эти поля.

source: The name of each :class:`~django.db.models.Field` instance (e.g. ``question_text`` or ``pub_date``) is the field's name, in machine-friendly format. You'll use this value in your Python code, and your database will use it as the column name.
ru: Названия каждого экземпляра :class:`~django.db.models.Field` (например, ``question_text`` или ``pub_date`` ) это название поля, в "машинном"(machine-friendly) формате. Вы будете использовать эти названия в коде, а база данных будет использовать их как названия колонок.

source: You can use an optional first positional argument to a :class:`~django.db.models.Field` to designate a human-readable name. That's used in a couple of introspective parts of Django, and it doubles as documentation. If this field isn't provided, Django will use the machine-readable name. In this example, we've only defined a human-readable name for ``Question.pub_date``. For all other fields in this model, the field's machine-readable name will suffice as its human-readable name.
ru: Вы можете использовать первый необязательный аргумент конструктора класса :class:`~django.db.models.Field`, чтобы определить отображаемое, удобное для восприятия, название поля. Оно используется в некоторых компонентах Django, и полезно для документирования. Если это название не указано, Django будет использовать "машинное" название. В этом примере, мы указали отображаемое название только для поля ``Question.pub_date``. Для всех других полей будет использоваться "машинное" название.

source: Some :class:`~django.db.models.Field` classes have required arguments. :class:`~django.db.models.CharField`, for example, requires that you give it a :attr:`~django.db.models.CharField.max_length`. That's used not only in the database schema, but in validation, as we'll soon see.
ru: Некоторые классы, унаследованные от :class:`~django.db.models.Field`, имеют обязательные аргументы. Например, :class:`~django.db.models.CharField` требует, чтобы вы передали ему :attr:`~django.db.models.CharField.max_length`. Это используется не только в схеме базы данных, но и при валидации, как мы скоро увидим.

source: A :class:`~django.db.models.Field` can also have various optional arguments; in this case, we've set the :attr:`~django.db.models.Field.default` value of ``votes`` to 0.
ru: :class:`~django.db.models.Field` может принимать различные необязательные аргументы; в нашем примере мы указали :attr:`~django.db.models.Field.default` значение для `votes`` равное 0.

source: Finally, note a relationship is defined, using :class:`~django.db.models.ForeignKey`. That tells Django each ``Choice`` is related to a single ``Question``. Django supports all the common database relationships: many-to-one, many-to-many, and one-to-one.
ru: Заметим, что связь между моделями определяется с помощью :class:`~django.db.models.ForeignKey`. Это указывает Django, что каждый ``Choice`` связан с одним объектом ``Question``. Django поддерживает все основные типы связей: многие-к-одному, многие-ко-многим и один-к-одному.

source: Activating models
ru: Активация моделей

source: That small bit of model code gives Django a lot of information. With it, Django is able to:
ru: Эта небольшая часть кода моделей предоставляет Django большое количество информации, которая позволяет Django:

source: Create a database schema (``CREATE TABLE`` statements) for this app.
ru: Создать структуру базы данных (``CREATE TABLE``) для приложения.

source: Create a Python database-access API for accessing ``Question`` and ``Choice`` objects.
ru: Создать Python API для доступа к данным объектов ``Question`` и ``Choice``.

source: But first we need to tell our project that the ``polls`` app is installed.
ru: Но первым делом мы должны указать нашему проекту, что приложение ``polls`` установлено.

source: Django apps are "pluggable": You can use an app in multiple projects, and you can distribute apps, because they don't have to be tied to a given Django installation.
ru: Приложения Django "подключаемые": вы можете использовать приложение в нескольких проектах и вы можете распространять приложение, так как они не связаны с конкретным проектом Django.

source: Now Django knows to include the ``polls`` app. Let's run another command:
ru: Теперь Django знает, что необходимо использовать приложение ``polls``. Давайте выполним следующую команду:

source: You should see something similar to the following:
ru: Вы увидите приблизительно такое:

source: By running ``makemigrations``, you're telling Django that you've made some changes to your models (in this case, you've made new ones) and that you'd like the changes to be stored as a *migration*.
ru: Выполняя ``makemigrations``, вы говорите Django, что внесли некоторые изменения в ваши модели (в нашем случае мы создали несколько новых) и хотели бы сохранить их в *миграции*.

source: Migrations are how Django stores changes to your models (and thus your database schema) - they're just files on disk. You can read the migration for your new model if you like; it's the file ``polls/migrations/0001_initial.py``. Don't worry, you're not expected to read them every time Django makes one, but they're designed to be human-editable in case you want to manually tweak how Django changes things.
ru: Миграции используются Django для сохранения изменений ваших моделей (и структуры базы данных) - это просто файлы на диске. Вы можете изучить миграцию для создания ваших моделей, она находится в файле ``polls/migrations/0001_initial.py``. Не волнуйтесь, вам не нужно каждый раз их проверять. Но их формат удобен для чтения на случай, если вы захотите внести изменения.

source: There's a command that will run the migrations for you and manage your database schema automatically - that's called :djadmin:`migrate`, and we'll come to it in a moment - but first, let's see what SQL that migration would run. The :djadmin:`sqlmigrate` command takes migration names and returns their SQL:
ru: В Django есть команда, которая выполняет миграции и автоматически обновляет базу данных - она называется :djadmin:`migrate`. Мы скоро к ней вернемся, но сначала давайте посмотрим какой SQL выполнит эта миграция. Команда :djadmin:`sqlmigrate` получает название миграции и возвращает SQL:

source: You should see something similar to the following (we've reformatted it for readability):
ru: Вы увидите приблизительно такое (мы отформатировали результат для читабельности):

source: Note the following:
ru: Обратите внимание на следующее:

source: The exact output will vary depending on the database you are using. The example above is generated for PostgreSQL.
ru: Полученные запросы зависят от базы данных, которую вы используете. Пример выше получен для PostgreSQL.

source: Table names are automatically generated by combining the name of the app (``polls``) and the lowercase name of the model -- ``question`` and ``choice``. (You can override this behavior.)
ru: Названия таблиц созданы автоматически из названия приложения(``polls``) и названия модели в нижнем регистре -- ``question`` и ``choice``. (Вы можете переопределить это.)

source: Primary keys (IDs) are added automatically. (You can override this, too.)
ru: Первичные ключи (ID) добавлены автоматически. (Вы можете переопределить и это.)

source: By convention, Django appends ``"_id"`` to the foreign key field name. (Yes, you can override this, as well.)
ru: Django добавляет ``"_id"`` к названию внешнего ключа. (Да, вы можете переопределить и это.)

source: The foreign key relationship is made explicit by a ``FOREIGN KEY`` constraint. Don't worry about the ``DEFERRABLE`` parts; that's just telling PostgreSQL to not enforce the foreign key until the end of the transaction.
ru: Связь явно определена через ``FOREIGN KEY`` constraint. Не волнуйтесь о ``DEFERRABLE``, это просто указание для PostgreSQL не применять ограничения ``FOREIGN KEY`` до окончания транзакции.

source: It's tailored to the database you're using, so database-specific field types such as ``auto_increment`` (MySQL), ``serial`` (PostgreSQL), or ``integer primary key autoincrement`` (SQLite) are handled for you automatically. Same goes for the quoting of field names -- e.g., using double quotes or single quotes.
ru: Учитываются особенности базы данных, которую вы используете. Специфические типы данных такие как ``auto_increment`` (MySQL), ``serial`` (PostgreSQL), или ``integer primary key`` (SQLite) будут использоваться автоматически. Тоже касается и экранирование названий, что позволяет использовать в названии кавычки -- например, использование одинарных или двойных кавычек.

source: The :djadmin:`sqlmigrate` command doesn't actually run the migration on your database - it just prints it to the screen so that you can see what SQL Django thinks is required. It's useful for checking what Django is going to do or if you have database administrators who require SQL scripts for changes.
ru: Команда :djadmin:`sqlmigrate` не применяет миграцию к базе данных - она просто выводит запросы на экран, чтобы вы могли увидеть какой SQL создает Django. Это полезно, если вы хотите проверить что выполнит Django, или чтобы предоставить вашему администратору базы данных SQL скрипт.

source: If you're interested, you can also run :djadmin:`python manage.py check <check>`; this checks for any problems in your project without making migrations or touching the database.
ru: Если необходимо, можете выполнить :djadmin:`python manage.py check <check>`. Эта команда ищет проблемы в вашем проекте не применяя миграции и не изменяя базу данных.

source: Now, run :djadmin:`migrate` again to create those model tables in your database:
ru: Теперь, выполните команду :djadmin:`migrate` снова, чтобы создать таблицы для этих моделей в базе данных:

source: The :djadmin:`migrate` command takes all the migrations that haven't been applied (Django tracks which ones are applied using a special table in your database called ``django_migrations``) and runs them against your database - essentially, synchronizing the changes you made to your models with the schema in the database.
ru: Команда :djadmin:`migrate` выполняет все миграции, которые ещё не выполнялись, (Django следит за всеми миграциями, используя таблицу в базе данных ``django_migrations``) и применяет изменения к базе данных, синхронизируя структуру базы данных со структурой ваших моделей.

source: Migrations are very powerful and let you change your models over time, as you develop your project, without the need to delete your database or tables and make new ones - it specializes in upgrading your database live, without losing data. We'll cover them in more depth in a later part of the tutorial, but for now, remember the three-step guide to making model changes:
ru: Миграции - очень мощная штука. Они позволяют изменять ваши модели в процессе развития проекта без необходимости пересоздавать таблицы в базе данных. Их задача изменять базу данных без потери данных. Мы ещё вернемся к ним, а пока запомните эти инструкции по изменению моделей:

source: Change your models (in ``models.py``).
ru: Внесите изменения в модели (в ``models.py``).

source: Run :djadmin:`python manage.py makemigrations <makemigrations>` to create migrations for those changes
ru: Выполните :djadmin:`python manage.py makemigrations <makemigrations>` чтобы создать миграцию для ваших изменений

source: Run :djadmin:`python manage.py migrate <migrate>` to apply those changes to the database.
ru: Выполните :djadmin:`python manage.py migrate <migrate>` чтобы применить изменения к базе данных.

source: The reason that there are separate commands to make and apply migrations is because you'll commit migrations to your version control system and ship them with your app; they not only make your development easier, they're also useable by other developers and in production.
ru: Две команды необходимы для того, чтобы хранить миграции в системе контроля версий. Они не только помогают вам, но и могут использоваться другими программистами вашего проекта.

source: Read the :doc:`django-admin documentation </ref/django-admin>` for full information on what the ``manage.py`` utility can do.
ru: О всех возможностях ``manage.py`` вы можете прочитать в :doc:`разделе о django-admin </ref/django-admin>`.

source: Playing with the API
ru: Поиграемся с API
