Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/topics/db/aggregation.po
Languages: ru

source: As with the ``filter()`` clause, the order in which ``annotate()`` and ``values()`` clauses are applied to a query is significant. If the ``values()`` clause precedes the ``annotate()``, the annotation will be computed using the grouping described by the ``values()`` clause.
ru: Так же, как и с ``filter()``, порядок использования ``annotate()`` и ``values()`` важен. Если ``values()`` используется перед ``annotate()``, "аннотация" будет вычислена, используя группирование ``values()`` описанное выше.

source: However, if the ``annotate()`` clause precedes the ``values()`` clause, the annotations will be generated over the entire query set. In this case, the ``values()`` clause only constrains the fields that are generated on output.
ru: Однако, если ``annotate()`` используется перед ``values()``, "аннотация" будет вычислена для каждого объекта. В этом случае ``values()`` просто ограничивает возвращаемые поля.

source: For example, if we reverse the order of the ``values()`` and ``annotate()`` clause from our previous example::
ru: Например, если мы поменяем местами ``values()`` и ``annotate()`` из предыдущего примера::

source: This will now yield one unique result for each author; however, only the author's name and the ``average_rating`` annotation will be returned in the output data.
ru: Будет вычислено одно значение для каждого автора, но результат будет содержать только имя автора и вычисленное значение ``average_rating``.

source: You should also note that ``average_rating`` has been explicitly included in the list of values to be returned. This is required because of the ordering of the ``values()`` and ``annotate()`` clause.
ru: Заметьте, что ``average_rating`` был явно включен в список значений, которые будут возвращены. Это необходимо из-за порядка использования ``values()`` и ``annotate()``.

source: If the ``values()`` clause precedes the ``annotate()`` clause, any annotations will be automatically added to the result set. However, if the ``values()`` clause is applied after the ``annotate()`` clause, you need to explicitly include the aggregate column.
ru: Если ``values()`` следует перед ``annotate()``, любая "аннотация" будет добавлена в результат. Однако, если ``values()`` используется после ``annotate()``, вы должны указать их.

source: Interaction with default ordering or ``order_by()``
ru: Влияние сортировки по-умолчанию и ``order_by()``

source: Fields that are mentioned in the ``order_by()`` part of a queryset (or which are used in the default ordering on a model) are used when selecting the output data, even if they are not otherwise specified in the ``values()`` call. These extra fields are used to group "like" results together and they can make otherwise identical result rows appear to be separate. This shows up, particularly, when counting things.
ru: Поля, упомянутые в ``order_by()`` (или используемые в сортировке по-умолчанию), используются при получении результата, даже если они не указаны в ``values()``. Это влияет на порядок следования строк, нарушая уникальные группы, по которым вычисляется аннотация. Это влияет на результат, например, при подсчете.

source: By way of example, suppose you have a model like this::
ru: Например, у нас есть такая модель::

source: The important part here is the default ordering on the ``name`` field. If you want to count how many times each distinct ``data`` value appears, you might try this::
ru: Важная часть -- сортировка по-умолчанию по полю ``name``. Если вы хотите подсчитать, сколько раз встречается каждое уникальное значение поля ``data``, вы могли бы использовать этот запрос::

source: ...which will group the ``Item`` objects by their common ``data`` values and then count the number of ``id`` values in each group. Except that it won't quite work. The default ordering by ``name`` will also play a part in the grouping, so this query will group by distinct ``(data, name)`` pairs, which isn't what you want. Instead, you should construct this queryset::
ru: ... который сгруппирует объекты ``Item`` по значениям поля ``data`` и потом подсчитает ``id`` в каждой группе. Но запрос работает не совсем так. Сортировка по-умолчанию по полю ``name`` играет свою роль при группировании. Группы будут уникальны по совокупности значений ``(data, name)``, и это не совсем то, что вам нужно. Поэтому, используйте запрос::

source: ...clearing any ordering in the query. You could also order by, say, ``data`` without any harmful effects, since that is already playing a role in the query.
ru: ...убирая любую сортировку из запроса. Вы можете отсортировать по полю ``data`` без какого-либо влияния на результат, т.к. оно уже сыграло свою роль в запросе.

source: This behavior is the same as that noted in the queryset documentation for :meth:`~django.db.models.query.QuerySet.distinct` and the general rule is the same: normally you won't want extra columns playing a part in the result, so clear out the ordering, or at least make sure it's restricted only to those fields you also select in a ``values()`` call.
ru: Это поведение идентично поведению метода :meth:`~django.db.models.query.QuerySet.distinct` и общее правило аналогично: лишние поля не должны быть использованы в запросе, поэтому очистите любую сортировку, или, по крайней мере, убедитесь что эти поля добавляются в результат вызовом ``values()``.

source: You might reasonably ask why Django doesn't remove the extraneous columns for you. The main reason is consistency with ``distinct()`` and other places: Django **never** removes ordering constraints that you have specified (and we can't change those other methods' behavior, as that would violate our :doc:`/misc/api-stability` policy).
ru: Вы можете спросить, почему Django не заботится об этом. Причина та же, что и для ``distinct()`` и др.: Django **никогда** не удаляет сортировку, определенную вами (и мы не может изменить такое поведение, т.к. это нарушает нашу :doc:`/misc/api-stability` политику стабильности API).

source: Aggregating annotations
ru: Аннотация агрегации

source: You can also generate an aggregate on the result of an annotation. When you define an ``aggregate()`` clause, the aggregates you provide can reference any alias defined as part of an ``annotate()`` clause in the query.
ru: Вы можете использовать агрегацию для результата "аннотации". При определении ``aggregate()``, можно указать имя результата, указанное в ``annotate()`` этого запроса.

source: For example, if you wanted to calculate the average number of authors per book you first annotate the set of books with the author count, then aggregate that author count, referencing the annotation field::
ru: Например, если вы хотите посчитать среднее количество авторов для каждой книги, сначала используйте "аннотацию" для количества авторов, потом агрегацию для этого значения::
