Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/topics/db/aggregation.po
Languages: ru

source: Aggregation
ru: Агрегация

source: The topic guide on :doc:`Django's database-abstraction API </topics/db/queries>` described the way that you can use Django queries that create, retrieve, update and delete individual objects. However, sometimes you will need to retrieve values that are derived by summarizing or *aggregating* a collection of objects. This topic guide describes the ways that aggregate values can be generated and returned using Django queries.
ru: Руководство :doc:`API для доступа к данным</topics/db/queries>` описывает, как создавать запросы с помощью Django для создания, обновления, получения и удаления отдельных объектов. Но иногда необходимы данные полученные через обобщение или *агрегацию* данных нескольких объектов. Этот раздел расскажет как создавать такие запросы с помощью Django.

source: Throughout this guide, we'll refer to the following models. These models are used to track the inventory for a series of online bookstores:
ru: В данном руководстве мы будем ссылаться на следующие модели. Эти модели хранят информацию для книжного магазина:

source: Cheat sheet
ru: Шпаргалка

source: In a hurry? Here's how to do common aggregate queries, assuming the models above:
ru: Спешите? Вот как выполнить стандартные запросы агрегации для моделей представленных выше::

source: Generating aggregates over a ``QuerySet``
ru: Создание агрегации с помощью ``QuerySet``

source: Django provides two ways to generate aggregates. The first way is to generate summary values over an entire ``QuerySet``. For example, say you wanted to calculate the average price of all books available for sale. Django's query syntax provides a means for describing the set of all books::
ru: Django предоставляет два способа использовать агрегацию. Первый способ заключается в использовании агрегации для всех объектов ``QuerySet``. Например, мы хотим вычислить среднюю цену для всех книг. Чтобы получить все книги, необходимо выполнить такой запрос::

source: What we need is a way to calculate summary values over the objects that belong to this ``QuerySet``. This is done by appending an ``aggregate()`` clause onto the ``QuerySet``::
ru: Нам нужно вычислить среднее значение для всех объектов в ``QuerySet``. Это можно сделать, добавив ``aggregate()`` в ``QuerySet``::

source: The ``all()`` is redundant in this example, so this could be simplified to::
ru: ``all()`` не обязательно использовать в данном примере, так что можно упростить::

source: The argument to the ``aggregate()`` clause describes the aggregate value that we want to compute - in this case, the average of the ``price`` field on the ``Book`` model. A list of the aggregate functions that are available can be found in the :ref:`QuerySet reference <aggregation-functions>`.
ru: Аргумент для ``aggregate()`` определяет, что нам нужно вычислить - в данном примере среднее значение поля ``price`` для модели ``Book``. Полный список функций агрегации можно найти в :ref:`разделе о QuerySet<aggregation-functions>`.

source: ``aggregate()`` is a terminal clause for a ``QuerySet`` that, when invoked, returns a dictionary of name-value pairs. The name is an identifier for the aggregate value; the value is the computed aggregate. The name is automatically generated from the name of the field and the aggregate function. If you want to manually specify a name for the aggregate value, you can do so by providing that name when you specify the aggregate clause::
ru: ``aggregate()`` завершающая инструкция для ``QuerySet``, которая возвращает словарь с результатом. Ключ словаря - идентификатор вычисленного значения; значение - результат. Название создается автоматически из поля и функции агрегации. Если вы хотите самостоятельно определить имя результата, вы можете указать его при определении функции агрегации::

source: If you want to generate more than one aggregate, you just add another argument to the ``aggregate()`` clause. So, if we also wanted to know the maximum and minimum price of all books, we would issue the query::
ru: Если вам необходимо вычислить больше одного значения, добавьте еще один аргумент в ``aggregate()``. Например, нам нужно узнать минимальную и максимальную цену книг::

source: Generating aggregates for each item in a ``QuerySet``
ru: Создание агрегации для каждого объекта в ``QuerySet``

source: The second way to generate summary values is to generate an independent summary for each object in a ``QuerySet``. For example, if you are retrieving a list of books, you may want to know how many authors contributed to each book. Each Book has a many-to-many relationship with the Author; we want to summarize this relationship for each book in the ``QuerySet``.
ru: Второй способ получения обобщенных данных -- вычислить обобщенное значение для каждого объекта в ``QuerySet``. Например, при получении списка книг, вы хотите знать количество их авторов. Каждая модель книги имеет связь много-ко-многому с моделью автора, нам нужно обобщить это отношение для каждой книги в ``QuerySet``.

source: Per-object summaries can be generated using the ``annotate()`` clause. When an ``annotate()`` clause is specified, each object in the ``QuerySet`` will be annotated with the specified values.
ru: Обобщение отношения можно выполнить с помощью ``annotate()``. ``annotate()`` для каждого объекта ``QuerySet`` добавит вычисленное значение.

source: The syntax for these annotations is identical to that used for the ``aggregate()`` clause. Each argument to ``annotate()`` describes an aggregate that is to be calculated. For example, to annotate books with the number of authors:
ru: Синтаксис совпадает с синтаксисом ``aggregate()``. Каждый аргумент ``annotate()`` описывает агрегацию, которая должна быть выполнена. Например, чтобы добавить количество авторов, необходимо выполнить такой код::

source: As with ``aggregate()``, the name for the annotation is automatically derived from the name of the aggregate function and the name of the field being aggregated. You can override this default name by providing an alias when you specify the annotation::
ru: Как и для ``aggregate()``, название будет вычислено из названия поля и функции агрегации. Вы можете переопределить это имя, добавив его при определении аннотации::

source: Unlike ``aggregate()``, ``annotate()`` is *not* a terminal clause. The output of the ``annotate()`` clause is a ``QuerySet``; this ``QuerySet`` can be modified using any other ``QuerySet`` operation, including ``filter()``, ``order_by()``, or even additional calls to ``annotate()``.
ru: В отличии от ``aggregate()``, ``annotate()`` *не* завершающая функция. Результат функции ``annotate()`` будет ``QuerySet``; этот ``QuerySet`` может быть изменен любой другой операцией ``QuerySet``, включая ``filter()``, ``order_by``, или еще одним вызовом ``annotate()``.

source: Combining multiple aggregations
ru: Объединение нескольких агрегаций

source: Combining multiple aggregations with ``annotate()`` will `yield the wrong results <https://code.djangoproject.com/ticket/10060>`_ because joins are used instead of subqueries:
ru: Объединение нескольких агрегаций через ``annotate()`` может привести к `неправильному результату <https://code.djangoproject.com/ticket/10060>`_, т.к. используется объединение вместо подзапросов:

source: For most aggregates, there is no way to avoid this problem, however, the :class:`~django.db.models.Count` aggregate has a ``distinct`` parameter that may help:
ru: Для большинства агрегаций нет способа избежать этой проблемы. Однако, агрегация :class:`~django.db.models.Count` принимает аргумент ``distinct``, который может помочь:

source: If in doubt, inspect the SQL query!
ru: Если вы сомневаетесь, изучите SQL запрос!

source: In order to understand what happens in your query, consider inspecting the ``query`` property of your ``QuerySet``.
ru: Запрос можно получить из свойства ``query`` экземпляра ``QuerySet``.

source: Joins and aggregates
ru: Объединения и агрегация

source: So far, we have dealt with aggregates over fields that belong to the model being queried. However, sometimes the value you want to aggregate will belong to a model that is related to the model you are querying.
ru: До этого мы работали с агрегацией для полей модели запроса. Однако, иногда данные для агрегации находятся в связанной модели.

source: When specifying the field to be aggregated in an aggregate function, Django will allow you to use the same :ref:`double underscore notation <field-lookups-intro>` that is used when referring to related fields in filters. Django will then handle any table joins that are required to retrieve and aggregate the related value.
ru: Для указания поля для агрегации, Django позволяет использовать :ref:`двойное подчеркивание <field-lookups-intro>`, которое используется для фильтрации по связанным полям. Django автоматически добавит необходимые объединения таблиц.

source: For example, to find the price range of books offered in each store, you could use the annotation::
ru: Например, чтобы найти диапазон цен на книги в каждом магазине::

source: This tells Django to retrieve the ``Store`` model, join (through the many-to-many relationship) with the ``Book`` model, and aggregate on the price field of the book model to produce a minimum and maximum value.
ru: Django получит модель ``Store``, сделает объединение (через связь многое-ко-многим) с моделью ``Book``, и агрегирует значение цены, чтобы получить минимальное и максимальное значение.

source: The same rules apply to the ``aggregate()`` clause. If you wanted to know the lowest and highest price of any book that is available for sale in any of the stores, you could use the aggregate::
ru: Те же правила действуют и для ``aggregate()``. Если вы хотите узнать максимальную и минимальную цену книги доступной в магазине, вы можете использовать такой код::

source: Join chains can be as deep as you require. For example, to extract the age of the youngest author of any book available for sale, you could issue the query::
ru: Объединение может быть любой вложенности. Например, чтобы получить возраст самого молодого автора, используйте такой запрос::

source: Following relationships backwards
ru: Использование обратных связей

source: In a way similar to :ref:`lookups-that-span-relationships`, aggregations and annotations on fields of models or models that are related to the one you are querying can include traversing "reverse" relationships. The lowercase name of related models and double-underscores are used here too.
ru: Аналогично :ref:`lookups-that-span-relationships`, можно выполнить агрегацию и аннотацию по полям модели или связанных моделей, используя "обратные" связи. Аналогично используйте название модели в нижнем регистре и два символа нижнего подчеркивания.

source: For example, we can ask for all publishers, annotated with their respective total book stock counters (note how we use ``'book'`` to specify the ``Publisher`` -> ``Book`` reverse foreign key hop)::
ru: Например, мы хотим получить всех издателей и количество их книг (обратите внимание, как мы используем `'book'`, указывая на связь обратную связь Publisher->Book)::

source: (Every ``Publisher`` in the resulting ``QuerySet`` will have an extra attribute called ``book__count``.)
ru: (Каждый объект Publisher в QuerySet будет содержать дополнительный атрибут ``book__count``.)

source: We can also ask for the oldest book of any of those managed by every publisher::
ru: Мы также можем получить самую старую книгу издателя::

source: (The resulting dictionary will have a key called ``'oldest_pubdate'``. If no such alias were specified, it would be the rather long ``'book__pubdate__min'``.)
ru: (В результате получим словарь с ключом ``'oldest_pubdate'``. Если имя ключа не было указано, оно будет следующим - ``'book__pubdate__min'``.)

source: This doesn't apply just to foreign keys. It also works with many-to-many relations. For example, we can ask for every author, annotated with the total number of pages considering all the books the author has (co-)authored (note how we use ``'book'`` to specify the ``Author`` -> ``Book`` reverse many-to-many hop)::
ru: Это относиться не только к внешним ключам и работает также для связей многое-ко-многим. Например, мы можем получить всех авторов и общее количество страниц в книгах, которые он написал (обратите внимание как мы используем `'book'` для указания на обратную связь ``Author`` -> ``Book``)::

source: (Every ``Author`` in the resulting ``QuerySet`` will have an extra attribute called ``total_pages``. If no such alias were specified, it would be the rather long ``book__pages__sum``.)
ru: (Каждый объект Author в результате будет содержать атрибут ``total_pages``. Если имя атрибута не указано, оно будет - ``book__pages__sum``.)

source: Or ask for the average rating of all the books written by author(s) we have on file::
ru: Или получим средний рейтинг книг каждого автора::

source: (The resulting dictionary will have a key called ``'average_rating'``. If no such alias were specified, it would be the rather long ``'book__rating__avg'``.)
ru: (В результате получим словарь с ключом ``'average__rating'``. Если не указать имя ключа, получим длинный ``'book__rating__avg'``.)

source: Aggregations and other ``QuerySet`` clauses
ru: Агрегация и другие методы ``QuerySet``

source: ``filter()`` and ``exclude()``
ru: ``filter()`` и ``exclude()``

source: Aggregates can also participate in filters. Any ``filter()`` (or ``exclude()``) applied to normal model fields will have the effect of constraining the objects that are considered for aggregation.
ru: Фильтры могут использоваться вместе с агрегацией. Любой ``filter()`` (или ``exclude()``) повлияет на выборку объектов, используемых для агрегации.

source: When used with an ``annotate()`` clause, a filter has the effect of constraining the objects for which an annotation is calculated. For example, you can generate an annotated list of all books that have a title starting with "Django" using the query::
ru: При использовании с ``annotate()``, фильтр ограничит выборку объектов, для которых необходимо выполнить "аннотацию". Например, чтобы получить список книг, название которых начинается с "Django", и количество авторов книги, используйте::

source: When used with an ``aggregate()`` clause, a filter has the effect of constraining the objects over which the aggregate is calculated. For example, you can generate the average price of all books with a title that starts with "Django" using the query::
ru: При использовании с ``aggregate()``, фильтр ограничит множество объектов, над которыми выполняется агрегация. Например, вы можете получить среднюю цену книг, название которых начинается с "Django"::

source: Filtering on annotations
ru: Фильтрация по "аннотации"

source: Annotated values can also be filtered. The alias for the annotation can be used in ``filter()`` and ``exclude()`` clauses in the same way as any other model field.
ru: "Аннотированные" значения могут быть использованы для фильтрации. Псевдонимы для "аннотированных" значений могут быть использованы в ``filter()`` и ``exclude()`` так же, как и другие поля модели.

source: For example, to generate a list of books that have more than one author, you can issue the query::
ru: Например, чтобы получить список книг хотя бы с одним автором, используем такой код::

source: This query generates an annotated result set, and then generates a filter based upon that annotation.
ru: Этот запрос вычисляет "аннотированное" значение, потом применяет фильтр по этому значению.

source: If you need two annotations with two separate filters you can use the ``filter`` argument with any aggregate. For example, to generate a list of authors with a count of highly rated books::
ru: Если вам необходимы две аннотации с двумя различными фильтрами, вы можете использовать аргумент ``filter`` с любой агрегацией. Например, чтобы сгенерировать список авторов с количеством популярных книг::

source: Each ``Author`` in the result set will have the ``num_books`` and ``highly_rated_books`` attributes.
ru: Каждый ``Author`` в результате будет содержать атрибуты ``num_books`` и ``highly_rated_books``.

source: Choosing between ``filter`` and ``QuerySet.filter()``
ru: Выбор между ``filter`` и ``QuerySet.filter()``

source: Avoid using the ``filter`` argument with a single annotation or aggregation. It's more efficient to use ``QuerySet.filter()`` to exclude rows. The aggregation ``filter`` argument is only useful when using two or more aggregations over the same relations with different conditionals.
ru: Не используйте аргумент ``filter`` с одной аннотацией или агрегацией. Эффективнее использовать ``QuerySet.filter()`` для фильтрации записей. Аргумент ``filter`` полезен только при нескольких агрегаций для одной связи с различными условиями выборки.

source: The ``filter`` argument was added to aggregates.
ru: Для агрегаций был добавлен аргумент ``filter``.

source: Order of ``annotate()`` and ``filter()`` clauses
ru: Порядок ``annotate()`` и ``filter()``

source: When developing a complex query that involves both ``annotate()`` and ``filter()`` clauses, pay particular attention to the order in which the clauses are applied to the ``QuerySet``.
ru: При создании сложного запроса с использованием ``annotate()`` и ``filter()``, необходимо учитывать порядок использования этих методов в ``QuerySet``.

source: When an ``annotate()`` clause is applied to a query, the annotation is computed over the state of the query up to the point where the annotation is requested. The practical implication of this is that ``filter()`` and ``annotate()`` are not commutative operations.
ru: При добавлении ``annotate()`` в запрос аннотация вычисляется над состоянием запроса, которое было на момент её добавления. По этому нужно учитывать, что операции ``filter()`` и ``annotate()`` не коммутативные(порядок важен).

source: Given:
ru: Берем следующий набор данных:

source: Publisher A has two books with ratings 4 and 5.
ru: У издателя A есть две книги с рейтингом 4 и 5.

source: Publisher B has two books with ratings 1 and 4.
ru: У издателя B есть две книги с рейтингом 1 и 4.

source: Publisher C has one book with rating 1.
ru: У издателя C есть одна книга с рейтингом 1.

source: Here's an example with the ``Count`` aggregate::
ru: Пример с агрегацией ``Count``::

source: Both queries return a list of publishers that have at least one book with a rating exceeding 3.0, hence publisher C is excluded.
ru: Оба запроса вернули список издателей, у которых есть хотя бы одна книга с рейтингом выше 3.0, по этому издатель C исключен из выборки.

source: In the first query, the annotation precedes the filter, so the filter has no effect on the annotation. ``distinct=True`` is required to avoid a :ref:`query bug <combining-multiple-aggregations>`.
ru: В первом запросе аннотация следует перед фильтрацией, по этому фильтрация не влияет на аннотацию. ``distinct=True`` необходим, чтобы избежать :ref:`бага с объединением таблиц <combining-multiple-aggregations>`.

source: The second query counts the number of books that have a rating exceeding 3.0 for each publisher. The filter precedes the annotation, so the filter constrains the objects considered when calculating the annotation.
ru: Второй запрос вычисляет количество книг с рейтингом выше 3.0 для каждого издателя. Фильтрация следует перед аннотацией, тем самым влияет на данные, которые используются при вычислении аннотации.

source: Here's another example with the ``Avg`` aggregate::
ru: Еще один пример с ``Avg``::

source: The first query asks for the average rating of all a publisher's books for publisher's that have at least one book with a rating exceeding 3.0. The second query asks for the average of a publisher's book's ratings for only those ratings exceeding 3.0.
ru: Первый запрос вычисляет средний рейтинг книг для издателей, у которых есть хотя бы одна книга с рейтингом выше 3.0. Второй вычисляет средний рейтинг для книг, рейтинг которых выше 3.0.

source: It's difficult to intuit how the ORM will translate complex querysets into SQL queries so when in doubt, inspect the SQL with ``str(queryset.query)`` and write plenty of tests.
ru: Тяжело интуитивно догадаться как ORM преобразует сложный ``QuerySet`` в SQL запрос. По этому изучайте созданный SQL в случае сомнений, используя ``str(queryset.query)``, и покрывайте тестами.

source: Annotations can be used as a basis for ordering. When you define an ``order_by()`` clause, the aggregates you provide can reference any alias defined as part of an ``annotate()`` clause in the query.
ru: Результат "аннотации" может быть использован для сортировки. При определении ``order_by()``, вы можете использовать параметр, указанный в ``annotate()``.

source: For example, to order a ``QuerySet`` of books by the number of authors that have contributed to the book, you could use the following query::
ru: Например, чтобы отсортировать книги из ``QuerySet`` по количеству авторов, используйте запрос::

source: Ordinarily, annotations are generated on a per-object basis - an annotated ``QuerySet`` will return one result for each object in the original ``QuerySet``. However, when a ``values()`` clause is used to constrain the columns that are returned in the result set, the method for evaluating annotations is slightly different. Instead of returning an annotated result for each result in the original ``QuerySet``, the original results are grouped according to the unique combinations of the fields specified in the ``values()`` clause. An annotation is then provided for each unique group; the annotation is computed over all members of the group.
ru: Обычно, аннотация вычисляется для каждого объекта - ``QuerySet`` вернет одно значение для каждого объекта в изначальном ``QuerySet``. Однако, при использовании ``values()`` "аннотация" вычисляется немного по другому. Вместо того, чтобы вычислить значение для каждого объекта ``QuerySet``, сначала все объекты результата будут разделены на группы по уникальному значению полей, указанных в ``values()``. "Аннотация" будет использована для каждой группы и будут использованы значения всех объектов группы.

source: For example, consider an author query that attempts to find out the average rating of books written by each author:
ru: Например, возьмем запрос для получения среднего рейтинга всех книг написанным автором:

source: This will return one result for each author in the database, annotated with their average book rating.
ru: Этот запрос вернет результат для каждого автора в базе данных, "аннотированный" средним рейтингом книг автора.

source: However, the result will be slightly different if you use a ``values()`` clause::
ru: Однако, результат будет другим при использовании ``values()``::

source: In this example, the authors will be grouped by name, so you will only get an annotated result for each *unique* author name. This means if you have two authors with the same name, their results will be merged into a single result in the output of the query; the average will be computed as the average over the books written by both authors.
ru: В этом примере, авторы будут сгруппированы по имени, поэтому вы получите средний рейтинг для *уникального* имени автора. Это означает, что, если в базе есть два автора с одинаковым именем, их результаты будут объединены вместе; среднее значение будет вычислено как среднее значение книг обоих авторов.

source: Order of ``annotate()`` and ``values()`` clauses
ru: Порядок ``annotate()`` и ``values()``
