Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/topics/db/managers.po
Languages: ru

source: Managers
ru: Менеджеры

source: A ``Manager`` is the interface through which database query operations are provided to Django models. At least one ``Manager`` exists for every model in a Django application.
ru: Менеджер(``Manager``) - это интерфейс, через который создаются запросы к моделям Django. Каждая модель имеет хотя бы один менеджер.

source: The way ``Manager`` classes work is documented in :doc:`/topics/db/queries`; this document specifically touches on model options that customize ``Manager`` behavior.
ru: Как работает ``Manager`` описано в разделе :doc:`/topics/db/queries`; этот раздел описывает, как изменить поведение менеджера модели.

source: Manager names
ru: Имя менеджера

source: By default, Django adds a ``Manager`` with the name ``objects`` to every Django model class. However, if you want to use ``objects`` as a field name, or if you want to use a name other than ``objects`` for the ``Manager``, you can rename it on a per-model basis. To rename the ``Manager`` for a given class, define a class attribute of type ``models.Manager()`` on that model. For example::
ru: По умолчанию Django добавляет ``Manager`` с именем ``objects`` для каждого класса модели. Однако, если вы хотите использовать ``objects``, как имя поля, или хотите использовать название, отличное от ``objects`` для ``Manager``, вы можете переименовать его для модели. Чтобы переименовать ``Manager`` добавьте в класс атрибут, значение которого экземпляр ``models.Manager()``. Например::

source: Using this example model, ``Person.objects`` will generate an ``AttributeError`` exception, but ``Person.people.all()`` will provide a list of all ``Person`` objects.
ru: Обращение к ``Person.objects`` вызовет исключение ``AttributeError``, в то время как ``Person.people.all()`` вернет список всех объектов ``Person``.

source: You can use a custom ``Manager`` in a particular model by extending the base ``Manager`` class and instantiating your custom ``Manager`` in your model.
ru: Вы можете использовать собственный менеджер, создав его через наследование от основного класса ``Manager`` и добавив его в модель.

source: There are two reasons you might want to customize a ``Manager``: to add extra ``Manager`` methods, and/or to modify the initial ``QuerySet`` the ``Manager`` returns.
ru: Есть две причины, почему вам может понадобиться изменить ``Manager``: добавить дополнительные методы, и/или изменить базовый ``QuerySet``, который возвращает ``Manager``.

source: Adding extra ``Manager`` methods is the preferred way to add "table-level" functionality to your models. (For "row-level" functionality -- i.e., functions that act on a single instance of a model object -- use :ref:`Model methods <model-methods>`, not custom ``Manager`` methods.)
ru: Добавление дополнительных методов в ``Manager`` - лучший способ добавить "table-level" функционал в вашу модель. (Для "row-level" функционала -- то есть функции, которые работают с одним экземпляром модели -- используйте :ref:`методы модели <model-methods>`, а не методы менеджера.)

source: A custom ``Manager`` method can return anything you want. It doesn't have to return a ``QuerySet``.
ru: Методы ``Manager`` могут возвращать что угодно. И это не обязательно должен быть ``QuerySet``.

source: For example, this custom ``Manager`` offers a method ``with_counts()``, which returns a list of all ``OpinionPoll`` objects, each with an extra ``num_responses`` attribute that is the result of an aggregate query::
ru: Например, этот ``Manager`` имеет метод ``with_counts()``, который возвращает список всех объектов ``OpinionPoll``, каждый из которых содержит дополнительный атрибут ``num_responses`` с результатом агрегации::

source: With this example, you'd use ``OpinionPoll.objects.with_counts()`` to return that list of ``OpinionPoll`` objects with ``num_responses`` attributes.
ru: Вы можете использовать ``OpinionPoll.objects.with_counts()``, чтобы получить список объектов ``OpinionPoll`` с атрибутом ``num_responses``.

source: Another thing to note about this example is that ``Manager`` methods can access ``self.model`` to get the model class to which they're attached.
ru: Стоит отметить, что методы ``Manager`` могут обращаться к ``self.model``, чтобы получить класс модели, которая использует этот менеджер.

source: A ``Manager``’s base ``QuerySet`` returns all objects in the system. For example, using this model::
ru: Базовый ``QuerySet`` менеджера возвращает все объекты модели. Возьмем для примера эту модель::

source: ...the statement ``Book.objects.all()`` will return all books in the database.
ru: ... ``Book.objects.all()`` вернет все книги из базы данных.

source: You can override a ``Manager``’s base ``QuerySet`` by overriding the ``Manager.get_queryset()`` method. ``get_queryset()`` should return a ``QuerySet`` with the properties you require.
ru: Вы можете изменить базовый ``QuerySet``, переопределив метод ``Manager.get_queryset()``. Метод ``get_queryset()`` должен возвращать ``QuerySet`` с необходимыми вам свойствами.

source: For example, the following model has *two* ``Manager``\s -- one that returns all objects, and one that returns only the books by Roald Dahl::
ru: Например, следующая модель содержит *два* менеджера -- один возвращает все книги, второй - только книги Roald Dahl::

source: With this sample model, ``Book.objects.all()`` will return all books in the database, but ``Book.dahl_objects.all()`` will only return the ones written by Roald Dahl.
ru: Для этой простой модели, ``Book.objects.all()`` вернет все книги из базы данных, в то время как ``Book.dahl_objects.all()`` вернет книги Roald Dahl.

source: Of course, because ``get_queryset()`` returns a ``QuerySet`` object, you can use ``filter()``, ``exclude()`` and all the other ``QuerySet`` methods on it. So these statements are all legal::
ru: Конечно же, т.к. ``get_queryset()`` возвращает экземпляр ``QuerySet``, вы можете использовать ``filter()``, ``exclude()`` и остальные методы ``QuerySet``. Таким образом, следующие операторы будут работать::

source: For example::
ru: Например::

source: This example allows you to request ``Person.authors.all()``, ``Person.editors.all()``, and ``Person.people.all()``, yielding predictable results.
ru: Этот пример позволяет выполнить ``Person.authors.all()``, ``Person.editors.all()``, и ``Person.people.all()`` для получения соответствующего результата.

source: Default managers
ru: Менеджеры по умолчанию

source: If you use custom ``Manager`` objects, take note that the first ``Manager`` Django encounters (in the order in which they're defined in the model) has a special status. Django interprets the first ``Manager`` defined in a class as the "default" ``Manager``, and several parts of Django (including :djadmin:`dumpdata`) will use that ``Manager`` exclusively for that model. As a result, it's a good idea to be careful in your choice of default manager in order to avoid a situation where overriding ``get_queryset()`` results in an inability to retrieve objects you'd like to work with.
ru: При использовании собственного объекта ``Manager``, помните, что первый ``Manager``, который заметит Django (в том порядке, в котором они определяются в модели) имеет особый статус. Для Django первый ``Manager`` будет ``Manager`` "по умолчанию", и некоторые компоненты Django (включая :djadmin:`dumpdata`) будут использовать этот ``Manager``. Поэтому нужно быть осторожным при выборе менеджера по умолчанию, чтобы, переопределив ``get_queryset()``, не попасть в ситуацию, когда вы не можете получить нужный объект.

source: Using managers for related object access
ru: Использования менеджеров для получения связанных объектов

source: While most methods from the standard ``QuerySet`` are accessible directly from the ``Manager``, this is only the case for the extra methods defined on a custom ``QuerySet`` if you also implement them on the ``Manager``::
ru: Т.к. большинство методом стандартного ``QuerySet`` доступны из ``Manager``, следующий подход необходимо использовать только для собственных методов переопределенного ``QuerySet``::

source: This example allows you to call both ``authors()`` and ``editors()`` directly from the manager ``Person.people``.
ru: Этот пример позволяет вызывать ``authors()`` и ``editors()`` непосредственно из менеджера ``Person.people``.

source: In lieu of the above approach which requires duplicating methods on both the ``QuerySet`` and the ``Manager``, :meth:`QuerySet.as_manager() <django.db.models.query.QuerySet.as_manager>` can be used to create an instance of ``Manager`` with a copy of a custom ``QuerySet``’s methods::
ru: Вместо подхода, описанного выше, который требует дублирования методов в ``QuerySet`` и ``Manager``, :meth:`QuerySet.as_manager() <django.db.models.query.QuerySet.as_manager>` позволяет создать экземпляр ``Manager`` со всеми методами ``QuerySet``::

source: The ``Manager`` instance created by :meth:`QuerySet.as_manager() <django.db.models.query.QuerySet.as_manager>` will be virtually identical to the ``PersonManager`` from the previous example.
ru: Экземпляр ``Manager``, созданный :meth:`QuerySet.as_manager() <django.db.models.query.QuerySet.as_manager>`, предоставляет интерфейс аналогичный ``PersonManager`` из примера выше.

source: Not every ``QuerySet`` method makes sense at the ``Manager`` level; for instance we intentionally prevent the :meth:`QuerySet.delete() <django.db.models.query.QuerySet.delete>` method from being copied onto the ``Manager`` class.
ru: Не каждый метод ``QuerySet`` следует добавлять в ``Manager``. Например, метод :meth:`QuerySet.delete() <django.db.models.query.QuerySet.delete>` намерено не добавляется в класс ``Manager``.

source: Methods are copied according to the following rules:
ru: Методы копируются в соответствии со следующими правилами:

source: Public methods are copied by default.
ru: Публичные методы копируются по умолчанию.

source: Private methods (starting with an underscore) are not copied by default.
ru: Приватные методы (которые начинаются с подчеркивания) не копируются по умолчанию.

source: Methods with a ``queryset_only`` attribute set to ``False`` are always copied.
ru: Методы с атрибутом ``queryset_only`` равным ``False`` всегда копируются.

source: Methods with a ``queryset_only`` attribute set to ``True`` are never copied.
ru: Методы с атрибутом ``queryset_only`` равным ``True`` никогда не копируются.

source: For advanced usage you might want both a custom ``Manager`` and a custom ``QuerySet``. You can do that by calling ``Manager.from_queryset()`` which returns a *subclass* of your base ``Manager`` with a copy of the custom ``QuerySet`` methods::
ru: В некоторых случаях вы можете создать собственные ``Manager`` и ``QuerySet``. Вы можете вызвать ``Manager.from_queryset()``, который вернет *дочерний класс* вашего базового ``Manager`` с копией методов вашего ``QuerySet``::

source: You may also store the generated class into a variable::
ru: Созданный класс можно сохранить в переменной::

source: Custom managers and model inheritance
ru: Собственные менеджеры и наследование моделей

source: These rules provide the necessary flexibility if you want to install a collection of custom managers on a group of models, via an abstract base class, but still customize the default manager. For example, suppose you have this base class::
ru: Эти правила позволяют достаточно гибко добавить собственные менеджеры в модель через абстрактные модели, в то же время имея возможность переопределить менеджер по умолчанию. Например, у нас есть такой базовый класс::

source: If you use this directly in a subclass, ``objects`` will be the default manager if you declare no managers in the base class::
ru: Унаследовав от него модель, ``objects`` станет менеджером по умолчанию, если мы не определим другой менеджер в дочерней модели ::

source: If you want to inherit from ``AbstractBase``, but provide a different default manager, you can provide the default manager on the child class::
ru: Если вы хотите унаследоваться от ``AbstractBase``, но использовать другой менеджер по умолчанию, вы можете определить менеджер по умолчанию таким способом::

source: Finally for this example, suppose you want to add extra managers to the child class, but still use the default from ``AbstractBase``. You can't add the new manager directly in the child class, as that would override the default and you would have to also explicitly include all the managers from the abstract base class. The solution is to put the extra managers in another base class and introduce it into the inheritance hierarchy *after* the defaults::
ru: Еще один пример. Например, мы хотим добавить еще один менеджер и в то же время оставить менеджер по умолчанию из ``AbstractBase``. Вы не можете просто добавить новый менеджер в дочернюю модель, т.к. вам нужно будет также добавить менеджер из абстрактной модели перед ним, чтобы он был менеджером по умолчанию. Мы можем добавить дополнительный менеджер в другую модель, и добавить в наследование *после* базовой::

source: Note that while you can *define* a custom manager on the abstract model, you can't *invoke* any methods using the abstract model. That is::
ru: Обратите внимание, хотя вы и можете *определить* собственный менеджер для абстрактной модели, вы не можете *вызывать* методы, используя абстрактную модель. То есть::

source: is legal, but::
ru: будет работать, но::

source: will raise an exception. This is because managers are intended to encapsulate logic for managing collections of objects. Since you can't have a collection of abstract objects, it doesn't make sense to be managing them. If you have functionality that applies to the abstract model, you should put that functionality in a ``staticmethod`` or ``classmethod`` on the abstract model.
ru: вызовет исключение. Менеджеры инкапсулируют логику работы с коллекцией объектов. Так как мы не можем создать коллекцию абстрактных объектов, нет смысла использовать менеджер для них. Если вам нужен функционал связанный с абстрактной моделью, добавьте его в ``staticmethod`` или ``classmethod``.

source: Implementation concerns
ru: Проблемы реализации

source: Whatever features you add to your custom ``Manager``, it must be possible to make a shallow copy of a ``Manager`` instance; i.e., the following code must work::
ru: Всегда должно работать копирование экземпляра менеджера, то есть должен работать такой код::

source: Django makes shallow copies of manager objects during certain queries; if your Manager cannot be copied, those queries will fail.
ru: Django выполняет копирование экземпляра менеджера при определенных запросах. Если ваш менеджер нельзя скопировать, эти запросы перестанут работать.

source: This won't be an issue for most custom managers. If you are just adding simple methods to your ``Manager``, it is unlikely that you will inadvertently make instances of your ``Manager`` uncopyable. However, if you're overriding ``__getattr__`` or some other private method of your ``Manager`` object that controls object state, you should ensure that you don't affect the ability of your ``Manager`` to be copied.
ru: Для большинства менеджеров это не будет проблемой. Если вы просто добавите метод в ``Manager``, вряд ли он станет не копируемым. Однако, если вы измените ``__getattr__``, или какой-либо другой приватный метод, который контролирует состояние объекта, вы должны убедиться что объект можно скопировать.
