Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/topics/db/models.po
Languages: ru

source: Your intermediate model must contain one - and *only* one - foreign key to the source model (this would be ``Group`` in our example), or you must explicitly specify the foreign keys Django should use for the relationship using :attr:`ManyToManyField.through_fields <ManyToManyField.through_fields>`. If you have more than one foreign key and ``through_fields`` is not specified, a validation error will be raised. A similar restriction applies to the foreign key to the target model (this would be ``Person`` in our example).
ru: Промежуточная модель должна содержать *только* одну связь с исходной моделью (в нашем примере -- это ``Group``), или вы должны явно указать Django какую связь использовать через параметр :attr:`ManyToManyField.through_fields <ManyToManyField.through_fields>`. Если промежуточная модель содержит несколько связей с исходной модель и ``through_fields`` не указан, будет вызвана ошибка валидации. Аналогичные правила выполняются и для связанной модели (в нашем примере -- ``Person``).

source: For a model which has a many-to-many relationship to itself through an intermediary model, two foreign keys to the same model are permitted, but they will be treated as the two (different) sides of the many-to-many relationship. If there are *more* than two foreign keys though, you must also specify ``through_fields`` as above, or a validation error will be raised.
ru: Исключение - промежуточная модель для рекурсивной связи. В таком случае у промежуточной модели будет два внешних ключа на одну модель, но в таком случае они будут восприниматься как две различных стороны связи многие-ко-многим. Если промежуточная модель содержит *больше* двух связей, необходимо указать ``through_fields``, иначе получите ошибку валидации.

source: When defining a many-to-many relationship from a model to itself, using an intermediary model, you *must* use :attr:`symmetrical=False <ManyToManyField.symmetrical>` (see :ref:`the model field reference <manytomany-arguments>`).
ru: При рекурсивной связи, используя промежуточную модель вы *должны* использовать аргумент :attr:`symmetrical=False <ManyToManyField.symmetrical>` (смотрите :ref:`справку о полях модели <manytomany-arguments>`).

source: Now that you have set up your :class:`~django.db.models.ManyToManyField` to use your intermediary model (``Membership``, in this case), you're ready to start creating some many-to-many relationships. You do this by creating instances of the intermediate model::
ru: После добавления в поле :class:`~django.db.models.ManyToManyField` промежуточной модели (``Membership``, в нашем случае), вы можете создать несколько связей, создавая экземпляр промежуточной модели::

source: Why? You can't just create a relationship between a ``Person`` and a ``Group`` - you need to specify all the detail for the relationship required by the ``Membership`` model. The simple ``add``, ``create`` and assignment calls don't provide a way to specify this extra detail. As a result, they are disabled for many-to-many relationships that use an intermediate model. The only way to create this type of relationship is to create instances of the intermediate model.
ru: Почему? Вы не можете просто создать связь между ``Person`` и ``Group`` - необходимо указать все необходимые подробности для модели ``Membership``. ``add``, ``create`` и присвоение не позволяют указать значения для дополнительных полей, поэтому вы не можете их использовать. Единственный способ - создать экземпляр промежуточной модели.

source: Once you have established the many-to-many relationships by creating instances of your intermediate model, you can issue queries. Just as with normal many-to-many relationships, you can query using the attributes of the many-to-many-related model::
ru: Добавив несколько связей, создав промежуточную модель, вы захотите выполнить несколько запросов для получения данных. Так же, как и для обычной связи, вы можете получить связанные объекты, используя атрибуты связанных моделей::

source: As you are using an intermediate model, you can also query on its attributes::
ru: Вы можете использовать поле промежуточной модели в запросах::

source: If you need to access a membership's information you may do so by directly querying the ``Membership`` model::
ru: Вы можете получить данные непосредственно из модели ``Membership``::

source: Another way to access the same information is by querying the :ref:`many-to-many reverse relationship<m2m-reverse-relationships>` from a ``Person`` object::
ru: Другой способ - используя :ref:`обратную связь<m2m-reverse-relationships>` объекта модели ``Person``::

source: One-to-one relationships
ru: Связь один-к-одному

source: To define a one-to-one relationship, use :class:`~django.db.models.OneToOneField`. You use it just like any other ``Field`` type: by including it as a class attribute of your model.
ru: Для определения связи один-к-одному используется :class:`~django.db.models.OneToOneField`. Вы используете его так же, как и другие типы :class:`~django.db.models.Field`: добавляя как атрибут в модель.

source: This is most useful on the primary key of an object when that object "extends" another object in some way.
ru: Чаще всего связь одни-к-одному используется для первичного ключа для модели, которая "расширяет" другую модель.

source: :class:`~django.db.models.OneToOneField` requires a positional argument: the class to which the model is related.
ru: Для :class:`~django.db.models.OneToOneField` необходимо указать обязательный позиционный аргумент: класс связанной модели.

source: For example, if you were building a database of "places", you would build pretty standard stuff such as address, phone number, etc. in the database. Then, if you wanted to build a database of restaurants on top of the places, instead of repeating yourself and replicating those fields in the ``Restaurant`` model, you could make ``Restaurant`` have a :class:`~django.db.models.OneToOneField` to ``Place`` (because a restaurant "is a" place; in fact, to handle this you'd typically use :ref:`inheritance <model-inheritance>`, which involves an implicit one-to-one relation).
ru: Например, вам необходима база данных "строений", обычным дело будет добавить адрес, номер телефона и др. в базу данных. После, если вы захотите дополнить базу данных строений ресторанами, вместо того, чтобы повторять поля в модели ``Restaurant``, вы можете добавить в модель ``Restaurant`` поле :class:`~django.db.models.OneToOneField` связанное с ``Place`` (т.к. ресторан "это" строение; вы можете использовать :ref:`наследование моделей <model-inheritance>`, которое на самом деле работает через связь один-к-одному).

source: See the :doc:`One-to-one relationship model example </topics/db/examples/one_to_one>` for a full example.
ru: Примеры можно найти в :doc:`этом разделе </topics/db/examples/one_to_one>`.

source: :class:`~django.db.models.OneToOneField` classes used to automatically become the primary key on a model. This is no longer true (although you can manually pass in the :attr:`~django.db.models.Field.primary_key` argument if you like). Thus, it's now possible to have multiple fields of type :class:`~django.db.models.OneToOneField` on a single model.
ru: Раньше :class:`~django.db.models.OneToOneField` автоматически использовались как первичный ключ. Теперь это не так (но вы можете сами указать это используя аргумент :attr:`~django.db.models.Field.primary_key`). Таким образом вы можете иметь несколько связей :class:`~django.db.models.OneToOneField` к одной модели.

source: Models across files
ru: Связь моделей из разных модулей

source: It's perfectly OK to relate a model to one from another app. To do this, import the related model at the top of the file where your model is defined. Then, just refer to the other model class wherever needed. For example::
ru: Нормальная практика использовать связи для моделей из разных приложений. Для этого, импортируйте связанную модель перед определением главной модели и используйте как аргумент для поля. Например::

source: Field name restrictions
ru: Ограничения при выборе названия поля

source: Django places only two restrictions on model field names:
ru: В Django существует только два ограничения:

source: A field name cannot be a Python reserved word, because that would result in a Python syntax error. For example::
ru: Название поля не может быть слово зарезервированное Python, т.к. это приведет к синтаксической ошибке. Например::

source: A field name cannot contain more than one underscore in a row, due to the way Django's query lookup syntax works. For example::
ru: Название поля не может содержать несколько нижних подчеркиваний(_) подряд, т.к. такой подход Django использует для формирования запросов. Например::

source: These limitations can be worked around, though, because your field name doesn't necessarily have to match your database column name. See the :attr:`~Field.db_column` option.
ru: Эти ограничения не сложно соблюдать т.к. название поля не обязано быть таким же, как и название колонки в базе данных. Смотрите аргумент :attr:`~Field.db_column`.

source: SQL reserved words, such as ``join``, ``where`` or ``select``, *are* allowed as model field names, because Django escapes all database table names and column names in every underlying SQL query. It uses the quoting syntax of your particular database engine.
ru: Зарезервированные SQL слова, такие как ``join``, ``where`` или ``select``, *можно* использовать как название поля, потому что Django экранирует название таблиц и полей для каждого SQL запроса. Используются "кавычки"(quoting syntax) базы данных, которую вы используете.

source: Custom field types
ru: Собственные типы полей

source: If one of the existing model fields cannot be used to fit your purposes, or if you wish to take advantage of some less common database column types, you can create your own field class. Full coverage of creating your own fields is provided in :doc:`/howto/custom-model-fields`.
ru: Если ни одно существующее поле не удовлетворяет вашим потребностям, или вам необходимо использовать какие-либо особенности поля, присущие определенной базе данных - вы можете создать собственный тип поля. Подробнее вы можете прочитать в :doc:`/howto/custom-model-fields`.

source: Give your model metadata by using an inner ``class Meta``, like so::
ru: Дополнительные настройки для модели можно определить через ``class Meta``, например::

source: Model metadata is "anything that's not a field", such as ordering options (:attr:`~Options.ordering`), database table name (:attr:`~Options.db_table`), or human-readable singular and plural names (:attr:`~Options.verbose_name` and :attr:`~Options.verbose_name_plural`). None are required, and adding ``class Meta`` to a model is completely optional.
ru: Сюда включено "все что не является полем", например, настройка сортировки по-умолчанию (:attr:`~Options.ordering`), название таблицы базы данных (:attr:`~Options.db_table`), или human-readable название в единственной и множественной форме(:attr:`~Options.verbose_name` и :attr:`~Options.verbose_name_plural`). Все они не обязательны и добавлять ``class Meta`` тоже не обязательно.

source: A complete list of all possible ``Meta`` options can be found in the :doc:`model option reference </ref/models/options>`.
ru: Полный список опций для ``Meta`` можно найти в :doc:`разделе о настройках модели </ref/models/options>`.

source: Model attributes
ru: Атрибуты модели

source: The most important attribute of a model is the :class:`~django.db.models.Manager`. It's the interface through which database query operations are provided to Django models and is used to :ref:`retrieve the instances <retrieving-objects>` from the database. If no custom ``Manager`` is defined, the default name is :attr:`~django.db.models.Model.objects`. Managers are only accessible via model classes, not the model instances.
ru: Самый важный атрибут модели -- :class:`~django.db.models.Manager`. Это интерфейс, через который Django выполняет запросы к базе данных и :ref:`получает объекты <retrieving-objects>`. Если собственный ``Manager`` не указан, название по умолчанию будет :attr:`~django.db.models.Model.objects`. Менеджеры доступны только через класс модели, они не доступны в экземплярах модели.

source: Model methods
ru: Методы модели

source: Define custom methods on a model to add custom "row-level" functionality to your objects. Whereas :class:`~django.db.models.Manager` methods are intended to do "table-wide" things, model methods should act on a particular model instance.
ru: Для добавления функционала работы с экземпляром модели("row-level" functionality), необходимо просто добавить метод в модель. В то время, как методы :class:`~django.db.models.Manager` работают с таблицей, методы модели работают с конкретной записью в таблице.

source: This is a valuable technique for keeping business logic in one place -- the model.
ru: Это хороший подход для хранения бизнес логики работы с данными в одном месте -- модели.

source: For example, this model has a few custom methods::
ru: Например, эта модель содержит два дополнительных метода::

source: The last method in this example is a :term:`property`.
ru: Последний метод в примере - свойство(:term:`property`).

source: The :doc:`model instance reference </ref/models/instances>` has a complete list of :ref:`methods automatically given to each model <model-instance-methods>`. You can override most of these -- see `overriding predefined model methods`_, below -- but there are a couple that you'll almost always want to define:
ru: :doc:`Раздел о моделях </ref/models/instances>` содержит полный список :ref:`методов, автоматически добавляемых в модель<model-instance-methods>`. Вы можете переопределить большинство из них -- смотрите :ref:`overriding-model-methods`, -- но есть методы, которые вы чаще всего определите для каждой модели:

source: A Python "magic method" that returns a unicode "representation" of any object. This is what Python and Django will use whenever a model instance needs to be coerced and displayed as a plain string. Most notably, this happens when you display an object in an interactive console or in the admin.
ru: "Волшебный метод" Python, который возвращает unicode "представление" объекта. Это то, что Python и Django используют для отображения объекта как строки, обычно в консоли, интерфейсе администратора или шаблоне.

source: You'll always want to define this method; the default isn't very helpful at all.
ru: Желательно определить этот метод, т.к. значение по умолчанию не слишком привлекательно.

source: Python 2 equivalent of ``__str__()``.
ru: Python 2 аналог ``__str__()``.

source: This tells Django how to calculate the URL for an object. Django uses this in its admin interface, and any time it needs to figure out a URL for an object.
ru: Этот метод указывает Django, какой URL использовать для объекта. Django использует его в интерфейсе администратора и каждый раз, когда необходимо получить URL для объекта.

source: Any object that has a URL that uniquely identifies it should define this method.
ru: Каждый объект, который имеет уникальный URL должен иметь этот метод.

source: Overriding predefined model methods
ru: Переопределение методов модели

source: There's another set of :ref:`model methods <model-instance-methods>` that encapsulate a bunch of database behavior that you'll want to customize. In particular you'll often want to change the way :meth:`~Model.save` and :meth:`~Model.delete` work.
ru: Существуют другие :ref:`методы модели <model-instance-methods>`, которые инкапсулируют работу с базой данных. Чаще всего вы захотите переопределить метод :meth:`~Model.save` и :meth:`~Model.delete`.

source: You're free to override these methods (and any other model method) to alter behavior.
ru: Вы можете переопределить эти методы и любые другие методы модели.

source: A classic use-case for overriding the built-in methods is if you want something to happen whenever you save an object. For example (see :meth:`~Model.save` for documentation of the parameters it accepts)::
ru: Распространенная задача, это выполнить какое-либо действие после сохранения объекта. Например (принимаемые параметры смотрите :meth:`~Model.save`)::

source: You can also prevent saving::
ru: Вы также можете отменить сохранение::

source: It's important to remember to call the superclass method -- that's that ``super(Blog, self).save(*args, **kwargs)`` business -- to ensure that the object still gets saved into the database. If you forget to call the superclass method, the default behavior won't happen and the database won't get touched.
ru: Не забывайте вызывать родительский метод -- ``super(Blog, self).save(*args, **kwargs)`` -- чтобы объект корректно сохранился в базе данных. Если этого не сделать, данные не будут сохранены в базе данных.

source: It's also important that you pass through the arguments that can be passed to the model method -- that's what the ``*args, **kwargs`` bit does. Django will, from time to time, extend the capabilities of built-in model methods, adding new arguments. If you use ``*args, **kwargs`` in your method definitions, you are guaranteed that your code will automatically support those arguments when they are added.
ru: Также не забывайте о аргументах, которые принимают встроенные методы -- вам поможет ``*args`` и ``**kwargs``. Django иногда использует дополнительные аргументы для методов. Используя ``*args, **kwargs``, можно быть уверенным, что все аргументы будут приняты.

source: Overridden model methods are not called on bulk operations
ru: Переопределенные методы модели не вызываются при множественных операциях(bulk)

source: Note that the :meth:`~Model.delete()` method for an object is not necessarily called when :ref:`deleting objects in bulk using a QuerySet <topics-db-queries-delete>` or as a result of a :attr:`cascading delete <django.db.models.ForeignKey.on_delete>`. To ensure customized delete logic gets executed, you can use :data:`~django.db.models.signals.pre_delete` and/or :data:`~django.db.models.signals.post_delete` signals.
ru: Учтите, метод :meth:`~Model.delete()` не обязательно вызывается при :ref:`массовом удалении объектов через QuerySet<topics-db-queries-delete>`, или как результат :attr:`каскадного удаления <django.db.models.ForeignKey.on_delete>`. Для гарантированного выполнения действий после удаления объекта используйте сигналы :data:`~django.db.models.signals.pre_delete` и/или :data:`~django.db.models.signals.post_delete`.

source: Unfortunately, there isn't a workaround when :meth:`creating<django.db.models.query.QuerySet.bulk_create>` or :meth:`updating<django.db.models.query.QuerySet.update>` objects in bulk, since none of :meth:`~Model.save()`, :data:`~django.db.models.signals.pre_save`, and :data:`~django.db.models.signals.post_save` are called.
ru: К сожалению, вы не сможете изменить логику сохранения объектов при использовании :meth:`creating<django.db.models.query.QuerySet.bulk_create>` или :meth:`updating<django.db.models.query.QuerySet.update>`, так как :meth:`~Model.save()`, :data:`~django.db.models.signals.pre_save` и :data:`~django.db.models.signals.post_save` не будут выполнены.

source: Executing custom SQL
ru: Выполнение SQL запросов

source: Another common pattern is writing custom SQL statements in model methods and module-level methods. For more details on using raw SQL, see the documentation on :doc:`using raw SQL</topics/db/sql>`.
ru: Запросы на чистом SQL лучше выполнять в методе модели. Подробнее о SQL-запросах можно прочитать в :doc:`разделе о запросах на чистом SQL</topics/db/sql>`.

source: Model inheritance
ru: Наследование моделей

source: Model inheritance in Django works almost identically to the way normal class inheritance works in Python, but the basics at the beginning of the page should still be followed. That means the base class should subclass :class:`django.db.models.Model`.
ru: Наследование моделей в Django работает почти так же, как и наследование классов в Python, но следует соблюдать правила, описанные выше. Это означает, что базовый класс должен наследоваться от :class:`django.db.models.Model`.

source: The only decision you have to make is whether you want the parent models to be models in their own right (with their own database tables), or if the parents are just holders of common information that will only be visible through the child models.
ru: Единственное, что вам нужно определить, это должна ли родительская модель быть независимой моделью (с собственной таблицей в базе данных), или же родительская модель просто контейнер для хранения информации, доступной только через дочерние модели.

source: There are three styles of inheritance that are possible in Django.
ru: Существует три вида наследования моделей в Django.

source: Often, you will just want to use the parent class to hold information that you don't want to have to type out for each child model. This class isn't going to ever be used in isolation, so :ref:`abstract-base-classes` are what you're after.
ru: Чаще всего вы будете использовать родительскую модель для хранения общих полей, чтобы не добавлять их в каждую дочернюю модель. Если вы не собираетесь использовать его как независимую модель -- :ref:`abstract-base-classes` то, что вам нужно.

source: If you're subclassing an existing model (perhaps something from another application entirely) and want each model to have its own database table, :ref:`multi-table-inheritance` is the way to go.
ru: Если родительская модель независимая(возможно, из другого приложения) и должна храниться в отдельной таблице, :ref:`multi-table-inheritance` то, что вам нужно.

source: Finally, if you only want to modify the Python-level behavior of a model, without changing the models fields in any way, you can use :ref:`proxy-models`.
ru: Если же вы хотите переопределить поведение модели на уровне Python, не меняя структуры базы данных, вы можете использовать :ref:`proxy-models`.

source: Abstract base classes
ru: Абстрактные модели

source: Abstract base classes are useful when you want to put some common information into a number of other models. You write your base class and put ``abstract=True`` in the :ref:`Meta <meta-options>` class. This model will then not be used to create any database table. Instead, when it is used as a base class for other models, its fields will be added to those of the child class. It is an error to have fields in the abstract base class with the same name as those in the child (and Django will raise an exception).
ru: Абстрактные модели удобны при определении общих, для нескольких моделей, полей. Вы создаете базовую модель и добавляете ``abstract=True`` в класс :ref:`Meta <meta-options>`. Для этой модели не будет создана таблица в базе данных. Используя эту модель как родительскую для другой модели - все ее поля будут добавлены в таблицу в базе данных для этой модели. Нельзя использовать поля с одинаковыми названиями в дочерней и родительской моделях (Django вызовет исключение).

source: An example::
ru: Например::

source: The ``Student`` model will have three fields: ``name``, ``age`` and ``home_group``. The ``CommonInfo`` model cannot be used as a normal Django model, since it is an abstract base class. It does not generate a database table or have a manager, and cannot be instantiated or saved directly.
ru: Модель ``Student`` содержит три поля: ``name``, ``age`` и ``home_group``. Модель ``CommonInfo`` не может использоваться как обычная модель Django, т.к. это абстрактный класс. Она не имеет собственной таблицы в базе данных и не имеет менеджера, нельзя создать экземпляр модели и сохранить его в базе данных.

source: ``Meta`` inheritance
ru: Наследование класса ``Meta``
