Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/topics/db/models.po
Languages: ru

source: When an abstract base class is created, Django makes any :ref:`Meta <meta-options>` inner class you declared in the base class available as an attribute. If a child class does not declare its own :ref:`Meta <meta-options>` class, it will inherit the parent's :ref:`Meta <meta-options>`. If the child wants to extend the parent's :ref:`Meta <meta-options>` class, it can subclass it. For example::
ru: После создания абстрактной модели, Django добавляет класс :ref:`Meta <meta-options>` как атрибут класса. Если дочерний класс не определяет собственный класс :ref:`Meta <meta-options>`, он унаследует родительский класс :ref:`Meta <meta-options>`. Если дочерняя модель хочет расширить родительский :ref:`Meta <meta-options>` класс, она может унаследовать его. Например::

source: Django does make one adjustment to the :ref:`Meta <meta-options>` class of an abstract base class: before installing the :ref:`Meta <meta-options>` attribute, it sets ``abstract=False``. This means that children of abstract base classes don't automatically become abstract classes themselves. Of course, you can make an abstract base class that inherits from another abstract base class. You just need to remember to explicitly set ``abstract=True`` each time.
ru: Django делает одно изменение в :ref:`Meta <meta-options>` для абстрактной модели: перед добавлением в модель изменяет атрибут ``abstract=False``. Это означает что дочерняя модель, наследуя :ref:`Meta <meta-options>`, не становится сама абстрактной моделью. Конечно вы можете создать абстрактную модель, которая наследуется от другой абстрактной модели. Вам только нужно определить атрибут ``abstract=True``.

source: Some attributes won't make sense to include in the :ref:`Meta <meta-options>` class of an abstract base class. For example, including ``db_table`` would mean that all the child classes (the ones that don't specify their own :ref:`Meta <meta-options>`) would use the same database table, which is almost certainly not what you want.
ru: Некоторые атрибуты не имеет смысла добавлять в класс :ref:`Meta <meta-options>` абстрактной модели. Например, добавление ``db_table`` означает, что каждая дочерняя модель(каждая, которая не определяет свой собственный класс :ref:`Meta <meta-options>`) будет использовать туже таблицу в базе данных, что точно не то, что вам нужно.

source: ``'%(class)s'`` is replaced by the lower-cased name of the child class that the field is used in.
ru: ``'%(class)s'`` будет заменен на название дочерней модели, в которой поле используется, в нижнем регистре.

source: ``'%(app_label)s'`` is replaced by the lower-cased name of the app the child class is contained within. Each installed application name must be unique and the model class names within each app must also be unique, therefore the resulting name will end up being different.
ru: ``'%(app_label)s'`` будет заменено на название приложения, в котором находится модель, в нижнем регистре. Название приложения должно быть уникальным, так же, как и название модели в приложении, в результате получится уникальное значение атрибута.

source: For example, given an app ``common/models.py``::
ru: Например, есть приложение с ``common/models.py``::

source: Along with another app ``rare/models.py``::
ru: И еще другое ``rare/models.py``::

source: If you don't specify a :attr:`~django.db.models.ForeignKey.related_name` attribute for a field in an abstract base class, the default reverse name will be the name of the child class followed by ``'_set'``, just as it normally would be if you'd declared the field directly on the child class. For example, in the above code, if the :attr:`~django.db.models.ForeignKey.related_name` attribute was omitted, the reverse name for the ``m2m`` field would be ``childa_set`` in the ``ChildA`` case and ``childb_set`` for the ``ChildB`` field.
ru: Не указав :attr:`~django.db.models.ForeignKey.related_name` для абстрактной модели, для обратной связи будет использовано название дочерней модели плюс ``'_set'``, так же, как при добавлении связи непосредственно в дочернюю модель. Например, в примере выше, без указания :attr:`~django.db.models.ForeignKey.related_name` название для обратной связи поля ``m2m`` будет ``childa_set`` для модели ``ChildA`` и ``childb_set`` для ``ChildB``.

source: Multi-table inheritance
ru: Multi-table наследование

source: The second type of model inheritance supported by Django is when each model in the hierarchy is a model all by itself. Each model corresponds to its own database table and can be queried and created individually. The inheritance relationship introduces links between the child model and each of its parents (via an automatically-created :class:`~django.db.models.OneToOneField`). For example::
ru: Это второй тип наследования в Django - когда каждая модель в иерархии будет независимой. Каждая модель имеет собственную таблицу в базе данных и может быть использована независимо. Наследование использует связь между родительской и дочерней моделью (через автоматически созданное поле :class:`~django.db.models.OneToOneField`). Например::

source: All of the fields of ``Place`` will also be available in ``Restaurant``, although the data will reside in a different database table. So these are both possible::
ru: Все поля ``Place`` будут доступны и в ``Restaurant``, в то время как данные будут храниться в разных таблицах. Например::

source: If you have a ``Place`` that is also a ``Restaurant``, you can get from the ``Place`` object to the ``Restaurant`` object by using the lower-case version of the model name::
ru: Если объект ``Place`` является одновременно и ``Restaurant``, вы можете из объекта ``Place`` получить связанный объект ``Restaurant``, используя название модели в нижнем регистре::

source: However, if ``p`` in the above example was *not* a ``Restaurant`` (it had been created directly as a ``Place`` object or was the parent of some other class), referring to ``p.restaurant`` would raise a ``Restaurant.DoesNotExist`` exception.
ru: Но, если ``p`` в примере выше *не* ``Restaurant`` (был создан непосредственно как объект ``Place`` или был родителем другой модели), использование ``p.restaurant`` вызовет ошибку ``Restaurant.DoesNotExist``.

source: ``Meta`` and multi-table inheritance
ru: ``Meta`` и multi-table наследование

source: In the multi-table inheritance situation, it doesn't make sense for a child class to inherit from its parent's :ref:`Meta <meta-options>` class. All the :ref:`Meta <meta-options>` options have already been applied to the parent class and applying them again would normally only lead to contradictory behavior (this is in contrast with the abstract base class case, where the base class doesn't exist in its own right).
ru: При multi-table наследовании, не имеет смысла дочерней модели наследовать :ref:`Meta <meta-options>` от родительской. Все атрибуты класса :ref:`Meta <meta-options>` уже используются в родительской модели и использование их снова может привести к противоречивому поведению (это отличие от абстрактной модели, которая сама по себе не существует как независимая модель).

source: So a child model does not have access to its parent's :ref:`Meta <meta-options>` class. However, there are a few limited cases where the child inherits behavior from the parent: if the child does not specify an :attr:`~django.db.models.Options.ordering` attribute or a :attr:`~django.db.models.Options.get_latest_by` attribute, it will inherit these from its parent.
ru: Поэтому дочерняя модель не имеет доступа к родительскому классу :ref:`Meta <meta-options>`. Но есть исключения, когда дочерняя модель наследует поведение родительской: если дочерняя модель не определяет атрибут :attr:`~django.db.models.Options.ordering` или :attr:`~django.db.models.Options.get_latest_by`, они будут унаследованы.

source: If the parent has an ordering and you don't want the child to have any natural ordering, you can explicitly disable it::
ru: Если родительская модель определяет сортировку, но вы не хотите ее наследовать в дочерней модели, вы можете указать это таким способом::

source: Inheritance and reverse relations
ru: Наследование и обратные связи

source: Because multi-table inheritance uses an implicit :class:`~django.db.models.OneToOneField` to link the child and the parent, it's possible to move from the parent down to the child, as in the above example. However, this uses up the name that is the default :attr:`~django.db.models.ForeignKey.related_name` value for :class:`~django.db.models.ForeignKey` and :class:`~django.db.models.ManyToManyField` relations. If you are putting those types of relations on a subclass of the parent model, you **must** specify the :attr:`~django.db.models.ForeignKey.related_name` attribute on each such field. If you forget, Django will raise a validation error.
ru: Т.к. multi-table наследование использует :class:`~django.db.models.OneToOneField` для связи родительской и дочерней модели, возможно из родительской модели получить дочернюю, как это показано в примере выше. Используется название по умолчанию для атрибута :attr:`~django.db.models.ForeignKey.related_name` в :class:`~django.db.models.ForeignKey` и :class:`~django.db.models.ManyToManyField`. Если вы используете такие связи на дочернюю модель с аналогичным предком, вы **должны** определить :attr:`~django.db.models.ForeignKey.related_name` для каждого такого поля. Иначе Django вызовет исключение.

source: For example, using the above ``Place`` class again, let's create another subclass with a :class:`~django.db.models.ManyToManyField`::
ru: Например, используя ``Place`` определенную выше, создадим еще одну дочернюю модель с :class:`~django.db.models.ManyToManyField`::

source: This results in the error::
ru: Это приведет к ошибке::

source: Adding ``related_name`` to the ``customers`` field as follows would resolve the error: ``models.ManyToManyField(Place, related_name='provider')``.
ru: Добавление ``related_name`` для поля ``customers`` -- ``models.ManyToManyField(Place, related_name='provider')`` -- решит эту проблему.

source: Specifying the parent link field
ru: Определение связи к родительской модели

source: As mentioned, Django will automatically create a :class:`~django.db.models.OneToOneField` linking your child class back to any non-abstract parent models. If you want to control the name of the attribute linking back to the parent, you can create your own :class:`~django.db.models.OneToOneField` and set :attr:`parent_link=True <django.db.models.OneToOneField.parent_link>` to indicate that your field is the link back to the parent class.
ru: Как уже упоминалось, Django самостоятельно создает :class:`~django.db.models.OneToOneField` для связи дочерней модели с каждой родительской не абстрактной моделью. Если вы хотите определять имя обратной связи для родительской модели, вы можете создать собственный :class:`~django.db.models.OneToOneField` с :attr:`parent_link=True <django.db.models.OneToOneField.parent_link>` чтобы указать, что это поле является связью с родительской моделью.

source: Proxy models
ru: Proxy-модели

source: When using :ref:`multi-table inheritance <multi-table-inheritance>`, a new database table is created for each subclass of a model. This is usually the desired behavior, since the subclass needs a place to store any additional data fields that are not present on the base class. Sometimes, however, you only want to change the Python behavior of a model -- perhaps to change the default manager, or add a new method.
ru: При использовании :ref:`multi-table наследования <multi-table-inheritance>`, будет создана новая таблица в базе данных. Это обязательное требование, т.к. дочерней модели необходимо хранить дополнительные поля. Иногда вам необходимо изменить поведение модели на уровне Python -- переопределить менеджер по умолчанию или добавить новые методы.

source: This is what proxy model inheritance is for: creating a *proxy* for the original model. You can create, delete and update instances of the proxy model and all the data will be saved as if you were using the original (non-proxied) model. The difference is that you can change things like the default model ordering or the default manager in the proxy, without having to alter the original.
ru: Вот для чего используют proxy-модель: создать *proxy* для оригинальной модели. Вы можете создать, изменить или обновить объект proxy модели и все изменения будут сохранены так же, как и при изменении оригинальной(non-proxied) модели. Разница в том, что вы можете изменить сортировку по-умолчанию или менеджер по умолчанию в proxy-модели, без изменения оригинальной модели.

source: Proxy models are declared like normal models. You tell Django that it's a proxy model by setting the :attr:`~django.db.models.Options.proxy` attribute of the ``Meta`` class to ``True``.
ru: Proxy-модели создаются так же, как и обычная модель. Указать что это proxy-модель можно установив атрибут :attr:`~django.db.models.Options.proxy` в классе ``Meta`` в ``True``.

source: For example, suppose you want to add a method to the ``Person`` model. You can do it like this::
ru: Например, вам нужно добавить метод в модель `Person``. Вы можете сделать это так::

source: The ``MyPerson`` class operates on the same database table as its parent ``Person`` class. In particular, any new instances of ``Person`` will also be accessible through ``MyPerson``, and vice-versa::
ru: Модель ``MyPerson`` использует ту же таблицу в базе данных, что и класс ``Person``. Также каждый новый экземпляр модели ``Person``` будет доступен через модель ``MyPerson``, и наоборот::

source: You could also use a proxy model to define a different default ordering on a model. You might not always want to order the ``Person`` model, but regularly order by the ``last_name`` attribute when you use the proxy. This is easy::
ru: Вы также можете использовать proxy модель для определения различной сортировки по умолчанию. Модель ``Person`` не имеет сортировки по умолчанию (намеренно; сортировка трудоемкая операция, и мы не хотим ее использовать при каждом доступе к данным о пользователях). Возможно вы хотите сортировать по полю ``last_name`` при использовании proxy-модели. Это просто::

source: Now normal ``Person`` queries will be unordered and ``OrderedPerson`` queries will be ordered by ``last_name``.
ru: Теперь запросы через ``Person`` будут не отсортированы а для модели ``OrderedPerson`` будут отсортированы по полю ``last_name``.

source: There is no way to have Django return, say, a ``MyPerson`` object whenever you query for ``Person`` objects. A queryset for ``Person`` objects will return those types of objects. The whole point of proxy objects is that code relying on the original ``Person`` will use those and your own code can use the extensions you included (that no other code is relying on anyway). It is not a way to replace the ``Person`` (or any other) model everywhere with something of your own creation.
ru: Нет способа указать Django возвращать объекты модели ``MyPerson`` при запросе через модель ``Person``. QuerySet для модели ``Person`` вернет объекты этого типа. Стоит помнить, что код, который использует модель ``Person``, будет использовать ее независимо от добавления proxy-модели. Вы не можете полностью заменить модель ``Person`` (или любую другую) всюду, где она используется.

source: Base class restrictions
ru: Ограничения базового класса

source: Proxy model managers
ru: Менеджер proxy-модели

source: If you don't specify any model managers on a proxy model, it inherits the managers from its model parents. If you define a manager on the proxy model, it will become the default, although any managers defined on the parent classes will still be available.
ru: Если вы не определите ни один менеджер для proxy-модели, он будет унаследован от родительской модели. Если вы определите менеджер, он будет использован как менеджер по умолчанию, в то же время доступны менеджеры, определенные в родительской модели.

source: Continuing our example from above, you could change the default manager used when you query the ``Person`` model like this::
ru: Используя пример выше, вы можете переопределить менеджер по умолчанию, используемый для получения данных модели ``Person``, таким способом::

source: If you wanted to add a new manager to the Proxy, without replacing the existing default, you can use the techniques described in the :ref:`custom manager <custom-managers-and-inheritance>` documentation: create a base class containing the new managers and inherit that after the primary base class::
ru: Если вы хотите добавить новый менеджер, без замены существующего менеджера, вы можете использовать методы, описанные в разделе о :ref:`собственных менеджерах<custom-managers-and-inheritance>`: создайте базовый класс с новым менеджером и добавьте его в наследование после базового класса::

source: You probably won't need to do this very often, but, when you do, it's possible.
ru: Скорее всего вам это не понадобится, но если все таки понадобится, знайте, что это возможно.

source: If you are mirroring an existing model or database table and don't want all the original database table columns, use ``Meta.managed=False``. That option is normally useful for modeling database views and tables not under the control of Django.
ru: Если вы хотите отобразить существующую модель или таблицу в базе данных без использования всех колонок таблицы, используйте ``Meta.managed=False``. Также это очень полезно для использования таблиц базы данных, которые управляются не Django.

source: If you are wanting to change the Python-only behavior of a model, but keep all the same fields as in the original, use ``Meta.proxy=True``. This sets things up so that the proxy model is an exact copy of the storage structure of the original model when data is saved.
ru: Если вы хотите изменить поведение модели на уровне Python, но использовать все существующие поля таблицы, используйте ``Meta.proxy=True``. Proxy-модель воспринимается как точная копия оригинальной при сохранении данных.

source: Multiple inheritance
ru: Множественное наследование

source: Just as with Python's subclassing, it's possible for a Django model to inherit from multiple parent models. Keep in mind that normal Python name resolution rules apply. The first base class that a particular name (e.g. :ref:`Meta <meta-options>`) appears in will be the one that is used; for example, this means that if multiple parents contain a :ref:`Meta <meta-options>` class, only the first one is going to be used, and all others will be ignored.
ru: Так же, как и наследование в Python, можно использовать множественное наследование моделей Django. Имейте в виду, что используются правила именования Python. Например, есть несколько родительских объектов с классом :ref:`Meta <meta-options>`, в таком случае будет использован атрибут первой родительской модели, остальные будут проигнорированы.

source: Generally, you won't need to inherit from multiple parents. The main use-case where this is useful is for "mix-in" classes: adding a particular extra field or method to every class that inherits the mix-in. Try to keep your inheritance hierarchies as simple and straightforward as possible so that you won't have to struggle to work out where a particular piece of information is coming from.
ru: В большинстве случаев вам не нужно будет использовать множественное наследование. В основном множественное наследование используют для "mix-in" классов: добавление дополнительных полей и методов для каждой модели унаследованной от mix-in класса. Старайтесь содержать иерархию наследования настолько простой и понятной, насколько это возможно, чтобы не возникало проблем с определением, откуда взялась та или другая информация.

source: Note that inheriting from multiple models that have a common ``id`` primary key field will raise an error. To properly use multiple inheritance, you can use an explicit :class:`~django.db.models.AutoField` in the base models::
ru: Обратите внимание, наследование от нескольких моделей, которые содержат первичное поле ``id``, вызовет ошибку. Чтобы избежать этой проблемы, можно явно указать :class:`~django.db.models.AutoField` поля в базовых моделях::

source: Or use a common ancestor to hold the :class:`~django.db.models.AutoField`::
ru: Или использовать общего предка, который содержит поле :class:`~django.db.models.AutoField`::

source: Field name "hiding" is not permitted
ru: Переопределение полей запрещено

source: Overriding fields in a parent model leads to difficulties in areas such as initializing new instances (specifying which field is being initialized in ``Model.__init__``) and serialization. These are features which normal Python class inheritance doesn't have to deal with in quite the same way, so the difference between Django model inheritance and Python class inheritance isn't arbitrary.
ru: Переопределение полей родительской модели приводит к проблемам при создании модели (нельзя точно узнать, какое поле таблицы указывается в ``Model.__init__``) и при сериализации. При наследовании классов в Python работает все немного по другому.

source: This restriction only applies to attributes which are :class:`~django.db.models.Field` instances. Normal Python attributes can be overridden if you wish. It also only applies to the name of the attribute as Python sees it: if you are manually specifying the database column name, you can have the same column name appearing in both a child and an ancestor model for multi-table inheritance (they are columns in two different database tables).
ru: Эти ограничения относятся только для атрибутов, которые являются экземплярами :class:`~django.db.models.Field`. Остальные атрибуты могут быть переопределены. Это также относится к атрибутам классов. Вы можете указать одинаковое название поля в таблице БД для родительской и дочерней моделей т.к. они находятся в разных таблицах.

source: Django will raise a :exc:`~django.core.exceptions.FieldError` if you override any model field in any ancestor model.
ru: Django вызовет исключение :exc:`~django.core.exceptions.FieldError`, если вы переопределите поле родительской модели.

source: Covers all the model related APIs including model fields, related objects, and ``QuerySet``.
ru: Описывает API всего, что связано с моделями.
