Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/topics/db/models.po
Languages: ru

source: Models
ru: Модели

source: A model is the single, definitive source of information about your data. It contains the essential fields and behaviors of the data you're storing. Generally, each model maps to a single database table.
ru: Модели отображают информацию о данных, с которыми вы работаете. Они содержат поля и поведение ваших данных. Обычно одна модель представляет одну таблицу в базе данных.

source: The basics:
ru: Основы:

source: Each model is a Python class that subclasses :class:`django.db.models.Model`.
ru: Каждая модель это класс унаследованный от :class:`django.db.models.Model`.

source: Each attribute of the model represents a database field.
ru: Атрибут модели представляет поле в базе данных.

source: With all of this, Django gives you an automatically-generated database-access API; see :doc:`/topics/db/queries`.
ru: Django предоставляет автоматически созданное API для доступа к данным; смотрите :doc:`/topics/db/queries`.

source: Quick example
ru: Примеры

source: This example model defines a ``Person``, which has a ``first_name`` and ``last_name``::
ru: Вот пример модели, которая определяет гипотетического человека(``Person``), с именем(``first_name``) и фамилией(``last_name``)::

source: ``first_name`` and ``last_name`` are fields_ of the model. Each field is specified as a class attribute, and each attribute maps to a database column.
ru: ``first_name`` и ``last_name`` поля модели. Каждое поле определено как атрибут класса, и каждый атрибут соответствует полю таблицы в базе данных.

source: The above ``Person`` model would create a database table like this:
ru: Модель ``Person`` создаст в базе данных таблицу:

source: Some technical notes:
ru: Технические замечания:

source: The name of the table, ``myapp_person``, is automatically derived from some model metadata but can be overridden. See :ref:`table-names` for more details.
ru: Название таблицы, ``myapp_person``, автоматически создано с метаданных модели и может быть переопределено. Подробнее :ref:`table-names`.

source: An ``id`` field is added automatically, but this behavior can be overridden. See :ref:`automatic-primary-key-fields`.
ru: Поле ``id`` добавлено автоматически, но его также можно переопределить. Подробнее :ref:`automatic-primary-key-fields`.

source: The ``CREATE TABLE`` SQL in this example is formatted using PostgreSQL syntax, but it's worth noting Django uses SQL tailored to the database backend specified in your :doc:`settings file </topics/settings>`.
ru: ``CREATE TABLE`` SQL в этом примере соответствует синтаксису PostgreSQL, но стоит учесть что Django использует синтаксис SQL соответственно настройкам базы данных в :doc:`файле настроек </topics/settings>`.

source: Using models
ru: Использование моделей

source: Once you have defined your models, you need to tell Django you're going to *use* those models. Do this by editing your settings file and changing the :setting:`INSTALLED_APPS` setting to add the name of the module that contains your ``models.py``.
ru: После определения моделей необходимо указать Django что необходимо их *использовать*. Сделайте это отредактировав файл настроек и изменив :setting:`INSTALLED_APPS`, добавив пакет, который содержит ваш ``models.py``.

source: For example, if the models for your application live in the module ``myapp.models`` (the package structure that is created for an application by the :djadmin:`manage.py startapp <startapp>` script), :setting:`INSTALLED_APPS` should read, in part::
ru: Например, если модели вашего приложения находятся в ``myapp.models`` (структура пакетов создана с помощью команды создания приложения :djadmin:`manage.py startapp <startapp>`), :setting:`INSTALLED_APPS` должен содержать::

source: When you add new apps to :setting:`INSTALLED_APPS`, be sure to run :djadmin:`manage.py migrate <migrate>`, optionally making migrations for them first with :djadmin:`manage.py makemigrations <makemigrations>`.
ru: После добавления приложения в :setting:`INSTALLED_APPS`, не забудьте выполнить :djadmin:`manage.py migrate <syncdb>`. Возможно, нужно будет создать сначала миграции, выполнив :djadmin:`manage.py makemigrations <makemigrations>`.

source: Fields
ru: Поля

source: The most important part of a model -- and the only required part of a model -- is the list of database fields it defines. Fields are specified by class attributes. Be careful not to choose field names that conflict with the :doc:`models API </ref/models/instances>` like ``clean``, ``save``, or ``delete``.
ru: Самая важная часть модели -- и единственная обязательная -- это список полей таблицы базы данных которые она представляет. Поля определены атрибутами класса. Нельзя использовать имена конфликтующие с :doc:`API моделей </ref/models/instances>`, такие как ``clean``, ``save`` или ``delete``.

source: Example::
ru: Пример::

source: Field types
ru: Типы полей

source: Each field in your model should be an instance of the appropriate :class:`~django.db.models.Field` class. Django uses the field class types to determine a few things:
ru: Каждое поле в вашей модели должно быть экземпляром соответствующего :class:`~django.db.models.Field` класса. Django использует классы полей для определения такой информации:

source: The default HTML :doc:`widget </ref/forms/widgets>` to use when rendering a form field (e.g. ``<input type="text">``, ``<select>``).
ru: :doc:`Виджет </ref/forms/widgets>` используемый при создании поля формы (например: ``<input type="text">``, ``<select>``).

source: The minimal validation requirements, used in Django's admin and in automatically-generated forms.
ru: Минимальные правила проверки данных, используемые в интерфейсе администратора и для автоматического создания формы.

source: Django ships with dozens of built-in field types; you can find the complete list in the :ref:`model field reference <model-field-types>`. You can easily write your own fields if Django's built-in ones don't do the trick; see :doc:`/howto/custom-model-fields`.
ru: В Django есть большое количество полей; полный список можно посмотреть на :ref:`странице списка полей <model-field-types>`. Вы можете легко добавить собственное поле; смотрите :doc:`/howto/custom-model-fields`.

source: Field options
ru: Настройка полей

source: Each field takes a certain set of field-specific arguments (documented in the :ref:`model field reference <model-field-types>`). For example, :class:`~django.db.models.CharField` (and its subclasses) require a :attr:`~django.db.models.CharField.max_length` argument which specifies the size of the ``VARCHAR`` database field used to store the data.
ru: Для каждого поля есть набор предопределенных аргументов (описание на :ref:`странице описания полей <model-field-types>`). Например, :class:`~django.db.models.CharField` (и унаследованные от него) имеют обязательный аргумент :attr:`~django.db.models.CharField.max_length`, который определяет размер поля ``VARCHAR`` для хранения данных этого поля.

source: There's also a set of common arguments available to all field types. All are optional. They're fully explained in the :ref:`reference <common-model-field-options>`, but here's a quick summary of the most often-used ones:
ru: Также есть список стандартных аргументов для всех полей. Все они не обязательны. Все они описаны в :ref:`разделе про аргументы полей модели<common-model-field-options>`, вот список самых используемых:

source: If ``True``, Django will store empty values as ``NULL`` in the database. Default is ``False``.
ru: Если ``True``, Django сохранит пустое значение как ``NULL`` в базе данных. По умолчанию - ``False``.

source: If ``True``, the field is allowed to be blank. Default is ``False``.
ru: Если ``True``, поле не обязательно и может быть пустым. По умолчанию - ``False``.

source: Note that this is different than :attr:`~Field.null`. :attr:`~Field.null` is purely database-related, whereas :attr:`~Field.blank` is validation-related. If a field has :attr:`blank=True <Field.blank>`, form validation will allow entry of an empty value. If a field has :attr:`blank=False <Field.blank>`, the field will be required.
ru: Это не то же что и :attr:`~Field.null`. :attr:`~Field.null` относится к базе данных, :attr:`~Field.blank` - к проверке данных. Если поле содержит :attr:`blank=True <Field.blank>`, форма позволит передать пустое значение. При :attr:`blank=False <Field.blank>` - поле обязательно.

source: An iterable (e.g., a list or tuple) of 2-tuples to use as choices for this field. If this is given, the default form widget will be a select box instead of the standard text field and will limit choices to the choices given.
ru: Итератор (например, список или кортеж) 2-х элементных кортежей, определяющих варианты значений для поля. При определении, виджет формы использует select вместо стандартного текстового поля и ограничит значение поля указанными значениями.

source: A choices list looks like this::
ru: Список значений выглядит::

source: The default value for the field. This can be a value or a callable object. If callable it will be called every time a new object is created.
ru: Значение по умолчанию для этого поля. Это может быть значение или функция. Если это функция - она будет вызвана при каждом создании объекта.

source: Extra "help" text to be displayed with the form widget. It's useful for documentation even if your field isn't used on a form.
ru: Подсказка, отображаемая в поле формы. Это полезно для описания поля, даже если поле не используется в формах.

source: If ``True``, this field is the primary key for the model.
ru: При ``True`` поле будет первичным ключом.

source: If you don't specify :attr:`primary_key=True <Field.primary_key>` for any fields in your model, Django will automatically add an :class:`IntegerField` to hold the primary key, so you don't need to set :attr:`primary_key=True <Field.primary_key>` on any of your fields unless you want to override the default primary-key behavior. For more, see :ref:`automatic-primary-key-fields`.
ru: Если :attr:`primary_key=True <Field.primary_key>` не указан ни для одного поля, Django самостоятельно добавит поле типа :class:`IntegerField` для хранения первичного ключа, поэтому вам не обязательно указывать :attr:`primary_key=True <Field.primary_key>` для каждой модели. Подробнее :ref:`automatic-primary-key-fields`.

source: The primary key field is read-only. If you change the value of the primary key on an existing object and then save it, a new object will be created alongside the old one. For example::
ru: Поле первичного ключа доступно только для чтения. Если вы поменяете значение первичного ключа для существующего объекта, а зачем сохраните его, будет создан новый объект рядом с существующим. Например::

source: If ``True``, this field must be unique throughout the table.
ru: При ``True`` поле будет уникальным.

source: Again, these are just short descriptions of the most common field options. Full details can be found in the :ref:`common model field option reference <common-model-field-options>`.
ru: Это краткое описание самых используемых аргументов. Полный список можно найти на :ref:`странице описания аргументов поля модели <common-model-field-options>`.

source: Automatic primary key fields
ru: Первичный ключ по умолчанию

source: By default, Django gives each model the following field::
ru: По умолчанию Django для каждой модели добавляет такое поле::

source: This is an auto-incrementing primary key.
ru: Это автоинкрементный первичный ключ.

source: If you'd like to specify a custom primary key, just specify :attr:`primary_key=True <Field.primary_key>` on one of your fields. If Django sees you've explicitly set :attr:`Field.primary_key`, it won't add the automatic ``id`` column.
ru: Для его переопределения просто укажите :attr:`primary_key=True <Field.primary_key>` для одного из полей. При этом Django не добавит поле ``id``.

source: Each model requires exactly one field to have :attr:`primary_key=True <Field.primary_key>` (either explicitly declared or automatically added).
ru: Каждая модель должна иметь хотя бы одно поле с :attr:`primary_key=True <Field.primary_key>` (явно указанное или созданное автоматически).

source: Verbose field names
ru: Читабельное имя поля

source: Each field type, except for :class:`~django.db.models.ForeignKey`, :class:`~django.db.models.ManyToManyField` and :class:`~django.db.models.OneToOneField`, takes an optional first positional argument -- a verbose name. If the verbose name isn't given, Django will automatically create it using the field's attribute name, converting underscores to spaces.
ru: Каждое поле, кроме :class:`~django.db.models.ForeignKey`, :class:`~django.db.models.ManyToManyField` и :class:`~django.db.models.OneToOneField`, первым аргументом принимает необязательное читабельное название. Если оно не указано, Django самостоятельно создаст его, используя название поля, заменяя подчеркивание на пробел.

source: In this example, the verbose name is ``"person's first name"``::
ru: В этом примере читабельное название - ``"person's first name"``::

source: In this example, the verbose name is ``"first name"``::
ru: Здесь - ``"first name"``::

source: :class:`~django.db.models.ForeignKey`, :class:`~django.db.models.ManyToManyField` and :class:`~django.db.models.OneToOneField` require the first argument to be a model class, so use the :attr:`~Field.verbose_name` keyword argument::
ru: :class:`~django.db.models.ForeignKey`, :class:`~django.db.models.ManyToManyField` и :class:`~django.db.models.OneToOneField` первым аргументом принимает класс модели, поэтому используется keyword аргумент :attr:`~Field.verbose_name`::

source: The convention is not to capitalize the first letter of the :attr:`~Field.verbose_name`. Django will automatically capitalize the first letter where it needs to.
ru: Django не делает первую букву прописной для :attr:`~Field.verbose_name` - только там, где это необходимо.

source: Relationships
ru: Связи

source: Clearly, the power of relational databases lies in relating tables to each other. Django offers ways to define the three most common types of database relationships: many-to-one, many-to-many and one-to-one.
ru: Основное преимущество реляционных баз данных - возможность добавлять связи для таблиц. Django предоставляет возможность использовать три самых используемых типа связей: многое-к-одному, многие-ко-многим и один-к-одному.

source: Many-to-one relationships
ru: Связь многое-к-одному

source: To define a many-to-one relationship, use :class:`django.db.models.ForeignKey`. You use it just like any other :class:`~django.db.models.Field` type: by including it as a class attribute of your model.
ru: Для определения связи многое-к-одному используется :class:`django.db.models.ForeignKey`. Вы используете его так же, как и другие типы :class:`~django.db.models.Field`: добавляя как атрибут в модель.

source: :class:`~django.db.models.ForeignKey` requires a positional argument: the class to which the model is related.
ru: Для :class:`~django.db.models.ForeignKey` необходимо указать обязательный позиционный аргумент: класс связанной модели.

source: For example, if a ``Car`` model has a ``Manufacturer`` -- that is, a ``Manufacturer`` makes multiple cars but each ``Car`` only has one ``Manufacturer`` -- use the following definitions::
ru: Например, если модель ``Car`` содержит информацию о ``Manufacturer`` -- это отношение многое-к-одному. ``Manufacturer`` производит много ``Car``, которая связана только с одной ``Manufacturer`` -- используйте следующее определение::

source: You can also create :ref:`recursive relationships <recursive-relationships>` (an object with a many-to-one relationship to itself) and :ref:`relationships to models not yet defined <lazy-relationships>`; see :ref:`the model field reference <ref-foreignkey>` for details.
ru: Вы можете также создать :ref:`рекурсивную связь<recursive-relationships>` (объект со связью многое-к-одному на себя) и :ref:`связь с моделью, которая еще не определена <lazy-relationships>`; смотрите :ref:`справку по полям модели<ref-foreignkey>` для подробностей.

source: It's suggested, but not required, that the name of a :class:`~django.db.models.ForeignKey` field (``manufacturer`` in the example above) be the name of the model, lowercase. You can, of course, call the field whatever you want. For example::
ru: Желательно, но не обязательно, чтобы название :class:`~django.db.models.ForeignKey` поля (``manufacturer`` в примере выше) было названием модели в нижнем регистре. Конечно же вы можете назвать поле, как вам угодно. Например::

source: :class:`~django.db.models.ForeignKey` fields accept a number of extra arguments which are explained in :ref:`the model field reference <foreign-key-arguments>`. These options help define how the relationship should work; all are optional.
ru: :class:`~django.db.models.ForeignKey` принимает дополнительные аргументы, смотрите :ref:`справку по полям модели<foreign-key-arguments>`. Эти аргументы определяют, как работает связь, все они не обязательны.

source: For details on accessing backwards-related objects, see the :ref:`Following relationships backward example <backwards-related-objects>`.
ru: Пример работы с обратно-связанными объектами смотрите в :ref:`в соответствующем разделе<backwards-related-objects>`.

source: For sample code, see the :doc:`Many-to-one relationship model example </topics/db/examples/many_to_one>`.
ru: Примеры кода можно найти в :doc:`соответствующем разделе </topics/db/examples/many_to_one>`.

source: Many-to-many relationships
ru: Связь много-ко-многому

source: To define a many-to-many relationship, use :class:`~django.db.models.ManyToManyField`. You use it just like any other :class:`~django.db.models.Field` type: by including it as a class attribute of your model.
ru: Для определения связи многие-ко-многим, используйте :class:`~django.db.models.ManyToManyField`. Используется так же, как и остальные типы :class:`~django.db.models.Field`: добавлением как атрибут класса.

source: :class:`~django.db.models.ManyToManyField` requires a positional argument: the class to which the model is related.
ru: Для :class:`~django.db.models.ManyToManyField` необходимо указать обязательный позиционный аргумент: класс связанной модели.

source: For example, if a ``Pizza`` has multiple ``Topping`` objects -- that is, a ``Topping`` can be on multiple pizzas and each ``Pizza`` has multiple toppings -- here's how you'd represent that::
ru: Например, если пицца(``Pizza``) содержит много добавок(``Topping``) -- то есть добавки(``Topping``) могут быть в различных сортах пиццы(``Pizza``) -- вот как вы можете представить это::

source: It's suggested, but not required, that the name of a :class:`~django.db.models.ManyToManyField` (``toppings`` in the example above) be a plural describing the set of related model objects.
ru: Желательно, но не обязательно, чтобы название поля :class:`~django.db.models.ManyToManyField` (``toppings`` в нашем примере) было множественным называнием связанных объектов.

source: It doesn't matter which model has the :class:`~django.db.models.ManyToManyField`, but you should only put it in one of the models -- not both.
ru: Не имеет значения какая модель содержит поле :class:`~django.db.models.ManyToManyField`, но вы должны добавить его только для одной модели.

source: Generally, :class:`~django.db.models.ManyToManyField` instances should go in the object that's going to be edited on a form. In the above example, ``toppings`` is in ``Pizza`` (rather than ``Topping`` having a ``pizzas`` :class:`~django.db.models.ManyToManyField` ) because it's more natural to think about a pizza having toppings than a topping being on multiple pizzas. The way it's set up above, the ``Pizza`` form would let users select the toppings.
ru: Обычно, :class:`~django.db.models.ManyToManyField` необходимо добавить в модель, которая будет редактироваться в форме. В примере выше, ``toppings`` добавлено в ``Pizza`` (вместо того, чтобы добавить поле ``pizzas`` типа :class:`~django.db.models.ManyToManyField` в модель ``Topping``), потому что обычно думают о пицце с ингредиентами, а не об ингредиентах в различных пиццах. В примере выше, форма для ``Pizza`` позволит пользователям редактировать ингредиенты для пиццы.

source: See the :doc:`Many-to-many relationship model example </topics/db/examples/many_to_many>` for a full example.
ru: Примеры использования связи многие-ко-многим можно найти в :doc:`соответствующем разделе </topics/db/examples/many_to_many>`

source: :class:`~django.db.models.ManyToManyField` fields also accept a number of extra arguments which are explained in :ref:`the model field reference <manytomany-arguments>`. These options help define how the relationship should work; all are optional.
ru: Поле :class:`~django.db.models.ManyToManyField` принимает список дополнительных аргументов, подробнее в разделе :ref:`справки о полях модели<manytomany-arguments>`. Эти настройки помогают определить как работает связь, все они не обязательны.

source: Extra fields on many-to-many relationships
ru: Дополнительные поля для связи многие-ко-многим

source: When you're only dealing with simple many-to-many relationships such as mixing and matching pizzas and toppings, a standard :class:`~django.db.models.ManyToManyField` is all you need. However, sometimes you may need to associate data with the relationship between two models.
ru: В примере про пиццу нам нужно было всего лишь указать ингредиенты для пиццы, и поля :class:`~django.db.models.ManyToManyField` было достаточно для этого. Но иногда необходимо хранить дополнительную информацию о связи.

source: For example, consider the case of an application tracking the musical groups which musicians belong to. There is a many-to-many relationship between a person and the groups of which they are a member, so you could use a :class:`~django.db.models.ManyToManyField` to represent this relationship. However, there is a lot of detail about the membership that you might want to collect, such as the date at which the person joined the group.
ru: Например, разберем приложение о музыкальных группах и музыкантах. Для хранения связи между музыкантами и группами мы можем использовать поле :class:`~django.db.models.ManyToManyField`. Но нам также необходимо хранить дополнительную информацию, например, когда музыкант вступил в группу.

source: For these situations, Django allows you to specify the model that will be used to govern the many-to-many relationship. You can then put extra fields on the intermediate model. The intermediate model is associated with the :class:`~django.db.models.ManyToManyField` using the :attr:`through <ManyToManyField.through>` argument to point to the model that will act as an intermediary. For our musician example, the code would look something like this::
ru: Для таких случаев Django позволяет определить модель для хранения связи многие-ко-многим и дополнительной информации. Теперь вы можете добавить дополнительные поля в эту модель. Эту промежуточную модель можно указать в поле :class:`~django.db.models.ManyToManyField` используя аргумент :attr:`through <ManyToManyField.through>`, который указывает на промежуточную модель. Для нашего примера код будет приблизительно таким::

source: When you set up the intermediary model, you explicitly specify foreign keys to the models that are involved in the many-to-many relationship. This explicit declaration defines how the two models are related.
ru: В промежуточной модели необходимо добавить внешние ключи на модели, связанные отношением многие-ко-многим. Эти ключи указывают как связаны модели.

source: There are a few restrictions on the intermediate model:
ru: Есть несколько ограничений для промежуточной модели:
