Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/topics/db/multi-db.po
Languages: ru

source: Use the ``using`` keyword to ``Model.save()`` to specify to which database the data should be saved.
ru: Используйте именованный аргумент ``using`` для метода ``Model.save()``, чтобы указать базу данных, в которую должны быть записаны данные.

source: For example, to save an object to the ``legacy_users`` database, you'd use this::
ru: Например, для сохранения объекта в базе данных ``legacy_users``, вам потребуется сделать::

source: If you don't specify ``using``, the ``save()`` method will save into the default database allocated by the routers.
ru: Если вы не укажете ``using`` в методе ``save()``, то запись будет произведена в стандартную базу данных, которую выберет роутер.

source: Moving an object from one database to another
ru: Перемещение объекта между базами данных

source: If you've saved an instance to one database, it might be tempting to use ``save(using=...)`` as a way to migrate the instance to a new database. However, if you don't take appropriate steps, this could have some unexpected consequences.
ru: При сохранении экземпляра данных в одну базу данных, может показаться заманчивым использовать ``save(using=...)`` в качестве способа переноса экземпляра данных в новую базу данных. Однако, если вы не предприняли соответствующих действий, такой подход может привести к неожиданным последствиям.

source: Consider the following example::
ru: Рассмотрим следующий пример::

source: In statement 1, a new ``Person`` object is saved to the ``first`` database. At this time, ``p`` doesn't have a primary key, so Django issues an SQL ``INSERT`` statement. This creates a primary key, and Django assigns that primary key to ``p``.
ru: В первом операторе создаётся новый объект ``Person`` в базе данных ``first``. В этот момент ``p`` не обладает первичным ключом, поэтому Djangо выполняет SQL запрос ``INSERT``. Запрос создаёт первичный ключ и Django назначает его для ``p``.

source: When the save occurs in statement 2, ``p`` already has a primary key value, and Django will attempt to use that primary key on the new database. If the primary key value isn't in use in the ``second`` database, then you won't have any problems -- the object will be copied to the new database.
ru: При сохранении объекта во втором операторе, ``p`` уже обладает первичным ключом и Django попытается использовать его для новой базы данных. Если значение первичного ключа ещё не было использовано в базе данных ``second``, то вы не заметите никаких проблем, объект будет скопирован в новую базу данных.

source: However, if the primary key of ``p`` is already in use on the ``second`` database, the existing object in the ``second`` database will be overridden when ``p`` is saved.
ru: Тем не менее, если первичный ключ ``p`` уже используется в базе данных ``second``, то произойдёт перезапись объекта с таким ключом данными объекта ``p``.

source: You can avoid this in two ways. First, you can clear the primary key of the instance. If an object has no primary key, Django will treat it as a new object, avoiding any loss of data on the ``second`` database::
ru: Этого можно избежать двумя способами. Первый, вы можете очищать значение первичного ключа в экземпляре. Если объект не имеет первичного ключа, Django считает его новым, не позволяя потерь данных в базе ``second``::

source: The second option is to use the ``force_insert`` option to ``save()`` to ensure that Django does an SQL ``INSERT``::
ru: Вторым способом будет использование параметра ``force_insert`` метода ``save()``, чтобы явно заставить Django использовать SQL запрос ``INSERT``::

source: This will ensure that the person named ``Fred`` will have the same primary key on both databases. If that primary key is already in use when you try to save onto the ``second`` database, an error will be raised.
ru: Это обеспечит одинаковое значение первичного ключа для персоны ``Fred`` в обоих базах данных. Если такой первичный ключ уже используется в базе данных ``second``, то будет выброшена ошибка.

source: Selecting a database to delete from
ru: Выбор базы для удаления данных

source: By default, a call to delete an existing object will be executed on the same database that was used to retrieve the object in the first place::
ru: По-умолчанию, удаление существующего объекта будет выполнено в той же базе данных из которой объект был получен::

source: To specify the database from which a model will be deleted, pass a ``using`` keyword argument to the ``Model.delete()`` method. This argument works just like the ``using`` keyword argument to ``save()``.
ru: Для указания базы данных из которой должна быть удалена модель, передайте именованный аргумент ``using`` в метод ``Model.delete()``. Этот аргумент работает аналогично такому же аргументу метода ``save()``.

source: For example, if you're migrating a user from the ``legacy_users`` database to the ``new_users`` database, you might use these commands::
ru: Например, если вы перемещаете пользователя из базы данных ``legacy_users`` в базу данных ``new_users``, вы можете использовать эти команды::

source: Using managers with multiple databases
ru: Использование менеджеров с множеством баз данных

source: Use the ``db_manager()`` method on managers to give managers access to a non-default database.
ru: Используйте ``db_manager()`` метод менеджеров, чтобы дать им доступ к нестандартной базе данных.

source: For example, say you have a custom manager method that touches the database -- ``User.objects.create_user()``. Because ``create_user()`` is a manager method, not a ``QuerySet`` method, you can't do ``User.objects.using('new_users').create_user()``. (The ``create_user()`` method is only available on ``User.objects``, the manager, not on ``QuerySet`` objects derived from the manager.) The solution is to use ``db_manager()``, like this::
ru: Например, у вас есть свой метод менеджера, который изменяет данные в базе -- ``User.objects.create_user()``. Так как ``create_user()`` является методом менеджера, а не запроса, вы не можете сделать ``User.objects.using('new_users').create_user()``. (Метод ``create_user()`` доступен только в ``User.objects``, в менеджере, а не в объектах запроса, полученных из менеджера.) Решением будет использование метода ``db_manager()``, например так::

source: ``db_manager()`` returns a copy of the manager bound to the database you specify.
ru: ``db_manager()`` возвращает копию менеджера для указанной вами базы данных.

source: Using ``get_queryset()`` with multiple databases
ru: Использование ``get_queryset()`` с множеством баз данных

source: If you're overriding ``get_queryset()`` on your manager, be sure to either call the method on the parent (using ``super()``) or do the appropriate handling of the ``_db`` attribute on the manager (a string containing the name of the database to use).
ru: Если вы переопределяете ``get_queryset()`` в вашем менеджере, удостоверьтесь, что вызываете метод родительского объекта (через ``super()``) или выполняйте соответствующую обработку атрибута ``_db`` в менеджере (строка, содержащая имя используемой базы данных).

source: For example, if you want to return a custom ``QuerySet`` class from the ``get_queryset`` method, you could do this::
ru: Например, если требуется вернуть свой класс ``QuerySet`` из метода ``get_queryset()``, то можно поступить так::

source: Exposing multiple databases in Django's admin interface
ru: Использование множества баз данных в интерфейсе администратора

source: Django's admin doesn't have any explicit support for multiple databases. If you want to provide an admin interface for a model on a database other than that specified by your router chain, you'll need to write custom :class:`~django.contrib.admin.ModelAdmin` classes that will direct the admin to use a specific database for content.
ru: Интерфейс администратора Django не имеет явной поддержки для использования множества баз данных. Если вам требуется предоставить интерфейс для модели в базе данных, отличной от указанной в вашей цепочке роутеров, то потребуется написать свои классы :class:`~django.contrib.admin.ModelAdmin`, которые будут обеспечивать доступ к требуемой базе данных.

source: ``ModelAdmin`` objects have five methods that require customization for multiple-database support::
ru: Объекты ``ModelAdmin`` имеют пять методов, которые требуют внесения изменений для поддержки множества баз данных::

source: The implementation provided here implements a multi-database strategy where all objects of a given type are stored on a specific database (e.g., all ``User`` objects are in the ``other`` database). If your usage of multiple databases is more complex, your ``ModelAdmin`` will need to reflect that strategy.
ru: Данная реализация обеспечивает мульти-БД стратегий, где все объекты определённого типа хранятся в указанной базе данных (т.е. все объекты ``User`` хранятся в базе данных ``other``). Если ваша конфигурация множества баз данных более сложна, тогда ваши ``ModelAdmin`` должны соответствовать вашей стратегии.

source: :class:`~django.contrib.admin.InlineModelAdmin` objects can be handled in a similar fashion. They require three customized methods::
ru: :class:`~django.contrib.admin.InlineModelAdmin` обекты могут обрабатываться аналогично. Они требуют три метода::

source: Once you've written your model admin definitions, they can be registered with any ``Admin`` instance::
ru: После создания определений для ваших моделей, они могут быть зарегистрированы в любом экземпляре ``Admin``::

source: This example sets up two admin sites. On the first site, the ``Author`` and ``Publisher`` objects are exposed; ``Publisher`` objects have a tabular inline showing books published by that publisher. The second site exposes just publishers, without the inlines.
ru: Этот пример настраивает два административных сайта. На первом отображаются объекты ``Author`` и ``Publisher``. Объекты ``Publisher`` имеют табличный инлайн, показывающий книги данного издателя. Второй сайт отображает просто издателей, без инлайнов.

source: Using raw cursors with multiple databases
ru: Использование raw курсоров с множеством баз данных

source: If you are using more than one database you can use ``django.db.connections`` to obtain the connection (and cursor) for a specific database. ``django.db.connections`` is a dictionary-like object that allows you to retrieve a specific connection using its alias::
ru: При использовании нескольких баз данных вы можете применять ``django.db.connections`` для получения соединения (и курсора) с указанной базой данных. Объект ``django.db.connections`` является словарным объектом, который позволяет вам получать нужное соединение, указав его псевдоним::

source: Limitations of multiple databases
ru: Ограничения в использовании множества баз данных

source: Cross-database relations
ru: Связи между базами данных

source: Django doesn't currently provide any support for foreign key or many-to-many relationships spanning multiple databases. If you have used a router to partition models to different databases, any foreign key and many-to-many relationships defined by those models must be internal to a single database.
ru: В настоящее время Django не предоставляет поддержки для внешних ключей и связей многие-ко-многим между множеством баз данных. Если вы используете роутер для распределения моделей по различным базам данных, любой внешний ключ и связи многие-ко-многим, определённые для этих моделей, должны быть выполнены внутри одной базы данных.

source: This is because of referential integrity. In order to maintain a relationship between two objects, Django needs to know that the primary key of the related object is valid. If the primary key is stored on a separate database, it's not possible to easily evaluate the validity of a primary key.
ru: Всему причиной является ссылочная целостность. Для того, чтобы осуществлять связь между двумя объектами, Django должно знать, что первичный ключ связанного объекта является верным. Если первичный ключ сохранён в отдельной базе данных, не существует возможности простого вычисления верности этого первичного ключа.

source: If you're using Postgres, Oracle, or MySQL with InnoDB, this is enforced at the database integrity level -- database level key constraints prevent the creation of relations that can't be validated.
ru: При использовании Postgres, Oracle или MySQL с движком InnoDB, это выполняется на уровне целостности базы данных - ограничения на ключи на уровне базы данных не допускают создание связей, которые нельзя проверить.

source: However, if you're using SQLite or MySQL with MyISAM tables, there is no enforced referential integrity; as a result, you may be able to 'fake' cross database foreign keys. However, this configuration is not officially supported by Django.
ru: Тем не менее, если вы используете SQLite или MySQL с движком MyISAM, никакой ссылочной целостности нет. В результате, вы можете создавать "плюшевые" внешние ключи между базами данных. Однако, эта конфигурация не попадает в список официально поддерживаемых Django.

source: Behavior of contrib apps
ru: Поведение contrib приложений

source: Several contrib apps include models, and some apps depend on others. Since cross-database relationships are impossible, this creates some restrictions on how you can split these models across databases:
ru: Несколько поставляемых приложений содержат модели, а некоторые приложения зависят от других. Так как невозможно достичь меж-БД целостности, это создаёт некоторые ограничения на распределение этих моделей между базами данных:

source: each one of ``contenttypes.ContentType``, ``sessions.Session`` and ``sites.Site`` can be stored in any database, given a suitable router.
ru: каждый элемент ``contenttypes.ContentType``, ``sessions.Session`` и ``sites.Site`` может быть сохранён в любой базе данных, используя соответствующий роутер.

source: ``auth`` models — ``User``, ``Group`` and ``Permission`` — are linked together and linked to ``ContentType``, so they must be stored in the same database as ``ContentType``.
ru: Модели приложения ``auth`` — ``User``, ``Group`` и ``Permission`` — соединены друг с другом и с ``ContentType``, таким образом, они должны быть сохранены в той же базе данных, что и ``ContentType``.

source: ``admin`` depends on ``auth``, so its models must be in the same database as ``auth``.
ru: Приложение ``admin`` зависит от приложения ``auth``, таким образом, его модели должны располагаться в той же базе данных, что и модели приложения ``auth``.

source: ``flatpages`` and ``redirects`` depend on ``sites``, so their models must be in the same database as ``sites``.
ru: Приложения ``flatpages`` и ``redirects`` зависят от приложения ``sites``, таким образом их модели должны располагаться в той же базе данных, что и модели приложения ``sites``.

source: In addition, some objects are automatically created just after :djadmin:`migrate` creates a table to hold them in a database:
ru: В дополнение, некоторые объекты автоматически создаются после того как :djadmin:`migrate` создаёт таблицу для их хранения в базе данных:

source: a default ``Site``,
ru: стандартный ``Site``,

source: a ``ContentType`` for each model (including those not stored in that database),
ru: ``ContentType`` для каждой модели (включая те, что не сохранены в базе данных),

source: three ``Permission`` for each model (including those not stored in that database).
ru: три ``Permission`` для каждой модели (включая те, что не сохранены в базе данных).

source: For common setups with multiple databases, it isn't useful to have these objects in more than one database. Common setups include primary/replica and connecting to external databases. Therefore, it's recommended to write a :ref:`database router<topics-db-multi-db-routing>` that allows synchronizing these three models to only one database. Use the same approach for contrib and third-party apps that don't need their tables in multiple databases.
ru: В стандартных конфигурациях с множеством баз данных, не будет полезным распределять эти объекты по разным базам данных. Стандартные конфигурации включают в себя главную базу данных и реплики, а также подключение к внешним базам данных. В этом случае рекомендуется создать :ref:`роутер<topics-db-multi-db-routing>`, который позволит синхронизировать эти три модели в одной базе данных. Используйте аналогичный подход для поставляемых (contrib) приложений и сторонних приложений, которые не требуют распределение своих моделей по нескольким базам данных.

source: If you're synchronizing content types to more than one database, be aware that their primary keys may not match across databases. This may result in data corruption or data loss.
ru: Если вы синхронизируете типы контента по нескольким базам данных, обеспечьте уникальность их первичных ключей на уровне всех баз данных. Иначе вы можете столкнуться с потерей или порчей данных.
