Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/topics/db/multi-db.po
Languages: ru

source: Multiple databases
ru: Использование нескольких баз данных

source: This topic guide describes Django's support for interacting with multiple databases. Most of the rest of Django's documentation assumes you are interacting with a single database. If you want to interact with multiple databases, you'll need to take some additional steps.
ru: Этот документ описывает функционал Django для работы с несколькими базами данных. Большая часть документации Django предполагает, что вы работаете с единственной базой данных. Если вам требуется работать с несколькими базами данных, вам понадобится выполнить ряд дополнительных действий.

source: Defining your databases
ru: Определение ваших баз данных

source: The first step to using more than one database with Django is to tell Django about the database servers you'll be using. This is done using the :setting:`DATABASES` setting. This setting maps database aliases, which are a way to refer to a specific database throughout Django, to a dictionary of settings for that specific connection. The settings in the inner dictionaries are described fully in the :setting:`DATABASES` documentation.
ru: Первым шагом к использованию нескольких баз данных с Django будет определение серверов БД, которые вы планируете использовать. Это выполняется с помощью параметра конфигурации :setting:`DATABASES`. Этот параметр привязывает к базам данных псевдонимы, по которым эти базы будут доступны в Django и словари параметров с характеристиками подключения к ним. Эти дополнительные параметры полностью описаны в документации на :setting:`DATABASES`.

source: Databases can have any alias you choose. However, the alias ``default`` has special significance. Django uses the database with the alias of ``default`` when no other database has been selected.
ru: Базам данных можно назначать любой псевдоним. Тем не менее, псевдоним ``default`` имеет особое значение. Django использует базу данных с псевдонимом ``default``, если явно не указано использование другой базы данных.

source: The following is an example ``settings.py`` snippet defining two databases -- a default PostgreSQL database and a MySQL database called ``users``::
ru: Далее показан пример ``settings.py``, в котором определяются две базы данных -- стандартная БД PostgreSQL и БД MySQL с псевдонимом ``users``::

source: If the concept of a ``default`` database doesn't make sense in the context of your project, you need to be careful to always specify the database that you want to use. Django requires that a ``default`` database entry be defined, but the parameters dictionary can be left blank if it will not be used. To do this, you must set up :setting:`DATABASE_ROUTERS` for all of your apps' models, including those in any contrib and third-party apps you're using, so that no queries are routed to the default database. The following is an example ``settings.py`` snippet defining two non-default databases, with the ``default`` entry intentionally left empty::
ru: Если концепция стандартной (``default``) базы данных не соответствует контексту вашего проекта, вам потребуется быть аккуратным, каждый раз указывая какую именно базу данных следует использовать в каждом случае. Django требует наличия записи ``default`` в конфигурации баз данных, но словарь его параметров можно оставить пустым, если вы не планируете его использовать. Вы должны настроить :setting:`DATABASE_ROUTERS` для всех моделей ваших приложений, включая те, которые расположены в сторонних приложениях, чтобы ни один запрос не был отправлен в стандартную базу. Следующий пример ``settings.py`` определяет две базы данных, оставляя запись ``default`` пустой::

source: If you attempt to access a database that you haven't defined in your :setting:`DATABASES` setting, Django will raise a ``django.db.utils.ConnectionDoesNotExist`` exception.
ru: Если вы попробуете получить доступ к базе данных, которая не определена в параметре конфигурации :setting:`DATABASES`, то Django выбросит исключение ``django.db.utils.ConnectionDoesNotExist``.

source: Synchronizing your databases
ru: Синхронизация ваших баз данных

source: The :djadmin:`migrate` management command operates on one database at a time. By default, it operates on the ``default`` database, but by providing the :option:`--database <migrate --database>` option, you can tell it to synchronize a different database. So, to synchronize all models onto all databases in the first example above, you would need to call::
ru: Команда :djadmin:`migrate` работает единовременно только с одной базой данных. По умолчанию, она работает с базой данных ``default``, но добавив аргумент :option:`--database <migrate --database>`, вы можете указать команде, что надо работать с другой базой данных. Таким образом, для того, чтобы синхронизировать все модели со всеми базами данных в нашем примере, вам потребуется вызвать::

source: If you don't want every application to be synchronized onto a particular database, you can define a :ref:`database router<topics-db-multi-db-routing>` that implements a policy constraining the availability of particular models.
ru: Если не хотите, чтобы модели приложения синхронизировались в конкретную базу данных, вы можете определить :ref:`роутер<topics-db-multi-db-routing>`, который будет управлять размещением моделей по базам данных

source: If, as in the second example above, you've left the ``default`` database empty, you must provide a database name each time you run :djadmin:`migrate`. Omitting the database name would raise an error. For the second example::
ru: Если вы оставили ``default`` базу данных пустой, как в примере выше, вам следует указывать название базы данных при каждом запуске :djadmin:`migrate`, иначе будет вызвано исключение. Для второго примера::

source: Using other management commands
ru: Использование других команд

source: Most other ``django-admin`` commands that interact with the database operate in the same way as :djadmin:`migrate` -- they only ever operate on one database at a time, using ``--database`` to control the database used.
ru: Остальные команды ``django-admin``, работающие с базой данных, аналогичны :djadmin:`migrate` -- т.е., только с одной базой данных за раз. Добавляйте ``--database``, чтобы указать, какую базу данных следует использовать.

source: An exception to this rule is the :djadmin:`makemigrations` command. It validates the migration history in the databases to catch problems with the existing migration files (which could be caused by editing them) before creating new migrations. By default, it checks only the ``default`` database, but it consults the :meth:`allow_migrate` method of :ref:`routers <topics-db-multi-db-routing>` if any are installed.
ru: Исключением является команда :djadmin:`makemigrations`. Она проверяет историю миграций в базах данных, чтобы найти проблему в существующих файлах миграций (что может быть вызвано их редактированием), перед тем, как создать новые миграции. По умолчанию проверяется только ``default`` база данных, но она учитывает метод :meth:`allow_migrate` :ref:`роутеров <topics-db-multi-db-routing>`, если они используются на проекте.

source: Automatic database routing
ru: Автоматический роутинг для баз данных

source: The easiest way to use multiple databases is to set up a database routing scheme. The default routing scheme ensures that objects remain 'sticky' to their original database (i.e., an object retrieved from the ``foo`` database will be saved on the same database). The default routing scheme ensures that if a database isn't specified, all queries fall back to the ``default`` database.
ru: Простейшим способом использования нескольких баз данных является настройка схемы роутинга. Стандартная схема роутинга проверяет, что объекты привязаны к их оригинальной базе данных (т.е., объект, полученный из базы данных ``foo``, будет сохранён в ту же базу данных). Стандартная схема роутинга проверяет, что если база данных не указана, то все запросы направляются к базе данных ``default``.

source: You don't have to do anything to activate the default routing scheme -- it is provided 'out of the box' on every Django project. However, if you want to implement more interesting database allocation behaviors, you can define and install your own database routers.
ru: Для активации стандартной схемы роутинга делать ничего не надо. Она уже настроена для каждого проекта Django. Тем не менее, если вы желаете реализовать более сложное поведение при выборе базы данных, вы можете определить и установить собственные роутеры для баз данных.

source: Database routers
ru: Роутеры баз данных

source: A database Router is a class that provides up to four methods:
ru: Роутер базы данных является классом, который предоставляет четыре метода:

source: Suggest the database that should be used for read operations for objects of type ``model``.
ru: Выбирает базу данных, которая должна использоваться для операций чтения для объектов типа ``model``.

source: If a database operation is able to provide any additional information that might assist in selecting a database, it will be provided in the ``hints`` dictionary. Details on valid hints are provided :ref:`below <topics-db-multi-db-hints>`.
ru: Если операция над базой данных может предоставить любую дополнительную информацию, которая может помочь в выборе базы данных, она будет предоставлена в словаре ``hints`` (подсказки). Подробности смотрите :ref:`далее <topics-db-multi-db-hints>`.

source: Returns ``None`` if there is no suggestion.
ru: Возвращает ``None``, если ничего не может предложить.

source: Suggest the database that should be used for writes of objects of type Model.
ru: Выбирает базу данных, которая должна использоваться для операций записи объектов типа ``model``.

source: Return ``True`` if a relation between ``obj1`` and ``obj2`` should be allowed, ``False`` if the relation should be prevented, or ``None`` if the router has no opinion. This is purely a validation operation, used by foreign key and many to many operations to determine if a relation should be allowed between two objects.
ru: Возвращает ``True``, если связь между ``obj1`` и ``obj2`` должна быть разрешена, ``False``, если связь запрещена или ``None``, если у роутера нет идей на этот счёт. Это обычная операция проверки, использующаяся операциями с внешними ключами и M2M, для определения возможности организации связи между двумя объектами.

source: Determine if the migration operation is allowed to run on the database with alias ``db``. Return ``True`` if the operation should run, ``False`` if it shouldn't run, or ``None`` if the router has no opinion.
ru: Определяет должна ли выполняться миграция для базы данных с именем ``db``. Возвращает ``True``, если миграция должна быть выполнена, ``False``, если нет или ``None`` - если у роутера нет идей.

source: The ``app_label`` positional argument is the label of the application being migrated.
ru: Позиционный аргумент ``app_label`` является меткой приложения, которое подвергается миграции.

source: ``model_name`` is set by most migration operations to the value of ``model._meta.model_name`` (the lowercased version of the model ``__name__``) of the model being migrated. Its value is ``None`` for the :class:`~django.db.migrations.operations.RunPython` and :class:`~django.db.migrations.operations.RunSQL` operations unless they provide it using hints.
ru: ``model_name`` устанавливается большинством миграционных операций в значение ``model._meta.model_name`` (строчная версия атрибута модели ``__name__``) модели, над которой производится миграция. Значение будет ``None`` для операций :class:`~django.db.migrations.operations.RunPython` и :class:`~django.db.migrations.operations.RunSQL`, если не будет указано, что используются подсказки.

source: ``hints`` are used by certain operations to communicate additional information to the router.
ru: ``hints`` используются определёнными операциями для передачи дополнительной информации роутеру.

source: When ``model_name`` is set, ``hints`` normally contains the model class under the key ``'model'``. Note that it may be a :ref:`historical model <historical-models>`, and thus not have any custom attributes, methods, or managers. You should only rely on ``_meta``.
ru: Когда ``model_name`` установлен, ``hints`` обычно содержит класс модели в ключе ``'model'``. Следует отметить, что он может быть :ref:`исторической моделью <historical-models>` и, следовательно, не иметь определённых атрибутов, методов или менеджеров. Вам следует руководствоваться информацией из ``_meta``.

source: This method can also be used to determine the availability of a model on a given database.
ru: Этот метод также может быть использован для определения доступности модели в текущей базе данных.

source: :djadmin:`makemigrations` always creates migrations for model changes, but if ``allow_migrate()`` returns ``False``, any migration operations for the ``model_name`` will be silently skipped when running :djadmin:`migrate` on the ``db``. Changing the behavior of ``allow_migrate()`` for models that already have migrations may result in broken foreign keys, extra tables, or missing tables. When :djadmin:`makemigrations` verifies the migration history, it skips databases where no app is allowed to migrate.
ru: :djadmin:`makemigrations` всегда создает миграции при изменении модели, но если ``allow_migrate()`` вернул ``False``, все операции миграции для ``model_name`` будут пропущены при выполнении :djadmin:`migrate` для ``db``. Изменяя ``allow_migrate()`` для модели, которая уже содержит миграции, может привести к сломанным внешним ключам, дополнительным таблицам, или пропущенным таблицам. Когда :djadmin:`makemigrations` историю миграций, она пропускает базы данных, для которых нет приложений с возможностью миграций.

source: A router doesn't have to provide *all* these methods -- it may omit one or more of them. If one of the methods is omitted, Django will skip that router when performing the relevant check.
ru: Роутер не должен предоставлять *все* эти методы. Если некоторые методы не определенны, Django пропустит этот роутер, выполняя соответствующую операцию.

source: Hints
ru: Подсказки

source: The hints received by the database router can be used to decide which database should receive a given request.
ru: В аргументах `hints` могут передаваться данные, помогающие определить какую базу данных использовать для запроса.

source: At present, the only hint that will be provided is ``instance``, an object instance that is related to the read or write operation that is underway. This might be the instance that is being saved, or it might be an instance that is being added in a many-to-many relation. In some cases, no instance hint will be provided at all. The router checks for the existence of an instance hint, and determine if that hint should be used to alter routing behavior.
ru: Сейчас передается только ``instance`` - объект связанный с операциями записи или чтения. Это может быть создаваемый объект, или объект добавляемый через связь многое-ко-многим. В некоторых случаях объект не будет передаваться. Роутер определяет наличие такого объекта и решает передавать его или нет при вызове метода.

source: Using routers
ru: Использование роутеров

source: Database routers are installed using the :setting:`DATABASE_ROUTERS` setting. This setting defines a list of class names, each specifying a router that should be used by the master router (``django.db.router``).
ru: Роутеры для базы данных можно использовать, указав в настройке :setting:`DATABASE_ROUTERS`. Вы должны указать список путей для импорта классов роутера, которые будут использоваться главным роутером (``django.db.router``).

source: The master router is used by Django's database operations to allocate database usage. Whenever a query needs to know which database to use, it calls the master router, providing a model and a hint (if available). Django then tries each router in turn until a database suggestion can be found. If no suggestion can be found, it tries the current ``_state.db`` of the hint instance. If a hint instance wasn't provided, or the instance doesn't currently have database state, the master router will allocate the ``default`` database.
ru: Мастер роутеров используются Django для определения какую БД использовать для запросов. Если необходимо определить для какой БД выполнять запрос, Django вызывает мастер роутеров передавая модель и "hint"(подсказки) (если они есть). Django проверяет каждый роутер пока не получит ответ о том, какую БД использовать. Если ответ не был найден, Django проверяет ``_state.db`` объекта "hint". Если "hint" не был передан, или не содержит информацию какую БД использовать, мастер роутеров укажет использовать БД из настроек ``default``.

source: An example
ru: Пример

source: Example purposes only!
ru: Только в целях примера!

source: This example is intended as a demonstration of how the router infrastructure can be used to alter database usage. It intentionally ignores some complex issues in order to demonstrate how routers are used.
ru: Этот пример показывает как можно использовать роутеры для управления несколькими БД. В нем намеренно игнорируются некоторые проблемы такой конфигурации, основная цель - продемонстрировать возможности роутеров.

source: This example won't work if any of the models in ``myapp`` contain relationships to models outside of the ``other`` database. :ref:`Cross-database relationships <no_cross_database_relations>` introduce referential integrity problems that Django can't currently handle.
ru: Этот пример не будет работать, если какая-либо модель из ``myapp`` содержит связи с моделями не из ``other`` БД. Раздел :ref:`Связи между разными БД <no_cross_database_relations>` описывает проблемы таких связей, которые Django пока не может обрабатывать.

source: The primary/replica (referred to as master/slave by some databases) configuration described is also flawed -- it doesn't provide any solution for handling replication lag (i.e., query inconsistencies introduced because of the time taken for a write to propagate to the replicas). It also doesn't consider the interaction of transactions with the database utilization strategy.
ru: Описанная настройка primary/replice (также известная в некоторых базах данных как master/slave) не учитывает некоторые проблемы. Она не предоставляет никакого решения для обработки задержек в репликации (т.е. нарушение целостности запросов из-за времени, затраченного на рассылку данных на подчинённые базы данных). Она также не рассматривает взаимодействие транзакций со стратегией использования базы данных.

source: So - what does this mean in practice? Let's consider another sample configuration. This one will have several databases: one for the ``auth`` application, and all other apps using a primary/replica setup with two read replicas. Here are the settings specifying these databases::
ru: Итак, что же это означает на практике? Давайте рассмотрим другую конфигурацию. В ней будет несколько баз данных: одна для приложения ``auth``, все остальные приложения используют primary/replica настройку, с двумя читающими репликами. Покажем настройки для этих баз данных::

source: Now we'll need to handle routing. First we want a router that knows to send queries for the ``auth`` app to ``auth_db``::
ru: Теперь нам надо настроить роутинг. Сначала опишем роутер, который будет слать запросы от приложения ``auth`` в базу данных ``auth_db``::

source: And we also want a router that sends all other apps to the primary/replica configuration, and randomly chooses a replica to read from::
ru: Также нам нужен роутер, который будет слать запросы всех остальных приложений в конфигурацию primary/replica и случайно выбирать реплику для чтения из неё::

source: Finally, in the settings file, we add the following (substituting ``path.to.`` with the actual Python path to the module(s) where the routers are defined)::
ru: Наконец, в файле конфигурации мы добавим следующее (подставим ``path.to`` с реальным путём к модулю(-ям), в которых определены роутеры)::

source: The order in which routers are processed is significant. Routers will be queried in the order they are listed in the :setting:`DATABASE_ROUTERS` setting. In this example, the ``AuthRouter`` is processed before the ``PrimaryReplicaRouter``, and as a result, decisions concerning the models in ``auth`` are processed before any other decision is made. If the :setting:`DATABASE_ROUTERS` setting listed the two routers in the other order, ``PrimaryReplicaRouter.allow_migrate()`` would be processed first. The catch-all nature of the PrimaryReplicaRouter implementation would mean that all models would be available on all databases.
ru: Порядок применения роутеров имеет важное значение. Роутеры вызываются в порядке, в котором они перечислены в параметре конфигурации :setting:`DATABASE_ROUTERS`. В этом примере ``AuthRouter`` применяется до ``PrimaryReplicaRouter`` и в результате, решение по модели в ``auth`` принимается до всех остальных решений. Если же поменять порядок роутеров в :setting:`DATABASE_ROUTERS`, то ``PrimaryReplicaRouter.allow_migrate()`` будет применено первым. Сущность "принимаем всё" реализации этого роутера приведёт к тому, что все модели будут доступны во всех базах данных.

source: With this setup installed, lets run some Django code::
ru: Используя вышеприведённую конфигурацию, выполним следующий код::

source: This example defined a router to handle interaction with models from the ``auth`` app, and other routers to handle interaction with all other apps. If you left your ``default`` database empty and don't want to define a catch-all database router to handle all apps not otherwise specified, your routers must handle the names of all apps in :setting:`INSTALLED_APPS` before you migrate. See :ref:`contrib_app_multiple_databases` for information about contrib apps that must be together in one database.
ru: Этот пример определяет роутер для работы с ``auth`` приложением и другие роутеры для работы с другими приложениями. Если не указывать ``default`` базу данных и не добавлять роутер, который обрабатывает все приложения, необходимо указать все приложения из :setting:`INSTALLED_APPS` в ваших роутерах чтобы выполнить миграции. Смотрите :ref:`contrib_app_multiple_databases`, чтобы узнать какие приложения должны находиться в одной базе данных.

source: Manually selecting a database
ru: Ручное указание базы данных

source: Django also provides an API that allows you to maintain complete control over database usage in your code. A manually specified database allocation will take priority over a database allocated by a router.
ru: Django также предоставляет API, которое позволяет вам получить полный контроль над использованием баз данных в вашем коде. Ручное указание базы данных имеет приоритет над действиями роутера.

source: Manually selecting a database for a ``QuerySet``
ru: Ручное выбор базы данных для ``QuerySet``

source: You can select the database for a ``QuerySet`` at any point in the ``QuerySet`` "chain." Just call ``using()`` on the ``QuerySet`` to get another ``QuerySet`` that uses the specified database.
ru: Вы можете выбрать базу данных для ``QuerySet`` в любой точке его цепочки. Для этого надо применить метод ``using()``, который изменит базу данных, к которой будет выполнен запрос.

source: ``using()`` takes a single argument: the alias of the database on which you want to run the query. For example::
ru: Метод ``using()`` принимает псевдоним базы данных в качестве единственного аргумента. Например::

source: Selecting a database for ``save()``
ru: Выбор базы данных для ``save()``
