Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/topics/db/optimization.po
Languages: ru

source: Database access optimization
ru: Оптимизация работы с базой данных

source: Django's database layer provides various ways to help developers get the most out of their databases. This document gathers together links to the relevant documentation, and adds various tips, organized under a number of headings that outline the steps to take when attempting to optimize your database usage.
ru: Django всячески помогает разработчикам получить максимальную отдачу от используемой базы данных. В этом разделе собрана информация, которая пригодится при оптимизации вашего приложения.

source: Profile first
ru: Первым делом - профайлинг

source: As general programming practice, this goes without saying. Find out :ref:`what queries you are doing and what they are costing you <faq-see-raw-sql-queries>`. You may also want to use an external project like django-debug-toolbar_, or a tool that monitors your database directly.
ru: Для практикующих программистов - это само собой разумеется. Первым делом определите :ref:`какие запросы выполняются и как быстро <faq-see-raw-sql-queries>`. Вы также можете использовать сторонние приложения, например, django-debug-toolbar_, или инструменты, которые мониторят непосредственно базу данных.

source: Remember that you may be optimizing for speed or memory or both, depending on your requirements. Sometimes optimizing for one will be detrimental to the other, but sometimes they will help each other. Also, work that is done by the database process might not have the same cost (to you) as the same amount of work done in your Python process. It is up to you to decide what your priorities are, where the balance must lie, and profile all of these as required since this will depend on your application and server.
ru: Вы можете оптимизировать скорость работы, или потребляемую память, или оба параметра. Иногда оптимизация одного пагубно влияет на другой параметр, но иногда можно улучшить оба. Так же нагрузка на базу данных может быть не так важна(для вас) как нагрузка на сервер(работы python). Вы сами определяете золотую средину, и не забывайте выполнить профайлинг всего этого, перед оптимизацией.

source: With everything that follows, remember to profile after every change to ensure that the change is a benefit, and a big enough benefit given the decrease in readability of your code. **All** of the suggestions below come with the caveat that in your circumstances the general principle might not apply, or might even be reversed.
ru: Не забывайте выполнять профайлинг после каждого изменения, чтобы удостоверится что изменения повысили производительность, и что это повышение стоит усложнения кода. **Все** советы ниже могут и не сработать в вашем случае, или даже понизить производительность.

source: Use standard DB optimization techniques
ru: Используйте стандартные техники оптимизации БД

source: ...including:
ru: ...включая:

source: Indexes_. This is a number one priority, *after* you have determined from profiling what indexes should be added. Use :attr:`Field.db_index <django.db.models.Field.db_index>` or :attr:`Meta.index_together <django.db.models.Options.index_together>` to add these from Django. Consider adding indexes to fields that you frequently query using :meth:`~django.db.models.query.QuerySet.filter()`, :meth:`~django.db.models.query.QuerySet.exclude()`, :meth:`~django.db.models.query.QuerySet.order_by()`, etc. as indexes may help to speed up lookups. Note that determining the best indexes is a complex database-dependent topic that will depend on your particular application. The overhead of maintaining an index may outweigh any gains in query speed.
ru: `Индексы <http://ru.wikipedia.org/wiki/%D0%98%D0%BD%D0%B4%D0%B5%D0%BA%D1%81_(%D0%B1%D0%B0%D0%B7%D1%8B_%D0%B4%D0%B0%D0%BD%D0%BD%D1%8B%D1%85)>`_. Следует добавить в первую очередь, *после* того, когда вы определите через профайлинг, какие индексы требуются. Используйте :attr:`Field.db_index <django.db.models.Field.db_index>` или :attr:`Meta.index_together <django.db.models.Options.index_together>` чтобы добавить индексы из Django. Следует добавить индексы полям, которые используются в :meth:`~django.db.models.query.QuerySet.filter()`, :meth:`~django.db.models.query.QuerySet.exclude()`, :meth:`~django.db.models.query.QuerySet.order_by()` и др., т.к. они ускоряют поиск по полям. Куда добавлять индексы - сложный вопрос, который зависит от БД и вашего приложения. Накладные расходы на поддержку индекса могут перевесить полученное ускорение при выполнении запросов.

source: Appropriate use of field types.
ru: Используйте правильные типы полей.

source: We will assume you have done the obvious things above. The rest of this document focuses on how to use Django in such a way that you are not doing unnecessary work. This document also does not address other optimization techniques that apply to all expensive operations, such as :doc:`general purpose caching </topics/cache>`.
ru: Предположим вы уже выполнили эти очевидные вещи. Остальная часть этого раздела расскажет, как оптимально использовать Django. Этот документ не описывает другие методы оптимизации, которые применимы для всех "тяжелых" операций, например, :doc:`кэширование </topics/cache>`.

source: Understanding :doc:`QuerySets </ref/models/querysets>` is vital to getting good performance with simple code. In particular:
ru: Понимание :doc:`QuerySets </ref/models/querysets>` - важная часть для написания эффективного простого кода. В частности:

source: To avoid performance problems, it is important to understand:
ru: Для избежания проблем с производительностью, важно понимать:

source: that :ref:`QuerySets are lazy <querysets-are-lazy>`.
ru: что :ref:`QuerySets - "ленивый" <querysets-are-lazy>`.

source: when :ref:`they are evaluated <when-querysets-are-evaluated>`.
ru: когда :ref:`происходит вычисление <when-querysets-are-evaluated>`.

source: how :ref:`the data is held in memory <caching-and-querysets>`.
ru: как :ref:`данные загружаются в память <caching-and-querysets>`.

source: Understand cached attributes
ru: Понимание кэширования атрибутов

source: As well as caching of the whole ``QuerySet``, there is caching of the result of attributes on ORM objects. In general, attributes that are not callable will be cached. For example, assuming the :ref:`example Weblog models <queryset-model-example>`::
ru: Как и кэширование всего ``QuerySet``, существует кэширование значения атрибутов в объектах ORM. В общем, не вызываемые атрибуты(not callable) будут закэшированы. Например, возьмем :ref:`модель Weblog из примеров <queryset-model-example>`::

source: But in general, callable attributes cause DB lookups every time::
ru: Но обращение к вызываемым атрибутам каждый раз выполняет запрос к базе данных::

source: Be careful when reading template code - the template system does not allow use of parentheses, but will call callables automatically, hiding the above distinction.
ru: Будьте внимательны читая код шаблонов - шаблонизатор не позволяет использовать скобки и автоматом вызывает функции и методы.

source: Be careful with your own custom properties - it is up to you to implement caching when required, for example using the :class:`~django.utils.functional.cached_property` decorator.
ru: Будьте внимательны с собственными свойствами - вы должны самостоятельно реализовать кэширование, используя, например, декоратор :class:`~django.utils.functional.cached_property`.

source: Use the ``with`` template tag
ru: Используйте шаблонный тэг ``with``

source: To make use of the caching behavior of ``QuerySet``, you may need to use the :ttag:`with` template tag.
ru: Для использования кэширования в ``QuerySet`` можно использовать шаблонный тэг :ttag:`with`.

source: Use ``iterator()``
ru: Используйте ``iterator()``

source: When you have a lot of objects, the caching behavior of the ``QuerySet`` can cause a large amount of memory to be used. In this case, :meth:`~django.db.models.query.QuerySet.iterator()` may help.
ru: Если у вас очень много объектов, кэширование в ``QuerySet`` может использовать большой объем памяти. В этом случае может помочь :meth:`~django.db.models.query.QuerySet.iterator()`.

source: Do database work in the database rather than in Python
ru: Выполняйте задачи базы данных в базе данных, а не в Python

source: For instance:
ru: Например:

source: At the most basic level, use :ref:`filter and exclude <queryset-api>` to do filtering in the database.
ru: Самое простое: используйте :ref:`filter и exclude <queryset-api>` для фильтрации данных в БД.

source: Use :class:`F expressions <django.db.models.F>` to filter based on other fields within the same model.
ru: Используйте :class:`объект F() <django.db.models.F>` для фильтрации по другим полям модели.

source: Use :doc:`annotate to do aggregation in the database </topics/db/aggregation>`.
ru: Используйте :doc:`annotate для выполнения агрегации в базе данных </topics/db/aggregation>`.

source: If these aren't enough to generate the SQL you need:
ru: Если этого не достаточно для создания необходимого SQL:

source: Use ``RawSQL``
ru: Используйте ``RawSQL``

source: A less portable but more powerful method is the :class:`~django.db.models.expressions.RawSQL` expression, which allows some SQL to be explicitly added to the query. If that still isn't powerful enough:
ru: Не совсем переносимый между разными БД, но очень мощный метод -- :class:`~django.db.models.expressions.RawSQL`, который позволяет добавить SQL непосредственно в запрос. Если и этого вам не достаточно:

source: Use raw SQL
ru: Используйте SQL

source: Write your own :doc:`custom SQL to retrieve data or populate models </topics/db/sql>`. Use ``django.db.connection.queries`` to find out what Django is writing for you and start from there.
ru: Используйте :doc:`собственный SQL запрос для получения данных и загрузки в модели </topics/db/sql>`. Используйте ``django.db.connection.queries``, чтобы понять что создает Django и начните с изменения этого запроса.

source: Retrieve individual objects using a unique, indexed column
ru: Получения объекта, используя уникальное или проиндексированное поле

source: There are two reasons to use a column with :attr:`~django.db.models.Field.unique` or :attr:`~django.db.models.Field.db_index` when using :meth:`~django.db.models.query.QuerySet.get` to retrieve individual objects. First, the query will be quicker because of the underlying database index. Also, the query could run much slower if multiple objects match the lookup; having a unique constraint on the column guarantees this will never happen.
ru: Есть две причины использовать поле с :attr:`~django.db.models.Field.unique` или :attr:`~django.db.models.Field.db_index` в методе :meth:`~django.db.models.query.QuerySet.get`. Первая - запрос будет быстрее т.к. будет использовать индекс в базе данных. Вторая - запрос будет гораздо медленнее, если несколько объектов будут удовлетворять запросу, уникальное поле исключает такую ситуацию.

source: So using the :ref:`example Weblog models <queryset-model-example>`::
ru: Для нашего :ref:`примера блога <queryset-model-example>`::

source: will be quicker than:
ru: будет быстрее чем:

source: because ``id`` is indexed by the database and is guaranteed to be unique.
ru: т.к. ``id`` проиндексировано и уникально.

source: Doing the following is potentially quite slow:
ru: Следующий запрос будет скорее всего медленным:

source: First of all, ``headline`` is not indexed, which will make the underlying database fetch slower.
ru: Во-первых `headline` не проиндексировано и база данных будет медленнее вычислять результат.

source: Second, the lookup doesn't guarantee that only one object will be returned. If the query matches more than one object, it will retrieve and transfer all of them from the database. This penalty could be substantial if hundreds or thousands of records are returned. The penalty will be compounded if the database lives on a separate server, where network overhead and latency also play a factor.
ru: Во-вторых - запрос не гарантирует, что будет возвращен только один объект. Если несколько объектов удовлетворяют запросу, они все будут переданы с базы данных. Задержка может быть значительной при передачи сотен или тысяч объектов. Еще большую задержку получаем, если база данных находится на другом сервере.

source: Retrieve everything at once if you know you will need it
ru: Загружайте все данные сразу, если уверены, что будете использовать их.

source: Hitting the database multiple times for different parts of a single 'set' of data that you will need all parts of is, in general, less efficient than retrieving it all in one query. This is particularly important if you have a query that is executed in a loop, and could therefore end up doing many database queries, when only one was needed. So:
ru: Обращение несколько раз к базе данных для получения различных частей одного "массива" данных обычно менее эффективно, чем получение всех данных одним запросом. Это особенно важно для запросов, выполняемых в цикле, что может привести к большому количеству запросов. Поэтому:

source: Use ``QuerySet.select_related()`` and ``prefetch_related()``
ru: Используйте ``QuerySet.select_related()`` и ``prefetch_related()``

source: Understand :meth:`~django.db.models.query.QuerySet.select_related` and :meth:`~django.db.models.query.QuerySet.prefetch_related` thoroughly, and use them:
ru: Изучите :meth:`~django.db.models.query.QuerySet.select_related` и :meth:`~django.db.models.query.QuerySet.prefetch_related` и используйте их в:

source: in view code,
ru: коде представлений,

source: and in :doc:`managers and default managers </topics/db/managers>` where appropriate. Be aware when your manager is and is not used; sometimes this is tricky so don't make assumptions.
ru: :doc:`своих менеджерах и в менеджерах по умолчанию </topics/db/managers>` при необходимости. Учитывайте когда используется менеджер, а когда нет; иногда это не однозначно, проверяйте самостоятельно.

source: Don't retrieve things you don't need
ru: Не получайте данные, которые вам не нужны

source: Use ``QuerySet.values()`` and ``values_list()``
ru: Используйте ``QuerySet.values()`` и ``values_list()``

source: When you just want a ``dict`` or ``list`` of values, and don't need ORM model objects, make appropriate usage of :meth:`~django.db.models.query.QuerySet.values()`. These can be useful for replacing model objects in template code - as long as the dicts you supply have the same attributes as those used in the template, you are fine.
ru: Если вам нужен ``dict`` или ``list`` значений, а не объекты моделей ORM, используйте :meth:`~django.db.models.query.QuerySet.values()`. Это можно использовать для подмены объектов моделей в шаблоне - если атрибуты словаря совпадают с используемыми атрибутами моделей, все будет хорошо работать.

source: Use ``QuerySet.defer()`` and ``only()``
ru: Используйте ``QuerySet.defer()`` и ``only()``

source: Use :meth:`~django.db.models.query.QuerySet.defer()` and :meth:`~django.db.models.query.QuerySet.only()` if there are database columns you know that you won't need (or won't need in most cases) to avoid loading them. Note that if you *do* use them, the ORM will have to go and get them in a separate query, making this a pessimization if you use it inappropriately.
ru: Используйте :meth:`~django.db.models.query.QuerySet.defer()` и :meth:`~django.db.models.query.QuerySet.only()`, если есть колонки в базе данных, которые вы не будете использовать. Запомните, что если вы все же *будете* их использовать, ORM сделает дополнительный запрос для их получения, что уменьшит производительность.

source: Also, be aware that there is some (small extra) overhead incurred inside Django when constructing a model with deferred fields. Don't be too aggressive in deferring fields without profiling as the database has to read most of the non-text, non-VARCHAR data from the disk for a single row in the results, even if it ends up only using a few columns. The ``defer()`` and ``only()`` methods are most useful when you can avoid loading a lot of text data or for fields that might take a lot of processing to convert back to Python. As always, profile first, then optimize.
ru: Заметим, что при создании моделей с "deferred" полями Django выполняет некоторую дополнительную работу. Не перестарайтесь, так как база данных читает большинство не текстовых, не VARCHAR данных с диска при запросе, даже если будет использоваться только несколько колонок, используйте профайлинг. Методы ``defer()`` и ``only()`` полезны, если вы можете избежать загрузки большинства текстовых полей или полей, которые долго конвертируются в объекты Python. Как всегда - используйте сначала профайлинг.

source: ...if you only want the count, rather than doing ``len(queryset)``.
ru: ...вместо``len(queryset)``, если вам необходимо только количество объектов.

source: ...if you only want to find out if at least one result exists, rather than ``if queryset``.
ru: ...если необходимо проверить есть ли результат, вместо ``if queryset``.

source: But:
ru: Но:

source: Don't overuse ``count()`` and ``exists()``
ru: Но не переусердствуйте с ``count()`` и ``exists()``

source: If you are going to need other data from the QuerySet, just evaluate it.
ru: Если вам необходимы остальные данные из QuerySet, просто вычислите их.

source: For example, assuming an Email model that has a ``body`` attribute and a many-to-many relation to User, the following template code is optimal:
ru: Например, возьмем модель Email с полем ``body`` и связь многое-го-многим с моделью User, следующий шаблон будет оптимальным:

source: It is optimal because:
ru: Он оптимальный потому что:

source: Since QuerySets are lazy, this does no database queries if 'display_inbox' is False.
ru: Так как QuerySets ленивый, запрос не будет выполнен при 'display_inbox' равном False.

source: Use of :ttag:`with` means that we store ``user.emails.all`` in a variable for later use, allowing its cache to be re-used.
ru: Тег :ttag:`with` означает что мы сохраняем ``user.emails.all`` в переменной для последующего использования.

source: The line ``{% if emails %}`` causes ``QuerySet.__bool__()`` to be called, which causes the ``user.emails.all()`` query to be run on the database, and at the least the first line to be turned into an ORM object. If there aren't any results, it will return False, otherwise True.
ru: Строка ``{% if emails %}`` вызывает ``QuerySet.__bool__()``, который выполняет``user.emails.all()`` что приводит к запросу к базе данных, и как минимум первая строка ответа будет преобразована в ORM объект. Если результат будет пуст, вернется False, иначе True.

source: The use of ``{{ emails|length }}`` calls ``QuerySet.__len__()``, filling out the rest of the cache without doing another query.
ru: Использование ``{{ emails|length }}`` вызывает ``QuerySet.__len__()``, заполняя оставшийся кэш без выполнения запроса.

source: The :ttag:`for` loop iterates over the already filled cache.
ru: :ttag:`for` выполняет цикл по уже заполненному кэшу.

source: In total, this code does either one or zero database queries. The only deliberate optimization performed is the use of the :ttag:`with` tag. Using ``QuerySet.exists()`` or ``QuerySet.count()`` at any point would cause additional queries.
ru: В общем этот код делает один или ноль запросов к базе данных. Единственная необходимая оптимизация -- это использование тега :ttag:`with`. Использование ``QuerySet.exists()`` или ``QuerySet.count()`` вызвало бы дополнительные запросы.

source: Use ``QuerySet.update()`` and ``delete()``
ru: Используйте ``QuerySet.update()`` и ``delete()``

source: Rather than retrieve a load of objects, set some values, and save them individual, use a bulk SQL UPDATE statement, via :ref:`QuerySet.update() <topics-db-queries-update>`. Similarly, do :ref:`bulk deletes <topics-db-queries-delete>` where possible.
ru: Вместо загрузки данных в объекты, изменения значений и отдельного их сохранения, используйте SQL UPDATE запросы через :ref:`QuerySet.update() <topics-db-queries-update>`. Аналогично используйте :ref:`массовое удаление <topics-db-queries-delete>` при возможности.

source: Note, however, that these bulk update methods cannot call the ``save()`` or ``delete()`` methods of individual instances, which means that any custom behavior you have added for these methods will not be executed, including anything driven from the normal database object :doc:`signals </ref/signals>`.
ru: Однако учтите, что эти методы не вызывают ``save()`` или ``delete()`` объектов. Это означает, что логика добавленная вами в эти методы, не будет выполнена, учитывая обработчики :doc:`сигналов от объектов </ref/signals>`.

source: Use foreign key values directly
ru: Используйте значения ключей непосредственно

source: If you only need a foreign key value, use the foreign key value that is already on the object you've got, rather than getting the whole related object and taking its primary key. i.e. do::
ru: Если вам необходимо только значение внешнего ключа, используйте его, т.к. оно уже в объекте, который вы получили, вместо получения всего связанного объекта и использования первичного ключа. Например, делайте::

source: instead of::
ru: вместо::

source: Don't order results if you don't care
ru: Не сортируйте данные, если вам это не требуется

source: Ordering is not free; each field to order by is an operation the database must perform. If a model has a default ordering (:attr:`Meta.ordering <django.db.models.Options.ordering>`) and you don't need it, remove it on a ``QuerySet`` by calling :meth:`~django.db.models.query.QuerySet.order_by()` with no parameters.
ru: Сортировка требует ресурсы. Каждое поле, по которому производится сортировка, требует от базы данных дополнительных ресурсов. Если модель имеет сортировку по-умолчанию (:attr:`Meta.ordering <django.db.models.Options.ordering>`) и она вам не нужна, уберите её из запроса с помощью :meth:`~django.db.models.query.QuerySet.order_by()` (без параметров).

source: Adding an index to your database may help to improve ordering performance.
ru: Добавление индекса в вашу базу данных может улучшить производительность операции сортировки.

source: Insert in bulk
ru: Используйте общее добавление

source: When creating objects, where possible, use the :meth:`~django.db.models.query.QuerySet.bulk_create()` method to reduce the number of SQL queries. For example::
ru: При создании объектов, если возможно, используйте метод :meth:`~django.db.models.query.QuerySet.bulk_create()` чтобы сократить количество SQL запросов. Например::

source: ...is preferable to::
ru: ...предпочтительнее чем::

source: Note that there are a number of :meth:`caveats to this method <django.db.models.query.QuerySet.bulk_create>`, so make sure it's appropriate for your use case.
ru: Заметим, что есть несколько :meth:`предостережений к этому методу <django.db.models.query.QuerySet.bulk_create>`, убедитесь что этот метод подходит для всего случая.

source: This also applies to :class:`ManyToManyFields <django.db.models.ManyToManyField>`, so doing::
ru: Это относится и к :class:`ManyToManyFields <django.db.models.ManyToManyField>`, это::

source: ...where ``Bands`` and ``Artists`` have a many-to-many relationship.
ru: ...где ``Bands`` и ``Artists`` связаны через многие-ко-многим.
