Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/topics/db/queries.po
Languages: ru

source: Like :class:`~django.db.models.ForeignKey`, :class:`~django.db.models.ManyToManyField` can specify :attr:`~django.db.models.ManyToManyField.related_name`. In the above example, if the :class:`~django.db.models.ManyToManyField` in ``Entry`` had specified ``related_name='entries'``, then each ``Author`` instance would have an ``entries`` attribute instead of ``entry_set``.
ru: Так же, как и :class:`~django.db.models.ForeignKey`, :class:`~django.db.models.ManyToManyField` позволяет определить :attr:`~django.db.models.ManyToManyField.related_name`. В примере выше, если поле :class:`~django.db.models.ManyToManyField` модели ``Entry`` содержит ``related_name='entries'``, тогда каждый объект модели ``Author`` будет с атрибутом ``entries`` вместо ``entry_set``.

source: One-to-one relationships
ru: Связь один-к-одному

source: One-to-one relationships are very similar to many-to-one relationships. If you define a :class:`~django.db.models.OneToOneField` on your model, instances of that model will have access to the related object via a simple attribute of the model.
ru: Связь один-к-одному похожа на связь многое-к-одному. При добавлении :class:`~django.db.models.OneToOneField` в модель, объект этой модели будет содержать ссылку на связанный объект через атрибут модели.

source: For example::
ru: Например::

source: The difference comes in "reverse" queries. The related model in a one-to-one relationship also has access to a :class:`~django.db.models.Manager` object, but that :class:`~django.db.models.Manager` represents a single object, rather than a collection of objects::
ru: Разница в обратной связи. Связанная модель также имеет доступ к объекту :class:`~django.db.models.Manager`, но :class:`~django.db.models.Manager` представляет один объект, а не множество объектов::

source: If no object has been assigned to this relationship, Django will raise a ``DoesNotExist`` exception.
ru: Если ни один объект не добавлен в связь, Django вызовет исключение ``DoesNotExist``.

source: Instances can be assigned to the reverse relationship in the same way as you would assign the forward relationship::
ru: Объект может быть назначен через обратную связь так же, как и через прямую::

source: How are the backward relationships possible?
ru: Как работает обратная связь?

source: Other object-relational mappers require you to define relationships on both sides. The Django developers believe this is a violation of the DRY (Don't Repeat Yourself) principle, so Django only requires you to define the relationship on one end.
ru: Другие ORM требуют определять связь с обеих сторон. Разработчики Django считают, что это противоречит принципу DRY (Don't Repeat Yourself - не повторяй себя), по этому принципу Django требует определить связь только для одной модели.

source: But how is this possible, given that a model class doesn't know which other model classes are related to it until those other model classes are loaded?
ru: Но как это возможно, учитывая, что модель не знает, какие другие модели связаны с ней, пока классы этих моделей не будут загружены?

source: The answer lies in the :data:`app registry <django.apps.apps>`. When Django starts, it imports each application listed in :setting:`INSTALLED_APPS`, and then the ``models`` module inside each application. Whenever a new model class is created, Django adds backward-relationships to any related models. If the related models haven't been imported yet, Django keeps tracks of the relationships and adds them when the related models eventually are imported.
ru: Все происходит при :data:`регистрации приложений <django.apps.apps>`. Когда запускается Django, происходит импорт всех приложений из :setting:`INSTALLED_APPS`, далее импорт модуля ``models`` этих приложений. Когда создается класс модели, Django добавляет обратные связи для всех связанных моделей. Если связанная модель еще не импортирована, Django запоминает эту модель и добавит связь при ее импорте.

source: For this reason, it's particularly important that all the models you're using be defined in applications listed in :setting:`INSTALLED_APPS`. Otherwise, backwards relations may not work properly.
ru: Поэтому важно, чтобы все модели, которые вы используете, находились в приложениях из :setting:`INSTALLED_APPS`. Иначе связи не будут работать.

source: Queries over related objects
ru: Запросы со связанными объектами

source: Queries involving related objects follow the same rules as queries involving normal value fields. When specifying the value for a query to match, you may use either an object instance itself, or the primary key value for the object.
ru: Запросы со связанными объектами используют те же правила, что и с обычными значениями. Вы можете использовать объект или значение первичного ключа.

source: For example, if you have a Blog object ``b`` with ``id=5``, the following three queries would be identical::
ru: Например, если у вас объект ``Blog`` ``b`` с ``id=5``, эти три запроса будут идентичны::

source: Falling back to raw SQL
ru: Использование чистого SQL

source: If you find yourself needing to write an SQL query that is too complex for Django's database-mapper to handle, you can fall back on writing SQL by hand. Django has a couple of options for writing raw SQL queries; see :doc:`/topics/db/sql`.
ru: Если вам нужно создать SQL запрос, который слишком сложен для API Django, вы можете использовать чистый SQL. Django имеет несколько возможностей использовать SQL запросы; смотрите :doc:`/topics/db/sql`.

source: Finally, it's important to note that the Django database layer is merely an interface to your database. You can access your database via other tools, programming languages or database frameworks; there's nothing Django-specific about your database.
ru: Наконец, важно отметить, что API Django для работы с базой данных является лишь интерфейсом к базе данных. Вы можете получить доступ к базе данных через другие инструменты, языки программирования и фреймворки; Django не делает ничего специфического с вашей базой данных.
