Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/topics/db/queries.po
Languages: ru

source: If you pass an invalid keyword argument, a lookup function will raise ``TypeError``.
ru: При передаче неверного именованного аргумента, будет вызвано исключение ``TypeError``.

source: The database API supports about two dozen lookup types; a complete reference can be found in the :ref:`field lookup reference <field-lookups>`. To give you a taste of what's available, here's some of the more common lookups you'll probably use:
ru: API базы данных поддерживает около двух дюжин фильтров; полный список можно найти в :ref:`разделе о фильтрах полей <field-lookups>`. Вот пример самых используемых фильтров:

source: An "exact" match. For example::
ru: "Точное" совпадение. Например::

source: Would generate SQL along these lines:
ru: Создаст такой SQL запрос:

source: If you don't provide a lookup type -- that is, if your keyword argument doesn't contain a double underscore -- the lookup type is assumed to be ``exact``.
ru: Если вы не указали фильтр -- именованный аргумент не содержит двойное подчеркивание -- будет использован фильтр ``exact``.

source: For example, the following two statements are equivalent::
ru: Например, эти два выражения идентичны::

source: This is for convenience, because ``exact`` lookups are the common case.
ru: Это сделано для удобства, т.к. ``exact`` самый распространенный фильтр.

source: A case-insensitive match. So, the query::
ru: Регистронезависимое совпадение. Такой запрос::

source: Would match a ``Blog`` titled ``"Beatles Blog"``, ``"beatles blog"``, or even ``"BeAtlES blOG"``.
ru: Найдет ``Blog`` с названием ``"Beatles Blog"``, ``"beatles blog"``, и даже ``"BeAtlES blOG"``.

source: Case-sensitive containment test. For example::
ru: Регистрозависимая проверка на вхождение. Например::

source: Roughly translates to this SQL:
ru: Будет конвертировано в такой SQL запрос:

source: Note this will match the headline ``'Today Lennon honored'`` but not ``'today lennon honored'``.
ru: Заметим, что этот пример найдет заголовок ``'Today Lennon honored'``, но не найдет ``'today lennon honored'``.

source: There's also a case-insensitive version, :lookup:`icontains`.
ru: Существуют также регистронезависимые версии, :lookup:`icontains`.

source: Starts-with and ends-with search, respectively. There are also case-insensitive versions called :lookup:`istartswith` and :lookup:`iendswith`.
ru: Поиск по началу и окончанию соответственно. Существуют также регистронезависимые версии :lookup:`istartswith` и :lookup:`iendswith`.

source: Again, this only scratches the surface. A complete reference can be found in the :ref:`field lookup reference <field-lookups>`.
ru: Это только основные фильтры. Полный список ищите в :ref:`разделе о фильтрах по полям <field-lookups>`.

source: Lookups that span relationships
ru: Фильтры по связанным объектам

source: Django offers a powerful and intuitive way to "follow" relationships in lookups, taking care of the SQL ``JOIN``\s for you automatically, behind the scenes. To span a relationship, just use the field name of related fields across models, separated by double underscores, until you get to the field you want.
ru: Django предлагает удобный и понятный интерфейс для фильтрации по связанным объектам, самостоятельно заботясь о ``JOIN`` в SQL. Для фильтра по полю из связанных моделей, используйте имена связывающих полей разделенных двойным нижним подчеркиванием, пока вы не достигните нужного поля.

source: This example retrieves all ``Entry`` objects with a ``Blog`` whose ``name`` is ``'Beatles Blog'``::
ru: Этот пример получает все объекты ``Entry`` с ``Blog``, ``name`` которого равен ``'Beatles Blog'``::

source: This spanning can be as deep as you'd like.
ru: Этот поиск может быть столь глубоким, как вам будет угодно.

source: It works backwards, too. To refer to a "reverse" relationship, just use the lowercase name of the model.
ru: Все работает и в другую сторону. Чтобы обратиться к "обратной" связи, просто используйте имя модели в нижнем регистре.

source: This example retrieves all ``Blog`` objects which have at least one ``Entry`` whose ``headline`` contains ``'Lennon'``::
ru: Этот пример получает все объекты ``Blog``, которые имеют хотя бы один связанный объект ``Entry`` с ``headline`` содержащим ``'Lennon'``::

source: If you are filtering across multiple relationships and one of the intermediate models doesn't have a value that meets the filter condition, Django will treat it as if there is an empty (all values are ``NULL``), but valid, object there. All this means is that no error will be raised. For example, in this filter::
ru: Если вы используйте фильтр через несколько связей и одна из промежуточных моделей не содержит подходящей связи, Django расценит это как пустое значение (все значения равны ``NULL``). Исключение не будет вызвано. Например, в этом фильтре::

source: (if there was a related ``Author`` model), if there was no ``author`` associated with an entry, it would be treated as if there was also no ``name`` attached, rather than raising an error because of the missing ``author``. Usually this is exactly what you want to have happen. The only case where it might be confusing is if you are using :lookup:`isnull`. Thus::
ru: (при связанной модели ``Author``), если нет объекта ``author`` связанного с ``entry``, это будет расценено как отсутствие ``name``, вместо вызова исключения т.к. ``author`` отсутствует. В большинстве случаев это то, что вам нужно. Единственный случай, когда это может работать не однозначно - при использовании :lookup:`isnull`. Например::

source: will return ``Blog`` objects that have an empty ``name`` on the ``author`` and also those which have an empty ``author`` on the ``entry``. If you don't want those latter objects, you could write::
ru: вернет объекты ``Blog`` у которого пустое поле ``name`` у ``author`` и также объекты, у которых пустой ``author``в ``entry``. Если вы не хотите включать вторые объекты, используйте::

source: Spanning multi-valued relationships
ru: Фильтрация по связям многие-ко-многим

source: When you are filtering an object based on a :class:`~django.db.models.ManyToManyField` or a reverse :class:`~django.db.models.ForeignKey`, there are two different sorts of filter you may be interested in. Consider the ``Blog``/``Entry`` relationship (``Blog`` to ``Entry`` is a one-to-many relation). We might be interested in finding blogs that have an entry which has both *"Lennon"* in the headline and was published in 2008. Or we might want to find blogs that have an entry with *"Lennon"* in the headline as well as an entry that was published in 2008. Since there are multiple entries associated with a single ``Blog``, both of these queries are possible and make sense in some situations.
ru: Когда вы используете фильтрацию по связанным через :class:`~django.db.models.ManyToManyField` объектам или по обратной связи для :class:`~django.db.models.ForeignKey`, может быть два вида фильтров. Рассмотрим связь ``Blog``/``Entry`` (от ``Blog`` к ``Entry`` -- это связь один-ко-многим). Нам может понадобиться получить блоги с записями, у которых заголовок содержит *"Lennon"* и которые были опубликованы в 2008. Или нам могут понадобиться блоги с записями с *"Lennon"* в заголовке и в то же время блоги с записями опубликованными до 2008. Т.к. один ``Blog`` может иметь несколько связанных ``Entry``, оба варианта возможны.

source: The same type of situation arises with a :class:`~django.db.models.ManyToManyField`. For example, if an ``Entry`` has a :class:`~django.db.models.ManyToManyField` called ``tags``, we might want to find entries linked to tags called *"music"* and *"bands"* or we might want an entry that contains a tag with a name of *"music"* and a status of *"public"*.
ru: Аналогичная ситуация и с :class:`~django.db.models.ManyToManyField`. Например, если ``Entry`` имеет :class:`~django.db.models.ManyToManyField` названное ``tags``, нам могут понадобиться записи связанные с тегами *"music"* и *"bands"* или нам может понадобиться запись содержащая тег *"music"* и статусом *"public"*.

source: To handle both of these situations, Django has a consistent way of processing :meth:`~django.db.models.query.QuerySet.filter` calls. Everything inside a single :meth:`~django.db.models.query.QuerySet.filter` call is applied simultaneously to filter out items matching all those requirements. Successive :meth:`~django.db.models.query.QuerySet.filter` calls further restrict the set of objects, but for multi-valued relations, they apply to any object linked to the primary model, not necessarily those objects that were selected by an earlier :meth:`~django.db.models.query.QuerySet.filter` call.
ru: Чтобы обеспечить оба варианта, Django использует определенные правила для вызовов :meth:`~django.db.models.query.QuerySet.filter`. Все, что в одном вызове :meth:`~django.db.models.query.QuerySet.filter`, применяется одновременно, чтобы отфильтровать все объекты, соответствующие этим параметрам фильтрации. Успешные вызовы :meth:`~django.db.models.query.QuerySet.filter` каждый раз сокращают выборку объектов, но для множественных связей, они применяются каждый раз ко всем связанным объектам, а не только к объектам отфильтрованным предыдущим вызовом :meth:`~django.db.models.query.QuerySet.filter`.

source: That may sound a bit confusing, so hopefully an example will clarify. To select all blogs that contain entries with both *"Lennon"* in the headline and that were published in 2008 (the same entry satisfying both conditions), we would write::
ru: Звучит немного непонятно, но пример должен все прояснить. Для выбора всех блогов, содержащих записи и с *"Lennon"* в заголовке и опубликованные в 2008 (запись должна удовлетворять оба условия), мы будем использовать такой код::

source: To select all blogs that contain an entry with *"Lennon"* in the headline **as well as** an entry that was published in 2008, we would write::
ru: Для выбора блогов с записями, у которых заголовок содержит *"Lennon"*, **а также** с записями опубликованными в 2008, мы напишем::

source: Suppose there is only one blog that had both entries containing *"Lennon"* and entries from 2008, but that none of the entries from 2008 contained *"Lennon"*. The first query would not return any blogs, but the second query would return that one blog.
ru: Предположим, существует только один блог, и в нем есть записи со словом *"Lennon"* и записи 2008-го года, но ни одна запись 2008-го не содержит слово *"Lennon"*. Первый запрос вернет пустой ответ, второй запрос - один блог.

source: In the second example, the first filter restricts the queryset to all those blogs linked to entries with *"Lennon"* in the headline. The second filter restricts the set of blogs *further* to those that are also linked to entries that were published in 2008. The entries selected by the second filter may or may not be the same as the entries in the first filter. We are filtering the ``Blog`` items with each filter statement, not the ``Entry`` items.
ru: В этом примере, первый фильтр ограничит выборку блогами со связанными записями содержащими *"Lennon"* в заголовке. Второй фильтр *далее* ограничит выборку блогами с записями, опубликованными в 2008. Записи выбранные вторым фильтром могут быть такими же, как и из первого фильтра, а могут и не быть. Мы фильтруем объекты ``Blog`` с каждым вызовом ``filter()``, а не объекты ``Entry``.

source: The behavior of :meth:`~django.db.models.query.QuerySet.filter` for queries that span multi-value relationships, as described above, is not implemented equivalently for :meth:`~django.db.models.query.QuerySet.exclude`. Instead, the conditions in a single :meth:`~django.db.models.query.QuerySet.exclude` call will not necessarily refer to the same item.
ru: Поведение :meth:`~django.db.models.query.QuerySet.exclude` при запросе, который использует множественную связь, отличается от аналогичных запросов с :meth:`~django.db.models.query.QuerySet.filter`, поведение которых описано выше. Несколько условий в одном вызове :meth:`~django.db.models.query.QuerySet.exclude` не обязательно будут применяться к одной записи.

source: For example, the following query would exclude blogs that contain *both* entries with *"Lennon"* in the headline *and* entries published in 2008::
ru: Например, следующий запрос исключит блоги, с записями, у которых заголовок содержит *"Lennon"*, **а также** с записями опубликованными в 2008::

source: However, unlike the behavior when using :meth:`~django.db.models.query.QuerySet.filter`, this will not limit blogs based on entries that satisfy both conditions. In order to do that, i.e. to select all blogs that do not contain entries published with *"Lennon"* that were published in 2008, you need to make two queries::
ru: Однако, в отличии от :meth:`~django.db.models.query.QuerySet.filter`, этот запрос не отфильтрует блоги по записям, которые удовлетворяют двум условиям. Для того, чтобы выбрать все блоги, которые не содержат записи с *"Lennon"* и опубликованные в 2008, необходимо сделать два запроса::

source: Filters can reference fields on the model
ru: Фильтры могут ссылаться на поля модели

source: In the examples given so far, we have constructed filters that compare the value of a model field with a constant. But what if you want to compare the value of a model field with another field on the same model?
ru: В примерах выше мы использовали фильтры, которые сравнивали поля с определенными значениями(константами). Но что, если вы хотите сравнить одно поле с другим полем одной модели?

source: Django provides :class:`F expressions <django.db.models.F>` to allow such comparisons. Instances of ``F()`` act as a reference to a model field within a query. These references can then be used in query filters to compare the values of two different fields on the same model instance.
ru: Django предоставляет :class:`класс F <django.db.models.F>` для таких сравнений. Экземпляр ``F()`` рассматривается как ссылка на другое поле модели. Эти ссылки могут быть использованы для сравнения значений двух разных полей одного объекта модели.

source: For example, to find a list of all blog entries that have had more comments than pingbacks, we construct an ``F()`` object to reference the pingback count, and use that ``F()`` object in the query::
ru: Например, чтобы выбрать все записи, у которых количество комментариев больше, чем "pingback", мы создаем объект ``F()`` с ссылкой на поле "pingback", и используем этот объект ``F()`` в запросе::

source: Django supports the use of addition, subtraction, multiplication, division, modulo, and power arithmetic with ``F()`` objects, both with constants and with other ``F()`` objects. To find all the blog entries with more than *twice* as many comments as pingbacks, we modify the query::
ru: Django поддерживает операции суммирования, вычитания, умножения, деления и арифметический модуль для объектов ``F()``, с константами или другими объектами ``F()``. Чтобы найти все записи с количеством комментариев в *два раза больше* чем "pingbacks", используем такой запрос::

source: To find all the entries where the rating of the entry is less than the sum of the pingback count and comment count, we would issue the query::
ru: Чтобы найти все записи с рейтингом ниже суммы "pingback" и количества комментариев, необходимо выполнить такой запрос::

source: You can also use the double underscore notation to span relationships in an ``F()`` object. An ``F()`` object with a double underscore will introduce any joins needed to access the related object. For example, to retrieve all the entries where the author's name is the same as the blog name, we could issue the query::
ru: Вы можете использовать два нижних подчеркивания для использования полей связанных объектов в ``F()``. Объект ``F()`` с двойным нижним подчеркиванием обеспечит все необходимые ``JOIN`` для получения необходимых связанных объектов. Например, чтобы получить все записи, у которых имя автора совпадает с названием блога, нужно выполнить такой запрос::

source: For date and date/time fields, you can add or subtract a :class:`~datetime.timedelta` object. The following would return all entries that were modified more than 3 days after they were published::
ru: Для полей даты и времени вы можете использовать сумму или разницу объектов :class:`~datetime.timedelta`. Этот код вернет все записи, которые были отредактированы через 3 дня после публикации::

source: For convenience, Django provides a ``pk`` lookup shortcut, which stands for "primary key".
ru: Для удобства, Django предоставляет специальный фильтр ``pk`` для работы с первичным ключом.

source: In the example ``Blog`` model, the primary key is the ``id`` field, so these three statements are equivalent::
ru: Например, первичный ключ модели ``Blog`` -- поле ``id``. Эти три запроса идентичны::

source: The use of ``pk`` isn't limited to ``__exact`` queries -- any query term can be combined with ``pk`` to perform a query on the primary key of a model::
ru: Использование ``pk`` не ограничено только фильтром ``__exact`` -- любой фильтр может быть использован с ``pk``::

source: ``pk`` lookups also work across joins. For example, these three statements are equivalent::
ru: ``pk`` работает также и для связей. Например, эти три запроса идентичны::

source: The field lookups that equate to ``LIKE`` SQL statements (``iexact``, ``contains``, ``icontains``, ``startswith``, ``istartswith``, ``endswith`` and ``iendswith``) will automatically escape the two special characters used in ``LIKE`` statements -- the percent sign and the underscore. (In a ``LIKE`` statement, the percent sign signifies a multiple-character wildcard and the underscore signifies a single-character wildcard.)
ru: Фильтры, эквивалентные оператору ``LIKE`` в SQL(``iexact``, ``contains``, ``icontains``, ``startswith``, ``istartswith``, ``endswith`` и ``iendswith``), автоматически экранируют два символа, используемых оператором ``LIKE`` -- знак процента и нижнего подчеркивания. (В операторе ``LIKE``, знак процента означает "wildcard" из нескольких символов, нижнего подчеркивания - односимвольный "wildcard".)

source: This means things should work intuitively, so the abstraction doesn't leak. For example, to retrieve all the entries that contain a percent sign, just use the percent sign as any other character::
ru: Это делает работу с API интуитивно-понятной. Например, чтобы получить все записи со знаком процента, просто используйте символ знака процента как любой другой символ::

source: Django takes care of the quoting for you; the resulting SQL will look something like this:
ru: Django самостоятельно позаботится об экранировании; полученный SQL будет выглядеть приблизительно вот так:

source: Same goes for underscores. Both percentage signs and underscores are handled for you transparently.
ru: Также работает и символ нижнего подчеркивания. Оба, знак процента и нижнего подчеркивания, обрабатываются автоматически, прозрачно для вас.

source: Each :class:`~django.db.models.query.QuerySet` contains a cache to minimize database access. Understanding how it works will allow you to write the most efficient code.
ru: Каждый :class:`~django.db.models.query.QuerySet` содержит кэш, для уменьшения количества запросов. Очень важно знать как он работает для эффективного использования Django.

source: In a newly created :class:`~django.db.models.query.QuerySet`, the cache is empty. The first time a :class:`~django.db.models.query.QuerySet` is evaluated -- and, hence, a database query happens -- Django saves the query results in the :class:`~django.db.models.query.QuerySet`’s cache and returns the results that have been explicitly requested (e.g., the next element, if the :class:`~django.db.models.query.QuerySet` is being iterated over). Subsequent evaluations of the :class:`~django.db.models.query.QuerySet` reuse the cached results.
ru: В только что созданном :class:`~django.db.models.query.QuerySet` кеш пустой. После вычисления :class:`~django.db.models.query.QuerySet` и будет выполнен запрос к базе данных -- Django сохраняет результат запроса в кеше :class:`~django.db.models.query.QuerySet` и возвращает необходимый результат (например, следующий элемент при итерации по :class:`~django.db.models.query.QuerySet`). Последующие вычисления :class:`~django.db.models.query.QuerySet` используют кеш.

source: Keep this caching behavior in mind, because it may bite you if you don't use your :class:`~django.db.models.query.QuerySet`\s correctly. For example, the following will create two :class:`~django.db.models.query.QuerySet`\s, evaluate them, and throw them away::
ru: Помните о кэшировании, чтобы использовать :class:`~django.db.models.query.QuerySet` правильно. Например, этот код создаст два экземпляра :class:`~django.db.models.query.QuerySet` и вычислит их не сохраняя::

source: That means the same database query will be executed twice, effectively doubling your database load. Also, there's a possibility the two lists may not include the same database records, because an ``Entry`` may have been added or deleted in the split second between the two requests.
ru: Это означает, что один и тот же запрос будет выполнен дважды, удваивая нагрузку на базу данных. Также, есть вероятность, что списки могут содержать разные результаты, потому что запись ``Entry`` может быть добавлена или удалена в доли секунды между запросами.

source: To avoid this problem, simply save the :class:`~django.db.models.query.QuerySet` and reuse it::
ru: Чтобы избежать этой проблемы, просто сохраните :class:`~django.db.models.query.QuerySet` и используйте его повторно::

source: Querysets do not always cache their results. When evaluating only *part* of the queryset, the cache is checked, but if it is not populated then the items returned by the subsequent query are not cached. Specifically, this means that :ref:`limiting the queryset <limiting-querysets>` using an array slice or an index will not populate the cache.
ru: Queryset не всегда кэширует результаты. При выполнении только *части* queryset-а, кэш проверяется, но если кэш пустой, выполняется запрос без сохранения его результата в кэш. Это значит, что :ref:`ограничение выборки <limiting-querysets>`, используя индекс или срез, как при использовании списков, не заполнит кэш.

source: For example, repeatedly getting a certain index in a queryset object will query the database each time::
ru: Например, при получении объекта по индексу несколько раз будет каждый раз выполнять запрос к базе данных::

source: However, if the entire queryset has already been evaluated, the cache will be checked instead::
ru: Однако, если уже был загружен весь queryset, он будет использоваться для получения значения::

source: Here are some examples of other actions that will result in the entire queryset being evaluated and therefore populate the cache::
ru: Еще несколько примеров, когда загружается весь queryset и результат сохраняется в кэше::

source: Simply printing the queryset will not populate the cache. This is because the call to ``__repr__()`` only returns a slice of the entire queryset.
ru: Использование ``print`` с queryset не заполнит кэш т.к. будет вызван ``__repr__()``, который показывает только часть объектов.

source: Keyword argument queries -- in :meth:`~django.db.models.query.QuerySet.filter`, etc. -- are "AND"ed together. If you need to execute more complex queries (for example, queries with ``OR`` statements), you can use :class:`Q objects <django.db.models.Q>`.
ru: Именованные аргументы функции :meth:`~django.db.models.query.QuerySet.filter` и др. -- объединяются оператором "AND". Если вам нужны более сложные запросы (например, запросы с оператором ``OR``), вы можете использовать :class:`объекты Q <django.db.models.Q>`.
