Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/topics/db/queries.po
Languages: ru

source: A :class:`Q object <django.db.models.Q>` (``django.db.models.Q``) is an object used to encapsulate a collection of keyword arguments. These keyword arguments are specified as in "Field lookups" above.
ru: :class:`Объект Q <django.db.models.Q>` (``django.db.models.Q``) -- объект, используемый для инкапсуляции множества именованных аргументов для фильтрации. Аргументы определяются так же, как и в примерах выше.

source: For example, this ``Q`` object encapsulates a single ``LIKE`` query::
ru: Например, этот объект ``Q`` определяет запрос ``LIKE``::

source: ``Q`` objects can be combined using the ``&`` and ``|`` operators. When an operator is used on two ``Q`` objects, it yields a new ``Q`` object.
ru: Объекты ``Q`` могут быть объединены операторами ``&`` и ``|``, при этом будет создан новый объект ``Q``.

source: For example, this statement yields a single ``Q`` object that represents the "OR" of two ``"question__startswith"`` queries::
ru: Например, это определение представляет объект ``Q``, который представляет операцию "OR" двух фильтров с ``"question__startswith"``::

source: This is equivalent to the following SQL ``WHERE`` clause::
ru: Этот фильтр равнозначен такому оператору SQL ``WHERE``::

source: You can compose statements of arbitrary complexity by combining ``Q`` objects with the ``&`` and ``|`` operators and use parenthetical grouping. Also, ``Q`` objects can be negated using the ``~`` operator, allowing for combined lookups that combine both a normal query and a negated (``NOT``) query::
ru: Вы можете комбинировать различные объекты ``Q`` с операторами ``&`` и ``|`` и использовать скобки. Можно использовать оператор ``~`` для отрицания(``NOT``) в запросе::

source: Each lookup function that takes keyword-arguments (e.g. :meth:`~django.db.models.query.QuerySet.filter`, :meth:`~django.db.models.query.QuerySet.exclude`, :meth:`~django.db.models.query.QuerySet.get`) can also be passed one or more ``Q`` objects as positional (not-named) arguments. If you provide multiple ``Q`` object arguments to a lookup function, the arguments will be "AND"ed together. For example::
ru: Каждый метод для фильтрации, который принимает именованные аргументы (например, :meth:`~django.db.models.query.QuerySet.filter`, :meth:`~django.db.models.query.QuerySet.exclude`, :meth:`~django.db.models.query.QuerySet.get`:meth:`~django.db.models.query.QuerySet.get`) также может принимать объекты ``Q``. Если вы передадите несколько объектов ``Q`` как аргументы, они будут объединены оператором "AND". Например::

source: ... roughly translates into the SQL::
ru: ... примерно переводится в SQL::

source: Lookup functions can mix the use of ``Q`` objects and keyword arguments. All arguments provided to a lookup function (be they keyword arguments or ``Q`` objects) are "AND"ed together. However, if a ``Q`` object is provided, it must precede the definition of any keyword arguments. For example::
ru: Вы можете использовать одновременно объекты ``Q`` и именованные аргументы. Все аргументы(будь то именованные аргументы или объекты ``Q``) объединяются оператором "AND". Однако, если присутствует объект ``Q``, он должен следовать перед именованными аргументами. Например::

source: ... would be a valid query, equivalent to the previous example; but::
ru: ... правильный запрос, идентичный предыдущему примеру; но::

source: ... would not be valid.
ru: ... будет неправильный`(Вообще Django здесь не причем. Синтаксис Python не позволяет передавать именованные аргументы перед позиционными -- прим. переводчика)`.

source: The `OR lookups examples`_ in the Django unit tests show some possible uses of ``Q``.
ru: Вы можете найти `примеры использования OR с Q <https://code.djangoproject.com/browser/django/trunk/tests/modeltests/or_lookups/tests.py>`_.

source: Comparing objects
ru: Сравнение объектов

source: To compare two model instances, just use the standard Python comparison operator, the double equals sign: ``==``. Behind the scenes, that compares the primary key values of two models.
ru: Для сравнения двух экземпляров модели, используйте стандартный оператор сравнения Python, двойной знак равно: ``==``. При этом будут сравнены первичные ключи.

source: Using the ``Entry`` example above, the following two statements are equivalent::
ru: Используя модель ``Entry`` из примеров выше, эти два утверждения эквивалентны::

source: If a model's primary key isn't called ``id``, no problem. Comparisons will always use the primary key, whatever it's called. For example, if a model's primary key field is called ``name``, these two statements are equivalent::
ru: Если первичный ключ назван не ``id`` -- это не проблема. Сравнение всегда использует первичный ключ. Например, если первичный ключ назван ``name``, эти два утверждения эквивалентны::

source: Deleting objects
ru: Удаление объектов

source: The delete method, conveniently, is named :meth:`~django.db.models.Model.delete`. This method immediately deletes the object and returns the number of objects deleted and a dictionary with the number of deletions per object type. Example::
ru: Метод удаления соответственно называется :meth:`~django.db.models.Model.delete`. Этот метод сразу удаляет объект и возвращает количество удаленных объектов, и словарь с количеством удаленных объектов для каждого типа. Например::

source: You can also delete objects in bulk. Every :class:`~django.db.models.query.QuerySet` has a :meth:`~django.db.models.query.QuerySet.delete` method, which deletes all members of that :class:`~django.db.models.query.QuerySet`.
ru: Можно также удалить несколько объектов сразу. Каждый :class:`~django.db.models.query.QuerySet` имеет метод :meth:`~django.db.models.query.QuerySet.delete`, который удаляет все объекты из :class:`~django.db.models.query.QuerySet`.

source: For example, this deletes all ``Entry`` objects with a ``pub_date`` year of 2005::
ru: Например, этот код удаляет все объекты ``Entry`` с годом ``pub_date`` равным 2005::

source: Keep in mind that this will, whenever possible, be executed purely in SQL, and so the ``delete()`` methods of individual object instances will not necessarily be called during the process. If you've provided a custom ``delete()`` method on a model class and want to ensure that it is called, you will need to "manually" delete instances of that model (e.g., by iterating over a :class:`~django.db.models.query.QuerySet` and calling ``delete()`` on each object individually) rather than using the bulk :meth:`~django.db.models.query.QuerySet.delete` method of a :class:`~django.db.models.query.QuerySet`.
ru: Учтите, что при любой возможности будет использован непосредственно SQL запрос, то есть метод ``delete()`` объекта может и не использоваться при удалении. Если вы переопределяете метод ``delete()`` модели и хотите быть уверенным, что он будет вызван, вы должны "самостоятельно" удалить объект модели (например, использовать цикл по :class:`~django.db.models.query.QuerySet` и вызывать метод ``delete()`` для каждого объекта) не используя метод :meth:`~django.db.models.query.QuerySet.delete` :class:`~django.db.models.query.QuerySet`.

source: When Django deletes an object, by default it emulates the behavior of the SQL constraint ``ON DELETE CASCADE`` -- in other words, any objects which had foreign keys pointing at the object to be deleted will be deleted along with it. For example::
ru: При удалении Django повторяет поведение SQL выражения ``ON DELETE CASCADE`` -- другими словами, каждый объект, имеющий связь(``ForeignKey``) с удаляемым объектом, будет также удален. Например::

source: This cascade behavior is customizable via the :attr:`~django.db.models.ForeignKey.on_delete` argument to the :class:`~django.db.models.ForeignKey`.
ru: Это поведение можно изменить, определив аргумент :attr:`~django.db.models.ForeignKey.on_delete` поля :class:`~django.db.models.ForeignKey`.

source: Note that :meth:`~django.db.models.query.QuerySet.delete` is the only :class:`~django.db.models.query.QuerySet` method that is not exposed on a :class:`~django.db.models.Manager` itself. This is a safety mechanism to prevent you from accidentally requesting ``Entry.objects.delete()``, and deleting *all* the entries. If you *do* want to delete all the objects, then you have to explicitly request a complete query set::
ru: Метод :meth:`~django.db.models.query.QuerySet.delete` содержится только в :class:`~django.db.models.query.QuerySet` и не существует в :class:`~django.db.models.Manager`. Это сделано, чтобы вы случайно не выполнили ``Entry.objects.delete()``, и не удалили *все* записи. Если вы *на самом деле* хотите удалить все объекты, сначала явно получите ``QuerySet``, содержащий все записи::

source: Copying model instances
ru: Копирование объекта модели

source: Although there is no built-in method for copying model instances, it is possible to easily create new instance with all fields' values copied. In the simplest case, you can just set ``pk`` to ``None``. Using our blog example::
ru: Хоть модель и не содержит встроенного метода для копирования объекта модели, очень просто создать новый экземпляр с копией всех полей другого объекта. Самый простой вариант -- установите ``pk`` в ``None``. Используя модели из примеров выше::

source: Things get more complicated if you use inheritance. Consider a subclass of ``Blog``::
ru: Все немного сложнее, если вы используете наследование. Рассмотрим подкласс ``Blog``::

source: Due to how inheritance works, you have to set both ``pk`` and ``id`` to None::
ru: Учитывая, как работает наследование, необходимо установить и ``pk`` и ``id`` в None::

source: Updating multiple objects at once
ru: Изменение нескольких объектов

source: Sometimes you want to set a field to a particular value for all the objects in a :class:`~django.db.models.query.QuerySet`. You can do this with the :meth:`~django.db.models.query.QuerySet.update` method. For example::
ru: Если вам понадобиться установить значение поля для всех объектов в :class:`~django.db.models.query.QuerySet`, используйте метод :meth:`~django.db.models.query.QuerySet.update`. Например::

source: You can only set non-relation fields and :class:`~django.db.models.ForeignKey` fields using this method. To update a non-relation field, provide the new value as a constant. To update :class:`~django.db.models.ForeignKey` fields, set the new value to be the new model instance you want to point to. For example::
ru: Вы можете изменить только обычные поля или :class:`~django.db.models.ForeignKey`, используя этот метод. Для обычных полей просто определите новое значение как константу. Чтобы обновить :class:`~django.db.models.ForeignKey`, укажите объект связанной модели. Например::

source: The ``update()`` method is applied instantly and returns the number of rows matched by the query (which may not be equal to the number of rows updated if some rows already have the new value). The only restriction on the :class:`~django.db.models.query.QuerySet` being updated is that it can only access one database table: the model's main table. You can filter based on related fields, but you can only update columns in the model's main table. Example::
ru: Метод ``update()`` применяется мгновенно и возвращает количество записей, удовлетворяющих запросу(что может быть не равно количеству обновленных записей, если они уже содержат новые значения). Единственное ограничение для изменяемого :class:`~django.db.models.query.QuerySet` -- он может изменять только одну таблицу в базе данных: главную таблицу модели. Вы можете использовать фильтры по связанным полям, но вы можете изменять поля только таблицы изменяемой модели. Например::

source: Be aware that the ``update()`` method is converted directly to an SQL statement. It is a bulk operation for direct updates. It doesn't run any :meth:`~django.db.models.Model.save` methods on your models, or emit the ``pre_save`` or ``post_save`` signals (which are a consequence of calling :meth:`~django.db.models.Model.save`), or honor the :attr:`~django.db.models.DateField.auto_now` field option. If you want to save every item in a :class:`~django.db.models.query.QuerySet` and make sure that the :meth:`~django.db.models.Model.save` method is called on each instance, you don't need any special function to handle that. Just loop over them and call :meth:`~django.db.models.Model.save`::
ru: Учтите, что метод ``update()`` использует непосредственно SQL запрос. Это операция для массового изменения. Метод :meth:`~django.db.models.Model.save` модели не будет вызван, сигналы ``pre_save`` или ``post_save`` не будут вызваны (которые являются следствием вызова :meth:`~django.db.models.Model.save`), аргумент :attr:`~django.db.models.DateField.auto_now` не будет учтен. Если вы хотите сохранить каждый объект в :class:`~django.db.models.query.QuerySet` и удостовериться что метод :meth:`~django.db.models.Model.save` вызван для каждого объекта, вы не должны использовать какой-либо специальный метод. Просто используйте цикл и вызовите метод :meth:`~django.db.models.Model.save`::

source: Calls to update can also use :class:`F expressions <django.db.models.F>` to update one field based on the value of another field in the model. This is especially useful for incrementing counters based upon their current value. For example, to increment the pingback count for every entry in the blog::
ru: Метод ``update()`` может использовать :class:`объект F <django.db.models.F>` для обновления одного поля значением другого поля модели. Это особенно полезно для изменения счетчика. Например, увеличить значение ``n_pingbacks`` на один для каждой записи::

source: However, unlike ``F()`` objects in filter and exclude clauses, you can't introduce joins when you use ``F()`` objects in an update -- you can only reference fields local to the model being updated. If you attempt to introduce a join with an ``F()`` object, a ``FieldError`` will be raised::
ru: Однако, в отличии от использования объектов ``F()`` в методах ``filter()`` и ``exclude()``, вы не можете использовать связанные поля при обновлении. Если вы будете использовать связанное поле в объекте ``F()``, буде вызвано исключение ``FieldError``::

source: Related objects
ru: Связанные объекты

source: When you define a relationship in a model (i.e., a :class:`~django.db.models.ForeignKey`, :class:`~django.db.models.OneToOneField`, or :class:`~django.db.models.ManyToManyField`), instances of that model will have a convenient API to access the related object(s).
ru: Используя связанные объекты в модели (например, :class:`~django.db.models.ForeignKey`, :class:`~django.db.models.OneToOneField` или :class:`~django.db.models.ManyToManyField`), в объект модели будет добавлен API для работы со связанными объектами.

source: Using the models at the top of this page, for example, an ``Entry`` object ``e`` can get its associated ``Blog`` object by accessing the ``blog`` attribute: ``e.blog``.
ru: Используя модели из примеров выше, например, объект ``e`` модели ``Entry``, может получить связанные объекты ``Blog`` используя атрибут ``blog``: ``e.blog``.

source: (Behind the scenes, this functionality is implemented by Python descriptors_. This shouldn't really matter to you, but we point it out here for the curious.)
ru: (Это все работает благодаря `дескрипторам Python <http://users.rcn.com/python/download/Descriptor.htm>`_. Это совсем не важно и упоминается для любознательных.)

source: Django also creates API accessors for the "other" side of the relationship -- the link from the related model to the model that defines the relationship. For example, a ``Blog`` object ``b`` has access to a list of all related ``Entry`` objects via the ``entry_set`` attribute: ``b.entry_set.all()``.
ru: Django также предоставляет доступ к связанным объектам с "другой" стороны -- ссылка с связанного объекта на объект, который определяет связь. Например, объект ``b`` модели ``Blog`` имеет доступ ко всем связанным объектам ``Entry`` через атрибут ``entry_set``: ``b.entry_set.all()``.

source: All examples in this section use the sample ``Blog``, ``Author`` and ``Entry`` models defined at the top of this page.
ru: Все примеры в этом разделе используют вышеупомянутые модели ``Blog``, ``Author`` и ``Entry``.

source: One-to-many relationships
ru: Связь один-к-многим

source: Forward
ru: Прямая

source: If a model has a :class:`~django.db.models.ForeignKey`, instances of that model will have access to the related (foreign) object via a simple attribute of the model.
ru: Если модель содержит :class:`~django.db.models.ForeignKey`, объект этой модели может получить связанный объект через атрибут модели.

source: You can get and set via a foreign-key attribute. As you may expect, changes to the foreign key aren't saved to the database until you call :meth:`~django.db.models.Model.save`. Example::
ru: Вы можете получить и изменить его через атрибут внешнего ключа. Как вы можете предполагать, изменения не будут сохранены в базу данных, пока не будет вызван метод :meth:`~django.db.models.Model.save`. Например::

source: If a :class:`~django.db.models.ForeignKey` field has ``null=True`` set (i.e., it allows ``NULL`` values), you can assign ``None`` to remove the relation. Example::
ru: Если поле :class:`~django.db.models.ForeignKey` содержит ``null=True`` (то есть разрешено значение ``NULL``), вы можете указать ``None`` для этого поля. Например::

source: Forward access to one-to-many relationships is cached the first time the related object is accessed. Subsequent accesses to the foreign key on the same object instance are cached. Example::
ru: Прямой доступ для связи один-ко-многим кэширует полученное значение при первом обращении. Последующие обращения к внешнему ключу этого же объекта будут использовать кэшированное значение. Например::

source: Note that the :meth:`~django.db.models.query.QuerySet.select_related` :class:`~django.db.models.query.QuerySet` method recursively prepopulates the cache of all one-to-many relationships ahead of time. Example::
ru: Запомните, что вызов метода :meth:`~django.db.models.query.QuerySet.select_related` :class:`~django.db.models.query.QuerySet` рекурсивно заполняет кэш значениями для всех связей один-ко-многим. Например::

source: Following relationships "backward"
ru: "Обратная" связь

source: If a model has a :class:`~django.db.models.ForeignKey`, instances of the foreign-key model will have access to a :class:`~django.db.models.Manager` that returns all instances of the first model. By default, this :class:`~django.db.models.Manager` is named ``FOO_set``, where ``FOO`` is the source model name, lowercased. This :class:`~django.db.models.Manager` returns ``QuerySets``, which can be filtered and manipulated as described in the "Retrieving objects" section above.
ru: Если модель содержит :class:`~django.db.models.ForeignKey, экземпляры модели, указанной в :class:`~django.db.models.ForeignKey`, будет содержать :class:`~django.db.models.Manager`, который вернет все связанные объекты первой модели. По-умолчанию, этот :class:`~django.db.models.Manager` называется ``FOO_set``, где ``FOO`` название основной модели в нижнем регистре. Этот :class:`~django.db.models.Manager` возвращает ``QuerySets``, который может быть отфильтрован и изменен как было описано в разделе "Получение объектов".

source: You can override the ``FOO_set`` name by setting the :attr:`~django.db.models.ForeignKey.related_name` parameter in the :class:`~django.db.models.ForeignKey` definition. For example, if the ``Entry`` model was altered to ``blog = ForeignKey(Blog, on_delete=models.CASCADE, related_name='entries')``, the above example code would look like this::
ru: Вы можете переопределить название ``FOO_set``, установив параметр :attr:`~django.db.models.ForeignKey.related_name` при определении :class:`~django.db.models.ForeignKey`. Например, если бы модель ``Entry`` содержала ``blog = ForeignKey(Blog, on_delete=models.CASCADE, related_name='entries')``, пример выше выглядел бы как::

source: Using a custom reverse manager
ru: Использование своего менеджера для обратных связей

source: By default the :class:`~django.db.models.fields.related.RelatedManager` used for reverse relations is a subclass of the :ref:`default manager <manager-names>` for that model. If you would like to specify a different manager for a given query you can use the following syntax::
ru: По умолчанию для обратных связей используется менеджер :class:`~django.db.models.fields.related.RelatedManager`, который является дочерним классом :ref:`менеджера по умолчанию <manager-names>` модели. Чтобы указать свой менеджер, используйте следующий подход::

source: If ``EntryManager`` performed default filtering in its ``get_queryset()`` method, that filtering would apply to the ``all()`` call.
ru: Если ``EntryManager`` выполняет фильтрацию в методе ``get_queryset()``, она будет выполнена и при вызове ``all()``.

source: Of course, specifying a custom reverse manager also enables you to call its custom methods::
ru: Также вы можете вызывать методы указанного менеджера::

source: Additional methods to handle related objects
ru: Дополнительные методы менеджера связанных объектов

source: In addition to the :class:`~django.db.models.query.QuerySet` methods defined in "Retrieving objects" above, the :class:`~django.db.models.ForeignKey` :class:`~django.db.models.Manager` has additional methods used to handle the set of related objects. A synopsis of each is below, and complete details can be found in the :doc:`related objects reference </ref/models/relations>`.
ru: В дополнение к методам :class:`~django.db.models.query.QuerySet` описанным в разделе "Получение объектов", "обратный" менеджер :class:`~django.db.models.ForeignKey` содержит дополнительные методы для работы со связанными объектами. Краткий список находится ниже, полное описание смотрите в разделе о :doc:`связанных объектах </ref/models/relations>`.

source: Adds the specified model objects to the related object set.
ru: Добавляет указанный объект к связанным объектам.

source: Creates a new object, saves it and puts it in the related object set. Returns the newly created object.
ru: Создает новый объект, сохраняет его и добавляет к связанным объектам. Возвращает созданный объект.

source: Removes the specified model objects from the related object set.
ru: Удаляет указанный объект из списка связанных объектов.

source: Removes all objects from the related object set.
ru: Удаляет все объекты из списка связанных.

source: Replace the set of related objects.
ru: Запросы со связанными объектами.

source: If the ``clear()`` method is available, any pre-existing objects will be removed from the ``entry_set`` before all objects in the iterable (in this case, a list) are added to the set. If the ``clear()`` method is *not* available, all objects in the iterable will be added without removing any existing elements.
ru: Если доступен метод ``clear()``, все связанные объекты будут удаленны из ``entry_set`` перед тем, как все объекты из итератора(в примере это список) будут добавлены в список связанных объектов. Если метод ``clear()`` *не* доступен, все объекты из итератора будут добавлены без удаления существующих объектов.

source: Each "reverse" operation described in this section has an immediate effect on the database. Every addition, creation and deletion is immediately and automatically saved to the database.
ru: Все вышеупомянутые методы сохраняют результат в базу. Каждое добавление, создание или удаление сразу и автоматически выполняет соответствующий запрос в базу данных.

source: Many-to-many relationships
ru: Связь многие-ко-многим

source: An example makes this easier to understand::
ru: Пример все разъяснит::
