Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/topics/db/queries.po
Languages: ru

source: Making queries
ru: Выполнение запросов

source: Once you've created your :doc:`data models </topics/db/models>`, Django automatically gives you a database-abstraction API that lets you create, retrieve, update and delete objects. This document explains how to use this API. Refer to the :doc:`data model reference </ref/models/index>` for full details of all the various model lookup options.
ru: После создания :doc:`модели </topics/db/models>`, Django автоматически создает API для работы с базой данных, который позволяет вам создавать, получать, изменять и удалять объекты. Этот раздел расскажет вам как использовать этот API. В :doc:`описании моделей </ref/models/index>` вы можете найти список всех существующих опций поиска.

source: Throughout this guide (and in the reference), we'll refer to the following models, which comprise a Weblog application:
ru: В этом разделе(и последующих) мы будем использовать такие модели:

source: Creating objects
ru: Создание объектов

source: To represent database-table data in Python objects, Django uses an intuitive system: A model class represents a database table, and an instance of that class represents a particular record in the database table.
ru: Для представления данных таблицы в виде объектов Python, Django использует интуитивно понятную систему: класс модели представляет таблицу, а экземпляр модели - запись в этой таблице.

source: To create an object, instantiate it using keyword arguments to the model class, then call :meth:`~django.db.models.Model.save` to save it to the database.
ru: Чтобы создать объект, создайте экземпляр класса модели, указав необходимые поля в аргументах и вызовите метод :meth:`~django.db.models.Model.save` чтобы сохранить его в базе данных.

source: Assuming models live in a file ``mysite/blog/models.py``, here's an example::
ru: Предположим, что модель находится в ``mysite/blog/models.py``::

source: This performs an ``INSERT`` SQL statement behind the scenes. Django doesn't hit the database until you explicitly call :meth:`~django.db.models.Model.save`.
ru: В результате выполнения этого кода будет создан ``INSERT`` SQL-запрос. Django не выполняет запросов к базе данных, пока не будет вызван метод :meth:`~django.db.models.Model.save`.

source: The :meth:`~django.db.models.Model.save` method has no return value.
ru: Метод :meth:`~django.db.models.Model.save` ничего не возвращает.

source: :meth:`~django.db.models.Model.save` takes a number of advanced options not described here. See the documentation for :meth:`~django.db.models.Model.save` for complete details.
ru: :meth:`~django.db.models.Model.save` принимает ряд аргументов, не описанных в этом разделе. Смотрите документацию о методе :meth:`~django.db.models.Model.save` для подробностей.

source: To create and save an object in a single step, use the :meth:`~django.db.models.query.QuerySet.create()` method.
ru: Чтобы создать и сохранить объект используйте метод :meth:`~django.db.models.query.QuerySet.create()`.

source: Saving changes to objects
ru: Сохранение изменений в объектах

source: To save changes to an object that's already in the database, use :meth:`~django.db.models.Model.save`.
ru: Для сохранения изменений в объект, который уже существует в базе данных, используйте :meth:`~django.db.models.Model.save`.

source: Given a ``Blog`` instance ``b5`` that has already been saved to the database, this example changes its name and updates its record in the database::
ru: В данном примере изменяется название объекта ``b5`` модели ``Blog`` и обновляется запись в базе данных::

source: This performs an ``UPDATE`` SQL statement behind the scenes. Django doesn't hit the database until you explicitly call :meth:`~django.db.models.Model.save`.
ru: В результате выполнения этого кода будет создан ``UPDATE`` SQL запрос. Django не выполняет каких либо запросов к базе данных, пока не будет вызван метод :meth:`~django.db.models.Model.save`.

source: Saving ``ForeignKey`` and ``ManyToManyField`` fields
ru: Сохранение полей ``ForeignKey`` и ``ManyToManyField``

source: Updating a :class:`~django.db.models.ForeignKey` field works exactly the same way as saving a normal field -- simply assign an object of the right type to the field in question. This example updates the ``blog`` attribute of an ``Entry`` instance ``entry``, assuming appropriate instances of ``Entry`` and ``Blog`` are already saved to the database (so we can retrieve them below)::
ru: Обновление :class:`~django.db.models.ForeignKey` работает так же, как и сохранение обычных полей; просто назначьте полю объект необходимого типа. В этом примере обновляется атрибут ``blog`` модели ``Entry`` объектом ``entry``, предполагается что в базе данных уже существуют используемые объекты::

source: Updating a :class:`~django.db.models.ManyToManyField` works a little differently -- use the :meth:`~django.db.models.fields.related.RelatedManager.add` method on the field to add a record to the relation. This example adds the ``Author`` instance ``joe`` to the ``entry`` object::
ru: Обновление :class:`~django.db.models.ManyToManyField` работает немного по-другому; используйте метод :meth:`~django.db.models.fields.related.RelatedManager.add` поля, чтобы добавить связанный объект. В этом примере объект ``joe`` модели ``Author`` добавляется к объекту ``entry``::

source: To add multiple records to a :class:`~django.db.models.ManyToManyField` in one go, include multiple arguments in the call to :meth:`~django.db.models.fields.related.RelatedManager.add`, like this::
ru: Для добавления сразу нескольких объектов в :class:`~django.db.models.ManyToManyField`, добавьте несколько аргументов в метод :meth:`~django.db.models.fields.related.RelatedManager.add`. Например::

source: Django will complain if you try to assign or add an object of the wrong type.
ru: Django вызовет исключение, если вы попытаетесь добавить объект неверного типа.

source: Retrieving objects
ru: Получение объектов

source: To retrieve objects from your database, construct a :class:`~django.db.models.query.QuerySet` via a :class:`~django.db.models.Manager` on your model class.
ru: Для получения объектов из базы данных, создается :class:`~django.db.models.query.QuerySet` через :class:`~django.db.models.Manager` модели.

source: A :class:`~django.db.models.query.QuerySet` represents a collection of objects from your database. It can have zero, one or many *filters*. Filters narrow down the query results based on the given parameters. In SQL terms, a :class:`~django.db.models.query.QuerySet` equates to a ``SELECT`` statement, and a filter is a limiting clause such as ``WHERE`` or ``LIMIT``.
ru: :class:`~django.db.models.query.QuerySet` представляет выборку объектов из базы данных. Он может не содержать, или содержать один или несколько *фильтров* -- критерии для ограничения выборки по определенным параметрам. В терминах SQL, :class:`~django.db.models.query.QuerySet` - это оператор ``SELECT``, а фильтры - условия такие, как ``WHERE`` или ``LIMIT``.

source: You get a :class:`~django.db.models.query.QuerySet` by using your model's :class:`~django.db.models.Manager`. Each model has at least one :class:`~django.db.models.Manager`, and it's called :attr:`~django.db.models.Model.objects` by default. Access it directly via the model class, like so::
ru: Вы получаете :class:`~django.db.models.query.QuerySet`, используя :class:`~django.db.models.Manager`. Каждая модель содержит как минимум один :class:`~django.db.models.Manager`, и он называется :attr:`~django.db.models.Model.objects` по умолчанию. Обратиться к нему можно непосредственно через класс модели::

source: ``Managers`` are accessible only via model classes, rather than from model instances, to enforce a separation between "table-level" operations and "record-level" operations.
ru: Обратиться к менеджерам можно только через модель и нельзя через ее экземпляр. Это сделано для разделения "table-level" операций и "record-level" операций.

source: The :class:`~django.db.models.Manager` is the main source of ``QuerySets`` for a model. For example, ``Blog.objects.all()`` returns a :class:`~django.db.models.query.QuerySet` that contains all ``Blog`` objects in the database.
ru: :class:`~django.db.models.Manager` - главный источник :class:`~django.db.models.query.QuerySet` для модели. Например, ``Blog.objects.all()`` вернет :class:`~django.db.models.query.QuerySet`, который содержит все объекты ``Blog`` из базы данных.

source: Retrieving all objects
ru: Получение всех объектов

source: The simplest way to retrieve objects from a table is to get all of them. To do this, use the :meth:`~django.db.models.query.QuerySet.all` method on a :class:`~django.db.models.Manager`::
ru: Самый простой способ получить объекты из таблицы - это получить их всех. Для этого используйте метод :meth:`~django.db.models.query.QuerySet.all` менеджера(:class:`~django.db.models.Manager`)::

source: The :meth:`~django.db.models.query.QuerySet.all` method returns a :class:`~django.db.models.query.QuerySet` of all the objects in the database.
ru: Метод :meth:`~django.db.models.query.QuerySet.all` возвращает :class:`~django.db.models.query.QuerySet` всех объектов в базе данных.

source: Retrieving specific objects with filters
ru: Получение объектов через фильтры

source: The :class:`~django.db.models.query.QuerySet` returned by :meth:`~django.db.models.query.QuerySet.all` describes all objects in the database table. Usually, though, you'll need to select only a subset of the complete set of objects.
ru: :class:`~django.db.models.query.QuerySet`, возвращенный :class:`~django.db.models.Manager`, описывает все объекты в таблице базы данных. Обычно вам нужно выбрать только подмножество всех объектов.

source: To create such a subset, you refine the initial :class:`~django.db.models.query.QuerySet`, adding filter conditions. The two most common ways to refine a :class:`~django.db.models.query.QuerySet` are:
ru: Для создания такого подмножества, вы можете изменить :class:`~django.db.models.query.QuerySet`, добавив условия фильтрации. Два самых простых метода изменить :class:`~django.db.models.query.QuerySet` - это:

source: Returns a new :class:`~django.db.models.query.QuerySet` containing objects that match the given lookup parameters.
ru: Возвращает новый :class:`~django.db.models.query.QuerySet`, который содержит объекты удовлетворяющие параметрам фильтрации.

source: Returns a new :class:`~django.db.models.query.QuerySet` containing objects that do *not* match the given lookup parameters.
ru: Возвращает новый :class:`~django.db.models.query.QuerySet` содержащий объекты, которые *не* удовлетворяют параметрам фильтрации.

source: The lookup parameters (``**kwargs`` in the above function definitions) should be in the format described in `Field lookups`_ below.
ru: Параметры фильтрации (``**kwargs`` в определении функций выше) должны быть в формате описанном в разделе `Field lookups`_.

source: For example, to get a :class:`~django.db.models.query.QuerySet` of blog entries from the year 2006, use :meth:`~django.db.models.query.QuerySet.filter` like so::
ru: Например, для создания :class:`~django.db.models.query.QuerySet` чтобы получить записи с 2006, используйте :meth:`~django.db.models.query.QuerySet.filter` таким образом::

source: With the default manager class, it is the same as::
ru: Это аналогично::

source: Chaining filters
ru: Цепочка фильтров

source: The result of refining a :class:`~django.db.models.query.QuerySet` is itself a :class:`~django.db.models.query.QuerySet`, so it's possible to chain refinements together. For example::
ru: Результат изменения :class:`~django.db.models.query.QuerySet` - это новый :class:`~django.db.models.query.QuerySet` и можно использовать цепочки фильтров. Например::

source: This takes the initial :class:`~django.db.models.query.QuerySet` of all entries in the database, adds a filter, then an exclusion, then another filter. The final result is a :class:`~django.db.models.query.QuerySet` containing all entries with a headline that starts with "What", that were published between January 30, 2005, and the current day.
ru: В этом примере к начальному :class:`~django.db.models.query.QuerySet`, который возвращает все объекты, добавляется фильтр, затем исключающий фильтр, и еще один фильтр. Полученный :class:`~django.db.models.query.QuerySet` содержит все объекты, у которых заголовок начинается с "What", и которые были опубликованы между 30-го января 2005 и текущей датой.

source: Each time you refine a :class:`~django.db.models.query.QuerySet`, you get a brand-new :class:`~django.db.models.query.QuerySet` that is in no way bound to the previous :class:`~django.db.models.query.QuerySet`. Each refinement creates a separate and distinct :class:`~django.db.models.query.QuerySet` that can be stored, used and reused.
ru: После каждого изменения :class:`~django.db.models.query.QuerySet`, вы получаете новый :class:`~django.db.models.query.QuerySet`, который никак не связан с предыдущим :class:`~django.db.models.query.QuerySet`. Каждый раз создается отдельный :class:`~django.db.models.query.QuerySet`, который может быть сохранен и использован.

source: Example::
ru: Например::

source: These three ``QuerySets`` are separate. The first is a base :class:`~django.db.models.query.QuerySet` containing all entries that contain a headline starting with "What". The second is a subset of the first, with an additional criteria that excludes records whose ``pub_date`` is today or in the future. The third is a subset of the first, with an additional criteria that selects only the records whose ``pub_date`` is today or in the future. The initial :class:`~django.db.models.query.QuerySet` (``q1``) is unaffected by the refinement process.
ru: Эти три ``QuerySets`` независимы. Первый -- это базовый :class:`~django.db.models.query.QuerySet`, который содержит все объекты с заголовками, которые начинаются с "What". Второй -- это множество первых с дополнительным критерием фильтрации, который исключает объекты с ``pub_date`` больше, чем текущая дата. Третий -- это множество первого, с отфильтрованными объектами, у которых ``pub_date`` больше, чем текущая дата. Первоначальный :class:`~django.db.models.query.QuerySet` (``q1``) не изменяется последующим добавлением фильтров.

source: ``QuerySets`` are lazy -- the act of creating a :class:`~django.db.models.query.QuerySet` doesn't involve any database activity. You can stack filters together all day long, and Django won't actually run the query until the :class:`~django.db.models.query.QuerySet` is *evaluated*. Take a look at this example::
ru: ``QuerySets`` -- ленивы, создание :class:`~django.db.models.query.QuerySet` не выполняет запросов к базе данных. Вы можете добавлять фильтры хоть весь день и Django не выполнит ни один запрос, пока :class:`~django.db.models.query.QuerySet` не *вычислен*. Разберем такой пример::

source: Though this looks like three database hits, in fact it hits the database only once, at the last line (``print(q)``). In general, the results of a :class:`~django.db.models.query.QuerySet` aren't fetched from the database until you "ask" for them. When you do, the :class:`~django.db.models.query.QuerySet` is *evaluated* by accessing the database. For more details on exactly when evaluation takes place, see :ref:`when-querysets-are-evaluated`.
ru: Глядя на это можно подумать что было выполнено три запроса в базу данных. На самом деле был выполнен один запрос, в последней строке (``print(q)``). Результат :class:`~django.db.models.query.QuerySet` не будет получен из базы данных, пока вы не "попросите" об этом. Когда вы делаете это, :class:`~django.db.models.query.QuerySet` *вычисляется* запросом к базе данных. Для подробностей, в какой момент выполняется запрос, смотрите :ref:`when-querysets-are-evaluated`.

source: :meth:`~django.db.models.query.QuerySet.filter` will always give you a :class:`~django.db.models.query.QuerySet`, even if only a single object matches the query - in this case, it will be a :class:`~django.db.models.query.QuerySet` containing a single element.
ru: :meth:`~django.db.models.query.QuerySet.filter` всегда возвращает :class:`~django.db.models.query.QuerySet`, даже если только один объект возвращен запросом - в этом случае, это будет :class:`~django.db.models.query.QuerySet` содержащий один объект.

source: If you know there is only one object that matches your query, you can use the :meth:`~django.db.models.query.QuerySet.get` method on a :class:`~django.db.models.Manager` which returns the object directly::
ru: Если вы знаете, что только один объект возвращается запросом, вы можете использовать метод :meth:`~django.db.models.query.QuerySet.get` менеджера(:class:`~django.db.models.Manager`), который возвращает непосредственно объект::

source: You can use any query expression with :meth:`~django.db.models.query.QuerySet.get`, just like with :meth:`~django.db.models.query.QuerySet.filter` - again, see `Field lookups`_ below.
ru: Вы можете использовать для :meth:`~django.db.models.query.QuerySet.get` аргументы, такие же, как и для :meth:`~django.db.models.query.QuerySet.filter` - смотрите `Field lookups`_ далее.

source: Note that there is a difference between using :meth:`~django.db.models.query.QuerySet.get`, and using :meth:`~django.db.models.query.QuerySet.filter` with a slice of ``[0]``. If there are no results that match the query, :meth:`~django.db.models.query.QuerySet.get` will raise a ``DoesNotExist`` exception. This exception is an attribute of the model class that the query is being performed on - so in the code above, if there is no ``Entry`` object with a primary key of 1, Django will raise ``Entry.DoesNotExist``.
ru: Учтите, что есть разница между использованием :meth:`~django.db.models.query.QuerySet.get` и :meth:`~django.db.models.query.QuerySet.filter` с ``[0]``. Если результат пустой, :meth:`~django.db.models.query.QuerySet.get` вызовет исключение ``DoesNotExist``. Это исключение является атрибутом модели, для которой выполняется запрос. Если в примере выше не существует объекта ``Entry`` с первичным ключом равным 1, Django вызовет исключение ``Entry.DoesNotExist``.

source: Similarly, Django will complain if more than one item matches the :meth:`~django.db.models.query.QuerySet.get` query. In this case, it will raise :exc:`~django.core.exceptions.MultipleObjectsReturned`, which again is an attribute of the model class itself.
ru: Также Django отреагирует, если запрос :meth:`~django.db.models.query.QuerySet.get` вернет не один объект. В этом случае будет вызвано исключение :exc:`~django.core.exceptions.MultipleObjectsReturned`, которое также является атрибутом класса модели.

source: Most of the time you'll use :meth:`~django.db.models.query.QuerySet.all`, :meth:`~django.db.models.query.QuerySet.get`, :meth:`~django.db.models.query.QuerySet.filter` and :meth:`~django.db.models.query.QuerySet.exclude` when you need to look up objects from the database. However, that's far from all there is; see the :ref:`QuerySet API Reference <queryset-api>` for a complete list of all the various :class:`~django.db.models.query.QuerySet` methods.
ru: В большинстве случаев вы будете использовать :meth:`~django.db.models.query.QuerySet.all`, :meth:`~django.db.models.query.QuerySet.get`, :meth:`~django.db.models.query.QuerySet.filter` и :meth:`~django.db.models.query.QuerySet.exclude` для получения объектов из базы данных. Однако это не все доступные возможности; смотрите :ref:`документацию о QuerySet API <queryset-api>` для получения информации о всех существующих методах :class:`~django.db.models.query.QuerySet`.

source: Use a subset of Python's array-slicing syntax to limit your :class:`~django.db.models.query.QuerySet` to a certain number of results. This is the equivalent of SQL's ``LIMIT`` and ``OFFSET`` clauses.
ru: Используйте синтаксис срезов для списков Python для ограничения результата выборки :class:`~django.db.models.query.QuerySet`. Это эквивалент таких операторов SQL как ``LIMIT`` и ``OFFSET``.

source: For example, this returns the first 5 objects (``LIMIT 5``)::
ru: Например, этот код возвращает 5 первых объектов (``LIMIT 5``)::

source: This returns the sixth through tenth objects (``OFFSET 5 LIMIT 5``)::
ru: Этот возвращает с шестого по десятый (``OFFSET 5 LIMIT 5``)::

source: Negative indexing (i.e. ``Entry.objects.all()[-1]``) is not supported.
ru: Отрицательные индексы (например, ``Entry.objects.all()[-1]``) не поддерживаются.

source: Generally, slicing a :class:`~django.db.models.query.QuerySet` returns a new :class:`~django.db.models.query.QuerySet` -- it doesn't evaluate the query. An exception is if you use the "step" parameter of Python slice syntax. For example, this would actually execute the query in order to return a list of every *second* object of the first 10::
ru: На самом деле, срез :class:`~django.db.models.query.QuerySet` возвращает новый :class:`~django.db.models.query.QuerySet` -- запрос не выполняется. Исключением является использовании "шага" в срезе. Например, этот пример выполнил бы запрос, возвращающий каждый *второй* объект из первых 10::

source: To retrieve a *single* object rather than a list (e.g. ``SELECT foo FROM bar LIMIT 1``), use a simple index instead of a slice. For example, this returns the first ``Entry`` in the database, after ordering entries alphabetically by headline::
ru: Для получения *одного* объекта, а не списка (например, ``SELECT foo FROM bar LIMIT 1``), используйте индекс вместо среза. Например, этот код возвращает первый объект ``Entry`` в базе данных, после сортировки записей по заголовку::

source: This is roughly equivalent to::
ru: Это эквивалент::

source: Note, however, that the first of these will raise ``IndexError`` while the second will raise ``DoesNotExist`` if no objects match the given criteria. See :meth:`~django.db.models.query.QuerySet.get` for more details.
ru: Заметим, что первый пример вызовет ``IndexError``, в то время как второй - ``DoesNotExist``, если запрос не вернёт ни одного объекта. Смотрите :meth:`~django.db.models.query.QuerySet.get` для подробностей.

source: Field lookups
ru: Фильтры полей

source: Field lookups are how you specify the meat of an SQL ``WHERE`` clause. They're specified as keyword arguments to the :class:`~django.db.models.query.QuerySet` methods :meth:`~django.db.models.query.QuerySet.filter`, :meth:`~django.db.models.query.QuerySet.exclude` and :meth:`~django.db.models.query.QuerySet.get`.
ru: Фильтры полей -- это "операторы" для составления условий SQL ``WHERE``. Они задаются как именованные аргументы для метода :meth:`~django.db.models.query.QuerySet.filter`, :meth:`~django.db.models.query.QuerySet.exclude` и :meth:`~django.db.models.query.QuerySet.get` в :class:`~django.db.models.query.QuerySet`.

source: Basic lookups keyword arguments take the form ``field__lookuptype=value``. (That's a double-underscore). For example::
ru: Фильтры полей выглядят как ``field__lookuptype=value``. (Используется двойное подчеркивание). Например::

source: translates (roughly) into the following SQL:
ru: будет транслировано в SQL:

source: How this is possible
ru: Как это работает

source: The field specified in a lookup has to be the name of a model field. There's one exception though, in case of a :class:`~django.db.models.ForeignKey` you can specify the field name suffixed with ``_id``. In this case, the value parameter is expected to contain the raw value of the foreign model's primary key. For example:
ru: Поля указанные при фильтрации должны быть полями модели. Есть одно исключение, для поля :class:`~django.db.models.ForeignKey` можно указать поле с суффиксом ``_id``. В этом случае необходимо передать значение первичного ключа связанной модели. Например:
