Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/topics/db/sql.po
Languages: ru

source: Performing raw SQL queries
ru: Использование чистого SQL

source: When the :doc:`model query APIs </topics/db/queries>` don't go far enough, you can fall back to writing raw SQL. Django gives you two ways of performing raw SQL queries: you can use :meth:`Manager.raw()` to `perform raw queries and return model instances`__, or you can avoid the model layer entirely and `execute custom SQL directly`__.
ru: Если вам не хватает возможностей :doc:`API ORM Django </topics/db/queries>`, вы можете использовать чистый SQL. Django предоставляет два способа для выполнения чистых SQL запросов: вы можете использовать :meth:`Manager.raw()` для :ref:`для выполнения запроса и возврата объектов модели <executing-raw-queries>`, или вообще не использовать модели и :ref:`напрямую выполнить SQL запрос <executing-custom-sql>`.

source: You should be very careful whenever you write raw SQL. Every time you use it, you should properly escape any parameters that the user can control by using ``params`` in order to protect against SQL injection attacks. Please read more about :ref:`SQL injection protection <sql-injection-protection>`.
ru: Вы должны быть предельно осторожны, используя SQL. Экранируйте все параметры, контролируемые пользователем, используя ``params``, чтобы защитится от SQL инъекции. Больше о :ref:`защите от SQL инъекций <sql-injection-protection>`.

source: Performing raw queries
ru: Выполнение чистых запросов

source: The ``raw()`` manager method can be used to perform raw SQL queries that return model instances:
ru: Метод ``raw()`` менеджера может использоваться для выполнения чистых SQL и возврата объектов модели:

source: This method takes a raw SQL query, executes it, and returns a ``django.db.models.query.RawQuerySet`` instance. This ``RawQuerySet`` instance can be iterated over just like a normal :class:`~django.db.models.query.QuerySet` to provide object instances.
ru: Этот метод принимает чистый SQL запрос, выполняет его, и возвращает экземпляр ``django.db.models.query.RawQuerySet``. Экземпляр ``RawQuerySet`` может быть проитерирован как и обычный :class:`~django.db.models.query.QuerySet` для получения объектов.

source: This is best illustrated with an example. Suppose you have the following model::
ru: Лучше посмотрим на пример. Предположим у нас есть такая модель::

source: You could then execute custom SQL like so::
ru: Вы можете выполнить следующий SQL::

source: Of course, this example isn't very exciting -- it's exactly the same as running ``Person.objects.all()``. However, ``raw()`` has a bunch of other options that make it very powerful.
ru: Конечно же этот пример не впечатляющий -- это все равно что выполнить ``Person.objects.all()``. Однако, ``raw()`` принимает ряд дополнительных параметров, что делает его очень полезным.

source: Model table names
ru: Названия таблиц для моделей

source: Where did the name of the ``Person`` table come from in that example?
ru: Откуда берется название таблицы для модели ``Person`` в этом примере?

source: By default, Django figures out a database table name by joining the model's "app label" -- the name you used in ``manage.py startapp`` -- to the model's class name, with an underscore between them. In the example we've assumed that the ``Person`` model lives in an app named ``myapp``, so its table would be ``myapp_person``.
ru: По умолчанию Django создает название таблицы объединив название приложения(название которое вы использовали при вызове ``manage.py startapp``), в котором находиться модель, и название модели с нижним подчеркиванием между ними. В нашем примере модель ``Person`` предположительно находится в приложение ``myapp``, поэтому название таблицы в базе данных будет ``myapp_person``.

source: For more details check out the documentation for the :attr:`~Options.db_table` option, which also lets you manually set the database table name.
ru: Подробности смотрите в описании настройки модели :attr:`~Options.db_table`, которая также позволяет явно указать название таблицы.

source: No checking is done on the SQL statement that is passed in to ``.raw()``. Django expects that the statement will return a set of rows from the database, but does nothing to enforce that. If the query does not return rows, a (possibly cryptic) error will result.
ru: SQL Запрос переданный в ``.raw()`` не проверяется. Django ожидает что он вернет набор записей с результатом, но никак не принуждает к этому. Если запрос возвращает не набор записей, вы получите ошибку.

source: If you are performing queries on MySQL, note that MySQL's silent type coercion may cause unexpected results when mixing types. If you query on a string type column, but with an integer value, MySQL will coerce the types of all values in the table to an integer before performing the comparison. For example, if your table contains the values ``'abc'``, ``'def'`` and you query for ``WHERE mycolumn=0``, both rows will match. To prevent this, perform the correct typecasting before using the value in a query.
ru: Выполняя запрос в MySQL, обратите внимание на преобразование типов. Если вы выполняете запрос по текстовому полю, но используете числовое значение, MySQL преобразует все значения поля в число перед сравнением. Например, если таблица содержит значения ``'abc'``, ``'def'`` и в запросе ``WHERE mycolumn=0``, обе строки попадут в результат. Чтобы избежать этого, используйте значение правильного типа в запросе.

source: While a ``RawQuerySet`` instance can be iterated over like a normal :class:`~django.db.models.query.QuerySet`, ``RawQuerySet`` doesn't implement all methods you can use with ``QuerySet``. For example, ``__bool__()`` and ``__len__()`` are not defined in ``RawQuerySet``, and thus all ``RawQuerySet`` instances are considered ``True``. The reason these methods are not implemented in ``RawQuerySet`` is that implementing them without internal caching would be a performance drawback and adding such caching would be backward incompatible.
ru: Хотя ``RawQuerySet`` и можно проитерировать как :class:`~django.db.models.query.QuerySet`, ``RawQuerySet`` не предоставляет все методы ``QuerySet``. Например, ``__bool__()`` и ``__len__()`` не определены в ``RawQuerySet``, все экземпляры ``RawQuerySet`` равны ``True``. Они не определены в ``RawQuerySet``, потому что их реализация без внутреннего кеширования может вызвать большие проблемы с производительностью, а добавление такого кеша повредило бы обратной совместимости.

source: Mapping query fields to model fields
ru: Соответствие полей ответа и полей модели

source: ``raw()`` automatically maps fields in the query to fields on the model.
ru: ``raw()`` автоматически сопоставляет поля ответа и поля модели.

source: The order of fields in your query doesn't matter. In other words, both of the following queries work identically::
ru: Порядок полей в запросе не важен. Другими словами, следующие два запроса идентичны::

source: Matching is done by name. This means that you can use SQL's ``AS`` clauses to map fields in the query to model fields. So if you had some other table that had ``Person`` data in it, you could easily map it into ``Person`` instances::
ru: Сопоставление производится по названию поля. Это означает что вы можете использовать SQL оператор ``AS``, чтобы поля в запросе соответствовали полям модели. Если у вас есть другая таблица, содержащая данные о ``Person``, вы можете легко сопоставить ее с моделью ``Person`` при запросе::

source: As long as the names match, the model instances will be created correctly.
ru: Пока названия полей совпадают, экземпляр модели будет успешно создан.

source: Alternatively, you can map fields in the query to model fields using the ``translations`` argument to ``raw()``. This is a dictionary mapping names of fields in the query to names of fields on the model. For example, the above query could also be written::
ru: Вы также можете сопоставить поля ответа и модели, используя аргумент ``translations`` при вызове ``raw()``. Это словарь, указывающий соответствие полей в запросе к полям модели. Например, вышеприведенный запрос может быть выполнен следующим образом::

source: Index lookups
ru: Индексирование

source: ``raw()`` supports indexing, so if you need only the first result you can write::
ru: ``raw()`` поддерживает индексирование. Если вам нужна только первая запись результата, вы можете сделать следующее::

source: However, the indexing and slicing are not performed at the database level. If you have a large number of ``Person`` objects in your database, it is more efficient to limit the query at the SQL level::
ru: Однако, индексирование и "slicing" выполняется не на уровне базы данных. Если база данных содержит большое количество записей ``Person``, эффективнее ограничить результат выборки на уровне SQL::

source: Deferring model fields
ru: Отложенная загрузка полей

source: Fields may also be left out::
ru: Часть полей при запросе может быть опущена::

source: The ``Person`` objects returned by this query will be deferred model instances (see :meth:`~django.db.models.query.QuerySet.defer()`). This means that the fields that are omitted from the query will be loaded on demand. For example::
ru: Объекты ``Person``, возвращенные этим запросом будут "отложенными"(*пер.* - deferred) экземплярами модели (смотрите :meth:`~django.db.models.query.QuerySet.defer()`). Это означает, что пропущенные поля будут загружены при обращении к ним. Например::

source: From outward appearances, this looks like the query has retrieved both the first name and last name. However, this example actually issued 3 queries. Only the first names were retrieved by the raw() query -- the last names were both retrieved on demand when they were printed.
ru: На первый взгляд, кажется что запрос вернул имя и фамилию. Однако, на самом деле этот пример выполнил три Запроса. Только имя было получено при выполнении ``raw()`` -- фамилия была получена при обращении к полю для двух объектов.

source: There is only one field that you can't leave out - the primary key field. Django uses the primary key to identify model instances, so it must always be included in a raw query. An ``InvalidQuery`` exception will be raised if you forget to include the primary key.
ru: Есть только одно поле, которое вы обязаны загрузить - первичный ключ. Django использует первичный ключ для идентификации экземпляра модели, поэтому он всегда должен присутствовать в запросе. Если вы забудете про первичный ключ, будет вызвано исключение ``InvalidQuery``.

source: Adding annotations
ru: Добавление аннотации

source: You can also execute queries containing fields that aren't defined on the model. For example, we could use `PostgreSQL's age() function`__ to get a list of people with their ages calculated by the database::
ru: Вы можете выполнять запросы, которые возвращают поля, отсутствующие в модели. Например, мы можем использовать `функцию PostgreSQL age() <http://www.postgresql.org/docs/8.4/static/functions-datetime.html>`__, чтобы получить список людей и их возраст вычисленный базой данных::

source: Passing parameters into ``raw()``
ru: Передача параметров в ``raw()``

source: If you need to perform parameterized queries, you can use the ``params`` argument to ``raw()``::
ru: Если вам необходимо выполнить запрос с параметрами, используйте аргумент ``params``::

source: ``params`` is a list or dictionary of parameters. You'll use ``%s`` placeholders in the query string for a list, or ``%(key)s`` placeholders for a dictionary (where ``key`` is replaced by a dictionary key, of course), regardless of your database engine. Such placeholders will be replaced with parameters from the ``params`` argument.
ru: ``params`` -- это список параметров. Используйте ``%s`` в строке с запросом для списка параметров, или ``%(key)s`` для словаря(где ``key`` будет заменен на значение ключа из словаря), независимо от базы данных. При выполнении запроса будут подставлены значения из списка ``params``.

source: Dictionary params are not supported with the SQLite backend; with this backend, you must pass parameters as a list.
ru: Параметры из словаря не поддерживаются SQLite, необходимо использовать список.

source: **Do not use string formatting on raw queries!**
ru: **Не используйте форматирование строк в запросе!**

source: It's tempting to write the above query as::
ru: Очень заманчиво написать запрос следующим образом::

source: **Don't.**
ru: **Не делайте этого.**

source: Using the ``params`` argument completely protects you from `SQL injection attacks`__, a common exploit where attackers inject arbitrary SQL into your database. If you use string interpolation, sooner or later you'll fall victim to SQL injection. As long as you remember to always use the ``params`` argument you'll be protected.
ru: Используя ``params`` вы полностью защищены от `Атак с внедрением SQL-кода <http://ru.wikipedia.org/wiki/%D0%92%D0%BD%D0%B5%D0%B4%D1%80%D0%B5%D0%BD%D0%B8%D0%B5_SQL-%D0%BA%D0%BE%D0%B4%D0%B0>`_. При вставке параметров непосредственно в строку запроса, рано или поздно вы станете жертвой атаки. Используя аргумент ``params`` вы обезопасите себя от этого.

source: Executing custom SQL directly
ru: Непосредственное выполнение SQL запроса

source: Sometimes even :meth:`Manager.raw` isn't quite enough: you might need to perform queries that don't map cleanly to models, or directly execute ``UPDATE``, ``INSERT``, or ``DELETE`` queries.
ru: Иногда и :meth:`Manager.raw` не достаточно: иногда вам необходимо выполнить запросы, которые не относятся ни к одной из моделей, или напрямую выполнить запросы ``UPDATE``, ``INSERT`` или ``DELETE``.

source: In these cases, you can always access the database directly, routing around the model layer entirely.
ru: В таких случаях вы можете обратиться к базе данных напрямую в обход уровня моделей.

source: The object ``django.db.connection`` represents the default database connection. To use the database connection, call ``connection.cursor()`` to get a cursor object. Then, call ``cursor.execute(sql, [params])`` to execute the SQL and ``cursor.fetchone()`` or ``cursor.fetchall()`` to return the resulting rows.
ru: Объект ``django.db.connection`` представляет подключение к базе данных по умолчанию. Для использования подключения к базе данных, вызовите ``connection.cursor()``, чтобы получить объект "указателя". Затем вызовите ``cursor.execute(sql, [params])`` для выполнения SQL и ``cursor.fetchone()`` или ``cursor.fetchall()`` для получения результата.

source: For example::
ru: Например::

source: Note that if you want to include literal percent signs in the query, you have to double them in the case you are passing parameters::
ru: Если необходимо вставить символ процента, необходимо его продублировать::

source: If you are using :doc:`more than one database </topics/db/multi-db>`, you can use ``django.db.connections`` to obtain the connection (and cursor) for a specific database. ``django.db.connections`` is a dictionary-like object that allows you to retrieve a specific connection using its alias::
ru: Если вы используете :doc:`несколько баз данных </topics/db/multi-db>`, вы можете использовать ``django.db.connections`` для получения подключения к конкретной базе данных. ``django.db.connections`` -- объект-словарь, позволяющий получить подключение по псевдониму базы данных::

source: By default, the Python DB API will return results without their field names, which means you end up with a ``list`` of values, rather than a ``dict``. At a small performance and memory cost, you can return results as a ``dict`` by using something like this::
ru: По умолчанию Python DB API вернет результат без названий полей, то есть вы получите список значений, а не словарь. За счет небольшой потери производительности вы можете получить словарь следующим образом::

source: Another option is to use :func:`collections.namedtuple` from the Python standard library. A ``namedtuple`` is a tuple-like object that has fields accessible by attribute lookup; it's also indexable and iterable. Results are immutable and accessible by field names or indices, which might be useful::
ru: Еще один вариант -- использовать :func:`collections.namedtuple` из стандартных библиотек Python. ``namedtuple`` -- это объект с интерфейсом кортежа, который предоставляет доступ к полям через атрибут. Он также поддерживает индексы и итерацию. Результат нельзя поменять и можно получить через название поля или индекс::

source: Here is an example of the difference between the three::
ru: Пример, показывающий разницу между тремя методами::

source: Connections and cursors
ru: Подключения и указатель

source: ``connection`` and ``cursor`` mostly implement the standard Python DB-API described in :pep:`249` — except when it comes to :doc:`transaction handling </topics/db/transactions>`.
ru: ``connection`` и ``cursor`` реализуют стандартный Python DB-API описанный в :pep:`249`, кроме механизма :doc:`работы с транзакциями </topics/db/transactions>`.

source: If you're not familiar with the Python DB-API, note that the SQL statement in ``cursor.execute()`` uses placeholders, ``"%s"``, rather than adding parameters directly within the SQL. If you use this technique, the underlying database library will automatically escape your parameters as necessary.
ru: Если вы не знакомы с Python DB-API, заметьте что SQL запрос переданный ``cursor.execute()`` использует подстановку параметром, ``"%s"``, вместо непосредственного добавления их в строку SQL запроса. При использовании такого подхода, библиотека для работы с текущей базой данной автоматически экранирует параметры.

source: Also note that Django expects the ``"%s"`` placeholder, *not* the ``"?"`` placeholder, which is used by the SQLite Python bindings. This is for the sake of consistency and sanity.
ru: Также заметим, что Django принимает ``"%s"``, *не* ``"?"``, который использует библиотекой для SQLite в Python. Так сделано для последовательности и удобства.

source: Using a cursor as a context manager::
ru: Использование курсора как контекстный менеджер::

source: is equivalent to::
ru: эквивалентно::
