Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/topics/db/tablespaces.po
Languages: ru

source: Tablespaces
ru: Табличные пространства

source: A common paradigm for optimizing performance in database systems is the use of `tablespaces`_ to organize disk layout.
ru: Общая парадигма для оптимизации производительности в системах баз данных заключается в использовании `tablespaces`_ для распределения данных по дискам.

source: Django does not create the tablespaces for you. Please refer to your database engine's documentation for details on creating and managing tablespaces.
ru: Django не создаёт табличные пространства для вас. Пожалуйста, обратитесь к документации на вашу базу данных насчёт подробностей по созданию и управлению табличными пространствами.

source: Declaring tablespaces for tables
ru: Определение табличных пространств для таблиц

source: A tablespace can be specified for the table generated by a model by supplying the :attr:`~django.db.models.Options.db_tablespace` option inside the model's ``class Meta``. This option also affects tables automatically created for :class:`~django.db.models.ManyToManyField`\ s in the model.
ru: Для таблицы, созданной по модели, может быть указано табличное пространство с помощью атрибута :attr:`~django.db.models.Options.db_tablespace` внутри класса ``Meta``. Этот атрибут также имеет влияние на таблицы, которые автоматически создаются для :class:`~django.db.models.ManyToManyField` полей в модели.

source: You can use the :setting:`DEFAULT_TABLESPACE` setting to specify a default value for :attr:`~django.db.models.Options.db_tablespace`. This is useful for setting a tablespace for the built-in Django apps and other applications whose code you cannot control.
ru: Вы можете использовать параметр конфигурации :setting:`DEFAULT_TABLESPACE` для указания значения по-умолчанию для атрибута :attr:`~django.db.models.Options.db_tablespace`. Данный параметр полезен для определения табличного пространства для встроенных приложений Django и для других приложений, код которых вы не можете контролировать.

source: Declaring tablespaces for indexes
ru: Определение табличных пространств для индексов

source: You can pass the :attr:`~django.db.models.Field.db_tablespace` option to a ``Field`` constructor to specify an alternate tablespace for the ``Field``’s column index. If no index would be created for the column, the option is ignored.
ru: Вы можете передать атрибут :attr:`~django.db.models.Field.db_tablespace` в конструктор ``Field``, чтобы указать табличное пространство для индекса данного поля. Атрибут игнорируется, если не требуется создавать индекс.

source: You can use the :setting:`DEFAULT_INDEX_TABLESPACE` setting to specify a default value for :attr:`~django.db.models.Field.db_tablespace`.
ru: Вы можете использовать параметр конфигурации :setting:`DEFAULT_INDEX_TABLESPACE` для указания значения по-умолчанию для атрибута :attr:`~django.db.models.Field.db_tablespace`.

source: If :attr:`~django.db.models.Field.db_tablespace` isn't specified and you didn't set :setting:`DEFAULT_INDEX_TABLESPACE`, the index is created in the same tablespace as the tables.
ru: Если атрибут :attr:`~django.db.models.Field.db_tablespace` не определён и вы не задали значение для параметра конфигурации :setting:`DEFAULT_INDEX_TABLESPACE`, индекс будет создан в том же табличном пространстве, что и сама таблица.

source: An example
ru: Пример

source: In this example, the tables generated by the ``TablespaceExample`` model (i.e. the model table and the many-to-many table) would be stored in the ``tables`` tablespace. The index for the name field and the indexes on the many-to-many table would be stored in the ``indexes`` tablespace. The ``data`` field would also generate an index, but no tablespace for it is specified, so it would be stored in the model tablespace ``tables`` by default.
ru: В данном примере, таблицы, созданные для модели ``TablespaceExample`` (т.е., таблица модели и таблица для связи многие-ко-многим), будут размещены в табличном пространстве ``tables``. Индекс для поля ``name`` и индекс для таблицы связей многие-ко-многим будут размещены в табличном пространстве ``indexes``. Поле ``data`` также создаёт индекс, но для него не указано никакого табличного пространства, таким образом, индекс будет создан в табличном пространстве ``tables`` по-умолчанию.

source: Database support
ru: Поддержка баз данных

source: PostgreSQL and Oracle support tablespaces. SQLite and MySQL don't.
ru: PostgreSQL и Oracle поддерживают табличные пространства. SQLite и MySQL не поддерживают.

source: When you use a backend that lacks support for tablespaces, Django ignores all tablespace-related options.
ru: При использовании бэкенда, который не обеспечивает поддержку табличных пространств, Django будет игнорировать все атрибуты для табличных пространств.
