Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/topics/db/transactions.po
Languages: ru

source: Callbacks are not run until autocommit is restored on the connection following the commit (because otherwise any queries done in a callback would open an implicit transaction, preventing the connection from going back into autocommit mode).
ru: Обработчики не вызываются, пока не будет восстановлен "autocommit" (т.к. любой запрос в обработчике неявно создаст транзакцию и заблокирует переход подключения в "autocommit" режим).

source: When in autocommit mode and outside of an :func:`atomic` block, the function will run immediately, not on commit.
ru: Если назначить обработчик в "autocommit" режиме вне блока :func:`atomic`, он будет выполнен моментально, а не после коммита.

source: On-commit functions only work with :ref:`autocommit mode <managing-autocommit>` and the :func:`atomic` (or :setting:`ATOMIC_REQUESTS <DATABASE-ATOMIC_REQUESTS>`) transaction API. Calling :func:`on_commit` when autocommit is disabled and you are not within an atomic block will result in an error.
ru: Обработчики коммита транзакции работают только с :ref:`"autocommit" режимом <managing-autocommit>` и :func:`atomic` (или при :setting:`ATOMIC_REQUESTS <DATABASE-ATOMIC_REQUESTS>`) API транзакций. Вызвав :func:`on_commit` при отключенном "autocommit" и вне блока ``atomic`` приведет к ошибке.

source: Use in tests
ru: Использование в тестах

source: Django's :class:`~django.test.TestCase` class wraps each test in a transaction and rolls back that transaction after each test, in order to provide test isolation. This means that no transaction is ever actually committed, thus your :func:`on_commit` callbacks will never be run. If you need to test the results of an :func:`on_commit` callback, use a :class:`~django.test.TransactionTestCase` instead.
ru: Встроенный класс :class:`~django.test.TestCase` оборачивает каждый тест в транзакцию и отменяет её после выполнения теста, чтобы обеспечить изолированность тестов. Это означает, что ни одна транзакция никогда не коммитится, и обработчики :func:`on_commit` никогда не будут вызваны. Если вам нужно протестировать выполнение обработчика :func:`on_commit`, используйте :class:`~django.test.TransactionTestCase`.

source: Why no rollback hook?
ru: Почему нет обработчика отмены транзакции?

source: A rollback hook is harder to implement robustly than a commit hook, since a variety of things can cause an implicit rollback.
ru: Обработчик отмены транзакции реализовать на много сложнее т.к. причин отката на много больше.

source: For instance, if your database connection is dropped because your process was killed without a chance to shut down gracefully, your rollback hook will never run.
ru: Например, если подключение к базе данных оборвалось из-за внезапной остановки процесса, ваш обработчик отмены транзакции никогда не сможет выполниться.

source: The solution is simple: instead of doing something during the atomic block (transaction) and then undoing it if the transaction fails, use :func:`on_commit` to delay doing it in the first place until after the transaction succeeds. It's a lot easier to undo something you never did in the first place!
ru: Решение простое: вместо того, чтобы выполнить что-то в блоке транзакции и затем отменять это при отмене транзакции, используйте :func:`on_commit`, чтобы отложить эти действия на момент успешного выполнения транзакции. На много проще отметить то, что никогда не выполнялось!

source: Low-level APIs
ru: Низкоуровневый API

source: Always prefer :func:`atomic` if possible at all. It accounts for the idiosyncrasies of each database and prevents invalid operations.
ru: При любой возможности используйте :func:`atomic`. Эта функция учитывает особенности различных баз данных и предотвращает использование недоступных операций.

source: The low level APIs are only useful if you're implementing your own transaction management.
ru: Низкоуровневый API полезен только при реализации собственного управления транзакциями.

source: Django provides a straightforward API in the :mod:`django.db.transaction` module to manage the autocommit state of each database connection.
ru: Django предоставляет простой API в модуле :mod:`django.db.transaction` для управления "autocommit" для каждого подключения к базе данных.

source: These functions take a ``using`` argument which should be the name of a database. If it isn't provided, Django uses the ``"default"`` database.
ru: Каждая из этих функций принимает аргумент ``using``, который обозначает имя базы данных. Если этот аргумент не указан, то все действия идут относительно стандартной (``"default"``) базы данных.

source: Autocommit is initially turned on. If you turn it off, it's your responsibility to restore it.
ru: "autocommit" по умолчанию включен. Если вы выключили его, на вашей ответственности и его включение.

source: Once you turn autocommit off, you get the default behavior of your database adapter, and Django won't help you. Although that behavior is specified in :pep:`249`, implementations of adapters aren't always consistent with one another. Review the documentation of the adapter you're using carefully.
ru: При выключении "autocommit", вы получаете поведение по умолчанию библиотеки, которая используется для работы с базой данных, и Django ничем вам не поможет. Это поведение описано в :pep:`249`, но реализация в различных библиотеках может отличаться. Вам следует изучить документацию используемой библиотеки.

source: You must ensure that no transaction is active, usually by issuing a :func:`commit` or a :func:`rollback`, before turning autocommit back on.
ru: Перед включением "autocommit" вы должны убедиться, что транзакция не активна, обычно выполнив :func:`commit` или :func:`rollback`.

source: Django will refuse to turn autocommit off when an :func:`atomic` block is active, because that would break atomicity.
ru: Django не позволит выключить "autocommit", если активен блок :func:`atomic`, т.к. это нарушит атомарность.

source: Transactions
ru: Транзакции

source: A transaction is an atomic set of database queries. Even if your program crashes, the database guarantees that either all the changes will be applied, or none of them.
ru: Транзакция -- это атомарный набор запросов к базе данных. Даже если ваша программа аварийно завершится, база данных гарантирует, что будут сохранены все изменения, или ни одно из них.

source: Django doesn't provide an API to start a transaction. The expected way to start a transaction is to disable autocommit with :func:`set_autocommit`.
ru: Django не предоставляет API для явного создания транзакции. Чтобы создать транзакцию, отключите "autocommit" с помощью :func:`set_autocommit`.

source: Once you're in a transaction, you can choose either to apply the changes you've performed until this point with :func:`commit`, or to cancel them with :func:`rollback`. These functions are defined in :mod:`django.db.transaction`.
ru: Оказавшись в транзакции, можно зафиксировать выполненные изменения, используя функцию :func:`commit`, или отменить их через функцию :func:`rollback`. Эти функции находятся в модуле :mod:`django.db.transaction`.

source: Django will refuse to commit or to rollback when an :func:`atomic` block is active, because that would break atomicity.
ru: Django не позволит зафиксировать или отменить изменения, если блок :func:`atomic` активен, т.к. это нарушит атомарность.

source: Savepoints aren't especially useful if you are using autocommit, the default behavior of Django. However, once you open a transaction with :func:`atomic`, you build up a series of database operations awaiting a commit or rollback. If you issue a rollback, the entire transaction is rolled back. Savepoints provide the ability to perform a fine-grained rollback, rather than the full rollback that would be performed by ``transaction.rollback()``.
ru: Точки сохранения бесполезны, если вы используете стандартное поведение Django -- "autocommit". Тем не менее, при создании транзакции через :func:`atomic`, каждая открытая транзакция выполняет ряд операций в базе данных, ожидая фиксации или отката транзакции. Если вы выполните откат транзакции, то будет выполнен откат всей транзакции. Точки сохранения предоставляют возможность выполнять частичный откат, вместо выполнения полного отката, который делается с помощью ``transaction.rollback()``.

source: When the :func:`atomic` decorator is nested, it creates a savepoint to allow partial commit or rollback. You're strongly encouraged to use :func:`atomic` rather than the functions described below, but they're still part of the public API, and there's no plan to deprecate them.
ru: При вложенных блоках :func:`atomic` создаются точки сохранения, которые позволяют выполнить частичную фиксацию или откат изменений. Мы настоятельно рекомендуем использовать :func:`atomic` вместо функций, указанных выше, но они в любом случае входят в публичный API и мы не собираемся удалять их.

source: Each of these functions takes a ``using`` argument which should be the name of a database for which the behavior applies. If no ``using`` argument is provided then the ``"default"`` database is used.
ru: Каждая из этих функция принимает аргумент ``using``, который обозначает имя базы данных с которой производится работа. Если этот аргумент не указан, то все действия идут относительно стандартной (``"default"``) базы данных.

source: Savepoints are controlled by three functions in :mod:`django.db.transaction`:
ru: Точки сохранения управляются тремя функциями из :mod:`django.db.transaction`:

source: Creates a new savepoint. This marks a point in the transaction that is known to be in a "good" state. Returns the savepoint ID (``sid``).
ru: Создаёт новую точку сохранения, обозначая точку в транзакции, отмечающую "хорошее" состояние. Возвращает ID (``sid``) точки сохранения.

source: Releases savepoint ``sid``. The changes performed since the savepoint was created become part of the transaction.
ru: Закрывает точку сохранения с указанным ``sid``. Все изменения, выполненные до этой точки сохранения, будут добавлены в текущую транзакцию.

source: Rolls back the transaction to savepoint ``sid``.
ru: Откатывает транзакцию до точки сохранения с указанным ``sid``.

source: These functions do nothing if savepoints aren't supported or if the database is in autocommit mode.
ru: Эти функции ничего не делают, если точки сохранения не поддерживаются базой данных, или если база данных в режиме "autocommit".

source: In addition, there's a utility function:
ru: Также Django предоставляет несколько дополнительных функций:

source: Resets the counter used to generate unique savepoint IDs.
ru: Сбрасывает счетчик генератора ID точек сохранения.

source: The following example demonstrates the use of savepoints::
ru: Следующие примеры демонстрируют использование промежуточных точек::

source: Savepoints may be used to recover from a database error by performing a partial rollback. If you're doing this inside an :func:`atomic` block, the entire block will still be rolled back, because it doesn't know you've handled the situation at a lower level! To prevent this, you can control the rollback behavior with the following functions.
ru: Точки сохранения могут использоваться для восстановления после ошибки в базе данных, отменив часть выполненных изменений. Выполнив это в блоке :func:`atomic`, отмена будет выполнена для всего блока, т.к. он не знает, что вы обработали ошибку на более низком уровне! Чтобы изменить это, вы можете контролировать поведение точек сохранения с помощью следующих функций.

source: Setting the rollback flag to ``True`` forces a rollback when exiting the innermost atomic block. This may be useful to trigger a rollback without raising an exception.
ru: Устанавливает флаг отмены изменений в ``True``, форсируя отмену изменений при выходе из самого вложенного атомарного блока. Это может быть полезно для отмены изменений без вызова исключений.

source: Setting it to ``False`` prevents such a rollback. Before doing that, make sure you've rolled back the transaction to a known-good savepoint within the current atomic block! Otherwise you're breaking atomicity and data corruption may occur.
ru: Установив флаг в ``False``, можно отключить отмену изменений. Перед тем как сделать это, убедитесь, что вы откатили транзакцию к последней безопасной точке в текущем атомарном блоке! Иначе вы нарушите атомарность и можете повредить данные.

source: Database-specific notes
ru: Заметки о различных базах данных

source: Savepoints in SQLite
ru: Точки сохранения в SQLite

source: When autocommit is enabled, savepoints don't make sense. When it's disabled, :mod:`sqlite3` commits implicitly before savepoint statements. (In fact, it commits before any statement other than ``SELECT``, ``INSERT``, ``UPDATE``, ``DELETE`` and ``REPLACE``.) This bug has two consequences:
ru: При включенном "autocommit" точки сохранения не имеют смысла. При отключенном -- :mod:`sqlite3` неявно фиксирует изменения перед созданием точки сохранения. (На самом деле фиксация выполняет перед любой операцией отличной от ``SELECT``, ``INSERT``, ``UPDATE``, ``DELETE`` и ``REPLACE``.) Этот баг приводит к следующим особенностям:

source: The low level APIs for savepoints are only usable inside a transaction ie. inside an :func:`atomic` block.
ru: Низкоуровневый API для работы с точками сохранения работает только внутри транзакции, то есть в блоке :func:`atomic`.

source: It's impossible to use :func:`atomic` when autocommit is turned off.
ru: Невозможно использовать :func:`atomic` при выключенном "autocommit".

source: Transactions in MySQL
ru: Транзакции в MySQL

source: If you're using MySQL, your tables may or may not support transactions; it depends on your MySQL version and the table types you're using. (By "table types," we mean something like "InnoDB" or "MyISAM".) MySQL transaction peculiarities are outside the scope of this article, but the MySQL site has `information on MySQL transactions`_.
ru: При использовании MySQL поддержка транзакция зависит от версии движка базы данных и от используемого типа таблиц. (Под "типом таблицы" мы подразумеваем "InnoDB" или "MyISAM".) Особенности транзакций MySQL выходят за рамки данной статьи, но сайт MySQL содержит `информацию о `транзакциях<http://dev.mysql.com/doc/refman/5.6/en/sql-syntax-transactions.html>`_.

source: If your MySQL setup does *not* support transactions, then Django will always function in autocommit mode: statements will be executed and committed as soon as they're called. If your MySQL setup *does* support transactions, Django will handle transactions as explained in this document.
ru: Если ваша настройка MySQL *не поддерживает* транзакции, тогда Django будет работать в режиме автоматической фиксации: Операторы будут выполняться и сразу же фиксироваться. Если же ваша настройка MySQL *поддерживает* транзакции, Django будет обрабатывать транзакции как описано выше.

source: Handling exceptions within PostgreSQL transactions
ru: Обработка исключений в транзакциях PostgreSQL

source: This section is relevant only if you're implementing your own transaction management. This problem cannot occur in Django's default mode and :func:`atomic` handles it automatically.
ru: Этот раздел важен только при создании собственного управления транзакциями. Описанная проблема не возникнет при стандартном поведении Django и при использовании :func:`atomic`.

source: Inside a transaction, when a call to a PostgreSQL cursor raises an exception (typically ``IntegrityError``), all subsequent SQL in the same transaction will fail with the error "current transaction is aborted, queries ignored until end of transaction block". While simple use of ``save()`` is unlikely to raise an exception in PostgreSQL, there are more advanced usage patterns which might, such as saving objects with unique fields, saving using the force_insert/force_update flag, or invoking custom SQL.
ru: В транзакции, когда вызов к курсору PostgreSQL вызывает исключение (обычно `IntegrityError``), все последующие SQL запросы в той же транзакции будут заблокированы с ошибкой "текущая транзакция прервана, запросы проигнорированы до конца транзакционного блока". Хотя обычное использование ``save()`` вряд ли вызовет исключение в PostgreSQL, существуют более сложные шаблоны использования, которые могут вызвать исключение: сохранение объектов с уникальными полями, сохранение с использованием флага force_insert/force_update или вызов собственного SQL.

source: There are several ways to recover from this sort of error.
ru: Существует несколько способов избежать таких ошибок.

source: Transaction rollback
ru: Откат транзакции

source: The first option is to roll back the entire transaction. For example::
ru: Первый способ -- выполнить отмену всей транзакции. Например::

source: Calling ``transaction.rollback()`` rolls back the entire transaction. Any uncommitted database operations will be lost. In this example, the changes made by ``a.save()`` would be lost, even though that operation raised no error itself.
ru: Вызов ``transaction.rollback()`` откатывает всю транзакцию. Все не зафиксированные в базе данных операции будут потеряны. В этом примере изменения, сделанные с помощью ``a.save()`` будут потеряны, несмотря на то, что эта операция прошла без ошибок.

source: Savepoint rollback
ru: Откат до точки сохранения

source: You can use :ref:`savepoints <topics-db-transactions-savepoints>` to control the extent of a rollback. Before performing a database operation that could fail, you can set or update the savepoint; that way, if the operation fails, you can roll back the single offending operation, rather than the entire transaction. For example::
ru: Вы можете использовать :ref:`точки сохранения <topics-db-transactions-savepoints>` для управления глубиной отката. Перед выполнением действия над базой данных, которое может завершиться ошибкой, вы можете установить или обновить точку сохранения. Впоследствии, если выполняемое действие завершится ошибкой, вы можете откатить только изменения, созданные этим действием, не оказывая влияние на всю транзакцию в целом. Например::

source: In this example, ``a.save()`` will not be undone in the case where ``b.save()`` raises an exception.
ru: В этом примере ``a.save()`` не будет отменён, если ``b.save()`` вызовет исключение.
