Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/topics/db/transactions.po
Languages: ru

source: Database transactions
ru: Управление транзакциями базы данных

source: Django gives you a few ways to control how database transactions are managed.
ru: Django предоставляет несколько инструментов для управления транзакциями базы данных.

source: Managing database transactions
ru: Управление транзакциями

source: Django's default transaction behavior
ru: Стандартное поведение Django

source: Django's default behavior is to run in autocommit mode. Each query is immediately committed to the database, unless a transaction is active. :ref:`See below for details <autocommit-details>`.
ru: По умолчанию Django использует режим автоматической фиксации("autocommit"). Каждый запрос сразу фиксируется в базе данных, если не используется транзакция. :ref:`Смотрите ниже <autocommit-details>`.

source: Django uses transactions or savepoints automatically to guarantee the integrity of ORM operations that require multiple queries, especially :ref:`delete() <topics-db-queries-delete>` and :ref:`update() <topics-db-queries-update>` queries.
ru: Django автоматически использует транзакции или точки сохранения для операций ORM, которые требуют нескольких запросов, особенно для :ref:`delete() <topics-db-queries-delete>` и :ref:`update() <topics-db-queries-update>`.

source: Django's :class:`~django.test.TestCase` class also wraps each test in a transaction for performance reasons.
ru: Класс :class:`~django.test.TestCase` также оборачивает каждый тест в транзакцию для оптимизации скорости выполнения тестов.

source: Tying transactions to HTTP requests
ru: Привязка транзакций к HTTP запросам

source: A common way to handle transactions on the web is to wrap each request in a transaction. Set :setting:`ATOMIC_REQUESTS <DATABASE-ATOMIC_REQUESTS>` to ``True`` in the configuration of each database for which you want to enable this behavior.
ru: Обычной практикой для Web-приложений является оборачивание каждого запроса в транзакцию. Чтобы активировать такое поведение, установите :setting:`ATOMIC_REQUESTS <DATABASE-ATOMIC_REQUESTS>` в ``True`` для соответствующей базы данных.

source: It works like this. Before calling a view function, Django starts a transaction. If the response is produced without problems, Django commits the transaction. If the view produces an exception, Django rolls back the transaction.
ru: Это работает следующим образом: при получении запроса Django начинает транзакцию. Если ответ был создан без возникновения ошибок, Django фиксирует все ожидающие транзакции. Если функция представления вызывает исключение, Django откатывает все ожидающие транзакции.

source: You may perform subtransactions using savepoints in your view code, typically with the :func:`atomic` context manager. However, at the end of the view, either all or none of the changes will be committed.
ru: Вы можете выполнять частичную фиксацию или откат изменений в коде представления, обычно с помощью менеджера контекста :func:`atomic`. Но в конце выполнения представления будут зафиксированы все изменения, или не одно из них.

source: While the simplicity of this transaction model is appealing, it also makes it inefficient when traffic increases. Opening a transaction for every view has some overhead. The impact on performance depends on the query patterns of your application and on how well your database handles locking.
ru: Хотя такая обработка запросов выглядит очень простой и привлекательной, она может быть неэффективна при росте количества запросов. Создание транзакции для каждого запроса создает небольшую нагрузку на базу данных. Влияние на производительность сервера зависит от запросов в вашем приложении и от того, на сколько эффективно ваша база данных работает с блокировками.

source: Per-request transactions and streaming responses
ru: Транзакции для запроса и потоковый ответ

source: When a view returns a :class:`~django.http.StreamingHttpResponse`, reading the contents of the response will often execute code to generate the content. Since the view has already returned, such code runs outside of the transaction.
ru: Когда представление возвращает :class:`~django.http.StreamingHttpResponse`, чтение содержимого ответа выполняет некоторый код для его ответа. Т.к. представление уже отработало, этот код будет выполняться вне транзакции.

source: Generally speaking, it isn't advisable to write to the database while generating a streaming response, since there's no sensible way to handle errors after starting to send the response.
ru: Не советуем выполнять запись в базу данных при генерации потокового ответа, т.к. нет хорошего способа обработать ошибки после начала отправки ответа.

source: In practice, this feature simply wraps every view function in the :func:`atomic` decorator described below.
ru: На практике каждое представление просто оборачивается в декоратор :func:`atomic`, описанный ниже.

source: Note that only the execution of your view is enclosed in the transactions. Middleware runs outside of the transaction, and so does the rendering of template responses.
ru: Обратите внимание, только представления оборачиваются в транзакцию. Промежуточные слои(middleware) выполняются вне транзакции, аналогично выполняется и рендеринг ответа.

source: When :setting:`ATOMIC_REQUESTS <DATABASE-ATOMIC_REQUESTS>` is enabled, it's still possible to prevent views from running in a transaction.
ru: При включенной :setting:`ATOMIC_REQUESTS <DATABASE-ATOMIC_REQUESTS>` все еще существует возможность не использовать транзакцию для представления.

source: This decorator will negate the effect of :setting:`ATOMIC_REQUESTS <DATABASE-ATOMIC_REQUESTS>` for a given view::
ru: Этот декоратор отключает эффект :setting:`ATOMIC_REQUESTS <DATABASE-ATOMIC_REQUESTS>` для указанного представления::

source: It only works if it's applied to the view itself.
ru: Работает только при применении к представлению.

source: Controlling transactions explicitly
ru: Явное управление транзакциями

source: Django provides a single API to control database transactions.
ru: Django предоставляет один API для управления транзакциями базы данных.

source: Atomicity is the defining property of database transactions. ``atomic`` allows us to create a block of code within which the atomicity on the database is guaranteed. If the block of code is successfully completed, the changes are committed to the database. If there is an exception, the changes are rolled back.
ru: Атомарность является основным свойством транзакций базы данных. ``atomic`` позволяет создать блок кода, для которого гарантируется атомарность операций над базой данных. Если этот блок кода выполнился без ошибок, все изменения фиксируются в базе данных. Если произошла ошибка, все изменений будут отменены.

source: ``atomic`` blocks can be nested. In this case, when an inner block completes successfully, its effects can still be rolled back if an exception is raised in the outer block at a later point.
ru: ``atomic`` блоки могут быть вложенными. В этом случае, если вложенный блок выполнился успешно, изменения в базе данных, которые он произвел, могут быть отменены при ошибке во внешнем блоке кода.

source: ``atomic`` is usable both as a :py:term:`decorator`::
ru: ``atomic`` может использоваться как :py:term:`decorator`::

source: and as a :py:term:`context manager`::
ru: и как :py:term:`context manager`::

source: Wrapping ``atomic`` in a try/except block allows for natural handling of integrity errors::
ru: Обернув ``atomic`` в блок ``try/except``, можно выполнить обработку ошибок::

source: In this example, even if ``generate_relationships()`` causes a database error by breaking an integrity constraint, you can execute queries in ``add_children()``, and the changes from ``create_parent()`` are still there. Note that any operations attempted in ``generate_relationships()`` will already have been rolled back safely when ``handle_exception()`` is called, so the exception handler can also operate on the database if necessary.
ru: В этом примере, вы можете выполнить запросы в ``add_children()``, даже если ``generate_relationships()`` вызывал ошибку, также никуда не денутся изменения, выполненные в ``create_parent()``. Обратите внимание, любые операции из ``generate_relationships()`` уже будут отменены, и при обработке ошибки в ``handle_exception()`` можно безопасно выполнять запросы к базе данных.

source: Avoid catching exceptions inside ``atomic``!
ru: Избегайте перехвата ошибок в ``atomic``!

source: When exiting an ``atomic`` block, Django looks at whether it's exited normally or with an exception to determine whether to commit or roll back. If you catch and handle exceptions inside an ``atomic`` block, you may hide from Django the fact that a problem has happened. This can result in unexpected behavior.
ru: При выходе из блока ``atomic`` Django определяет произошла ли ошибка, чтобы понять фиксировать изменения или отменить их. Если вы перехватите исключение и обработаете его в блоке ``atomic``, вы можете скрыть от Django наличие проблемы. Это может привести к непредвиденному поведению.

source: This is mostly a concern for :exc:`~django.db.DatabaseError` and its subclasses such as :exc:`~django.db.IntegrityError`. After such an error, the transaction is broken and Django will perform a rollback at the end of the ``atomic`` block. If you attempt to run database queries before the rollback happens, Django will raise a :class:`~django.db.transaction.TransactionManagementError`. You may also encounter this behavior when an ORM-related signal handler raises an exception.
ru: В основном это относится к :exc:`~django.db.DatabaseError` и классам наследникам, например :exc:`~django.db.IntegrityError`. При таких ошибках транзакция будет сломана и Django выполнит отмену изменений после завершения блока ``atomic``. Если вы попытаетесь выполнить запросы перед отменой изменений, Django вызовет исключение :class:`~django.db.transaction.TransactionManagementError`. Подобное поведение может произойти, если обработчик сигналов ORM вызовет исключение.

source: The correct way to catch database errors is around an ``atomic`` block as shown above. If necessary, add an extra ``atomic`` block for this purpose. This pattern has another advantage: it delimits explicitly which operations will be rolled back if an exception occurs.
ru: Правильный способ обработать ошибки базы данных -- перехватить их за блоком ``atomic``, как в примере выше. Если необходимо, добавьте дополнительный блок ``atomic`` для этого. У такого подхода есть свои преимущества: он явно разделяет операции, которые должны быть отменены при ошибке.

source: If you catch exceptions raised by raw SQL queries, Django's behavior is unspecified and database-dependent.
ru: Если вы перехватите исключение, вызванное чистым SQL запросом, поведение Django будет зависеть от вашей базы данных.

source: You may need to manually revert model state when rolling back a transaction.
ru: В некоторых случаях вам необходимо отменить изменения в модели после отката транзакции

source: The values of a model's fields won't be reverted when a transaction rollback happens. This could lead to an inconsistent model state unless you manually restore the original field values.
ru: Значения полей модели не будут изменены обратно после отката транзакции. Это может привести к не согласующемся состоянию модели, если вы явно не восстановите начальные значения.

source: For example, given ``MyModel`` with an ``active`` field, this snippet ensures that the ``if obj.active`` check at the end uses the correct value if updating ``active`` to ``True`` fails in the transaction::
ru: Например, возьмем ``MyModel`` с полем ``active``, этот код проверяет правильное значение в ``if obj.active`` даже если установка ``active`` в ``True`` не выполнилась в транзакции::

source: In order to guarantee atomicity, ``atomic`` disables some APIs. Attempting to commit, roll back, or change the autocommit state of the database connection within an ``atomic`` block will raise an exception.
ru: Чтобы гарантировать атомарность, ``atomic`` блокирует некоторые функции. При попытке явно зафиксировать или отменить изменения, или изменить статус "autocommit" подключения к базе данных внутри блока ``atomic``, будет вызвано исключение.

source: ``atomic`` takes a ``using`` argument which should be the name of a database. If this argument isn't provided, Django uses the ``"default"`` database.
ru: ``atomic`` принимает аргумент ``using``, который обозначает имя базы данных с которой производится работа. Если этот аргумент не указан, то все действия идут относительно стандартной (``"default"``) базы данных.

source: Under the hood, Django's transaction management code:
ru: Код обработки транзакций в Django выполняет следующие действия:

source: opens a transaction when entering the outermost ``atomic`` block;
ru: создает транзакцию при входе в блок ``atomic``;

source: creates a savepoint when entering an inner ``atomic`` block;
ru: создает точку сохранения при входе во вложенный блок ``atomic``;

source: releases or rolls back to the savepoint when exiting an inner block;
ru: сохраняет или отменяет точку сохранения при выходе из вложенного блока;

source: commits or rolls back the transaction when exiting the outermost block.
ru: фиксирует или отменяет транзакцию при выходе из последнего блока.

source: You can disable the creation of savepoints for inner blocks by setting the ``savepoint`` argument to ``False``. If an exception occurs, Django will perform the rollback when exiting the first parent block with a savepoint if there is one, and the outermost block otherwise. Atomicity is still guaranteed by the outer transaction. This option should only be used if the overhead of savepoints is noticeable. It has the drawback of breaking the error handling described above.
ru: Вы можете отменить создание точки сохранения для внутренних блоков, указав в аргументе ``savepoint`` ``False``. При исключении Django выполнит отмену изменений при выходе из первого попавшегося блока, который создает точку сохранения, или же самого последнего блока. Атомарность внешних транзакций все также гарантирована. Такой подход должен использоваться только для оптимизации создания точек сохранения, т.к. нарушает обработку ошибок, как было описано выше.

source: You may use ``atomic`` when autocommit is turned off. It will only use savepoints, even for the outermost block.
ru: Вы можете использовать ``atomic`` при выключенном "autocommit". Он использует только точки сохранения, даже для самого внешнего блока.

source: Performance considerations
ru: Заметка о производительности

source: Open transactions have a performance cost for your database server. To minimize this overhead, keep your transactions as short as possible. This is especially important if you're using :func:`atomic` in long-running processes, outside of Django's request / response cycle.
ru: Создание транзакции требует определенных операций от базы данных. Чтобы минимизировать нагрузку на сервер базы данных, делайте транзакции минимально короткими. Это особенно важно при использовании :func:`atomic` в долго выполняемых процессах вне цикла обработки запроса и ответа.

source: Why Django uses autocommit
ru: Почему Django использует автоматическую фиксацию

source: In the SQL standards, each SQL query starts a transaction, unless one is already active. Such transactions must then be explicitly committed or rolled back.
ru: По стандартам SQL каждый SQL-запрос начинается с транзакции, если она еще не создана. Эти транзакции должны быть явно зафиксированы или отменены.

source: This isn't always convenient for application developers. To alleviate this problem, most databases provide an autocommit mode. When autocommit is turned on and no transaction is active, each SQL query gets wrapped in its own transaction. In other words, not only does each such query start a transaction, but the transaction also gets automatically committed or rolled back, depending on whether the query succeeded.
ru: Это не всегда удобно при разработке приложения. Чтобы решить эту проблему, большинство баз данных поддерживает режим автоматической фиксации(autocommit). При включенном "autocommit", если транзакция не активна, каждый SQL запрос обернут в транзакцию. То есть транзакция для каждого запроса не только создается, но и автоматически фиксируется, если запросы был успешно выполнен.

source: :pep:`249`, the Python Database API Specification v2.0, requires autocommit to be initially turned off. Django overrides this default and turns autocommit on.
ru: :pep:`249`, спецификация Python о Database API v2.0, требует чтобы "autocommit" по умолчанию был выключен. Django переопределяет это поведение и "autocommit" по умолчанию включен.

source: To avoid this, you can :ref:`deactivate the transaction management <deactivate-transaction-management>`, but it isn't recommended.
ru: :ref:`Вы можете отключить такое поведение <deactivate-transaction-management>`, но мы не рекомендует этого делать.

source: Deactivating transaction management
ru: Отключение управления транзакциями

source: You can totally disable Django's transaction management for a given database by setting :setting:`AUTOCOMMIT <DATABASE-AUTOCOMMIT>` to ``False`` in its configuration. If you do this, Django won't enable autocommit, and won't perform any commits. You'll get the regular behavior of the underlying database library.
ru: Вы можете отключить управление транзакциями Django для определенной базы данных, установив :setting:`AUTOCOMMIT <DATABASE-AUTOCOMMIT>` в ``False`` в её настройках. При этом Django отключит "autocommit" и не будет выполнять фиксирование изменений. Все будут работать в соответствии с библиотекой, которая используется для работы с базой данных.

source: This requires you to commit explicitly every transaction, even those started by Django or by third-party libraries. Thus, this is best used in situations where you want to run your own transaction-controlling middleware or do something really strange.
ru: При этом вам необходимо явно фиксировать каждую транзакцию, не зависимо была ли она создана Django, или сторонней библиотекой. Это может быть полезно, если вы хотите использовать свой промежуточный слой(middleware) для управления транзакциями, или сделать что-то очень необычное.

source: Performing actions after commit
ru: Выполнение операция после коммита

source: Sometimes you need to perform an action related to the current database transaction, but only if the transaction successfully commits. Examples might include a `Celery`_ task, an email notification, or a cache invalidation.
ru: Иногда вам необходимо выполнить какие-либо действия связанные с текущей транзакцией в базе данных, но только при успешном коммите транзакции. Это может быть задача `Celery`_, отправка электронного письма, или сброс кэша.

source: Django provides the :func:`on_commit` function to register callback functions that should be executed after a transaction is successfully committed:
ru: Django предоставляет функцию :func:`on_commit`, которая позволяет добавить обработчик, вызываемый после успешного коммита транзакции:

source: Pass any function (that takes no arguments) to :func:`on_commit`::
ru: Передайте функцию (которая не требует аргументов) в :func:`on_commit`::

source: You can also wrap your function in a lambda::
ru: Можно также использовать lambda::

source: The function you pass in will be called immediately after a hypothetical database write made where ``on_commit()`` is called would be successfully committed.
ru: Обработчик будет выполнен сразу после гипотетической записи в базу данных, которая означает успешное завершение транзакции.

source: If you call ``on_commit()`` while there isn't an active transaction, the callback will be executed immediately.
ru: Если вызывать ``on_commit()`` пока транзакция активна, обработчик сразу выполнится.

source: If that hypothetical database write is instead rolled back (typically when an unhandled exception is raised in an :func:`atomic` block), your function will be discarded and never called.
ru: Если транзакция будет отменена (обычно при возникновении ошибки в блоке :func:`atomic`), обработчик никогда не выполнится и будет проигнорирован.

source: Savepoints
ru: Точки сохранения

source: Savepoints (i.e. nested :func:`atomic` blocks) are handled correctly. That is, an :func:`on_commit` callable registered after a savepoint (in a nested :func:`atomic` block) will be called after the outer transaction is committed, but not if a rollback to that savepoint or any previous savepoint occurred during the transaction::
ru: Точки сохранения (например вложенные блоки :func:`atomic`) обрабатываются правильно. То есть обработчик, добавленный :func:`on_commit` после точки сохранения (во вложенных блоках :func:`atomic`), будет выполнен после коммита внешней транзакции, и не будет выполнен при откате до этой точки сохранения, или другой точки сохранения в текущей транзакции::

source: On the other hand, when a savepoint is rolled back (due to an exception being raised), the inner callable will not be called::
ru: Другими словами, при выполнении отката точки сохранения (из-за исключения), внутренний обработчик не будет вызван::

source: Order of execution
ru: Порядок выполнения

source: On-commit functions for a given transaction are executed in the order they were registered.
ru: Обработчики коммита транзакции выполняются в порядке, в котором они были зарегистрированы.

source: Exception handling
ru: Обработка исключений

source: If one on-commit function within a given transaction raises an uncaught exception, no later registered functions in that same transaction will run. This is, of course, the same behavior as if you'd executed the functions sequentially yourself without :func:`on_commit`.
ru: Если один из обработчиков вызывал исключение во время транзакции, другие обработчики не будут вызваны. Такое поведение аналогично, если бы вы последовательно выполняли функции без :func:`on_commit`.

source: Timing of execution
ru: Время выполнения обработчиков

source: Your callbacks are executed *after* a successful commit, so a failure in a callback will not cause the transaction to roll back. They are executed conditionally upon the success of the transaction, but they are not *part* of the transaction. For the intended use cases (mail notifications, Celery tasks, etc.), this should be fine. If it's not (if your follow-up action is so critical that its failure should mean the failure of the transaction itself), then you don't want to use the :func:`on_commit` hook. Instead, you may want `two-phase commit`_ such as the `psycopg Two-Phase Commit protocol support`_ and the `optional Two-Phase Commit Extensions in the Python DB-API specification`_.
ru: Ваши обработчики вызываются *после* успешного коммита, и ошибка в обработчике не приведет к отмене транзакции. Они не являются *частью* транзакции. Для предполагаемых случаев использования (отправка электронных писем, Celery задача, и т.д.) такое поведение работает. Если нет (если выполнение обработчика настолько важно, что при ошибки должна быть выполнена отмена транзакции), тогда вам не следует использовать :func:`on_commit`. Вместо этого может помочь `двухфазный коммит <https://en.wikipedia.org/wiki/Two-phase_commit_protocol>`_, который `поддерживается psycopg <http://initd.org/psycopg/docs/usage.html#tpc>_ и `спецификацией Python DB-API <https://www.python.org/dev/peps/pep-0249/#optional-two-phase-commit-extensions>`_.
