Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/ref/forms/api.po
Languages: ru

source: Each text label is surrounded in an HTML ``<label>`` tag, which points to the appropriate form field via its ``id``. Its ``id``, in turn, is generated by prepending ``'id_'`` to the field name. The ``id`` attributes and ``<label>`` tags are included in the output by default, to follow best practices, but you can change that behavior.
ru: Каждая текстовая метка выводится с помощью тега ``<label>``, который указывает на соответствующее поле формы с помощью атрибута ``id``. Атрибут ``id`` генерируется путём добавления префикса ``'id_'`` к имени поля. Атрибуты ``id`` и теги ``<label>`` включаются в HTML представление формы по умолчанию, но можете изменить такое поведение формы.

source: Although ``<table>`` output is the default output style when you ``print`` a form, other output styles are available. Each style is available as a method on a form object, and each rendering method returns a Unicode object.
ru: Несмотря на то, что по умолчанию форма выводится в табличном виде, существует ряд других представлений. Каждое представление доступно через метод объекта формы, возвращая объект ``Unicode``.

source: ``as_p()`` renders the form as a series of ``<p>`` tags, with each ``<p>`` containing one field::
ru: Метод ``as_p()`` представляет форму в виде последовательности тегов ``<p>``, по одному на каждое поле::

source: ``as_ul()`` renders the form as a series of ``<li>`` tags, with each ``<li>`` containing one field. It does *not* include the ``<ul>`` or ``</ul>``, so that you can specify any HTML attributes on the ``<ul>`` for flexibility::
ru: Метод ``as_ul()`` представляет форму в виде последовательности тегов ``<li>``, по одному на каждое поле. Представление *не включает в себя* теги ``<ul>`` или ``</ul>``, таким образом вы можете указать любой атрибут для тега ``<ul>``::

source: Finally, ``as_table()`` outputs the form as an HTML ``<table>``. This is exactly the same as ``print``. In fact, when you ``print`` a form object, it calls its ``as_table()`` method behind the scenes::
ru: Наконец, метод ``as_table()`` выводит форму в виде таблицы. Этот метод используется по умолчанию::

source: Styling required or erroneous form rows
ru: Стилизация обязательных полей или полей с ошибкой

source: It's pretty common to style form rows and fields that are required or have errors. For example, you might want to present required form rows in bold and highlight errors in red.
ru: Стилизация полей формы, обязательных для заполнения или имеющих ошибку, является общей практикой. Например, вы можете выделять обязательные поля жирным шрифтом, а поля с ошибкой выводить на красном.

source: The :class:`Form` class has a couple of hooks you can use to add ``class`` attributes to required rows or to rows with errors: simply set the :attr:`Form.error_css_class` and/or :attr:`Form.required_css_class` attributes::
ru: Класс :class:`Form` имеет ряд возможностей, которые вы можете использовать для добавления атрибутов ``class`` к обязательным полям и полям с ошибками: просто определите атрибут :attr:`Form.error_css_class` и/или :attr:`Form.required_css_class` attributes::

source: Once you've done that, rows will be given ``"error"`` and/or ``"required"`` classes, as needed. The HTML will look something like::
ru: После этого к полям будут добавлены классы ``"error"`` и/или ``"required"``. В результате HTML код будет выглядеть таким образом::

source: Configuring form elements' HTML ``id`` attributes and ``<label>`` tags
ru: Настройка тегов ``<label>`` и атрибута ``id``

source: By default, the form rendering methods include:
ru: По умолчанию методы для рендеринга форма включают:

source: HTML ``id`` attributes on the form elements.
ru: HTML атрибуты ``id`` элементов формы.

source: The corresponding ``<label>`` tags around the labels. An HTML ``<label>`` tag designates which label text is associated with which form element. This small enhancement makes forms more usable and more accessible to assistive devices. It's always a good idea to use ``<label>`` tags.
ru: Тег ``<label>`` определяет, с каким элементом формы связана текущая текстовая метка. Это небольшое уточнение делает форму более открытой для устройств. Советуем использовать теги ``<label>``.

source: The ``id`` attribute values are generated by prepending ``id_`` to the form field names. This behavior is configurable, though, if you want to change the ``id`` convention or remove HTML ``id`` attributes and ``<label>`` tags entirely.
ru: Атрибуты ``id`` создаются с помощью добавления префикса ``id_`` к именам полей формы. Это поведение является изменяемым, таким образом вы можете изменить его или вообще удалить эти атрибуты и тег ``<label>`` из формы.

source: Use the ``auto_id`` argument to the ``Form`` constructor to control the ``id`` and label behavior. This argument must be ``True``, ``False`` or a string.
ru: Используйте аргумент ``auto_id`` конструктора ``Form`` для управления поведением меток и их идентификаторов. Этот аргумент может принимать значения ``True``, ``False`` или строку.

source: If ``auto_id`` is ``False``, then the form output will not include ``<label>`` tags nor ``id`` attributes::
ru: Если ``auto_id`` равен ``False``, тогда форма не содержит ни тегов ``<label>``, ни атрибутов ``id``::

source: If ``auto_id`` is set to ``True``, then the form output *will* include ``<label>`` tags and will simply use the field name as its ``id`` for each form field::
ru: Если ``auto_id`` равен ``True``, тогда форма *содержит* теги ``<label>`` и использует имена полей в качестве значений атрибутов тегов, название поля будет использоваться как ``id``::

source: If ``auto_id`` is set to a string containing the format character ``'%s'``, then the form output will include ``<label>`` tags, and will generate ``id`` attributes based on the format string. For example, for a format string ``'field_%s'``, a field named ``subject`` will get the ``id`` value ``'field_subject'``. Continuing our example::
ru: Если ``auto_id`` является строкой, которая содержит символ форматирования ``'%s'``, тогда форма будет содержать теги ``<label>`` и будет генерировать ``id`` атрибуты, используя эту строку. Например, для строки ``'field_%s'``, поле с именем ``subject`` для атрибута ``id`` получит значение ``'field_subject'``. Вернёмся к нашему примеру::

source: If ``auto_id`` is set to any other true value -- such as a string that doesn't include ``%s`` -- then the library will act as if ``auto_id`` is ``True``.
ru: Если ``auto_id`` равно любому другому значимому значению (например, строка, которая не содержит символа форматирования), тогда библиотека будет рассматривать это значение как ``True``.

source: By default, ``auto_id`` is set to the string ``'id_%s'``.
ru: По умолчанию, ``auto_id`` имеет значение ``'id_%s'``.

source: A translatable string (defaults to a colon (``:``) in English) that will be appended after any label name when a form is rendered.
ru: Строка(по умолчанию двоеточие (``:``)), которая будет добавлена к названию метки поля. Строка локализирована и можно перевести на разные языки.

source: It's possible to customize that character, or omit it entirely, using the ``label_suffix`` parameter::
ru: Есть возможность заменить это двоеточие на другой символ или вообще убрать его. Для этого надо воспользоваться параметром ``label_suffix``::

source: Note that the label suffix is added only if the last character of the label isn't a punctuation character (in English, those are ``.``, ``!``, ``?`` or ``:``).
ru: Следует отметить, что суффикс добавляется к метке только в том случае, когда последний символ метки не является пунктуационным, т.е. не принадлежит списку (``.``, ``!``, ``?`` or ``:``).

source: Fields can also define their own :attr:`~django.forms.Field.label_suffix`. This will take precedence over :attr:`Form.label_suffix <django.forms.Form.label_suffix>`. The suffix can also be overridden at runtime using the ``label_suffix`` parameter to :meth:`~django.forms.BoundField.label_tag`.
ru: Поля могут также могут указывать свои :attr:`~django.forms.Field.label_suffix`. У этого значение приоритет выше, чем у :attr:`Form.label_suffix <django.forms.Form.label_suffix>`. Этот суффикс может быть переопределен во время выполнения через параметр ``label_suffix`` атрибута :meth:`~django.forms.BoundField.label_tag`.

source: Notes on field ordering
ru: Порядок полей

source: In the ``as_p()``, ``as_ul()`` and ``as_table()`` shortcuts, the fields are displayed in the order in which you define them in your form class. For example, in the ``ContactForm`` example, the fields are defined in the order ``subject``, ``message``, ``sender``, ``cc_myself``. To reorder the HTML output, just change the order in which those fields are listed in the class.
ru: При использовании методов ``as_p()``, ``as_ul()`` и ``as_table()`` поля отображаются в порядке их определения в классе формы. Например, в нашей форме ``ContactForm`` поля определены в порядке ``subject``, ``message``, ``sender``, ``cc_myself``. Для изменения их порядка на форме, просто поменяйте их местами в классе.

source: There are several other ways to customize the order:
ru: Есть и другие способы переопределить порядок полей в форме:

source: By default ``Form.field_order=None``, which retains the order in which you define the fields in your form class. If ``field_order`` is a list of field names, the fields are ordered as specified by the list and remaining fields are appended according to the default order. Unknown field names in the list are ignored. This makes it possible to disable a field in a subclass by setting it to ``None`` without having to redefine ordering.
ru: По умолчанию ``Form.field_order=None``, при этом поля формы будут в порядке их определения. Если ``field_order`` содержит список названий полей формы, поля будут выведены в указанном порядке, а оставшиеся -- в порядке по умолчанию. Неизвестные названия полей будут проигнорированы. Это позволяете удалить поле в классе-наследнике, установив его в ``None``, и при это вам не нужно переопределять ``field_order``.

source: You can also use the ``Form.field_order`` argument to a :class:`Form` to override the field order. If a :class:`~django.forms.Form` defines :attr:`~Form.field_order` *and* you include ``field_order`` when instantiating the ``Form``, then the latter ``field_order`` will have precedence.
ru: Также можно передать аргумент ``Form.field_order`` в :class:`Form`, чтобы переопределить порядок полей. Если :class:`~django.forms.Form` содержит :attr:`~Form.field_order` *и* и передать аргумент ``field_order`` при создании ``Form``, будет использоваться последний ``field_order``.

source: You may rearrange the fields any time using ``order_fields()`` with a list of field names as in :attr:`~django.forms.Form.field_order`.
ru: Вы можете изменить порядок полей, используя метод ``order_fields()`` и передав в него список полей, как и для :attr:`~django.forms.Form.field_order`.

source: How errors are displayed
ru: Отображение ошибок

source: If you render a bound ``Form`` object, the act of rendering will automatically run the form's validation if it hasn't already happened, and the HTML output will include the validation errors as a ``<ul class="errorlist">`` near the field. The particular positioning of the error messages depends on the output method you're using::
ru: При отображении заполненного объекта ``Form``, процесс генерации HTML кода автоматически выполняет проверку данных формы, если она ещё не была произведена. Если проверка выявила ошибки, то HTML код формы будет включать в себя список ошибок в виде списка ``<ul class="errorlist">`` у соответствующего поля. Точная позиция списка сообщений с ошибками проверки зависит от метода, который вы используете::

source: Customizing the error list format
ru: Настройка формата списка ошибок

source: By default, forms use ``django.forms.utils.ErrorList`` to format validation errors. If you'd like to use an alternate class for displaying errors, you can pass that in at construction time (replace ``__str__`` by ``__unicode__`` on Python 2)::
ru: По умолчанию, формы используют ``django.forms.utils.ErrorList`` для форматирования списка с ошибками . Если вам требуется использовать другой класс для отображения ошибок, вы можете передать его во время создания объекта формы (замените ``__str__`` на ``__unicode__`` для Python 2)::

source: More granular output
ru: Точное управление выводом

source: The ``as_p()``, ``as_ul()``, and ``as_table()`` methods are simply shortcuts -- they're not the only way a form object can be displayed.
ru: Методы ``as_p()``, ``as_ul()`` и ``as_table()`` являются упрошенными методами отображения формы. Это не единственные способы отображения формы.

source: Used to display HTML or access attributes for a single field of a :class:`Form` instance.
ru: Используется для отображения HTML или для доступа к атрибутам отдельного поля экземпляра :class:`Form`.

source: The ``__str__()`` (``__unicode__`` on Python 2) method of this object displays the HTML for this field.
ru: Метод ``__str__()`` (``__unicode__`` в Python 2) этого объекта возвращают HTML для данного поля.

source: To retrieve a single ``BoundField``, use dictionary lookup syntax on your form using the field's name as the key::
ru: Для получение одного ``BoundField`` используйте синтаксис поиска в словаре, применяя имя поля в качестве ключа::

source: To retrieve all ``BoundField`` objects, iterate the form::
ru: Для получения всех объектов ``BoundField``, пройдите циклом по форме::

source: The field-specific output honors the form object's ``auto_id`` setting::
ru: Вывод указанного поля соответствует настройке ``auto_id``::

source: Attributes of ``BoundField``
ru: Атрибуты ``BoundField``

source: This property returns the data for this :class:`~django.forms.BoundField` extracted by the widget's :meth:`~django.forms.Widget.value_from_datadict` method, or ``None`` if it wasn't given::
ru: Это свойство возвращает данные для текущего :class:`~django.forms.BoundField`, полученные из метода :meth:`~django.forms.Widget.value_from_datadict` виджета, или ``None``, если данные отсутствуют::

source: A :ref:`list-like object <ref-forms-error-list-format>` that is displayed as an HTML ``<ul class="errorlist">`` when printed::
ru: :ref:`Объект со свойствами списка <ref-forms-error-list-format>`, который при отображении представляется в виде ``<ul class="errorlist">``::

source: The form :class:`~django.forms.Field` instance from the form class that this :class:`~django.forms.BoundField` wraps.
ru: Экземпляр :class:`~django.forms.Field` из класса формы, который оборачивает текущий :class:`~django.forms.BoundField`.

source: The :class:`~django.forms.Form` instance this :class:`~django.forms.BoundField` is bound to.
ru: Экземпляр :class:`~django.forms.Form`, к которому привязан текущий :class:`~django.forms.BoundField`.

source: The :attr:`~django.forms.Field.help_text` of the field.
ru: :attr:`~django.forms.Field.help_text` поля.

source: The name that will be used in the widget's HTML ``name`` attribute. It takes the form :attr:`~django.forms.Form.prefix` into account.
ru: Название, которое будет использоваться в HTML атрибуте ``name`` виджета. Учитывает :attr:`~django.forms.Form.prefix` формы.

source: Use this property to render the ID of this field. For example, if you are manually constructing a ``<label>`` in your template (despite the fact that :meth:`~BoundField.label_tag` will do this for you):
ru: Этот атрибут рендерит ID поля. Например, вы можете использовать его, если вы самостоятельно создаете ``<label>`` для поля (несмотря на то, что :meth:`~BoundField.label_tag` делает это для вас):

source: By default, this will be the field's name prefixed by ``id_`` ("``id_my_field``" for the example above). You may modify the ID by setting :attr:`~django.forms.Widget.attrs` on the field's widget. For example, declaring a field like this::
ru: По умолчанию, он равен названию поля с префиксом ``id_`` ("``id_my_field``" для примера выше). Вы можете изменить ID, передав его в параметре :attr:`~django.forms.Widget.attrs` виджета. Например, определив поле следующим образом::

source: and using the template above, would render something like:
ru: и используя пример выше, получите следующий результат:

source: Returns ``True`` if this :class:`~django.forms.BoundField`'s widget is hidden.
ru: Возвращает ``True``, если виджет :class:`~django.forms.BoundField`' скрыт.

source: The :attr:`~django.forms.Field.label` of the field. This is used in :meth:`~BoundField.label_tag`.
ru: :attr:`~django.forms.Field.label` поля. Используется в :meth:`~BoundField.label_tag`.

source: The name of this field in the form::
ru: Название текущего поля в форме::

source: Methods of ``BoundField``
ru: Методы ``BoundField``

source: Returns a string of HTML for representing this as an ``<input type="hidden">``.
ru: Возвращает HTML строку, которая представляет текущее поля как ``<input type="hidden">``.

source: ``**kwargs`` are passed to :meth:`~django.forms.BoundField.as_widget`.
ru: ``**kwargs`` передается в :meth:`~django.forms.BoundField.as_widget`.

source: This method is primarily used internally. You should use a widget instead.
ru: Этот метод в основном используется внутренним кодом. Вам следует использовать виджет вместо него.

source: Renders the field by rendering the passed widget, adding any HTML attributes passed as ``attrs``. If no widget is specified, then the field's default widget will be used.
ru: Рендерит поле, используя переданный виджет, добавляете HTML атрибуты из ``attrs``. Если виджет не указан, будет использоваться виджет по умолчанию поля.

source: ``only_initial`` is used by Django internals and should not be set explicitly.
ru: ``only_initial`` используется Django и не должен указываться явно.

source: When you use Django's rendering shortcuts, CSS classes are used to indicate required form fields or fields that contain errors. If you're manually rendering a form, you can access these CSS classes using the ``css_classes`` method::
ru: Когда вы применяете общие методы для отображения формы, для выделения обязательных полей формы или полей, которые содержат ошибки, используются CSS классы. Если вы вручную выводите форму, вы можете получить доступ к этим классам через метод ``css_classes``::

source: If you want to provide some additional classes in addition to the error and required classes that may be required, you can provide those classes as an argument::
ru: Если потребуется предоставить дополнительные классы для ошибок и обязательных полей, вы можете указать эти классы в качестве аргумента::

source: To separately render the label tag of a form field, you can call its ``label_tag()`` method::
ru: Чтобы отдельно отрендерить label поля, вызовите метод ``label_tag()``::

source: You can provide the ``contents`` parameter which will replace the auto-generated label tag. An ``attrs`` dictionary may contain additional attributes for the ``<label>`` tag.
ru: Вы можете передать параметр ``contents``, который заменит автоматически генерируемый тег ``<label>``. Необязательный параметр ``attrs``, который является словарем, может передавать дополнительные атрибуты для тега ``<label>``.

source: The HTML that's generated includes the form's :attr:`~django.forms.Form.label_suffix` (a colon, by default) or, if set, the current field's :attr:`~django.forms.Field.label_suffix`. The optional ``label_suffix`` parameter allows you to override any previously set suffix. For example, you can use an empty string to hide the label on selected fields. If you need to do this in a template, you could write a custom filter to allow passing parameters to ``label_tag``.
ru: Сгенерированный HTML содержит :attr:`~django.forms.Form.label_suffix` формы (двоеточие по умолчанию), или :attr:`~django.forms.Field.label_suffix` поля, если этот атрибут установлен. Необязательный аргумент ``label_suffix`` позволяет переопределить установленный ранее суффикс. Например, можно использовать пустую строку, чтобы скрыть метку поля. Если это необходимо сделать в шаблоне, создайте собственный фильтр, который позволяет передавать значение в ``label_tag``.

source: Use this method to render the raw value of this field as it would be rendered by a ``Widget``::
ru: Используйте этот метод для выдачи "сырого" значения данного поля, как будто бы оно было отображено через ``Widget``::

source: Customizing ``BoundField``
ru: Настройка ``BoundField``

source: If you need to access some additional information about a form field in a template and using a subclass of :class:`~django.forms.Field` isn't sufficient, consider also customizing :class:`~django.forms.BoundField`.
ru: Если вам необходима дополнительная информация про поле формы в шаблоне, и наследоваться от :class:`~django.forms.Field` не достаточно, вы можете переопределить :class:`~django.forms.BoundField`.

source: A custom form field can override ``get_bound_field()``:
ru: В собственном поле формы можно переопределить метод ``get_bound_field()``:

source: Takes an instance of :class:`~django.forms.Form` and the name of the field. The return value will be used when accessing the field in a template. Most likely it will be an instance of a subclass of :class:`~django.forms.BoundField`.
ru: Принимает экземпляр :class:`~django.forms.Form` и название поля. Возвращаемое значение будет использоваться при доступе к полю в шаблоне. Обычно это экземпляр :class:`~django.forms.BoundField`.

source: If you have a ``GPSCoordinatesField``, for example, and want to be able to access additional information about the coordinates in a template, this could be implemented as follows::
ru: Например у вас есть поле ``GPSCoordinatesField``, и вы хотите получать дополнительную информацию про координаты в шаблоне, это можно сделать следующим образом::

source: Now you can access the country in a template with ``{{ form.coordinates.country }}``.
ru: Теперь вы можете получить страну в шаблоне через ``{{ form.coordinates.country }}``.

source: Binding uploaded files to a form
ru: Привязка загруженных файлов к форме

source: Dealing with forms that have ``FileField`` and ``ImageField`` fields is a little more complicated than a normal form.
ru: Работа с формами, которые содержат поля ``FileField`` и ``ImageField`` немного отличается от работы с обычными формами.

source: Firstly, in order to upload files, you'll need to make sure that your ``<form>`` element correctly defines the ``enctype`` as ``"multipart/form-data"``::
ru: Сначала, для того, чтобы загружать файлы, вам потребуется назначить форме атрибут ``enctype``::

source: Secondly, when you use the form, you need to bind the file data. File data is handled separately to normal form data, so when your form contains a ``FileField`` and ``ImageField``, you will need to specify a second argument when you bind your form. So if we extend our ContactForm to include an ``ImageField`` called ``mugshot``, we need to bind the file data containing the mugshot image::
ru: Затем, при использовании формы следует привязывать данные к форме. Файлы обрабатываются отдельно от данных формы. Таким образом, если ваша форма содержит поля ``FileField`` и ``ImageField``, потребуется указать второй аргумент у конструктора. Если мы добавим в нашу ``ContactForm`` поле ``ImageField`` с именем ``mugshot``, придётся сделать следующее::

source: In practice, you will usually specify ``request.FILES`` as the source of file data (just like you use ``request.POST`` as the source of form data)::
ru: На практике вы будете просто указывать ``request.FILES`` в качестве источника данных файлов аналогично тому, как вы указываете ``request.POST`` в качестве источника данных формы::
