Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/ref/forms/api.po
Languages: ru

source: Constructing an unbound form is the same as always -- just omit both form data *and* file data::
ru: Создание незаполненной формы аналогично обычной форме -- просто не указывайте *никаких* данных для неё::

source: Testing for multipart forms
ru: Определение таких форм

source: If you're writing reusable views or templates, you may not know ahead of time whether your form is a multipart form or not. The ``is_multipart()`` method tells you whether the form requires multipart encoding for submission::
ru: Если вы пишете представления и шаблоны в расчёте на их неоднократное использование в будущем, вы не можете знать, будет ли ваша форма обычной или будет работать с файлами. В этом случае вам поможет метод ``is_multipart()``, который точно ответит на этот вопрос::

source: Here's an example of how you might use this in a template::
ru: Покажем пример использования этого метода в шаблоне::

source: Subclassing forms
ru: Наследование форм

source: If you have multiple ``Form`` classes that share fields, you can use subclassing to remove redundancy.
ru: Если у вас есть несколько классов ``Form`` с одинаковыми полями, вы можете воспользоваться наследованием форм, чтобы убрать дублирование кода.

source: When you subclass a custom ``Form`` class, the resulting subclass will include all fields of the parent class(es), followed by the fields you define in the subclass.
ru: При наследовании определённого класса ``Form``, результирующий класс будет обладать всеми полями родительского класса (-ов), включая поля, которые определены в нём самом.

source: In this example, ``ContactFormWithPriority`` contains all the fields from ``ContactForm``, plus an additional field, ``priority``. The ``ContactForm`` fields are ordered first::
ru: В этом примере, ``ContactFormWithPriority`` содержит все поля из ``ContactForm``, и собственное поле, ``priority``. Поля ``ContactForm`` выводятся первыми::

source: It's possible to subclass multiple forms, treating forms as mixins. In this example, ``BeatleForm`` subclasses both ``PersonForm`` and ``InstrumentForm`` (in that order), and its field list includes the fields from the parent classes::
ru: Также можно наследовать несколько форм, рассматривая формы как "смесь"(mixin). В этом примере форма ``BeatleForm`` наследует формы ``PersonForm`` и ``InstrumentForm`` (именно в этом порядке) и её список полей включает в себя поля из родительских классов::

source: It's possible to declaratively remove a ``Field`` inherited from a parent class by setting the name of the field to ``None`` on the subclass. For example::
ru: Добавлена возможность декларативно удалить ``Field``, унаследованное от родительского класса, указав ``None``. Например::

source: Prefixes for forms
ru: Префиксы для форм

source: You can put several Django forms inside one ``<form>`` tag. To give each ``Form`` its own namespace, use the ``prefix`` keyword argument::
ru: Вы можете размещать несколько форм в одном теге ``<form>``. Для размещения каждой формы в собственном пространстве имён следует использовать именованный аргумент ``prefix``::

source: The prefix can also be specified on the form class::
ru: Префикс также можно указать в классе формы::
