Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/ref/forms/api.po
Languages: ru

source: The Forms API
ru: API форм

source: About this document
ru: Об этом документе

source: This document covers the gritty details of Django's forms API. You should read the :doc:`introduction to working with forms </topics/forms/index>` first.
ru: Этот документ знакомит с деталями API форм Django. Сначала вы должны прочитать :doc:`введение в использование форм </topics/forms/index>`.

source: Bound and unbound forms
ru: Заполненные и незаполненные формы

source: A :class:`Form` instance is either **bound** to a set of data, or **unbound**.
ru: Экземпляр класса :class:`Form` может быть **заполнен** набором данных или **не заполнен**.

source: If it's **bound** to a set of data, it's capable of validating that data and rendering the form as HTML with the data displayed in the HTML.
ru: Если он **заполнен**, то у него есть возможность валидации полученных данных и генерации заполненной формы в виде HTML кода.

source: If it's **unbound**, it cannot do validation (because there's no data to validate!), but it can still render the blank form as HTML.
ru: Если он **не заполнен**, то выполнить валидацию невозможно (так как нет для этого данных!), но есть возможность сгенерировать HTML код пустой формы.

source: To create an unbound :class:`Form` instance, simply instantiate the class::
ru: Для создания незаполненного экземпляра :class:`Form`, просто создайте объект::

source: To bind data to a form, pass the data as a dictionary as the first parameter to your :class:`Form` class constructor::
ru: Для привязки данных к форме, передайте данные в виде словаря в качестве первого параметра конструктора класса :class:`Form`::

source: In this dictionary, the keys are the field names, which correspond to the attributes in your :class:`Form` class. The values are the data you're trying to validate. These will usually be strings, but there's no requirement that they be strings; the type of data you pass depends on the :class:`Field`, as we'll see in a moment.
ru: В этом словаре, ключами являются имена полей, которые соответствуют атрибутам в вашем классе :class:`Form`. Значения словаря являются данными, которые вам требуется проверить. Обычно значения представлены строками, но это требование не является обязательным. Тип переданных данных зависит от класса :class:`Field`, это мы сейчас рассмотрим.

source: If you need to distinguish between bound and unbound form instances at runtime, check the value of the form's :attr:`~Form.is_bound` attribute::
ru: Если вам требуется определять заполненность экземпляров форм во время работы программы, обратитесь к значению атрибута формы :attr:`~Form.is_bound`::

source: Note that passing an empty dictionary creates a *bound* form with empty data::
ru: Следует отметить, что передача форме пустого словаря создаёт *заполненную* форму без данных::

source: If you have a bound :class:`Form` instance and want to change the data somehow, or if you want to bind an unbound :class:`Form` instance to some data, create another :class:`Form` instance. There is no way to change data in a :class:`Form` instance. Once a :class:`Form` instance has been created, you should consider its data immutable, whether it has data or not.
ru: Если есть заполненный экземпляр :class:`Form` и требуется как-то изменить его данные или если требуется привязать данные к незаполненному экземпляру :class:`Form`, то создаёте другой экземпляр :class:`Form`. Нет способа изменить данные в экземпляре :class:`Form`. После создания экземпляра :class:`Form`, его данные следует рассматривать как неизменные, независимо от его заполненности.

source: Using forms to validate data
ru: Использование форм для проверки данных

source: Implement a ``clean()`` method on your ``Form`` when you must add custom validation for fields that are interdependent. See :ref:`validating-fields-with-clean` for example usage.
ru: Добавьте метод ``clean()`` в вашу форму ``Form``, если необходимо проверить независимые поля вместе. Смотрите :ref:`validating-fields-with-clean`.

source: The primary task of a :class:`Form` object is to validate data. With a bound :class:`Form` instance, call the :meth:`~Form.is_valid` method to run validation and return a boolean designating whether the data was valid::
ru: Главной задачей объекта :class:`Form` является проверка данных. У заполненного экземпляра :class:`Form` вызовите метод :meth:`~Form.is_valid` для выполнения проверки и получения её результата::

source: Let's try with some invalid data. In this case, ``subject`` is blank (an error, because all fields are required by default) and ``sender`` is not a valid email address::
ru: Начнём с неправильных данных. В этом случае поле ``subject`` будет пустым (ошибка, так как по умолчанию все поля должны быть заполнены), а поле ``sender`` содержит неправильный адрес электронной почты::

source: Access the :attr:`~Form.errors` attribute to get a dictionary of error messages::
ru: Обратитесь к атрибуту :attr:`~Form.errors` для получения словаря с сообщениями об ошибках::

source: In this dictionary, the keys are the field names, and the values are lists of Unicode strings representing the error messages. The error messages are stored in lists because a field can have multiple error messages.
ru: В этом словаре, ключами являются имена полей, а значениями -- списки юникодных строк, представляющих сообщения об ошибках. Сообщения хранятся в виде списков, так как поле может иметь множество таких сообщений.

source: You can access :attr:`~Form.errors` without having to call :meth:`~Form.is_valid` first. The form's data will be validated the first time either you call :meth:`~Form.is_valid` or access :attr:`~Form.errors`.
ru: Обращаться к атрибуту :attr:`~Form.errors` можно без предварительного вызова методе call :meth:`~Form.is_valid`. Данные формы будут проверены при вызове метода :meth:`~Form.is_valid` или при обращении к :attr:`~Form.errors`.

source: The validation routines will only get called once, regardless of how many times you access :attr:`~Form.errors` or call :meth:`~Form.is_valid`. This means that if validation has side effects, those side effects will only be triggered once.
ru: Процедуры проверки выполняются один раз, независимо от количества обращений к атрибуту :attr:`~Form.errors` или вызова метода :meth:`~Form.is_valid`. Это означает, что если проверка данных имеет побочное влияние на состояние формы, то оно проявится только один раз.

source: Returns a ``dict`` that maps fields to their original ``ValidationError`` instances.
ru: Возвращает ``dict``, который содержит поля и объекты ``ValidationError``.

source: Use this method anytime you need to identify an error by its ``code``. This enables things like rewriting the error's message or writing custom logic in a view when a given error is present. It can also be used to serialize the errors in a custom format (e.g. XML); for instance, :meth:`~Form.errors.as_json()` relies on ``as_data()``.
ru: Используйте этот метод, если вам необходимо определить тип ошибки по её ``code``. Это позволяет переопределить сообщение об ошибке, или добавить дополнительную логику обработки некоторых ошибок. Также позволяет преобразовать ошибки в другой формат (например, XML). Например, :meth:`~Form.errors.as_json()` использует ``as_data()``.

source: The need for the ``as_data()`` method is due to backwards compatibility. Previously ``ValidationError`` instances were lost as soon as their **rendered** error messages were added to the ``Form.errors`` dictionary. Ideally ``Form.errors`` would have stored ``ValidationError`` instances and methods with an ``as_`` prefix could render them, but it had to be done the other way around in order not to break code that expects rendered error messages in ``Form.errors``.
ru: Метод ``as_data()`` добавлен для обратной совместимости. В предыдущих версиях объекты ``ValidationError`` терялись при получении сообщения с ошибкой и добавления его в словарь ``Form.errors``. В идеале ``Form.errors`` должен содержать объекты ``ValidationError`` и метод с префиксом ``as_`` должен преобразовать их в текстовые сообщения, но нам пришлось пойти другим путем, чтобы не сломать существующий код, который ожидает получить сообщения с ошибками из ``Form.errors``.

source: Returns the errors serialized as JSON.
ru: Возвращает ошибки в JSON формате.

source: By default, ``as_json()`` does not escape its output. If you are using it for something like AJAX requests to a form view where the client interprets the response and inserts errors into the page, you'll want to be sure to escape the results on the client-side to avoid the possibility of a cross-site scripting attack. It's trivial to do so using a JavaScript library like jQuery - simply use ``$(el).text(errorText)`` rather than ``.html()``.
ru: По умолчанию, ``as_json()`` не экранирует результат. Если вы используете, например, AJAX запросы для отправки формы, и показываете ошибки на странице, вам следует экранировать результат на клиенте, чтобы избежать XSS атак. Это просто сделать, используя JavaScript библиотеку, например, jQuery -- просто используйте ``$(el).text(errorText)`` вместо ``.html()``.

source: If for some reason you don't want to use client-side escaping, you can also set ``escape_html=True`` and error messages will be escaped so you can use them directly in HTML.
ru: Если вы не хотите использовать экранирование на стороне клиента, можете передать аргумент ``escape_html=True`` и все ошибки будет экранированы, теперь их можно вставлять непосредственно в HTML.

source: This method allows adding errors to specific fields from within the ``Form.clean()`` method, or from outside the form altogether; for instance from a view.
ru: Этот метод позволяет добавить ошибки конкретному полю в методе ``Form.clean()``, или вне формы. Например, из представления.

source: The ``field`` argument is the name of the field to which the errors should be added. If its value is ``None`` the error will be treated as a non-field error as returned by :meth:`Form.non_field_errors() <django.forms.Form.non_field_errors>`.
ru: Аргумент ``field`` указывает поле, для которого необходимо добавить ошибку. Если равен ``None``, ошибка будет добавлена к общим ошибкам формы, которые можно получить через метод :meth:`Form.non_field_errors() <django.forms.Form.non_field_errors>`.

source: The ``error`` argument can be a simple string, or preferably an instance of ``ValidationError``. See :ref:`raising-validation-error` for best practices when defining form errors.
ru: Аргумент ``error`` может быть просто строкой, но лучше передавать объект ``ValidationError``. Смотрите :ref:`raising-validation-error`.

source: Note that ``Form.add_error()`` automatically removes the relevant field from ``cleaned_data``.
ru: Обратите внимание, ``Form.add_error()`` автоматически удалит поле из ``cleaned_data``.

source: This method returns a boolean designating whether a field has an error with a specific error ``code``. If ``code`` is ``None``, it will return ``True`` if the field contains any errors at all.
ru: Этот метод возвращает ``True``, если поле содержит ошибку с кодом ``code``. Если ``code`` равен ``None``, вернет ``True``, если поле содержит любую ошибку.

source: To check for non-field errors use :data:`~django.core.exceptions.NON_FIELD_ERRORS` as the ``field`` parameter.
ru: Чтобы проверить наличие ошибок, которые не относятся ни к одному из полей, передайте :data:`~django.core.exceptions.NON_FIELD_ERRORS` в параметре ``field``.

source: This method returns the list of errors from :attr:`Form.errors <django.forms.Form.errors>` that aren't associated with a particular field. This includes ``ValidationError``\s that are raised in :meth:`Form.clean() <django.forms.Form.clean>` and errors added using :meth:`Form.add_error(None, "...") <django.forms.Form.add_error>`.
ru: Этот метод возвращает список ошибок из :attr:`Form.errors <django.forms.Form.errors>`, которые не привязаны к конкретному полю. Сюда входят ошибки ``ValidationError``, вызванные в :meth:`Form.clean() <django.forms.Form.clean>`, и ошибки, добавленные через :meth:`Form.add_error(None, "...") <django.forms.Form.add_error>`.

source: Behavior of unbound forms
ru: Поведение незаполненных форм

source: It's meaningless to validate a form with no data, but, for the record, here's what happens with unbound forms::
ru: Бессмысленно проводить проверку незаполненной формы, но покажем, что происходит с такой формой::

source: Dynamic initial values
ru: Динамические начальные значения

source: Use :attr:`~Form.initial` to declare the initial value of form fields at runtime. For example, you might want to fill in a ``username`` field with the username of the current session.
ru: Используйте атрибут :attr:`~Form.initial` для определения начальных значений полей формы во время работы приложения. Например, вам может потребоваться заполнить поле ``username`` именем текущего пользователя.

source: To accomplish this, use the :attr:`~Form.initial` argument to a :class:`Form`. This argument, if given, should be a dictionary mapping field names to initial values. Only include the fields for which you're specifying an initial value; it's not necessary to include every field in your form. For example::
ru: Для этого следует использовать аргумент :attr:`~Form.initial` конструктора класса :class:`Form`. Этот аргумент, если он передан, должен содержать словарь, связывающий имена полей с их значениями. Указывайте в словаре только те поля, значения которых вы желаете определить. Например::

source: These values are only displayed for unbound forms, and they're not used as fallback values if a particular value isn't provided.
ru: Эти значения только отображаются на незаполненных формах, они не будут доступны пока форма не будет отправлена пользователем.

source: Checking which form data has changed
ru: Проверяем какие данные формы были изменены

source: Use the ``has_changed()`` method on your ``Form`` when you need to check if the form data has been changed from the initial data.
ru: Используйте метод ``has_changed()``, если необходимо проверить были ли изначальные данные изменены.

source: When the form is submitted, we reconstruct it and provide the original data so that the comparison can be done:
ru: После отправки формы, мы создаем ее, предоставляя изначальные данные, и теперь может проверить изменились ли они:

source: ``has_changed()`` will be ``True`` if the data from ``request.POST`` differs from what was provided in :attr:`~Form.initial` or ``False`` otherwise. The result is computed by calling :meth:`Field.has_changed` for each field in the form.
ru: ``has_changed()`` вернет ``True``, если данные из ``request.POST`` отличаются от данных из :attr:`~Form.initial`, иначе вернет ``False``. Результат вычисляется путем вызова :meth:`Field.has_changed` для каждого поля формы.

source: The ``changed_data`` attribute returns a list of the names of the fields whose values in the form's bound data (usually ``request.POST``) differ from what was provided in :attr:`~Form.initial`. It returns an empty list if no data differs.
ru: Атрибут ``changed_data`` возвращает список полей, чии значения из переданных данных (обычно ``request.POST``) отличаются от значений из :attr:`~Form.initial`. Возвращает пустой список, если данные не поменялись.

source: Accessing the fields from the form
ru: Обращение к полям из формы

source: You can access the fields of :class:`Form` instance from its ``fields`` attribute::
ru: Вы можете обращаться к полям объекта :class:`Form`, используя атрибут ``fields``::

source: You can alter the field of :class:`Form` instance to change the way it is presented in the form::
ru: Вы можете изменить поле::

source: Beware not to alter the ``base_fields`` attribute because this modification will influence all subsequent ``ContactForm`` instances within the same Python process::
ru: Будьте осторожны, не изменяйте атрибут ``base_fields`` т.к. эти изменения повлияют на все экземпляры ``ContactForm`` в текущем процессе Python::

source: Accessing "clean" data
ru: Доступ к "чистым" данным

source: Each field in a :class:`Form` class is responsible not only for validating data, but also for "cleaning" it -- normalizing it to a consistent format. This is a nice feature, because it allows data for a particular field to be input in a variety of ways, always resulting in consistent output.
ru: Каждое поле в классе :class:`Form` отвечает не только за проверку, но и за нормализацию данных. Это приятная особенность, так как она позволяет вводить данные в определённые поля различными способами, всегда получая правильный результат.

source: For example, :class:`~django.forms.DateField` normalizes input into a Python ``datetime.date`` object. Regardless of whether you pass it a string in the format ``'1994-07-15'``, a ``datetime.date`` object, or a number of other formats, ``DateField`` will always normalize it to a ``datetime.date`` object as long as it's valid.
ru: Например, класс :class:`~django.forms.DateField` нормализует введённое значение к объекту ``datetime.date``. Независимо от того, передали ли вы строку в формате ``'1994-07-15'``, объект ``datetime.date`` или число в других форматах, ``DateField`` всегда преобразует его в объект ``datetime.date``, если при этом не произойдёт ошибка.

source: Once you've created a :class:`~Form` instance with a set of data and validated it, you can access the clean data via its ``cleaned_data`` attribute::
ru: После создания экземпляра :class:`~Form`, привязки данных и их проверки, вы можете обращаться к "чистым" данным через атрибут ``cleaned_data``::

source: Note that any text-based field -- such as ``CharField`` or ``EmailField`` -- always cleans the input into a Unicode string. We'll cover the encoding implications later in this document.
ru: Следует отметить, что любое текстовое поле, такое как ``CharField`` или ``EmailField``, всегда преобразует текст в юникодную строку. Мы рассмотрим применения кодировок далее.

source: If your data does *not* validate, the ``cleaned_data`` dictionary contains only the valid fields::
ru: Если данные *не прошли* проверку, то атрибут ``cleaned_data`` будет содержать только значения тех полей, что прошли проверку::

source: ``cleaned_data`` will always *only* contain a key for fields defined in the ``Form``, even if you pass extra data when you define the ``Form``. In this example, we pass a bunch of extra fields to the ``ContactForm`` constructor, but ``cleaned_data`` contains only the form's fields::
ru: Атрибут ``cleaned_data`` всегда содержит *только* данные для полей, определённых в классе ``Form``, даже если вы передали дополнительные данные при определении ``Form``. В этом примере, мы передаём набор дополнительных полей в конструктор ``ContactForm``, но ``cleaned_data`` содержит только поля формы::

source: When the ``Form`` is valid, ``cleaned_data`` will include a key and value for *all* its fields, even if the data didn't include a value for some optional fields. In this example, the data dictionary doesn't include a value for the ``nick_name`` field, but ``cleaned_data`` includes it, with an empty value::
ru: Если ``Form`` прошла проверку, то ``cleaned_data`` будет содержать ключ и значение для *всех* полей формы, даже если данные не включают в себя значение для некоторых необязательных полей. В данном примере, словарь данных не содержит значение для поля ``nick_name``, но ``cleaned_data`` содержит пустое значение для него::

source: In this above example, the ``cleaned_data`` value for ``nick_name`` is set to an empty string, because ``nick_name`` is ``CharField``, and ``CharField``\s treat empty values as an empty string. Each field type knows what its "blank" value is -- e.g., for ``DateField``, it's ``None`` instead of the empty string. For full details on each field's behavior in this case, see the "Empty value" note for each field in the "Built-in ``Field`` classes" section below.
ru: В приведённом выше примере, значением атрибута ``cleaned_data`` для поля ``nick_name`` является пустая строка, так как ``nick_name`` -- это ``CharField``, а ``CharField`` рассматривает пустые значения как пустые строки. Каждый тип поля знает, что такое "пустое" значение, т.е. для ``DateField`` -- это ``None``, на не пустая строка. Для получения подробностей о поведении каждого типа поля обращайте внимание на заметку "Пустое значение" для каждого поля в разделе "Встроенные поля", которые приведён далее.

source: You can write code to perform validation for particular form fields (based on their name) or for the form as a whole (considering combinations of various fields). More information about this is in :doc:`/ref/forms/validation`.
ru: Вы можете написать код для выполнения проверки определённых полей формы (используя их имена) или для проверки всей формы (рассматривая её как комбинацию полей). Подробная информация изложена в :doc:`/ref/forms/validation`.

source: Outputting forms as HTML
ru: Выдача формы в виде HTML

source: The second task of a ``Form`` object is to render itself as HTML. To do so, simply ``print`` it::
ru: Второй задачей объекта ``Form`` является представление себя в виде HTML кода. Для этого объект надо просто "распечатать"::

source: This default output is a two-column HTML table, with a ``<tr>`` for each field. Notice the following:
ru: По умолчанию в HTML форма представляется в виде таблицы, т.е. каждое поле обёрнуто в ``<tr>``. Обратите внимание на:

source: For flexibility, the output does *not* include the ``<table>`` and ``</table>`` tags, nor does it include the ``<form>`` and ``</form>`` tags or an ``<input type="submit">`` tag. It's your job to do that.
ru: Для гибкости, выводимый код *не включает в себя* ни теги ``<table>`` и ``</table>``, ни теги ``<form>`` and ``</form>``, ни тег ``<input type="submit">``. Не забывайте их добавлять.

source: Each field type has a default HTML representation. ``CharField`` is represented by an ``<input type="text">`` and ``EmailField`` by an ``<input type="email">``. ``BooleanField`` is represented by an ``<input type="checkbox">``. Note these are merely sensible defaults; you can specify which HTML to use for a given field by using widgets, which we'll explain shortly.
ru: Каждый тип поля имеет стандартное HTML представление. Тип ``CharField``представлен как ``<input type="text">``, а ``EmailField`` как ``<input type="email">``. Тип ``BooleanField`` представлен ``<input type="checkbox">``. Следует отметить, что эти представления достаточно гибкие, так как вы можете влиять на них, указав для поля виджет. Далее мы покажем как это делается.

source: The HTML ``name`` for each tag is taken directly from its attribute name in the ``ContactForm`` class.
ru: Атрибут ``name`` каждого тега совпадает напрямую с именем атрибута в классе ``ContactForm``.

source: The text label for each field -- e.g. ``'Subject:'``, ``'Message:'`` and ``'Cc myself:'`` is generated from the field name by converting all underscores to spaces and upper-casing the first letter. Again, note these are merely sensible defaults; you can also specify labels manually.
ru: Текстовая метка каждого поля, т.е. ``'Subject:'``, ``'Message:'`` и ``'Cc myself:'``, генерируется из имени поля, конвертируя символы подчёркивания в пробелы и переводя первый символ в верхний регистр. Также, вы можете явно назначить текстовую метку для поля.
