Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/ref/forms/fields.po
Languages: ru

source: Optional. Either ``True`` or ``False``. Default is ``True``. Specifies whether files in the specified location should be included. Either this or :attr:`allow_folders` must be ``True``.
ru: Необязательно. Возможные значения: ``True`` или ``False``. По умолчанию: ``True``. Определяет, следует ли подключать файлы из указанного места или нет. Этот атрибут или :attr:`allow_folders` должен быть установлен в ``True``.

source: Optional. Either ``True`` or ``False``. Default is ``False``. Specifies whether folders in the specified location should be included. Either this or :attr:`allow_files` must be ``True``.
ru: Необязательно. Возможные значения: ``True`` или ``False``. По умолчанию: ``False``. Определяет, следует ли подключать каталоги из указанного места или нет. Этот атрибут или :attr:`allow_files` должен быть установлен в ``True``.

source: Normalizes to: A Python float.
ru: Возвращает: Тип ``float`` языка Python.

source: Validates that the given value is a float. Leading and trailing whitespace is allowed, as in Python's ``float()`` function.
ru: Проверяет, что полученное значение является числом с плавающей точкой. Пробелы до и после значения не влияют на преобразование значения, так как эта ситуация обрабатывается функцией ``float()`` языка Python.

source: Error message keys: ``required``, ``invalid``, ``max_value``, ``min_value``
ru: Ключи сообщений об ошибках: ``required``, ``invalid``, ``max_value``, ``min_value``.

source: Takes two optional arguments for validation, ``max_value`` and ``min_value``. These control the range of values permitted in the field.
ru: Принимает два необязательных аргумента для проверки: ``max_value`` и ``min_value``. Они определяют диапазон значений, разрешённый для поля.

source: Validates that file data has been bound to the form, and that the file is of an image format understood by Pillow.
ru: Проверяет, что данные файла были связаны с формой, а затем, что файл является изображением, формат которого поддерживается библиотекой Pillow.

source: Error message keys: ``required``, ``invalid``, ``missing``, ``empty``, ``invalid_image``
ru: Ключи сообщений об ошибках: ``required``, ``invalid``, ``missing``, ``empty``, ``invalid_image``.

source: Using an ``ImageField`` requires that `Pillow`_ is installed with support for the image formats you use. If you encounter a ``corrupt image`` error when you upload an image, it usually means that Pillow doesn't understand its format. To fix this, install the appropriate library and reinstall Pillow.
ru: Использование ``ImageField`` требует наличия `Pillow`_ (рекомендуется) с поддержкой используемых вами форматов изображений. Если вы сталкиваетесь с ошибкой ``corrupt image`` при загрузке изображения, обычно это означает, что Pillow не поддерживает такой формат изображения. Для решения этой проблемы, установите соответствующую библиотеку и переустановите Pillow.

source: When you use an ``ImageField`` on a form, you must also remember to :ref:`bind the file data to the form <binding-uploaded-files>`.
ru: При использовании ``ImageField`` на форме, вы должны не забыть :ref:`связать данные файла с формой <binding-uploaded-files>`.

source: After the field has been cleaned and validated, the ``UploadedFile`` object will have an additional ``image`` attribute containing the Pillow `Image`_ instance used to check if the file was a valid image. Also, ``UploadedFile.content_type`` will be updated with the image's content type if Pillow can determine it, otherwise it will be set to ``None``.
ru: После очистки и проверки поля, объект ``UploadedFile`` получает дополнительный атрибут ``image``, который содержит экземпляр `Image`_, используемый для проверка того, что файл содержит изображение. Атрибут ``UploadedFile.content_type`` также обновляется значением соответствующего типа контента, определённого библиотекой Pillow, иначе ``None``.

source: Validates that the given value is an integer. Leading and trailing whitespace is allowed, as in Python's ``int()`` function.
ru: Проверяет, что полученное значение является целым числом. Пробелы до и после значения не влияют на преобразование значения, так как эта ситуация обрабатывается функцией ``int()`` языка Python.

source: The ``max_value`` and ``min_value`` error messages may contain ``%(limit_value)s``, which will be substituted by the appropriate limit.
ru: Сообщения об ошибках ``max_value`` и ``min_value`` могут содержать шаблон ``%(limit_value)s``, который будет заполнен соответствующим значением.

source: Takes two optional arguments for validation:
ru: Принимает два необязательных аргумента для проверки:

source: These control the range of values permitted in the field.
ru: Они определяют диапазон значений, разрешённый для поля.

source: A field containing either an IPv4 or an IPv6 address.
ru: Поле для обработки адресов IPv4 или IPv6.

source: Validates that the given value is a valid IP address.
ru: Проверяет, что полученное значение является правильным IP адресом.

source: The IPv6 address normalization follows :rfc:`4291#section-2.2` section 2.2, including using the IPv4 format suggested in paragraph 3 of that section, like ``::ffff:192.0.2.0``. For example, ``2001:0::0:01`` would be normalized to ``2001::1``, and ``::ffff:0a0a:0a0a`` to ``::ffff:10.10.10.10``. All characters are converted to lowercase.
ru: IPv6 адрес преобразуется в соответствии с :rfc:`4291#section-2.2`, секция 2.2, включая использование формата IPv4, предложенного в параграфе 3 этой секции, вида ``::ffff:192.0.2.0``. Например, ``2001:0::0:01`` будет преобразован к ``2001::1``, а ``::ffff:0a0a:0a0a`` к ``::ffff:10.10.10.10``. Все символы преобразуются в нижний регистр.

source: Takes two optional arguments:
ru: Принимает два необязательных аргумента:

source: Limits valid inputs to the specified protocol. Accepted values are ``both`` (default), ``IPv4`` or ``IPv6``. Matching is case insensitive.
ru: Ограничивает диапазон значений указанным протоколом. Принимает значения: ``both`` (по умолчанию, т.е. "оба"), ``IPv4`` или ``IPv6``. Регистр букв не имеет значения.

source: Unpacks IPv4 mapped addresses like ``::ffff:192.0.2.1``. If this option is enabled that address would be unpacked to ``192.0.2.1``. Default is disabled. Can only be used when ``protocol`` is set to ``'both'``.
ru: Распаковывает IPv4 адреса вида ``::ffff::192.0.2.1``. Если эта опция активирована, то адрес будет преобразован в ``192.0.2.1``. По умолчанию опция отключена. Может использоваться только если ``protocol`` установлен в ``'both'``.

source: Default widget: :class:`SelectMultiple`
ru: Стандартный виджет: :class:`SelectMultiple`

source: Empty value: ``[]`` (an empty list)
ru: Пустое значение: ``[]`` (пустой список).

source: Validates that every value in the given list of values exists in the list of choices.
ru: Проверяет, что каждое значение из полученного списка присутствует в списке вариантов.

source: Error message keys: ``required``, ``invalid_choice``, ``invalid_list``
ru: Ключи сообщений об ошибках: ``required``, ``invalid_choice``, ``invalid_list``.

source: Takes one extra required argument, ``choices``, as for :class:`ChoiceField`.
ru: Принимает один дополнительный обязательный аргумент ``choices``, аналогично полю :class:`ChoiceField`.

source: Just like a :class:`MultipleChoiceField`, except :class:`TypedMultipleChoiceField` takes two extra arguments, ``coerce`` and ``empty_value``.
ru: Похоже на :class:`MultipleChoiceField`, за исключением того, что :class:`TypedMultipleChoiceField` принимает два дополнительных аргумента: ``coerce`` и ``empty_value``.

source: Empty value: Whatever you've given as ``empty_value``
ru: Пустое значение: Всё, что вы назовёте ``empty_value``.

source: Normalizes to: A list of values of the type provided by the ``coerce`` argument.
ru: Возвращает: Список значений типа, который указан аргументом ``coerce``.

source: Validates that the given values exists in the list of choices and can be coerced.
ru: Проверяет, что полученные значения присутствуют в списке вариантов и могут быть преобразованы в нужный тип.

source: Takes two extra arguments, ``coerce`` and ``empty_value``, as for :class:`TypedChoiceField`.
ru: Принимает два дополнительных аргумента, ``coerce`` и ``empty_value``, аналогично :class:`TypedChoiceField`.

source: Default widget: :class:`NullBooleanSelect`
ru: Стандартный виджет: :class:`NullBooleanSelect`

source: Normalizes to: A Python ``True``, ``False`` or ``None`` value.
ru: Возвращает: ``True``, ``False`` или ``None``.

source: Validates nothing (i.e., it never raises a ``ValidationError``).
ru: Ничего не проверяет, т.е. никогда не возвратит ``ValidationError``.

source: Validates that the given value matches against a certain regular expression.
ru: Проверяет, что полученное значение совпадает с указанным регулярным выражением.

source: Takes one required argument:
ru: Принимает один обязательный аргумент:

source: A regular expression specified either as a string or a compiled regular expression object.
ru: Регулярное выражение в виде строки или скомпилированного объекта регулярного выражения.

source: Also takes ``max_length``, ``min_length``, and ``strip``, which work just as they do for :class:`CharField`.
ru: Также принимает аргументы ``max_length``, ``min_length`` и ``strip``, которые работают аналогично :class:`CharField`.

source: Defaults to ``False``. If enabled, stripping will be applied before the regex validation.
ru: По умолчанию ``False``. При ``True`` будут удалены пробелы в начале и конце значения перед проверкой регулярным выражением.

source: Validates that the given value contains only letters, numbers, underscores, and hyphens.
ru: Проверяет, что полученное значение содержит только буквы, цифры, подчёркивания и тире.

source: Error messages: ``required``, ``invalid``
ru: Ключи сообщений об ошибках: ``required``, ``invalid``.

source: This field is intended for use in representing a model :class:`~django.db.models.SlugField` in forms.
ru: Это поле предназначено для представления поля модели :class:`~django.db.models.SlugField` на формах.

source: Takes an optional parameter:
ru: Принимает необязательный аргумент:

source: A boolean instructing the field to accept Unicode letters in addition to ASCII letters. Defaults to ``False``.
ru: Булево значение, указывает принимать ли Unicode символы в дополнение к ASCII. По умолчанию ``False``.

source: Normalizes to: A Python ``datetime.time`` object.
ru: Возвращает: Объект ``datetime.time`` языка Python.

source: Validates that the given value is either a ``datetime.time`` or string formatted in a particular time format.
ru: Проверяет, что переданное значение является объектом ``datetime.time`` или строкой, отформатированной в нужном виде.

source: A list of formats used to attempt to convert a string to a valid ``datetime.time`` object.
ru: Список форматов, используемых при попытках сконвертировать строку в объект ``datetime.time``.

source: Default widget: :class:`URLInput`
ru: Стандартный виджет: :class:`URLInput`

source: Validates that the given value is a valid URL.
ru: Проверяет, что полученное значение является правильным URL.

source: Takes the following optional arguments:
ru: Принимает следующие необязательные аргументы:

source: These are the same as ``CharField.max_length`` and ``CharField.min_length``.
ru: Аналогичны ``CharField.max_length`` и ``CharField.min_length``.

source: Normalizes to: A :class:`~python:uuid.UUID` object.
ru: Нормализует к: объекту :class:`~python:uuid.UUID`.

source: This field will accept any string format accepted as the ``hex`` argument to the :class:`~python:uuid.UUID` constructor.
ru: Это поле будет принимать любой строковый формат, понимаемый аргументом ``hex`` конструктора :class:`~python:uuid.UUID`.

source: Slightly complex built-in ``Field`` classes
ru: Достаточно сложные встроенные классы ``Field``

source: Validates the given value against each of the fields specified as an argument to the ``ComboField``.
ru: Проверяет, что полученное значение соответствует каждому полю, указанному в качестве аргумента ``ComboField``.

source: Takes one extra required argument:
ru: Принимает один дополнительный обязательный аргумент:

source: The list of fields that should be used to validate the field's value (in the order in which they are provided).
ru: Список полей, которые должны использоваться для проверки значения поля (в порядке их определения).

source: Normalizes to: the type returned by the ``compress`` method of the subclass.
ru: Возвращает: Тип, который вернёт метод ``compress()``.

source: Validates the given value against each of the fields specified as an argument to the ``MultiValueField``.
ru: Проверяет, что полученное значение соответствует полям, указанным в аргументе ``MultiValueField``.

source: Error message keys: ``required``, ``invalid``, ``incomplete``
ru: Ключи сообщений об ошибках: ``required``, ``invalid``, ``incomplete``

source: Aggregates the logic of multiple fields that together produce a single value.
ru: Агрегирует логику нескольких полей, создавая единое значение.

source: This field is abstract and must be subclassed. In contrast with the single-value fields, subclasses of :class:`MultiValueField` must not implement :meth:`~django.forms.Field.clean` but instead - implement :meth:`~MultiValueField.compress`.
ru: Это поле является абстрактным и должно быть реализовано в собственном классе. В отличие от полей с единственным значением, дочерние классы :class:`MultiValueField` не должны реализовывать метод :meth:`~django.forms.Field.clean`, вместо этого надо реализовать метод :meth:`~MultiValueField.compress`.

source: A tuple of fields whose values are cleaned and subsequently combined into a single value. Each value of the field is cleaned by the corresponding field in ``fields`` -- the first value is cleaned by the first field, the second value is cleaned by the second field, etc. Once all fields are cleaned, the list of clean values is combined into a single value by :meth:`~MultiValueField.compress`.
ru: Кортеж полей, чьи значения очищаются и последовательно объединяются в единственное значение. Каждое значение поля проверяется соответствующим полем в ``fields``. Первое значение обрабатывается первым полем, второе -- вторым и так далее. После проверки всех полей, список значений "сжимается" в одно значений с помощью метода :meth:`~MultiValueField.compress`.

source: Defaults to ``True``, in which case a ``required`` validation error will be raised if no value is supplied for any field.
ru: По умолчанию ``True``, в это случае будет получена ошибка валидации ``required``, если хотя бы одно поле не содержит значения.

source: When set to ``False``, the :attr:`Field.required` attribute can be set to ``False`` for individual fields to make them optional. If no value is supplied for a required field, an ``incomplete`` validation error will be raised.
ru: При ``False`` атрибут :attr:`Field.required` вложенных полей может быть ``False``, делая их не обязательными. Если обязательное поле не содержит значения, оно вернет ошибку валидации ``incomplete``.

source: A default ``incomplete`` error message can be defined on the :class:`MultiValueField` subclass, or different messages can be defined on each individual field. For example::
ru: Сообщение об ошибке ``incomplete`` может быть указано в дочернем классе :class:`MultiValueField`, или индивидуально для каждого вложенного поля. Например::

source: Must be a subclass of :class:`django.forms.MultiWidget`. Default value is :class:`~django.forms.TextInput`, which probably is not very useful in this case.
ru: Должен быть дочерним классом :class:`django.forms.MultiWidget`.Значением по умолчанию является :class:`~django.forms.TextInput`, который возможно не так полезен в этом случае.

source: Takes a list of valid values and returns a "compressed" version of those values -- in a single value. For example, :class:`SplitDateTimeField` is a subclass which combines a time field and a date field into a ``datetime`` object.
ru: Принимает список проверенных значений и возвращает в одном значении их "сжатую" версию. Например, :class:`SplitDateTimeField` является дочерним классом, который объединяет поле времени с полем даты в объект ``datetime``.

source: This method must be implemented in the subclasses.
ru: Этот метод должен быть реализован в дочерних классах.

source: Default widget: :class:`SplitDateTimeWidget`
ru: Стандартный виджет: :class:``SplitDateTimeWidget``

source: Validates that the given value is a ``datetime.datetime`` or string formatted in a particular datetime format.
ru: Проверяет, что переданное значение является объектом ``datetime.datetime`` или строкой, отформатированной в нужном виде.

source: Error message keys: ``required``, ``invalid``, ``invalid_date``, ``invalid_time``
ru: Ключи сообщений об ошибках: ``required``, ``invalid``, ``invalid_date``, ``invalid_time``.

source: If no ``input_date_formats`` argument is provided, the default input formats for :class:`DateField` are used.
ru: Если аргумент ``input_date_formats`` не был предоставлен, то используются шаблоны аналогичные полю :class:`DateField`.

source: If no ``input_time_formats`` argument is provided, the default input formats for :class:`TimeField` are used.
ru: Если аргумент ``input_date_formats`` не был предоставлен, то используются шаблоны аналогичные полю :class:`TimeField`.

source: Fields which handle relationships
ru: Поля для обработки связей

source: Two fields are available for representing relationships between models: :class:`ModelChoiceField` and :class:`ModelMultipleChoiceField`. Both of these fields require a single ``queryset`` parameter that is used to create the choices for the field. Upon form validation, these fields will place either one model object (in the case of ``ModelChoiceField``) or multiple model objects (in the case of ``ModelMultipleChoiceField``) into the ``cleaned_data`` dictionary of the form.
ru: Для представления связей между моделями предлагается два поля: :class:`ModelChoiceField` and :class:`ModelMultipleChoiceField`. Оба эти поля требуют наличие одного параметра ``queryset``, который используется для создания вариантов значений для этого поля. При проверке формы эти поля заполняются одним объектом модели (в случае ``ModelChoiceField``) или множеством объектов модели (в случае ``ModelMultipleChoiceField``) в словаре ``cleaned_data`` формы.

source: For more complex uses, you can specify ``queryset=None`` when declaring the form field and then populate the ``queryset`` in the form's ``__init__()`` method::
ru: Возможно указать ``queryset=None`` при определении поля, далее в конструкторе формы определить значение этого атрибута::

source: Normalizes to: A model instance.
ru: Возвращает: Экземпляр модели.

source: Validates that the given id exists in the queryset.
ru: Проверяет, что полученный идентификатор присутствует в выборке.

source: Allows the selection of a single model object, suitable for representing a foreign key. Note that the default widget for ``ModelChoiceField`` becomes impractical when the number of entries increases. You should avoid using it for more than 100 items.
ru: Позволяет выбор единственного объекта модели, имеет смысл при отображении внешнего ключа. Следует отметить, что стандартный виджет для ``ModelChoiceField`` становится непрактичным когда число его значений растёт. Сотня значений уже становится проблемой.

source: A single argument is required:
ru: Единственный обязательный аргумент:

source: ``ModelChoiceField`` also takes two optional arguments:
ru: ``ModelChoiceField`` принимает два необязательных аргумента:

source: By default the ``<select>`` widget used by ``ModelChoiceField`` will have an empty choice at the top of the list. You can change the text of this label (which is ``"---------"`` by default) with the ``empty_label`` attribute, or you can disable the empty label entirely by setting ``empty_label`` to ``None``::
ru: По умолчанию виджет ``<select>``, используемый полем ``ModelChoiceField``, содержит пустой вариант в начале списка. Вы можете изменить текстовую метку для этого варианта (по умолчанию это ``"---------"``) с помощью атрибута ``empty_label``. Также вы можете исключить пустой вариант из списка поря, назначив ``None`` параметру ``empty_label``::

source: Note that if a ``ModelChoiceField`` is required and has a default initial value, no empty choice is created (regardless of the value of ``empty_label``).
ru: Следует отметить, что если ``ModelChoiceField`` является обязательным и имеет начальное значение, то пустой вариант отсутствует для такого поля, вне зависимости от значения аргумента ``empty_label``.

source: This optional argument is used to specify the field to use as the value of the choices in the field's widget. Be sure it's a unique field for the model, otherwise the selected value could match more than one object. By default it is set to ``None``, in which case the primary key of each object will be used. For example::
ru: Этот необязательный параметр позволяет указать поле модели, которое будет использоваться для определения значения. Поле должно быть уникальным, чтобы выбранное значение не соответствовало нескольким объектам. По умолчанию равно ``None``, в этом случае используется первичный ключ. Например::

source: would yield:
ru: вернет:

source: and::
ru: и::

source: Empty value: An empty ``QuerySet`` (self.queryset.none())
ru: Пустое значение: Пустой ``QuerySet`` (self.queryset.none())

source: Normalizes to: A ``QuerySet`` of model instances.
ru: Возвращает: Выборку с экземплярами модели.

source: Validates that every id in the given list of values exists in the queryset.
ru: Проверяет, что каждый идентификатор полученного списка значений присутствует в выборке.

source: Error message keys: ``required``, ``list``, ``invalid_choice``, ``invalid_pk_value``
ru: Ключи сообщений об ошибках: ``required``, ``list``, ``invalid_choice``, ``invalid_pk_value``.

source: The ``invalid_choice`` message may contain ``%(value)s`` and the ``invalid_pk_value`` message may contain ``%(pk)s``, which will be substituted by the appropriate values.
ru: Сообщение об ошибке ``invalid_choice`` может включать ``%(value)s``,а ``invalid_pk_value`` -- ``%(pk)s``.

source: Creating custom fields
ru: Создание собственных полей

source: If the built-in ``Field`` classes don't meet your needs, you can easily create custom ``Field`` classes. To do this, just create a subclass of ``django.forms.Field``. Its only requirements are that it implement a ``clean()`` method and that its ``__init__()`` method accept the core arguments mentioned above (``required``, ``label``, ``initial``, ``widget``, ``help_text``).
ru: Если встроенные классы ``Field`` не подходят к вашей задаче, вы легко можете создать свои собственные. Для того, чтобы сделать это просто унаследуйте ваш класс от ``django.forms.Field``. Класс должен реализовывать метод ``clean()`` и его конструктор должен принимать обязательные аргументы, т.е., ``required``, ``label``, ``initial``, ``widget``, ``help_text``.

source: You can also customize how a field will be accessed by overriding :meth:`~django.forms.Field.get_bound_field()`.
ru: Вы также можете настроить доступ к полю, переопределив метод :meth:`~django.forms.Field.get_bound_field()`.
