Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/ref/forms/fields.po
Languages: ru

source: Form fields
ru: Поля формы

source: When you create a ``Form`` class, the most important part is defining the fields of the form. Each field has custom validation logic, along with a few other hooks.
ru: При создании класса ``Form`` наиболее важной деталью является определение полей формы. Каждое поле обладает собственной логикой проверки вводимых данных наряду с дополнительными возможностями.

source: Although the primary way you'll use ``Field`` classes is in ``Form`` classes, you can also instantiate them and use them directly to get a better idea of how they work. Each ``Field`` instance has a ``clean()`` method, which takes a single argument and either raises a ``django.forms.ValidationError`` exception or returns the clean value::
ru: Несмотря на то, что обычно классы ``Field`` используются внутри классов ``Form``, вы можете создавать их объекты самостоятельно, чтобы понять как они работают. Каждый экземпляр класса ``Field`` имеет метод ``clean()``, который принимает единственный аргумент и который вызывает исключение ``django.forms.ValidationError`` в случае ошибки или возвращает чистое значение::

source: Core field arguments
ru: Базовые аргументы поля

source: Each ``Field`` class constructor takes at least these arguments. Some ``Field`` classes take additional, field-specific arguments, but the following should *always* be accepted:
ru: Каждый конструктор класса ``Field`` принимает эти аргументы. Некоторые классы ``Field`` принимают дополнительные аргументы. Перечисленные ниже аргументы принимаются *всеми* полями:

source: By default, each ``Field`` class assumes the value is required, so if you pass an empty value -- either ``None`` or the empty string (``""``) -- then ``clean()`` will raise a ``ValidationError`` exception::
ru: По умолчанию каждый класс ``Field`` предполагает значение обязательным. Таким образом, если вы передадите ему пустое значение, т.е. ``None`` или пустую строку (``""``), то метод ``clean()`` вызовет исключение ``ValidationError``::

source: To specify that a field is *not* required, pass ``required=False`` to the ``Field`` constructor::
ru: Для того, чтобы сделать поле "необязательным" передайте ``required=False`` в конструктор ``Field``::

source: The ``label`` argument lets you specify the "human-friendly" label for this field. This is used when the ``Field`` is displayed in a ``Form``.
ru: Аргумент ``label`` позволяет вам определить "видимую людьми" метку для этого поля. Оно используется когда ``Field`` отображается на форме.

source: As explained in "Outputting forms as HTML" above, the default label for a ``Field`` is generated from the field name by converting all underscores to spaces and upper-casing the first letter. Specify ``label`` if that default behavior doesn't result in an adequate label.
ru: Как показано ранее в `Выдаче формы в виде HTML <Outputting forms as HTML>`_, стандартная метка для ``Field`` создаётся из имени поля, с преобразованием всех символов подчёркивания в пробелы и переводом первой буквы в верхний регистр. Укажите ``label``, если это стандартная метка не подходит для вашей задачи.

source: Here's a full example ``Form`` that implements ``label`` for two of its fields. We've specified ``auto_id=False`` to simplify the output::
ru: Ниже приведён пример формы, которая определяет метки для двух своих полей. Мы используем ``auto_id=False`` для упрощения вывода::

source: The ``label_suffix`` argument lets you override the form's :attr:`~django.forms.Form.label_suffix` on a per-field basis::
ru: Аргумент ``label_suffix`` позволяет вам переопределить атрибут формы :attr:`~django.forms.Form.label_suffix` для каждого поля::

source: The ``initial`` argument lets you specify the initial value to use when rendering this ``Field`` in an unbound ``Form``.
ru: Аргумент ``initial`` позволяет определять начальное значение для поля, при его отображении на незаполненной форме.

source: To specify dynamic initial data, see the :attr:`Form.initial` parameter.
ru: Для определения динамических начальных данных, используйте параметр :attr:`Form.initial`.

source: The use-case for this is when you want to display an "empty" form in which a field is initialized to a particular value. For example::
ru: Использование этого аргумента подходит для отображения пустой формы, в которой поля будут иметь указанные значения. Например::

source: You may be thinking, why not just pass a dictionary of the initial values as data when displaying the form? Well, if you do that, you'll trigger validation, and the HTML output will include any validation errors::
ru: Вам могло прийти в голову просто передать словарь с начальными значениями при отображении формы. Но если так сделать, то вы запустите механизм проверки данных и HTML код формы будет содержать в себе результаты этой проверки::

source: This is why ``initial`` values are only displayed for unbound forms. For bound forms, the HTML output will use the bound data.
ru: Это главная причина, по которой начальные значения отображаются только на незаполненных формах. Для заполненных форм, HTML код всегда будет содержать введённые в форму данные.

source: Also note that ``initial`` values are *not* used as "fallback" data in validation if a particular field's value is not given. ``initial`` values are *only* intended for initial form display::
ru: Также следует отметить, что начальные значения *не используются* в качестве значений по умолчанию во время проведения проверки данных в полях формы. Начальные значения, определённые в ``initial`` предназначены лишь для первого отображения формы::

source: Instead of a constant, you can also pass any callable::
ru: Вместо констант вы также можете передавать любой исполняемый объект (``callable``)::

source: The callable will be evaluated only when the unbound form is displayed, not when it is defined.
ru: Исполняемый объект будет вычислен только в момент отображения незаполненной формы.

source: The ``widget`` argument lets you specify a ``Widget`` class to use when rendering this ``Field``. See :doc:`/ref/forms/widgets` for more information.
ru: Аргумент ``widget`` позволяет указать класс ``Widget``, который следует использовать при отображении поля. Обратитесь к :doc:`/ref/forms/widgets` для более подробной информации.

source: The ``help_text`` argument lets you specify descriptive text for this ``Field``. If you provide ``help_text``, it will be displayed next to the ``Field`` when the ``Field`` is rendered by one of the convenience ``Form`` methods (e.g., ``as_ul()``).
ru: Аргумент ``help_text`` позволяет указать описание для поля. Если вы укажете ``help_text``, он будет показан около поля при отображении формы с помощью вспомогательных методов ``Form`` (например, через ``as_ul()``).

source: Like the model field's :attr:`~django.db.models.Field.help_text`, this value isn't HTML-escaped in automatically-generated forms.
ru: Как и параметр поля модели :attr:`~django.db.models.Field.help_text`, это значение выводится при генерации формы без экранирования спецсимволов HTML.

source: Here's a full example ``Form`` that implements ``help_text`` for two of its fields. We've specified ``auto_id=False`` to simplify the output::
ru: Ниже представлен пример формы, в которой ``help_text`` определён у двух полей. Мы используем ``auto_id=False`` для упрощения вывода::

source: The ``error_messages`` argument lets you override the default messages that the field will raise. Pass in a dictionary with keys matching the error messages you want to override. For example, here is the default error message::
ru: Аргумент ``error_messages`` позволяет изменить стандартные сообщения об ошибках, которые выдаёт поле. Создайте словарь с ключами тех сообщений, которые вы желаете изменить. Например, стандартное сообщение об ошибке::

source: And here is a custom error message::
ru: А вот собственное сообщение об ошибке::

source: In the `built-in Field classes`_ section below, each ``Field`` defines the error message keys it uses.
ru: В разделе `классы встроенных полей <built-in Field classes>`_ показано, что каждое поле определяет ключи сообщений об ошибках, которые оно использует.

source: The ``validators`` argument lets you provide a list of validation functions for this field.
ru: Аргумент ``validators`` позволяет указать список функций, осуществляющих проверку поля.

source: See the :doc:`validators documentation </ref/validators>` for more information.
ru: Обратитесь к документации на :doc:`валидаторы </ref/validators>` для подробной информации.

source: The ``localize`` argument enables the localization of form data input, as well as the rendered output.
ru: Аргумент ``localize`` включает локализацию для данных формы, как на входе, так и на выходе.

source: The ``disabled`` boolean argument, when set to ``True``, disables a form field using the ``disabled`` HTML attribute so that it won't be editable by users. Even if a user tampers with the field's value submitted to the server, it will be ignored in favor of the value from the form's initial data.
ru: ``disabled`` принимает булево значение. При ``True`` выключает поля формы, используя HTML атрибут ``disabled``. Даже если пользователь отправит данные для этого поля, они будут проигнорированы и будет использоваться значение из начальных данных, которые были переданы в форму.

source: Checking if the field data has changed
ru: Устанавливается при изменении данных поля

source: The ``has_changed()`` method is used to determine if the field value has changed from the initial value. Returns ``True`` or ``False``.
ru: Метод ``has_changed()`` используется для определения наличия изменений значения поля по сравнению с начальным состоянием. Возвращает ``True`` или ``False``.

source: See the :class:`Form.has_changed()` documentation for more information.
ru: Смотрите документацию на :class:`Form.has_changed()` для подробностей.

source: Built-in ``Field`` classes
ru: Классы встроенных полей

source: Naturally, the ``forms`` library comes with a set of ``Field`` classes that represent common validation needs. This section documents each built-in field.
ru: Библиотека форм поставляется с набором классов ``Field``, которые предоставляют решение общих задач проверки данных. Этот раздел описывает каждое встроенное поле.

source: For each field, we describe the default widget used if you don't specify ``widget``. We also specify the value returned when you provide an empty value (see the section on ``required`` above to understand what that means).
ru: Для каждого поля мы указываем виджет, который используется в случае, если вы явно не определили нужный вам виджет. Мы также указываем значение, которое будет возвращено, если вы предоставили пустое значение (см. `required`_).

source: Default widget: :class:`CheckboxInput`
ru: Стандартный виджет: :class:`CheckboxInput`

source: Empty value: ``False``
ru: Пустое значение: ``False``.

source: Normalizes to: A Python ``True`` or ``False`` value.
ru: Возвращает: ``True`` или ``False`` языка Python.

source: Validates that the value is ``True`` (e.g. the check box is checked) if the field has ``required=True``.
ru: Гарантирует, что значение равно ``True`` (т.е. чекбокс отмечен), если поле имеет атрибут ``required=True``.

source: Error message keys: ``required``
ru: Ключи сообщений об ошибках: ``required``.

source: Since all ``Field`` subclasses have ``required=True`` by default, the validation condition here is important. If you want to include a boolean in your form that can be either ``True`` or ``False`` (e.g. a checked or unchecked checkbox), you must remember to pass in ``required=False`` when creating the ``BooleanField``.
ru: Так как все потомки ``Field`` по умолчанию имеют ``required=True``, это условие проверки имеет большое значение. Если вам требуется включить в свою форму булево значение, которое может принимать значения ``True`` или ``False`` (т.е. отмеченный или неотмеченный чекбокс), то вы должны передать ``required=False`` в создаваемое поле ``BooleanField``.

source: Default widget: :class:`TextInput`
ru: Стандартный виджет: :class:`TextInput`

source: Validates ``max_length`` or ``min_length``, if they are provided. Otherwise, all inputs are valid.
ru: Проверяет ``max_length`` или ``min_length``, если они указаны. В противном случае, любые значения будут правильными.

source: Error message keys: ``required``, ``max_length``, ``min_length``
ru: Ключи сообщений об ошибках: ``required``, ``max_length``, ``min_length``.

source: Has three optional arguments for validation:
ru: Имеет три необязательных аргумента для проверки:

source: If provided, these arguments ensure that the string is at most or at least the given length.
ru: Если они указаны, то производится соответствующая проверка длины полученной строки.

source: If ``True`` (default), the value will be stripped of leading and trailing whitespace.
ru: При ``True`` (по умолчанию), у значения будут обрезаны пробелы в начале и в конце.

source: Default widget: :class:`Select`
ru: Стандартный виджет: :class:`Select`

source: Empty value: ``''`` (an empty string)
ru: Пустое значение: ``''`` (пустая строка).

source: Validates that the given value exists in the list of choices.
ru: Проверяет, что введённое значение присутствует в списке вариантов.

source: Error message keys: ``required``, ``invalid_choice``
ru: Ключи сообщений об ошибках: ``required``, ``invalid_choice``.

source: The ``invalid_choice`` error message may contain ``%(value)s``, which will be replaced with the selected choice.
ru: Сообщение об ошибке ``invalid_choice`` может содержать ``%(value)s``, которое будет замещено выбранным вариантом.

source: Validates that the given value exists in the list of choices and can be coerced.
ru: Проверяет, что полученное значение присутствует в списке вариантов и может быть преобразовано в нужный тип.

source: Takes extra arguments:
ru: Принимает дополнительные аргументы:

source: A function that takes one argument and returns a coerced value. Examples include the built-in ``int``, ``float``, ``bool`` and other types. Defaults to an identity function. Note that coercion happens after input validation, so it is possible to coerce to a value not present in ``choices``.
ru: Функция, которая принимает один аргумент и возвращает преобразованное значение. Например, можно использовать стандартные ``int``, ``float``, ``bool`` и другие типы. Функция по умолчанию не выполняет преобразования. Преобразование значения происходит после валидации, поэтому можно вернуть значение, которое отсутствует в ``choices``.

source: The value to use to represent "empty." Defaults to the empty string; ``None`` is another common choice here. Note that this value will not be coerced by the function given in the ``coerce`` argument, so choose it accordingly.
ru: Значение, используемое для представления "пустоты". Обычно это пустая строка. ``None`` является ещё одним вариантом. Следует отметить, что это значение не будет преобразовываться функцией, определённой аргументом ``coerce``, так что выбирайте значение соответственно.

source: Default widget: :class:`DateInput`
ru: Стандартный виджет: :class:`DateInput`

source: Empty value: ``None``
ru: Пустое значение: ``None``.

source: Normalizes to: A Python ``datetime.date`` object.
ru: Возвращает: Объект ``datetime.date`` языка Python.

source: Validates that the given value is either a ``datetime.date``, ``datetime.datetime`` or string formatted in a particular date format.
ru: Проверяет, что полученное значение является объектом ``datetime.date``, ``datetime.datetime`` или строкой, отформатированной в нужном виде.

source: Error message keys: ``required``, ``invalid``
ru: Ключи сообщений об ошибках: ``required``, ``invalid``.

source: Takes one optional argument:
ru: Принимает один необязательный аргумент:

source: A list of formats used to attempt to convert a string to a valid ``datetime.date`` object.
ru: Список форматов, используемых при попытках сконвертировать строку в объект ``datetime.date``.

source: If no ``input_formats`` argument is provided, the default input formats are::
ru: Если аргумент ``input_formats`` не предоставлен, то используются следующие форматы::

source: Additionally, if you specify :setting:`USE_L10N=False<USE_L10N>` in your settings, the following will also be included in the default input formats::
ru: Дополнительно, если вы указали :setting:`USE_L10N=False<USE_L10N>` в конфигурации проекта, следующее будет включено в список форматов по умолчанию::

source: Default widget: :class:`DateTimeInput`
ru: Стандартный виджет: :class:`DateTimeInput`

source: Normalizes to: A Python ``datetime.datetime`` object.
ru: Возвращает: Объект ``datetime.datetime`` языка Python.

source: Validates that the given value is either a ``datetime.datetime``, ``datetime.date`` or string formatted in a particular datetime format.
ru: Проверяет, что полученное значение является объектом ``datetime.datetime``, ``datetime.date`` или строкой, отформатированной в нужном виде.

source: A list of formats used to attempt to convert a string to a valid ``datetime.datetime`` object.
ru: Список форматов, используемых при попытках сконвертировать строку в объект ``datetime.datetime``.

source: Default widget: :class:`NumberInput` when :attr:`Field.localize` is ``False``, else :class:`TextInput`.
ru: По умолчанию используется виджет :class:`NumberInput` при :attr:`Field.localize` равном ``False``, иначе :class:`TextInput`.

source: Normalizes to: A Python ``decimal``.
ru: Возвращает: Тип ``decimal`` языка Python.

source: Validates that the given value is a decimal. Leading and trailing whitespace is ignored.
ru: Проверяет, что полученное значение является десятичным. Пробелы до и после значения игнорируются.

source: Error message keys: ``required``, ``invalid``, ``max_value``, ``min_value``, ``max_digits``, ``max_decimal_places``, ``max_whole_digits``
ru: Ключи сообщений об ошибках: ``required``, ``invalid``, ``max_value``, ``min_value``, ``max_digits``, ``max_decimal_places``, ``max_whole_digits``.

source: The ``max_value`` and ``min_value`` error messages may contain ``%(limit_value)s``, which will be substituted by the appropriate limit. Similarly, the ``max_digits``, ``max_decimal_places`` and ``max_whole_digits`` error messages may contain ``%(max)s``.
ru: Сообщения об ошибках ``max_value`` и ``min_value`` могут содержать шаблон ``%(limit_value)s``, который будет заполнен соответствующим значением. Аналогично, сообщения об ошибках ``max_digits``, ``max_decimal_places`` и ``max_whole_digits`` могут содержать ``%(max)s``.

source: Takes four optional arguments:
ru: Принимает четыре необязательных аргумента:

source: These control the range of values permitted in the field, and should be given as ``decimal.Decimal`` values.
ru: Эти аргументы управляют диапазоном значений, разрешённых для ввода в поле, и должны быть заполнены значениями ``decimal.Decimal``.

source: The maximum number of digits (those before the decimal point plus those after the decimal point, with leading zeros stripped) permitted in the value.
ru: Максимальное число разрядов (до и после десятичной точки, впередистоящие нули обрезаются) разрешённых в значении.

source: The maximum number of decimal places permitted.
ru: Максимальное число разрешённых десятичных разрядов.

source: Normalizes to: A Python :class:`~python:datetime.timedelta`.
ru: Нормализует к :class:`~python:datetime.timedelta`.

source: Validates that the given value is a string which can be converted into a ``timedelta``.
ru: Проверяет, что полученное значение является строкой, которая может быть преобразована в ``timedelta``.

source: Error message keys: ``required``, ``invalid``.
ru: Ключи сообщений об ошибках: ``required``, ``invalid``.

source: Accepts any format understood by :func:`~django.utils.dateparse.parse_duration`.
ru: Принимает любой формат, который понимает :func:`~django.utils.dateparse.parse_duration`.

source: Default widget: :class:`EmailInput`
ru: Стандартный виджет: :class:`EmailInput`

source: Validates that the given value is a valid email address, using a moderately complex regular expression.
ru: Проверяет, что полученное значение является правильным адресом электронной почты, используя достаточно сложное регулярное выражение.

source: Has two optional arguments for validation, ``max_length`` and ``min_length``. If provided, these arguments ensure that the string is at most or at least the given length.
ru: Имеет два необязательных аргумента: ``max_length`` и ``min_length``. Если аргументы указаны, то они контролируют диапазон принимаемого значения.

source: Default widget: :class:`ClearableFileInput`
ru: Стандартный виджет: :class:`ClearableFileInput`

source: Normalizes to: An ``UploadedFile`` object that wraps the file content and file name into a single object.
ru: Возвращает: Объект ``UploadedFile``, который оборачивает содержимое файла и его имя в единый объект.

source: Can validate that non-empty file data has been bound to the form.
ru: Может проверять, что данные непустого файла были связаны с формой.

source: Error message keys: ``required``, ``invalid``, ``missing``, ``empty``, ``max_length``
ru: Ключи сообщений об ошибках: ``required``, ``invalid``, ``missing``, ``empty``, ``max_length``.

source: Has two optional arguments for validation, ``max_length`` and ``allow_empty_file``. If provided, these ensure that the file name is at most the given length, and that validation will succeed even if the file content is empty.
ru: Имеет два необязательных аргумента: ``max_length`` и ``allow_empty_file``. Если аргументы указаны, то первый ограничивает длину имени файла, а второй позволяет загружать даже пустые файлы.

source: To learn more about the ``UploadedFile`` object, see the :doc:`file uploads documentation </topics/http/file-uploads>`.
ru: Для получения подробностей об объекте ``UploadedFile`, см. :doc:`документацию по загрузке файлов </topics/http/file-uploads>`.

source: When you use a ``FileField`` in a form, you must also remember to :ref:`bind the file data to the form <binding-uploaded-files>`.
ru: При использовании ``FileField`` на форме, вы должны не забыть :ref:`связать данные файла с формой <binding-uploaded-files>`.

source: The ``max_length`` error refers to the length of the filename. In the error message for that key, ``%(max)d`` will be replaced with the maximum filename length and ``%(length)d`` will be replaced with the current filename length.
ru: Ошибка ``max_length`` относится к длине имени файла. В сообщении об ошибке шаблон ``%(max)d`` будет заменён максимальной длиной имени файла, а ``%(length)d`` -- длиной имени текущего файла.

source: Validates that the selected choice exists in the list of choices.
ru: Проверяет, что выбранное значение присутствует в списке вариантов.

source: The absolute path to the directory whose contents you want listed. This directory must exist.
ru: Абсолютный путь до каталога, содержимое которого вы желаете отобразить. Этот каталог должен существовать.

source: If ``False`` (the default) only the direct contents of ``path`` will be offered as choices. If ``True``, the directory will be descended into recursively and all descendants will be listed as choices.
ru: Если ``False`` (по умолчанию), то будет показано только содержимое каталога, указанного в ``path``. Если ``True``, то будет показано также и содержимое всех вложенных каталогов.

source: A regular expression pattern; only files with names matching this expression will be allowed as choices.
ru: Шаблон регулярного выражения. Отображаться будут только те файлы, которые подходят под указанное регулярное выражение.
