Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/ref/forms/models.po
Languages: ru

source: Model Form Functions
ru: Функции модельных форм

source: Model Form API reference. For introductory material about model forms, see the :doc:`/topics/forms/modelforms` topic guide.
ru: Описание API модельных форм. Полное руководство смотрите в разделе :doc:`/topics/forms/modelforms`.

source: Returns a :class:`~django.forms.ModelForm` class for the given ``model``. You can optionally pass a ``form`` argument to use as a starting point for constructing the ``ModelForm``.
ru: Возвращает класс :class:`~django.forms.ModelForm` для указанной ``model``. Вы можете опционально передавать аргумент ``form``, чтобы использовать форму в качестве стартовой точки при конструировании ``ModelForm``.

source: ``fields`` is an optional list of field names. If provided, only the named fields will be included in the returned fields.
ru: Аргумент ``fields`` является необязательным списком имён полей. Если он указан, то только перечисленные в нём поля будут созданы в модельной форме.

source: ``exclude`` is an optional list of field names. If provided, the named fields will be excluded from the returned fields, even if they are listed in the ``fields`` argument.
ru: Аргумент ``exclude`` является необязательным списком имён полей. Если он указан, то соответствующих полей не будет в созданной модельной форме, даже если они были указаны в аргументе ``fields``.

source: ``formfield_callback`` is a callable that takes a model field and returns a form field.
ru: Аргумент ``formfield_callback`` является обработчиком, который будет применять к полям модели и возвращать поля формы.

source: ``widgets`` is a dictionary of model field names mapped to a widget.
ru: Аргумент ``widgets`` является словарём с именами полей модели привязанных к виджетам.

source: ``localized_fields`` is a list of names of fields which should be localized.
ru: Аргумент ``localized_fields`` является списком имён полей, которые должны быть локализованы.

source: ``labels`` is a dictionary of model field names mapped to a label.
ru: Аргумент ``labels`` является словарём имён полей модели привязанных к меткам.

source: ``help_texts`` is a dictionary of model field names mapped to a help text.
ru: Аргумент ``help_texts`` является словарём имён полей модели привязанных к тексту подсказок.

source: ``error_messages`` is a dictionary of model field names mapped to a dictionary of error messages.
ru: Аргумент ``error_messages`` является словарём имён полей модели привязанных к словарю с сообщениями об ошибках.

source: ``field_classes`` is a dictionary of model field names mapped to a form field class.
ru: Аргумент ``field_classes`` является словарём имён полей модели привязанных к классам полей формы.

source: See :ref:`modelforms-factory` for example usage.
ru: Обратитесь к документации на :ref:`modelforms-factory` для примеров использования.

source: You must provide the list of fields explicitly, either via keyword arguments ``fields`` or ``exclude``, or the corresponding attributes on the form's inner ``Meta`` class. See :ref:`modelforms-selecting-fields` for more information. Omitting any definition of the fields to use will result in an :exc:`~django.core.exceptions.ImproperlyConfigured` exception.
ru: Вы должны явно определять список полей, через именованные аргументы ``fields`` или ``exclude``, или через соответствующие атрибуты внутреннего класса ``Meta`` формы. Обратитесь к документации на :ref:`modelforms-selecting-fields` для подробностей. Игнорирование определения используемых полей вызовет исключение :exc:`~django.core.exceptions.ImproperlyConfigured`.

source: Returns a ``FormSet`` class for the given ``model`` class.
ru: Возвращает класс ``FormSet`` для указанного класса ``model``.

source: Arguments ``model``, ``form``, ``fields``, ``exclude``, ``formfield_callback``, ``widgets``, ``localized_fields``, ``labels``, ``help_texts``, ``error_messages``, and ``field_classes`` are all passed through to :func:`~django.forms.models.modelform_factory`.
ru: Аргументы ``model``, ``form``, ``fields``, ``exclude``, ``formfield_callback``, ``widgets``, ``localized_fields``, ``labels``, ``help_texts``, ``error_messages`` и ``field_classes`` все проходят через функцию :func:`~django.forms.models.modelform_factory`.

source: See :ref:`model-formsets` for example usage.
ru: Обратитесь к документации на :ref:`model-formsets` для примеров использования.

source: Returns an ``InlineFormSet`` using :func:`modelformset_factory` with defaults of ``formset=``:class:`~django.forms.models.BaseInlineFormSet`, ``can_delete=True``, and ``extra=3``.
ru: Возвращает ``InlineFormSet``, используя функцию :func:`modelformset_factory` со стандартными ``formset=``:class:`~django.forms.models.BaseInlineFormSet`, ``can_delete=True`` и ``extra=3``.

source: If your model has more than one :class:`~django.db.models.ForeignKey` to the ``parent_model``, you must specify a ``fk_name``.
ru: Если ваша модель содержит больше одного внешнего ключа (:class:`~django.db.models.ForeignKey`) к родительской модели (``parent_model``), обязательно указывайте ``fk_name``.

source: See :ref:`inline-formsets` for example usage.
ru: Обратитесь к документации на :ref:`inline-formsets` для примеров использования.
