Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/ref/forms/validation.po
Languages: ru

source: Form and field validation
ru: Проверка форм и полей формы

source: Form validation happens when the data is cleaned. If you want to customize this process, there are various places to make changes, each one serving a different purpose. Three types of cleaning methods are run during form processing. These are normally executed when you call the ``is_valid()`` method on a form. There are other things that can also trigger cleaning and validation (accessing the ``errors`` attribute or calling ``full_clean()`` directly), but normally they won't be needed.
ru: Проверка формы происходит при нормализации её данных. При возникновении необходимости вмешаться в этот процесс, есть много мест, где можно это сделать и которые влияют на разные этапы проверки. Во время обработки формы вызываются три типа методов для нормализации данных. Процесс проверки запускается при вызове метода ``is_valid()`` формы. Существуют ситуации, которые запускают нормализацию и проверку данных (обращение к свойству ``errors`` или прямой вызов метода ``full_clean()``), но они возникают достаточно редко.

source: In general, any cleaning method can raise ``ValidationError`` if there is a problem with the data it is processing, passing the relevant information to the ``ValidationError`` constructor. :ref:`See below <raising-validation-error>` for the best practice in raising ``ValidationError``. If no ``ValidationError`` is raised, the method should return the cleaned (normalized) data as a Python object.
ru: В общем случае, любой нормализующий метод может вызвать исключение ``ValidationError`` при наличии проблем с данными, передавая соответствующее сообщение об ошибке в конструктор исключения. :ref:`Смотрите ниже <raising-validation-error>` примеры, как правильно вызывать ``ValidationError``. Если проблем не выявлено, то метод должен возвращать нормализованное значение в виде объекта языка Python.

source: Most validation can be done using `validators`_ - simple helpers that can be reused easily. Validators are simple functions (or callables) that take a single argument and raise ``ValidationError`` on invalid input. Validators are run after the field's ``to_python`` and ``validate`` methods have been called.
ru: Большая часть проверок может быть выполнена с помощью `validators`_, которые являются простыми в использовании вспомогательными объектами. Валидатор — это простая функция (или вызываемый объект, callable), которая принимает единственный аргумент и вызывает исключение ``ValidationError`` в случае проблем с полученным значением. Валидаторы запускаются после вызова методов поля: ``to_python`` и ``validate``.

source: Validation of a form is split into several steps, which can be customized or overridden:
ru: Проверка формы состоит из нескольких этапов, каждый из которых может быть настроен или переопределён:

source: The ``to_python()`` method on a ``Field`` is the first step in every validation. It coerces the value to a correct datatype and raises ``ValidationError`` if that is not possible. This method accepts the raw value from the widget and returns the converted value. For example, a ``FloatField`` will turn the data into a Python ``float`` or raise a ``ValidationError``.
ru: Вызов метода поля ``to_python()`` является первым этапом каждой проверки. Он приводит значение к соответствующему типу данных или вызывает исключение ``ValidationError``, если это невозможно. Метод принимает сырое значение от виджета и возвращает нормализованное значение. Например, поле типа ``FloatField`` преобразовывает данные в тип ``float`` языка Python или вызывает исключение ``ValidationError``.

source: The ``validate()`` method on a ``Field`` handles field-specific validation that is not suitable for a validator. It takes a value that has been coerced to a correct datatype and raises ``ValidationError`` on any error. This method does not return anything and shouldn't alter the value. You should override it to handle validation logic that you can't or don't want to put in a validator.
ru: Метод ``validate()`` поля выполняет специфическую для поля проверку данных и приводит значение к правильному типу данных, или вызывает исключение ``ValidationError`` на любую ошибку. Этот метод не возвращает значение и не должен изменять проверяемые данные. Если вам надо обеспечить логику, которую невозможно или нежелательно выносить в валидатор, то вам следует переопределить этот метод.

source: The ``run_validators()`` method on a ``Field`` runs all of the field's validators and aggregates all the errors into a single ``ValidationError``. You shouldn't need to override this method.
ru: Метод поля ``run_validators()`` запускает все валидаторы и аккумулирует все возникающие ошибки в одно исключение ``ValidationError``. Вам не стоит переопределять этот метод.

source: The ``clean()`` method on a ``Field`` subclass is responsible for running ``to_python()``, ``validate()``, and ``run_validators()`` in the correct order and propagating their errors. If, at any time, any of the methods raise ``ValidationError``, the validation stops and that error is raised. This method returns the clean data, which is then inserted into the ``cleaned_data`` dictionary of the form.
ru: Метод ``clean()`` поля отвечает за вызов методов ``to_python()``, ``validate()`` и ``run_validators()`` в правильном порядке и передачу их ошибок. Как только любой из этих методов вызовет исключение ``ValidationError``, процесс проверки прекращается и ошибка передаётся выше. Этот метод возвращает проверенные данные, которые затем помещаются в словарь ``cleaned_data`` формы.

source: The ``clean_<fieldname>()`` method is called on a form subclass -- where ``<fieldname>`` is replaced with the name of the form field attribute. This method does any cleaning that is specific to that particular attribute, unrelated to the type of field that it is. This method is not passed any parameters. You will need to look up the value of the field in ``self.cleaned_data`` and remember that it will be a Python object at this point, not the original string submitted in the form (it will be in ``cleaned_data`` because the general field ``clean()`` method, above, has already cleaned the data once).
ru: Для проверки значения поля используется метод ``clean_<fieldname>()``, где ``<fieldname>`` заменяется на имя поля. Этот метод выполняет проверку значения. Метод не принимает аргументы. Для получения значения поля обращайтесь к словарю ``self.cleaned_data`` и помните, что там будет объект языка Python, а не строка, переданная формой (значение находится в ``cleaned_data`` т.к. уже была выполнена проверка методом ``clean()`` поля).

source: For example, if you wanted to validate that the contents of a ``CharField`` called ``serialnumber`` was unique, ``clean_serialnumber()`` would be the right place to do this. You don't need a specific field (it's just a ``CharField``), but you want a formfield-specific piece of validation and, possibly, cleaning/normalizing the data.
ru: Например, если требуется проверить, что содержимое ``CharField`` поля с именем ``serialnumber`` является уникальным, то метод ``clean_serialnumber()`` будет правильным местом для такого функционала. Вам не нужно специальное поле (пусть будет ``CharField``), но требуется хитрая проверка данных и, возможно, очистка/нормализация данных.

source: Since the field validation methods have been run by the time ``clean()`` is called, you also have access to the form's ``errors`` attribute which contains all the errors raised by cleaning of individual fields.
ru: Так как валидация полей выполняется перед вызовом ``clean()``, вы можете получить доступ к атрибуту формы ``errors``, который содержит уже полученные ошибки валидации.

source: Note that any errors raised by your :meth:`Form.clean()` override will not be associated with any field in particular. They go into a special "field" (called ``__all__``), which you can access via the :meth:`~django.forms.Form.non_field_errors` method if you need to. If you want to attach errors to a specific field in the form, you need to call :meth:`~django.forms.Form.add_error()`.
ru: Следует отметить, что любая ошибка, вызванная методом :meth:`Form.clean()` формы, не будет ассоциирована ни с каким полем. Такие ошибки привязываются к «особому» полю (``__all__``), доступ к которому можно получить через метод :meth:`~django.forms.Form.non_field_errors`. Если вам потребуется добавить ошибки к определённому полю формы, используйте :meth:`~django.forms.Form.add_error()`.

source: Also note that there are special considerations when overriding the ``clean()`` method of a ``ModelForm`` subclass. (see the :ref:`ModelForm documentation <overriding-modelform-clean-method>` for more information)
ru: Также следует отметить, что существует ряд соглашений, которым необходимо следовать при переопределении метода ``clean()`` в вашем классе ``ModelForm``. (Обратитесь к :ref:`документации на ModelForm <overriding-modelform-clean-method>` для получения подробностей.)

source: These methods are run in the order given above, one field at a time. That is, for each field in the form (in the order they are declared in the form definition), the ``Field.clean()`` method (or its override) is run, then ``clean_<fieldname>()``. Finally, once those two methods are run for every field, the :meth:`Form.clean()` method, or its override, is executed whether or not the previous methods have raised errors.
ru: Эти методы вызываются в порядке, указанном выше, по одному полю за раз. Для каждого поля формы (в порядке их определения в классе формы) вызывается сначала метод ``Field.clean()``, затем вызывается метод ``clean_<fieldname>()``. После того, как пара этих методов будет вызвана для каждого поля формы, наступает очередь метода :meth:`Form.clean()` формы. Он будет вызыван в любом случае, даже если предыдущие методы вызывали ошибку.

source: Examples of each of these methods are provided below.
ru: Примеры для каждого из этих методов показаны ниже.

source: As mentioned, any of these methods can raise a ``ValidationError``. For any field, if the ``Field.clean()`` method raises a ``ValidationError``, any field-specific cleaning method is not called. However, the cleaning methods for all remaining fields are still executed.
ru: Как упоминалось ранее, любой из этих методов может вызвать исключение ``ValidationError``. Для любого поля, если его метод ``clean()`` вызвал исключение ``ValidationError``, то следующий метод для этого поля не вызывается. Тем не менее, методы для остальных полей отрабатывают в штатном режиме.

source: Raising ``ValidationError``
ru: Вызов ``ValidationError``

source: In order to make error messages flexible and easy to override, consider the following guidelines:
ru: Для удобной работы с ошибками валидации используйте следующие правила:

source: Provide a descriptive error ``code`` to the constructor::
ru: Передайте при создании код ошибки через аргумент ``code``::

source: Don't coerce variables into the message; use placeholders and the ``params`` argument of the constructor::
ru: Переменные лучше передавать в аргументе ``params``, а в сообщении указать места для подстановки::

source: Use mapping keys instead of positional formatting. This enables putting the variables in any order or omitting them altogether when rewriting the message::
ru: Используйте именованные параметры в сообщении. Это позволит использовать переменные в любом параметре при переопределении сообщения::

source: Wrap the message with ``gettext`` to enable translation::
ru: Оберните сообщения в ``gettext`` для последующего перевода::

source: Putting it all together::
ru: Все вместе::

source: Following these guidelines is particularly necessary if you write reusable forms, form fields, and model fields.
ru: Соблюдать правила очень важно при создании переносимых форм, полей форм и моделей.

source: While not recommended, if you are at the end of the validation chain (i.e. your form ``clean()`` method) and you know you will *never* need to override your error message you can still opt for the less verbose::
ru: Не рекомендуется, но если вы в конце цепочки валидации(например, метод ``clean()`` формы) и никогда не будете переопределять сообщение, можно просто сделать::

source: The :meth:`Form.errors.as_data() <django.forms.Form.errors.as_data()>` and :meth:`Form.errors.as_json() <django.forms.Form.errors.as_json()>` methods greatly benefit from fully featured ``ValidationError``\s (with a ``code`` name and a ``params`` dictionary).
ru: Методы :meth:`Form.errors.as_data() <django.forms.Form.errors.as_data()>` и :meth:`Form.errors.as_json() <django.forms.Form.errors.as_json()>` используют все возможности ``ValidationError`` (включая ``code`` и ``params``).

source: Raising multiple errors
ru: Вызов нескольких ошибок

source: If you detect multiple errors during a cleaning method and wish to signal all of them to the form submitter, it is possible to pass a list of errors to the ``ValidationError`` constructor.
ru: При обнаружении нескольких ошибок в процессе нормализации поля и при наличии желания отобразить их одновременно на форме, следует передать их в виде списка в конструктор исключения.

source: As above, it is recommended to pass a list of ``ValidationError`` instances with ``code``\s and ``params`` but a list of strings will also work::
ru: Рекомендуется использовать список объектов ``ValidationError`` с ``code`` и ``params``, но можно использовать просто список строк::

source: Using validation in practice
ru: Использование проверки на практике

source: The previous sections explained how validation works in general for forms. Since it can sometimes be easier to put things into place by seeing each feature in use, here are a series of small examples that use each of the previous features.
ru: Выше мы рассмотрели как осуществляется проверка форм в целом. Так как временами бывает проще разобраться с функционалом, просмотрев его в действии, далее показан ряд небольших примеров, которые используют описанные возможности.

source: Using validators
ru: Использование валидаторов

source: Django's form (and model) fields support use of simple utility functions and classes known as validators. A validator is merely a callable object or function that takes a value and simply returns nothing if the value is valid or raises a :exc:`~django.core.exceptions.ValidationError` if not. These can be passed to a field's constructor, via the field's ``validators`` argument, or defined on the :class:`~django.forms.Field` class itself with the ``default_validators`` attribute.
ru: Поля форм (и моделей) Django поддерживают использование простых функций и классов, которые известны как валидаторы. Это просто функция, которая принимает значение и ничего не возвращает, если значение верно, иначе вызывает :exc:`~django.core.exceptions.ValidationError`. Они могут быть переданы в конструктор поля через аргумент ``validators`` или определены в самом классе поля :class:`~django.forms.Field` с помощью атрибута ``default_validators``.

source: Simple validators can be used to validate values inside the field, let's have a look at Django's ``SlugField``::
ru: Простые валидаторы могут использоваться для проверки значений внутри полей. Давайте рассмотрим ``SlugField``::

source: As you can see, ``SlugField`` is just a ``CharField`` with a customized validator that validates that submitted text obeys to some character rules. This can also be done on field definition so::
ru: Как можно увидеть ``SlugField`` — это обычное поле ``CharField``, которое имеет валидатор, проверяющий вводимое значение на допустимые символы. Все это можно указать при определении поля::

source: is equivalent to::
ru: эквивалентно::

source: Common cases such as validating against an email or a regular expression can be handled using existing validator classes available in Django. For example, ``validators.validate_slug`` is an instance of a :class:`~django.core.validators.RegexValidator` constructed with the first argument being the pattern: ``^[-a-zA-Z0-9_]+$``. See the section on :doc:`writing validators </ref/validators>` to see a list of what is already available and for an example of how to write a validator.
ru: Обычные проверки, такие как проверка email или по регулярному выражению, можно выполнить используя существующие валидаторы Django. Например, ``validators.validate_slug`` экземпляр :class:`~django.core.validators.RegexValidator` с первым аргументом равным ``^[-a-zA-Z0-9_]+$``. Подробности смотрите в разделе о :doc:`создании валидаторов </ref/validators>`.

source: Form field default cleaning
ru: Встроенная проверка поля формы

source: Let's first create a custom form field that validates its input is a string containing comma-separated email addresses. The full class looks like this::
ru: Давайте сначала создадим собственное поле формы, которое проверяет, что переданные ему данные — это строка, содержащая адреса электронной почты, разделенные запятыми. Класс такого поля будет выглядеть следующим образом::

source: Every form that uses this field will have these methods run before anything else can be done with the field's data. This is cleaning that is specific to this type of field, regardless of how it is subsequently used.
ru: Каждая форма, использующая такое поле, будет вызывать эти методы до выполнения всех остальных действий с данными поля. Такая проверка привязана к этому типу поля и не зависит от дальнейшего его использования.

source: Let's create a simple ``ContactForm`` to demonstrate how you'd use this field::
ru: Давайте создадим простую форму ``ContactForm``, чтобы показать как можно использовать это поле::

source: Simply use ``MultiEmailField`` like any other form field. When the ``is_valid()`` method is called on the form, the ``MultiEmailField.clean()`` method will be run as part of the cleaning process and it will, in turn, call the custom ``to_python()`` and ``validate()`` methods.
ru: Просто используем ``MultiEmailField`` как и любое другое поле. При вызове метода формы ``is_valid()`` происходит вызов метода ``MultiEmailField.clean()``, который в свою очередь вызовет собственные методы ``to_python()`` и ``validate()``.

source: Cleaning a specific field attribute
ru: Проверка атрибута определённого поля

source: Continuing on from the previous example, suppose that in our ``ContactForm``, we want to make sure that the ``recipients`` field always contains the address ``"fred@example.com"``. This is validation that is specific to our form, so we don't want to put it into the general ``MultiEmailField`` class. Instead, we write a cleaning method that operates on the ``recipients`` field, like so::
ru: Продолжая работать над нашим примером, предположим, что на форме ``ContactForm`` поле электронной почты ``recipients`` всегда должно содержать адрес ``"fred@example.com"``. Эта проверка будет особенностью нашей формы, следовательно, нам не надо её помещать в класс ``MultiEmailField``. Вместо этого мы напишем метод, который будет проверять поле ``recipients``::

source: Cleaning and validating fields that depend on each other
ru: Очистка и проверка полей, которые зависят друг от друга

source: Suppose we add another requirement to our contact form: if the ``cc_myself`` field is ``True``, the ``subject`` must contain the word ``"help"``. We are performing validation on more than one field at a time, so the form's :meth:`~Form.clean()` method is a good spot to do this. Notice that we are talking about the ``clean()`` method on the form here, whereas earlier we were writing a ``clean()`` method on a field. It's important to keep the field and form difference clear when working out where to validate things. Fields are single data points, forms are a collection of fields.
ru: Допустим, что мы добавили ещё одно требование для нашей формы: если поле ``cc_myself`` равно ``True``, то поле ``subject`` должно содержать слово ``"help"``. Раз мы выполняем проверку нескольких полей, то метод формы :meth:`~Form.clean()` будет правильным местом для нашего кода. Обратите внимание, мы сейчас говорим о методе ``clean()`` формы, а раньше говорили о методе ``clean()`` поля. Важно понимать разницу между ними при реализации алгоритма проверки данных. Поля содержат один источник данных, а формы — это коллекции полей.

source: By the time the form's ``clean()`` method is called, all the individual field clean methods will have been run (the previous two sections), so ``self.cleaned_data`` will be populated with any data that has survived so far. So you also need to remember to allow for the fact that the fields you are wanting to validate might not have survived the initial individual field checks.
ru: К моменту вызова метода формы ``clean()`` все ``clean()`` методы полей уже отработали. Таким образом, свойство формы ``self.cleaned_data`` будет заполнено данными, прошедшими проверку. Следовательно, надо принять во внимание возможность того, что данные некоторых полей не прошли начальную поверку.

source: There are two ways to report any errors from this step. Probably the most common method is to display the error at the top of the form. To create such an error, you can raise a ``ValidationError`` from the ``clean()`` method. For example::
ru: Существует два способа сообщить об ошибках на этом этапе. Обычно ошибку отображают сверху формы. Для этого достаточно вызвать исключение ``ValidationError`` в методе формы ``clean()``. Например::

source: In this code, if the validation error is raised, the form will display an error message at the top of the form (normally) describing the problem.
ru: В данном коде, при возникновении ошибки во время проверки данных, форма отобразит сообщение об ошибке сверху (обычное поведение), описывая проблему.

source: The second approach for reporting validation errors might involve assigning the error message to one of the fields. In this case, let's assign an error message to both the "subject" and "cc_myself" rows in the form display. Be careful when doing this in practice, since it can lead to confusing form output. We're showing what is possible here and leaving it up to you and your designers to work out what works effectively in your particular situation. Our new code (replacing the previous sample) looks like this::
ru: Второй способ подразумевает назначение ошибки одному из полей. В нашем случае, давайте назначим сообщение об ошибке обоим полям («subject» и «cc_myself») при отображении формы. Использовать этот способ надо аккуратно, так как он может запутать пользователя. Мы лишь показываем возможные варианты, оставляя решение конкретной задачи вам и вашим дизайнерам. Наш новый код (заменяющий предыдущий пример) выглядит так::

source: The second argument of ``add_error()`` can be a simple string, or preferably an instance of ``ValidationError``. See :ref:`raising-validation-error` for more details. Note that ``add_error()`` automatically removes the field from ``cleaned_data``.
ru: Вторым аргументом ``add_error()`` может быть просто строка, но лучше объект ``ValidationError``. Подробности смотрите в :ref:`raising-validation-error`. Обратите внимание, ``add_error()`` автоматически убирает поле из ``cleaned_data``.
