Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/ref/forms/widgets.po
Languages: ru

source: Takes same arguments as :class:`TextInput`, with one more optional argument:
ru: Принимает аргументы, аналогичные :class:`TextInput`, лишь с одним необязательным аргументом:

source: The format in which this field's initial value will be displayed.
ru: Формат, в котором отображается начальное значение поля.

source: Date/time input as a simple text box: ``<input type='text' ...>``
ru: Ввод даты/времени в простое текстовое поле: ``<input type='text' ...>``

source: By default, the microseconds part of the time value is always set to ``0``. If microseconds are required, use a subclass with the :attr:`~Widget.supports_microseconds` attribute set to ``True``.
ru: По умолчанию микросекунды значения всегда устанавливаются в ``0``. Если микросекунды необходимы, наследуйтесь от этого класса и установите атрибут :attr:`~Widget.supports_microseconds` в ``True``.

source: Time input as a simple text box: ``<input type='text' ...>``
ru: Ввод времени в простое текстовое поле: ``<input type='text' ...>``

source: For the treatment of microseconds, see :class:`DateTimeInput`.
ru: Подробности об обработке микросекунд смотрите в описании :class:`DateTimeInput`.

source: Text area: ``<textarea>...</textarea>``
ru: Текстовая область: ``<textarea>...</textarea>``

source: Selector and checkbox widgets
ru: Виджеты выбора и отметки

source: Checkbox: ``<input type='checkbox' ...>``
ru: Чекбокс: ``<input type='checkbox' ...>``

source: A callable that takes the value of the ``CheckboxInput`` and returns ``True`` if the checkbox should be checked for that value.
ru: Функция, которая принимает значение ``CheckboxInput`` и возвращает ``True``, если указанное значение было отмечено на элементе.

source: Select widget: ``<select><option ...>...</select>``
ru: Виджет выбора: ``<select><option ...>...</select>``

source: This attribute is optional when the form field does not have a ``choices`` attribute. If it does, it will override anything you set here when the attribute is updated on the :class:`Field`.
ru: Этот атрибут является необязательным, если поле не имеет атрибут ``choices``. В противном случае, его содержимое имеет преимущество над атрибутами :class:`Field`.

source: Select widget with options 'Unknown', 'Yes' and 'No'
ru: Виджет выбора с вариантами 'Неизвестно', 'Да' и 'Нет'.

source: Similar to :class:`Select`, but allows multiple selection: ``<select multiple='multiple'>...</select>``
ru: Аналогично :class:`Select`, но разрешён множественный выбор: ``<select multiple='multiple'>...</select>``.

source: Similar to :class:`Select`, but rendered as a list of radio buttons within ``<li>`` tags:
ru: Аналогично :class:`Select`, но отображается в виде списка радио кнопок с помощью тегов ``<li>``:

source: For more granular control over the generated markup, you can loop over the radio buttons in the template. Assuming a form ``myform`` with a field ``beatles`` that uses a ``RadioSelect`` as its widget:
ru: Для более тонкого управления процессом генерации HTML кода, вы можете выводить радио кнопки в шаблон в цикле. Рассмотрим форму ``myform`` с полем ``beatles``, которое использует ``RadioSelect`` в качестве виджета:

source: This would generate the following HTML:
ru: Она будет представлена в виде следующего HTML кода:

source: That included the ``<label>`` tags. To get more granular, you can use each radio button's ``tag``, ``choice_label`` and ``id_for_label`` attributes. For example, this template...
ru: Код содержит теги ``<label>``. Также вы можете использовать атрибуты ``tag``, ``choice_label`` и ``id_for_label`` для управления отображением каждой радио кнопки. Например, этот шаблон...

source: ...will result in the following HTML:
ru: ... преобразуется в следующий HTML:

source: If you decide not to loop over the radio buttons -- e.g., if your template simply includes ``{{ myform.beatles }}`` -- they'll be output in a ``<ul>`` with ``<li>`` tags, as above.
ru: Если вы просто выведите поле в шаблоне с помощью ``{{ myform.beatles }}``, то кнопки будут выведены с помощью тега ``<ul>`` с ``<li>``, как было показано ранее.

source: When looping over the radio buttons, the ``label`` and ``input`` tags include ``for`` and ``id`` attributes, respectively. Each radio button has an ``id_for_label`` attribute to output the element's ID.
ru: При генерации радио кнопок теги ``label`` and ``input`` содержат атрибуты ``for`` и ``id`` соответственно. Каждая радио кнопка использует атрибут ``id_for_label`` для генерации ID элемента.

source: Similar to :class:`SelectMultiple`, but rendered as a list of check buttons:
ru: Аналогичен :class:`SelectMultiple`, но отображается в виде списка чекбоксов.

source: When looping over the checkboxes, the ``label`` and ``input`` tags include ``for`` and ``id`` attributes, respectively. Each checkbox has an ``id_for_label`` attribute to output the element's ID.
ru: При генерации чекбоксов теги ``label`` and ``input`` содержат атрибуты ``for`` и ``id`` соответственно. Каждый чекбокс использует атрибут ``id_for_label`` для генерации ID элемента.

source: File upload widgets
ru: Виджеты для загрузки файлов

source: File upload input: ``<input type='file' ...>``
ru: Загрузка файла: ``<input type='file' ...>``

source: File upload input: ``<input type='file' ...>``, with an additional checkbox input to clear the field's value, if the field is not required and has initial data.
ru: Загрузка файла: ``<input type='file' ...>``, с дополнительным чекбоксом для очистки значения поля, если оно не является обязательным и имеет начальные данные.

source: Composite widgets
ru: Сложные виджеты

source: Multiple ``<input type='hidden' ...>`` widgets.
ru: Множество виджетов``<input type='hidden' ...>``.

source: A widget that handles multiple hidden widgets for fields that have a list of values.
ru: Виджет, который обрабатывает множество скрытых виджетов для полей, которые содержат список значений.

source: ``SplitDateTimeWidget`` has two optional attributes:
ru: ``SplitDateTimeWidget`` имеет два необязательных атрибута:

source: Similar to :attr:`DateInput.format`
ru: Аналогичен :attr:`DateInput.format`.

source: Similar to :attr:`TimeInput.format`
ru: Аналогичен :attr:`TimeInput.format`.

source: Similar to :class:`SplitDateTimeWidget`, but uses :class:`HiddenInput` for both date and time.
ru: Аналогичен :class:`SplitDateTimeWidget`, но используется :class:`HiddenInput` для даты и времени.

source: Wrapper around three :class:`~django.forms.Select` widgets: one each for month, day, and year.
ru: Обёртка вокруг трёх виджетов :class:`~django.forms.Select` -- месяц, день и год.

source: Takes several optional arguments:
ru: Принимает несколько необязательных аргументов:

source: An optional list/tuple of years to use in the "year" select box. The default is a list containing the current year and the next 9 years.
ru: Необязательный список/кортеж с вариантами года. По умолчанию содержит текущий год и девять последующих.

source: An optional dict of months to use in the "months" select box.
ru: Необязательный словарь списка месяцев.

source: The keys of the dict correspond to the month number (1-indexed) and the values are the displayed months::
ru: Ключ словаря соответствует номеру месяца (начиная с 1), значения -- отображаемое название::

source: If the :class:`~django.forms.DateField` is not required, :class:`SelectDateWidget` will have an empty choice at the top of the list (which is ``---`` by default). You can change the text of this label with the ``empty_label`` attribute. ``empty_label`` can be a ``string``, ``list``, or ``tuple``. When a string is used, all select boxes will each have an empty choice with this label. If ``empty_label`` is a ``list`` or ``tuple`` of 3 string elements, the select boxes will have their own custom label. The labels should be in this order ``('year_label', 'month_label', 'day_label')``.
ru: Если поле :class:`~django.forms.DateField` не обязательно, :class:`SelectDateWidget` будет содержать пустое значение в начале списка (по умолчанию ``---``). Вы можете поменять название элемента с помощью атрибута ``empty_label``. ``empty_label`` принимает ``string``, ``list``, или ``tuple``. Если указана строка, каждый ``<select>`` будет содержать пустое значение. Если ``empty_label`` содержит ``list`` или ``tuple`` из 3-х строк -- для каждого ``<select>`` будет использоваться свое значение. Элементы используются в следующем порядке: ``('year_label', 'month_label', 'day_label')``.

source: This widget used to be located in the ``django.forms.extras.widgets`` package. It is now defined in ``django.forms.widgets`` and like the other widgets it can be imported directly from ``django.forms``.
ru: Этот виджет раньше находился в пакете ``django.forms.extras.widgets``. Теперь находится в ``django.forms.widgets`` и, как и другие виджеты, может быть импортирован из ``django.forms``.
