Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/ref/forms/widgets.po
Languages: ru

source: Widgets
ru: Виджеты

source: A widget is Django's representation of an HTML input element. The widget handles the rendering of the HTML, and the extraction of data from a GET/POST dictionary that corresponds to the widget.
ru: Виджет -- это представление поля в виде HTML кода. Виджеты обеспечивают генерацию HTML и извлечение соответствующих данных из GET/POST запросов.

source: Widgets should not be confused with the :doc:`form fields </ref/forms/fields>`. Form fields deal with the logic of input validation and are used directly in templates. Widgets deal with rendering of HTML form input elements on the web page and extraction of raw submitted data. However, widgets do need to be :ref:`assigned <widget-to-field>` to form fields.
ru: Не следует путать виджеты с :doc:`полями формы </ref/forms/fields>`. Поля формы обеспечивают логику проверки вводимой информации и используются в шаблонах. Виджеты же отвечают за рендеринг форм на веб-странице и обработку переданных данных. Тем не менее, виджеты следует :ref:`назначать <widget-to-field>` на поля формы.

source: Specifying widgets
ru: Назначение виджета

source: Whenever you specify a field on a form, Django will use a default widget that is appropriate to the type of data that is to be displayed. To find which widget is used on which field, see the documentation about :ref:`built-in-fields`.
ru: При добавлении поля на форму, Django использует стандартный виджет, наиболее подходящий к отображаемому типу данных. Для того, чтобы узнать какой виджет использует интересующий вас тип поля обратитесь к :ref:`built-in fields`.

source: However, if you want to use a different widget for a field, you can just use the :attr:`~Field.widget` argument on the field definition. For example::
ru: Тем не менее, если потребуется указать другой виджет для поля, просто используйте аргумент :attr:`~Field.widget` при определении поля. Например::

source: This would specify a form with a comment that uses a larger :class:`Textarea` widget, rather than the default :class:`TextInput` widget.
ru: Этот код создают форму, у которой полю комментария назначен виджет class:`Textarea` вместо стандартного :class:`TextInput` widget.

source: Setting arguments for widgets
ru: Аргументы виджетов

source: Many widgets have optional extra arguments; they can be set when defining the widget on the field. In the following example, the :attr:`~django.forms.SelectDateWidget.years` attribute is set for a :class:`~django.forms.SelectDateWidget`::
ru: Большинство виджетов принимают дополнительные аргументы. Они могут быть назначены при определении виджета для поля. В следующем примере атрибут :attr:`~django.forms.SelectDateWidget.years` передаётся в :class:`~django.forms.SelectDateWidget`::

source: See the :ref:`built-in widgets` for more information about which widgets are available and which arguments they accept.
ru: Обратитесь к :ref:`built-in widgets` для получения подробной информации о доступных виджетах и аргументах, которые они принимают.

source: Widgets inheriting from the :class:`Select` widget deal with choices. They present the user with a list of options to choose from. The different widgets present this choice differently; the :class:`Select` widget itself uses a ``<select>`` HTML list representation, while :class:`RadioSelect` uses radio buttons.
ru: Виджеты, унаследованные от виджета :class:`Select`, предназначены для работы с вариантами. Они предоставляют список вариантов, из которых надо сделать выбор. Разные виджеты позволяют сделать выбор по-разному. Базовый виджет :class:`Select` использует HTML тег ``<select>``, а унаследованный виджет :class:`RadioSelect` использует радио кнопки.

source: :class:`Select` widgets are used by default on :class:`ChoiceField` fields. The choices displayed on the widget are inherited from the :class:`ChoiceField` and changing :attr:`ChoiceField.choices` will update :attr:`Select.choices`. For example::
ru: Виджеты типа :class:`Select` по умолчанию используют поля :class:`ChoiceField`. Варианты, отображаемые виджетом, наследуются от :class:`ChoiceField` и изменение :attr:`ChoiceField.choices` повлияет на :attr:`Select.choices`. Например::

source: Widgets which offer a :attr:`~Select.choices` attribute can however be used with fields which are not based on choice -- such as a :class:`CharField` -- but it is recommended to use a :class:`ChoiceField`-based field when the choices are inherent to the model and not just the representational widget.
ru: Виджеты, поддерживающие атрибут :attr:`~Select.choices` могут, тем не менее, использоваться совместно с полями, которые не основаны на выборе, -- такими как :class:`CharField` -- но рекомендуется использовать поля типа :class:`ChoiceField` в случаях, когда варианты берутся из модели.

source: Customizing widget instances
ru: Настройка экземпляров виджета

source: When Django renders a widget as HTML, it only renders very minimal markup - Django doesn't add class names, or any other widget-specific attributes. This means, for example, that all :class:`TextInput` widgets will appear the same on your Web pages.
ru: При отображении виджета на странице сайта, Django генерирует минимальный HTML код, который не включает в себя указание классов или других специфических атрибутов виджета. Это означает, что все виджеты типа :class:`TextInput` будут отображаться на странице однообразно.

source: There are two ways to customize widgets: :ref:`per widget instance <styling-widget-instances>` and :ref:`per widget class <styling-widget-classes>`.
ru: Существует два способа настройки виджета: :ref:`на уровне экземпляра виджет <styling-widget-instances>` и :ref:`на уровне класса виджета <styling-widget-classes>`.

source: Styling widget instances
ru: Настройка экземпляров виджета

source: If you want to make one widget instance look different from another, you will need to specify additional attributes at the time when the widget object is instantiated and assigned to a form field (and perhaps add some rules to your CSS files).
ru: Если требуется визуально выделить один виджет от других, потребуется во время его создания указать для него дополнительные атрибуты и назначить его на поле формы (и возможно, добавить несколько правил в ваши CSS файлы).

source: For example, take the following simple form::
ru: Например, рассмотрим следующую простую форму::

source: This form will include three default :class:`TextInput` widgets, with default rendering -- no CSS class, no extra attributes. This means that the input boxes provided for each widget will be rendered exactly the same::
ru: Эта форма включает в себя три обычных виджета :class:`TextInput`, которым не назначены ни CSS класс, ни дополнительные атрибуты. Это означает, что визуально они будут выглядеть одинаково::

source: On a real Web page, you probably don't want every widget to look the same. You might want a larger input element for the comment, and you might want the 'name' widget to have some special CSS class. It is also possible to specify the 'type' attribute to take advantage of the new HTML5 input types. To do this, you use the :attr:`Widget.attrs` argument when creating the widget::
ru: На реальной странице сайта, возможно, вам понадобится разнообразить их отображение. Вам может потребоваться сделать поле для ввода комментария побольше или назначить имя виджету, чтобы он начал реагировать на особый CSS класс. Также возможно указать атрибут 'type' для поддержки типов HTML5. Для этого надо использовать аргумент :attr:`Widget.attrs` при создании виджета::

source: Django will then include the extra attributes in the rendered output:
ru: Django добавит дополнительные атрибуты в генерируемый HTML код:

source: You can also set the HTML ``id`` using :attr:`~Widget.attrs`. See :attr:`BoundField.id_for_label` for an example.
ru: Вы также можете указать HTML ``id`` используя :attr:`~Widget.attrs`. Смотрите :attr:`BoundField.id_for_label`.

source: Styling widget classes
ru: Настройка классов виджета

source: With widgets, it is possible to add assets (``css`` and ``javascript``) and more deeply customize their appearance and behavior.
ru: Для виджетов можно добавлять медиа файлы (``css`` и ``javascript``) для более глубокой настройки их внешнего вида и поведения.

source: In a nutshell, you will need to subclass the widget and either :ref:`define a "Media" inner class <assets-as-a-static-definition>` or :ref:`create a "media" property <dynamic-property>`.
ru: Вкратце, вам потребуется унаследовать виджет и либо :ref:`определить класс "Media" <assets-as-a-static-definition>`, либо :ref:`создать свойство "media" <dynamic-property>`, возвращающее экземпляр этого класса.

source: These methods involve somewhat advanced Python programming and are described in detail in the :doc:`Form Assets </topics/forms/media>` topic guide.
ru: Эти методы требуют некоторого объёма продвинутого кода и подробно описаны в руководстве по :doc:`ресурсам форм </topics/forms/media>`.

source: Base widget classes :class:`Widget` and :class:`MultiWidget` are subclassed by all the :ref:`built-in widgets <built-in widgets>` and may serve as a foundation for custom widgets.
ru: Основные классы виджетов :class:`Widget` и :class:`MultiWidget` унаследованы всеми :ref:`встроенными виджетами <built-in widgets>` и могут являться основой для ваших собственных виджетов.

source: This abstract class cannot be rendered, but provides the basic attribute :attr:`~Widget.attrs`. You may also implement or override the :meth:`~Widget.render()` method on custom widgets.
ru: Абстрактный класс не может быть использован для отображения поля, но он предоставляет основной атрибут :attr:`~Widget.attrs`. Вы также можете реализовать или переопределить метод :meth:`~Widget.render()` в своём виджете.

source: A dictionary containing HTML attributes to be set on the rendered widget.
ru: Словарь, которые содержит HTML атрибуты, которые будут назначены сгенерированному виджету.

source: If you assign a value of ``True`` or ``False`` to an attribute, it will be rendered as an HTML5 boolean attribute::
ru: Если вы укажите ``True`` или ``False`` атрибуту, он будет отрендерен как HTML5 булев атрибут::

source: An attribute that defaults to ``True``. If set to ``False``, the microseconds part of :class:`~datetime.datetime` and :class:`~datetime.time` values will be set to ``0``.
ru: Атрибут по умолчанию равен ``True``. При ``False`` микросекунды объекта :class:`~datetime.datetime` и :class:`~datetime.time` будут сброшены в ``0``.

source: In older versions, this attribute was only defined on the date and time widgets (as ``False``).
ru: В предыдущих версиях этот атрибут был доступен только для виджетов даты и времени (по умолчанию ``False``).

source: Returns the HTML ID attribute of this widget for use by a ``<label>``, given the ID of the field. Returns ``None`` if an ID isn't available.
ru: Возвращает HTML ID атрибут виджета, который можно использовать для ``<label>``, принимая ID поля. Возвращает ``None``, если ID не доступен.

source: This hook is necessary because some widgets have multiple HTML elements and, thus, multiple IDs. In that case, this method should return an ID value that corresponds to the first ID in the widget's tags.
ru: Этот метод необходим т.к. некоторые виджеты состоят из нескольких HTML элеентов с разными ID. В этом случает метод должен вернуть ID первого тега виджета.

source: Returns HTML for the widget, as a Unicode string. This method must be implemented by the subclass, otherwise ``NotImplementedError`` will be raised.
ru: Возвращает HTML для виджета в виде строки Unicode. Этот метод должен быть реализован в дочерних классах. В противном случае будет выброшено исключение ``NotImplementedError``.

source: The 'value' given is not guaranteed to be valid input, therefore subclass implementations should program defensively.
ru: Никто не гарантирует, что полученное значение будет правильным, поэтому реализация метода в дочерних классах должна обеспечивать соответствующую проверку.

source: Given a dictionary of data and this widget's name, returns the value of this widget. ``files`` may contain data coming from :attr:`request.FILES <django.http.HttpRequest.FILES>`. Returns ``None`` if a value wasn't provided. Note also that ``value_from_datadict`` may be called more than once during handling of form data, so if you customize it and add expensive processing, you should implement some caching mechanism yourself.
ru: Принимает словарь с данными и имя виджета. ``files`` может содержать данные из :attr:`request.FILES <django.http.HttpRequest.FILES>`. Возвращает ``None``, если значение не найдено. Обратите внимание, ``value_from_datadict`` может вызываться несколько раз при обработке данных в форме. Если вы добавите медленные операции в этот метод, позаботьтесь о кешировании результата.

source: A widget that is composed of multiple widgets. :class:`~django.forms.MultiWidget` works hand in hand with the :class:`~django.forms.MultiValueField`.
ru: Виджет, который состоит из множества виджетов. Класс :class:`~django.forms.MultiWidget` предназначен для поля :class:`~django.forms.MultiValueField`.

source: :class:`MultiWidget` has one required argument:
ru: Класс :class:`MultiWidget` имеет один обязательный аргумент:

source: An iterable containing the widgets needed.
ru: Итератор, содержащий необходимые виджеты.

source: And one required method:
ru: И один обязательный метод:

source: This method takes a single "compressed" value from the field and returns a list of "decompressed" values. The input value can be assumed valid, but not necessarily non-empty.
ru: Этот метод принимает единственное "сжато" значение от поля и возвращает список "распакованных" значений. Введённое значение может считаться верным, но не обязательно не пустым.

source: This method **must be implemented** by the subclass, and since the value may be empty, the implementation must be defensive.
ru: Этот метод **должен быть реализован** в дочернем классе и, так как значение может быть пустым, реализация должна проверять этот момент.

source: The rationale behind "decompression" is that it is necessary to "split" the combined value of the form field into the values for each widget.
ru: Наличие "распаковки" объясняется необходимостью "разделить" объединённое значение поля формы на значения для каждого виджета.

source: An example of this is how :class:`SplitDateTimeWidget` turns a :class:`~datetime.datetime` value into a list with date and time split into two separate values::
ru: Пример того как :class:`SplitDateTimeWidget` преобразовывает значение :class:`~datetime.datetime` в список с датой и временем::

source: Note that :class:`~django.forms.MultiValueField` has a complementary method :meth:`~django.forms.MultiValueField.compress` with the opposite responsibility - to combine cleaned values of all member fields into one.
ru: Следует отметить, что :class:`~django.forms.MultiValueField` обладает дополнительным методом :meth:`~django.forms.MultiValueField.compress` с обратной функциональностью -- объединять проверенные значения всех элементов поля в единое значение.

source: Other methods that may be useful to override include:
ru: Список других методов, которые может быть полезно переопределить:

source: Argument ``value`` is handled differently in this method from the subclasses of :class:`~Widget` because it has to figure out how to split a single value for display in multiple widgets.
ru: Аргумент ``value`` обрабатывается по-другому в этом методе в отличие от дочерних классов :class:`~Widget`, потому что он должен знать как именно разделять единое значение для отображения во множестве виджетов.

source: The ``value`` argument used when rendering can be one of two things:
ru: Аргумент ``value``, используемый при генерации, может быть одним из:

source: A ``list``.
ru: Список (``list``).

source: A single value (e.g., a string) that is the "compressed" representation of a ``list`` of values.
ru: Единственное значение (т.е., строка), которая является "сжатым" представлением списка значений.

source: If ``value`` is a list, the output of :meth:`~MultiWidget.render` will be a concatenation of rendered child widgets. If ``value`` is not a list, it will first be processed by the method :meth:`~MultiWidget.decompress()` to create the list and then rendered.
ru: Если ``value`` является списком, результатом метода :meth:`~MultiWidget.render` будет совокупность отрендеренных виджетов. Если ``value`` не является списком, то сначала оно будет обработано методом :meth:`~MultiWidget.decompress()` для получения списка и затем выполнится рендеринг.

source: When ``render()`` executes its HTML rendering, each value in the list is rendered with the corresponding widget -- the first value is rendered in the first widget, the second value is rendered in the second widget, etc.
ru: При работе метода ``render()`` каждому значению в списке назначается соответствующий виджет. Первое значение значение назначается первому виджету, второе -- второму и так далее.

source: Unlike in the single value widgets, method :meth:`~MultiWidget.render` need not be implemented in the subclasses.
ru: В отличие от виджетов с единственным значением, метод :meth:`~MultiWidget.render` не обязательно должен быть реализован в дочерних классах.

source: Given a list of rendered widgets (as strings), returns a Unicode string representing the HTML for the whole lot.
ru: Переданный список отрендеренных виджетов (в виде строки), возвращает строку Unicode, представляющую HTML код для всего этого.

source: This hook allows you to format the HTML design of the widgets any way you'd like.
ru: Этот обработчик позволяет вам форматировать HTML код виджетов в нужном вам виде.

source: Here's an example widget which subclasses :class:`MultiWidget` to display a date with the day, month, and year in different select boxes. This widget is intended to be used with a :class:`~django.forms.DateField` rather than a :class:`~django.forms.MultiValueField`, thus we have implemented :meth:`~Widget.value_from_datadict`::
ru: Ниже приведён виджет унаследован от :class:`MultiWidget` и подходит для отображения даты, разделяя день, месяц и год по различным элементам. Этот виджет предназначен для использования совместно с :class:`~django.forms.DateField` вместо :class:`~django.forms.MultiValueField`, следовательно мы должны реализовать метод :meth:`~Widget.value_from_datadict`::

source: The constructor creates several :class:`Select` widgets in a tuple. The ``super`` class uses this tuple to setup the widget.
ru: Конструктор создаёт кортеж из нескольких виджетов :class:`Select`. Класс, от которого был унаследован виджет, использует этот кортеж для настройки виджета.

source: The :meth:`~MultiWidget.format_output` method is fairly vanilla here (in fact, it's the same as what's been implemented as the default for ``MultiWidget``), but the idea is that you could add custom HTML between the widgets should you wish.
ru: Метод :meth:`~MultiWidget.format_output` не особо нужен здесь (действительно, он похож на стандартную реализацию этого метода в ``MultiWidget``), но идея в том, что вы можете в этой точке можете сделать нужную настройку виджетов.

source: The required method :meth:`~MultiWidget.decompress` breaks up a ``datetime.date`` value into the day, month, and year values corresponding to each widget. Note how the method handles the case where ``value`` is ``None``.
ru: Обязательный метод :meth:`~MultiWidget.decompress` разбивает значение ``datetime.date`` на значение дня, месяца и года для каждого виджета. Следует отметить, что метод обрабатывает случай, когда ``value`` равно ``None``.

source: The default implementation of :meth:`~Widget.value_from_datadict` returns a list of values corresponding to each ``Widget``. This is appropriate when using a ``MultiWidget`` with a :class:`~django.forms.MultiValueField`, but since we want to use this widget with a :class:`~django.forms.DateField` which takes a single value, we have overridden this method to combine the data of all the subwidgets into a ``datetime.date``. The method extracts data from the ``POST`` dictionary and constructs and validates the date. If it is valid, we return the string, otherwise, we return an empty string which will cause ``form.is_valid`` to return ``False``.
ru: Стандартная реализация метода :meth:`~Widget.value_from_datadict` возвращает список значений для каждого ``Widget``. Это полезно при использовании ``MultiWidget`` совместно с :class:`~django.forms.MultiValueField`, но так как мы желаем использовать этот виджет совместно с :class:`~django.forms.DateField`, который принимает единственное значение, мы переопределили этот метод для соединения данных всех подчинённых виджетов в ``datetime.date``. Метод получает данные из словаря ``POST``, создаёт и проверяет дату. Если она проходит проверку, мы возвращаем строку, в противном случае возвращаем пустую строку, что заставляет ``form.is_valid`` вернуть ``False``.

source: Built-in widgets
ru: Встроенные виджеты

source: Django provides a representation of all the basic HTML widgets, plus some commonly used groups of widgets in the ``django.forms.widgets`` module, including :ref:`the input of text <text-widgets>`, :ref:`various checkboxes and selectors <selector-widgets>`, :ref:`uploading files <file-upload-widgets>`, and :ref:`handling of multi-valued input <composite-widgets>`.
ru: Django с помощью модуля ``django.forms.widgets`` обеспечивает представление для всех базовых HTML виджетов, а также некоторые часто используемые группы виджетов, включая :ref:`виджеты для ввода текста <text-widgets>`, :ref:`различные чекбоксы и селекторы <selector-widgets>`, :ref:`загрузку файлов <file-upload-widgets>` и :ref:`обработку сложных значений <composite-widgets>`.

source: Widgets handling input of text
ru: Виджеты для ввода текста

source: These widgets make use of the HTML elements ``input`` and ``textarea``.
ru: Эти виджеты используют HTML элементы ``input`` и ``textarea``.

source: Text input: ``<input type="text" ...>``
ru: Ввод текста: ``<input type="text" ...>``

source: Text input: ``<input type="number" ...>``
ru: Ввод текста: ``<input type="number" ...>``

source: Beware that not all browsers support entering localized numbers in ``number`` input types. Django itself avoids using them for fields having their :attr:`~django.forms.Field.localize` property set to ``True``.
ru: Будьте осторожны, не все браузеры поддерживают локализированные числа в полях типа ``number``. Django, не надеясь на браузер, использует для :attr:`~django.forms.Field.localize` значение ``True``.

source: Text input: ``<input type="email" ...>``
ru: Ввод текста: ``<input type="email" ...>``

source: Text input: ``<input type="url" ...>``
ru: Ввод текста: ``<input type="url" ...>``

source: Password input: ``<input type='password' ...>``
ru: Ввод пароля: ``<input type='password' ...>``

source: Takes one optional argument:
ru: Принимает один необязательный аргумент:

source: Determines whether the widget will have a value filled in when the form is re-displayed after a validation error (default is ``False``).
ru: Определяет, надо ли заполнять этот виджет при повторном отображении формы при ошибке (по умолчанию ``False``).

source: Hidden input: ``<input type='hidden' ...>``
ru: Скрытый ввод: ``<input type='hidden' ...>``

source: Note that there also is a :class:`MultipleHiddenInput` widget that encapsulates a set of hidden input elements.
ru: Следует отметить, что также существует виджет :class:`MultipleHiddenInput`, который объединяет элементы скрытого ввода.

source: Date input as a simple text box: ``<input type='text' ...>``
ru: Ввод даты в простое текстовое поле: ``<input type='text' ...>``
