Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/howto/deployment/wsgi/uwsgi.po
Languages: ru

source: How to use Django with uWSGI
ru: Развёртывание Django с uWSGI

source: uWSGI_ is a fast, self-healing and developer/sysadmin-friendly application container server coded in pure C.
ru: uWSGI_ это быстрый, самовосстанавливающийся и дружелюбный к разработчикам/сисадминам контейнер серверов, написанный на чистом C.

source: The uWSGI docs offer a `tutorial`_ covering Django, nginx, and uWSGI (one possible deployment setup of many). The docs below are focused on how to integrate Django with uWSGI.
ru: В документации uWSGI есть `tutorial`_, в котором описана настройка Django, nginx и uWSGI (один из возможных способов установки). В этом разделе мы сфокусируемся на том, как организовать взаимодействие Django и uWSGI.

source: Prerequisite: uWSGI
ru: Предпосылка: uWSGI

source: The uWSGI wiki describes several `installation procedures`_. Using pip, the Python package manager, you can install any uWSGI version with a single command. For example:
ru: Wiki uWSGI описывает несколько `installation procedures`_. Используя pip, менеджер пакетов Python, вы можете установить uWSGI с помощью одной команды:

source: uWSGI model
ru: Модель uWSGI

source: uWSGI operates on a client-server model. Your Web server (e.g., nginx, Apache) communicates with a `django-uwsgi` "worker" process to serve dynamic content.
ru: uWSGI основывается на клиент-серверной модели. Ваш веб-сервер (nginx, Apache...) обращается к рабочему процессу `django-uwsgi` для получения динамического контента.

source: Configuring and starting the uWSGI server for Django
ru: Конфигурация и запуск сервера uWSGI для Django

source: uWSGI supports multiple ways to configure the process. See uWSGI's `configuration documentation`_.
ru: uWSGI поддерживает различные пути настройки, смотрите `документацию о настройках <https://uwsgi.readthedocs.org/en/latest/Configuration.html>`_.

source: Here's an example command to start a uWSGI server::
ru: Пример команды для запуска сервера uWSGI::

source: This assumes you have a top-level project package named ``mysite``, and within it a module :file:`mysite/wsgi.py` that contains a WSGI ``application`` object. This is the layout you'll have if you ran ``django-admin startproject mysite`` (using your own project name in place of ``mysite``) with a recent version of Django. If this file doesn't exist, you'll need to create it. See the :doc:`/howto/deployment/wsgi/index` documentation for the default contents you should put in this file and what else you can add to it.
ru: Здесь предполагается, что есть проект верхнего уровня, называющийся ``mysite``, и внутри него модуль :file:`mysite/wsgi.py`, который содержит WSGI-объект ``application``. Такая структура создаётся при запуске ``django-admin startproject mysite`` (где ``mysite`` - имя вашего приложения) последней версии Django. Если же такого файла нет, то надо его создать. Описание содержимого описано в :doc:`/howto/deployment/wsgi/index`.

source: The Django-specific options here are:
ru: Django-специфичные опции:

source: ``chdir``: The path to the directory that needs to be on Python's import path -- i.e., the directory containing the ``mysite`` package.
ru: ``chdir``: путь к каталогу, который нужен для импорта Python -- например, содержащему пакет ``mysite``.

source: ``module``: The WSGI module to use -- probably the ``mysite.wsgi`` module that :djadmin:`startproject` creates.
ru: ``module``: модуль WSGI -- ``mysite.wsgi``, если вы создавали проект командой :djadmin:`startproject`.

source: ``env``: Should probably contain at least ``DJANGO_SETTINGS_MODULE``.
ru: ``env``: должен содержать как минимум ``DJANGO_SETTINGS_MODULE``.

source: ``home``: Optional path to your project virtualenv.
ru: ``home``: опциональный путь к виртуальному окружению (virtualenv).

source: Example ini configuration file::
ru: Пример конфигурационного ini-файла::

source: Example ini configuration file usage::
ru: Пример использования конфигурационного ini-файла::

source: Fixing ``UnicodeEncodeError`` for file uploads
ru: Исправляем ``UnicodeEncodeError`` при загрузке файлов

source: If you get a ``UnicodeEncodeError`` when uploading files with file names that contain non-ASCII characters, make sure uWSGI is configured to accept non-ASCII file names by adding this to your ``uwsgi.ini``::
ru: Если вы получили ``UnicodeEncodeError`` при загрузке файлов, названия которых содержат не ASCII символы, убедитесь, что uWSGI настроен для загрузки таких файлов. Для этого укажите в ``uwsgi.ini``::

source: See the :ref:`unicode-files` section of the Unicode reference guide for details.
ru: Подробности смотрите в разделе :ref:`unicode-files`.

source: See the uWSGI docs on `managing the uWSGI process`_ for information on starting, stopping and reloading the uWSGI workers.
ru: Смотрите документацию `managing the uWSGI process`_ для информации о способах запуска, остановки и обновления процессов uWSGI.
