Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/topics/i18n/formatting.po
Languages: ru

source: Format localization
ru: Формат локализации

source: Overview
ru: Введение

source: Django's formatting system is capable of displaying dates, times and numbers in templates using the format specified for the current :term:`locale <locale name>`. It also handles localized input in forms.
ru: Система форматирования Django имеет возможность отображать в шаблонах даты, время и числа, используя формат, определённый для текущей :term:`локали <locale name>`. Она также поддерживает локализованный ввод в формы.

source: When it's enabled, two users accessing the same content may see dates, times and numbers formatted in different ways, depending on the formats for their current locale.
ru: Когда система активирована, два пользователя, просматривающие один контент, могут видеть даты, времена и числа, отформатированные разными способами. Способ форматирования зависит от форматов их текущих локалей.

source: The formatting system is disabled by default. To enable it, it's necessary to set :setting:`USE_L10N = True <USE_L10N>` in your settings file.
ru: По умолчанию, система форматирования отключена. Для её активации установите :setting:`USE_L10N = True <USE_L10N>` в файле конфигурации.

source: The default :file:`settings.py` file created by :djadmin:`django-admin startproject <startproject>` includes :setting:`USE_L10N = True <USE_L10N>` for convenience. Note, however, that to enable number formatting with thousand separators it is necessary to set :setting:`USE_THOUSAND_SEPARATOR = True <USE_THOUSAND_SEPARATOR>` in your settings file. Alternatively, you could use :tfilter:`intcomma` to format numbers in your template.
ru: Стандартный файл :file:`settings.py`, созданный с помощью команды :djadmin:`django-admin startproject <startproject>`, включает локализацию :setting:`USE_L10N = True <USE_L10N>` (выключите её нахрен, включайте в нужных частях явно, иначе огребёте, прим. переводчика). Следует отметить, что для активации форматирования чисел с разделением тысяч потребуется установить :setting:`USE_THOUSAND_SEPARATOR = True <USE_THOUSAND_SEPARATOR>` в конфигурационном файле. В качестве альтернативы можно использовать фильтр :tfilter:`intcomma` для форматирования чисел в шаблонах.

source: There is also an independent but related :setting:`USE_I18N` setting that controls if Django should activate translation. See :doc:`/topics/i18n/translation` for more details.
ru: Существует независимый, но связанный параметр конфигурации :setting:`USE_I18N`, который управляет активацией системы перевода Django. Обратитесь к :doc:`/topics/i18n/translation` для получения подробной информации.

source: Locale aware input in forms
ru: Локализованный ввод в формах

source: When formatting is enabled, Django can use localized formats when parsing dates, times and numbers in forms. That means it tries different formats for different locales when guessing the format used by the user when inputting data on forms.
ru: При активированной системе форматирования Django может использовать локализованные форматы при обработке дат, времён и чисел в формах. Это означает, что она применяет различные форматы для разных локалей, при определении формата, использованного пользователем при вводе данных в формы.

source: Django uses different formats for displaying data to those it uses for parsing data. Most notably, the formats for parsing dates can't use the ``%a`` (abbreviated weekday name), ``%A`` (full weekday name), ``%b`` (abbreviated month name), ``%B`` (full month name), or ``%p`` (AM/PM).
ru: Django использует форматы для отображения данных отличные от форматов для ввода данных. Особенно отметим, что форматы для обработки дат не могут использовать ``%a`` (сокращенное название дня недели), ``%A`` (полное название дня недели), ``%b`` (сокращенное название месяца), ``%B`` (полное название месяца) или ``%p`` (AM/PM).

source: To enable a form field to localize input and output data simply use its ``localize`` argument::
ru: Для того, чтобы разрешить полю использовать локализацию для вводимых и выводимых данных, просто используйте его аргумент ``localize``::

source: Controlling localization in templates
ru: Управление локализацией в шаблонах

source: When you have enabled formatting with :setting:`USE_L10N`, Django will try to use a locale specific format whenever it outputs a value in a template.
ru: После того, как вы активировали систему форматирования с помощью параметра :setting:`USE_L10N`, Django будет пытаться использовать формат, определённый локалью, при отображении значения в шаблоне.

source: However, it may not always be appropriate to use localized values -- for example, if you're outputting JavaScript or XML that is designed to be machine-readable, you will always want unlocalized values. You may also want to use localization in selected templates, rather than using localization everywhere.
ru: Тем не менее, использование локализованных значений подходит не во всех случаях. Например, при выводе JavaScript или XML, которые не предназначены для чтения людьми, вам всегда будут нужны не локализированные значения. Также может потребоваться использовать локализацию только в нужных шаблонах, а не во всех.

source: To allow for fine control over the use of localization, Django provides the ``l10n`` template library that contains the following tags and filters.
ru: Для решения задачи по контролю над использованием локализации, Django предоставляет шаблонную библиотеку ``l10n``, которая содержит следующие теги и фильтры.

source: Template tags
ru: Шаблонные теги

source: Enables or disables localization of template variables in the contained block.
ru: Включает или отключает локализацию шаблонных переменных в текущем блоке.

source: This tag allows a more fine grained control of localization than :setting:`USE_L10N`.
ru: Этот тег обеспечивает более точный контроль над локализацией, чем предоставляет параметр конфигурации :setting:`USE_L10N`.

source: To activate or deactivate localization for a template block, use::
ru: Для включения или выключения локализации для шаблонного блока используйте::

source: The value of :setting:`USE_L10N` isn't respected inside of a ``{% localize %}`` block.
ru: Параметр конфигурации :setting:`USE_L10N` не имеет влияния внутри блока ``{% localize %}``.

source: See :tfilter:`localize` and :tfilter:`unlocalize` for template filters that will do the same job on a per-variable basis.
ru: Обратитесь к шаблонным фильтрам :tfilter:`localize` и :tfilter:`unlocalize` для реализации аналогичного контроля на уровне одного значения.

source: Template filters
ru: Шаблонные фильтры

source: Forces localization of a single value.
ru: Включает локализацию для одного значения.

source: For example::
ru: Например::

source: To disable localization on a single value, use :tfilter:`unlocalize`. To control localization over a large section of a template, use the :ttag:`localize` template tag.
ru: Используйте шаблонный фильтр :tfilter:`unlocalize`, чтобы отключить локализацию одного значения. Используйте шаблонный тег :ttag:`localize`, чтобы управлять локализацией большой части шаблона.

source: Forces a single value to be printed without localization.
ru: Обеспечивает вывод одного значения в нелокализированном виде.

source: To force localization of a single value, use :tfilter:`localize`. To control localization over a large section of a template, use the :ttag:`localize` template tag.
ru: Используйте шаблонный фильтр :tfilter:`localize`, чтобы включить локализацию одного значения. Используйте шаблонный тег :ttag:`localize`, чтобы управлять локализацией большой части шаблона.

source: Creating custom format files
ru: Создание собственных форматов

source: Django provides format definitions for many locales, but sometimes you might want to create your own, because a format files doesn't exist for your locale, or because you want to overwrite some of the values.
ru: Django предоставляет определения форматов для множества локалей, но иногда может потребоваться создать собственные форматы. Причиной может быть отсутствие форматов для вашей локали или желание переопределить поведение имеющихся форматов.

source: To use custom formats, specify the path where you'll place format files first. To do that, just set your :setting:`FORMAT_MODULE_PATH` setting to the package where format files will exist, for instance::
ru: Для использования собственных форматов требуется указать путь до пакета, в котором они определены. Для этого предназначен параметр конфигурации :setting:`FORMAT_MODULE_PATH`, пример::

source: Files are not placed directly in this directory, but in a directory named as the locale, and must be named ``formats.py``. Be careful not to put sensitive information in these files as values inside can be exposed if you pass the string to ``django.utils.formats.get_format()`` (used by the :tfilter:`date` template filter).
ru: Файлы помещаются не в каталог, а в подкаталог с названием ``locale``, и должны называться ``formats.py``. Осторожно, не помещайте важные данные в эти файлы т.к. значения могут быть отображены пользователю при передаче в ``django.utils.formats.get_format()`` (например шаблонным фильтром :tfilter:`date`).

source: To customize the English formats, a structure like this would be needed::
ru: Для настройки форматов для английского языка потребуется следующая структура::

source: where :file:`formats.py` contains custom format definitions. For example::
ru: где :file:`formats.py` содержит определения своих форматов. Например::

source: to use a non-breaking space (Unicode ``00A0``) as a thousand separator, instead of the default for English, a comma.
ru: для использования неразрывного пробела (Unicode ``00A0``) в качестве разделителя разрядов, вместо стандартной для англичан точки.

source: Limitations of the provided locale formats
ru: Ограничения предоставленных форматов локализации

source: Some locales use context-sensitive formats for numbers, which Django's localization system cannot handle automatically.
ru: Некоторые локали используют контекстно-зависимое форматирование для чисел, которое не в состоянии автоматически обработать система локализации Django.

source: Switzerland (German)
ru: Швейцария (Германия)

source: The Swiss number formatting depends on the type of number that is being formatted. For monetary values, a comma is used as the thousand separator and a decimal point for the decimal separator. For all other numbers, a comma is used as decimal separator and a space as thousand separator. The locale format provided by Django uses the generic separators, a comma for decimal and a space for thousand separators.
ru: Швейцарское форматирование чисел зависит от типа числа. Для денежных величин используются запятая для разделения разрядов и точка для выделения целой части. Для всех остальных чисел, используются запятая для выделения целой части, а пробел — в качестве разделителя разрядов. Поставляемое с Django локализованное форматирование использует вариант для большинства чисел.
