Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/topics/i18n/index.po
Languages: ru

source: Internationalization and localization
ru: Интернационализация и локализация

source: Overview
ru: Введение

source: The goal of internationalization and localization is to allow a single Web application to offer its content in languages and formats tailored to the audience.
ru: Целью интернационализации и локализации является обеспечение возможности отдельному веб приложению предоставлять свой контент на языке и в формате, понятном целевой аудитории.

source: Django has full support for :doc:`translation of text </topics/i18n/translation>`, :doc:`formatting of dates, times and numbers </topics/i18n/formatting>`, and :doc:`time zones </topics/i18n/timezones>`.
ru: Django обладает полным набором средств для решения этой задачи: :doc:`перевод текста </topics/i18n/translation>`, :doc:`форматирование даты, времени и чисел </topics/i18n/formatting>` и :doc:`поддержка часовых поясов </topics/i18n/timezones>`.

source: Essentially, Django does two things:
ru: По существу, Django обеспечивает две вещи:

source: It allows developers and template authors to specify which parts of their apps should be translated or formatted for local languages and cultures.
ru: Он позволяет разработчикам и авторам шаблонов указывать какие именно части их приложений должны быть переведены или отформатированы под используемые языки и традиции.

source: It uses these hooks to localize Web apps for particular users according to their preferences.
ru: Он использует эти метки для локализации веб приложений под конкретного пользователя, учитывая его настройки.

source: Translation depends on the target language, and formatting usually depends on the target country. This information is provided by browsers in the ``Accept-Language`` header. However, the time zone isn't readily available.
ru: Перевод зависит от целевого языка, а форматирование зависит от целевой страны. Эта информация предоставляется браузерами в заголовке ``Accept-Language``. Тем не менее, информацию о часовом поясе не так просто получить.

source: Definitions
ru: Терминология

source: The words "internationalization" and "localization" often cause confusion; here's a simplified definition:
ru: Слова «интернационализация» и «локализация» часто вызывают путаницу. Сейчас всё будет понятно:

source: internationalization
ru: интернационализация

source: Preparing the software for localization. Usually done by developers.
ru: Подготовка программного обеспечения для локализации. Обычно выполняется разработчиками.

source: localization
ru: локализация

source: Writing the translations and local formats. Usually done by translators.
ru: Создание переводов и локальных форматов. Обычно выполняется переводчиками.

source: More details can be found in the `W3C Web Internationalization FAQ`_, the `Wikipedia article`_ or the `GNU gettext documentation`_.
ru: Подробности можно найти в `ЧаВо W3C по интернационализации веба <http://www.w3.org/International/questions/qa-i18n>`_, в `Википедии <http://ru.wikipedia.org/wiki/Интернационализация>`_ или в `документации GNU gettext <http://www.gnu.org/software/gettext/manual/gettext.html>`_.

source: Translation and formatting are controlled by :setting:`USE_I18N` and :setting:`USE_L10N` settings respectively. However, both features involve internationalization and localization. The names of the settings are an unfortunate result of Django's history.
ru: Перевод и форматирование контролируются параметрами :setting:`USE_I18N` and :setting:`USE_L10N` соответственно. Тем не менее, оба функционала участвуют в интернационализации и локализации. Имена параметров являются не слишком удачным результатом развития Django.

source: Here are some other terms that will help us to handle a common language:
ru: Рассмотрим ещё несколько терминов, которые помогут нам общаться на понятном языке:

source: A locale name, either a language specification of the form ``ll`` or a combined language and country specification of the form ``ll_CC``. Examples: ``it``, ``de_AT``, ``es``, ``pt_BR``. The language part is always in lowercase and the country part in upper case. The separator is an underscore.
ru: Имя локали, либо спецификация языка в виде ``ll`` или комбинация языка и спецификации страны в виде ``ll_CC``. Примеры: ``it``, ``de_AT``, ``es``, ``pt_BR``. Языковая часть всегда указывается в нижнем регистре, а часть, определяющая страну, -- в верхнем регистре. Разделителем является символ подчёркивания.

source: Represents the name of a language. Browsers send the names of the languages they accept in the ``Accept-Language`` HTTP header using this format. Examples: ``it``, ``de-at``, ``es``, ``pt-br``. Language codes are generally represented in lowercase, but the HTTP ``Accept-Language`` header is case-insensitive. The separator is a dash.
ru: Представляет имя языка. Используя этот формат, браузеры отправляют имена языков, контент на которых они предпочитают принять, в HTTP заголовке ``Accept-Language``. Примеры: ``it``, ``de-at``, ``es``, ``pt-br``. Коды языков обычно указываются в нижнем регистре, но HTTP заголовок ``Accept-Language`` является регистронезависимым. Разделителем является символ тире.

source: A message file is a plain-text file, representing a single language, that contains all available :term:`translation strings <translation string>` and how they should be represented in the given language. Message files have a ``.po`` file extension.
ru: Файл сообщения является обычным текстовым файлом, представляющим единственный язык, который содержит все доступные :term:`строки перевода <translation string>` и правила их отображения для данного языка. Файлы сообщений имеют расширение ``.po``.

source: A literal that can be translated.
ru: Строка, которая может быть переведена.

source: A format file is a Python module that defines the data formats for a given locale.
ru: Файл формата является модулем языка Python и определяет форматы данных для данной локали.
