Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/topics/i18n/timezones.po
Languages: ru

source: Time zones
ru: Часовые пояса

source: Overview
ru: Введение

source: When support for time zones is enabled, Django stores datetime information in UTC in the database, uses time-zone-aware datetime objects internally, and translates them to the end user's time zone in templates and forms.
ru: При включенной поддержке часовых поясов, Django сохраняет в базе данных информацию о дате и времени в формате UTC, использует специальные объекты абсолютного времени и переводит значения к часовому поясу конечного пользователя в шаблонах и формах.

source: This is handy if your users live in more than one time zone and you want to display datetime information according to each user's wall clock.
ru: Такая поддержка становится актуальной, если ваши пользователи живут в разных часовых поясах и требуется отображать время в их текущем часовом поясе.

source: Even if your website is available in only one time zone, it's still good practice to store data in UTC in your database. The main reason is Daylight Saving Time (DST). Many countries have a system of DST, where clocks are moved forward in spring and backward in autumn. If you're working in local time, you're likely to encounter errors twice a year, when the transitions happen. (The pytz_ documentation discusses `these issues`_ in greater detail.) This probably doesn't matter for your blog, but it's a problem if you over-bill or under-bill your customers by one hour, twice a year, every year. The solution to this problem is to use UTC in the code and use local time only when interacting with end users.
ru: Даже если ваш сайт используется в пределах одного часового пояса, хорошей привычкой будет хранение данных о времени в формате UTC. Основной причиной этой рекомендации является летнее время (Daylight Saving Time, DST). Во многих странах используется летнее время, когда часы переводятся весной на час вперёд, а осенью назад. При работе с локальным временем, у вас проявляется вероятность получения ошибок из-за времени дважды в год, в момент перевода часов. (Документация на пакет pytz_ рассматривает `эти вопросы <these issues>`_ очень подробно.) Это может не иметь значения для вашего блога, но это становится проблемой, когда вы обсчитываетесь в расчётах с клиентами дважды в год ежегодно на один час. Решением этой проблемы является использование UTC в коде и преобразование времени к локальному при взаимодействии с конечным пользователем.

source: The default :file:`settings.py` file created by :djadmin:`django-admin startproject <startproject>` includes :setting:`USE_TZ = True <USE_TZ>` for convenience.
ru: Файл конфигурации :file:`settings.py`, созданный с помощью :djadmin:`django-admin startproject <startproject>` для удобства включает в себя :setting:`USE_TZ = True <USE_TZ>`.

source: There is also an independent but related :setting:`USE_L10N` setting that controls whether Django should activate format localization. See :doc:`/topics/i18n/formatting` for more details.
ru: Существует также независимый, но связанный параметр конфигурации :setting:`USE_L10N`, который управляет активацией форматов локализации. Обратитесь к разделу :doc:`/topics/i18n/formatting` для получения подробностей.

source: If you're wrestling with a particular problem, start with the :ref:`time zone FAQ <time-zones-faq>`.
ru: Если вы бьётесь над определённой проблемой, начните с :ref:`ЧаВо по часовым поясам <time-zones-faq>`.

source: Concepts
ru: Концепция

source: Naive and aware datetime objects
ru: Объекты относительного и абсолютного времени

source: Python's :class:`datetime.datetime` objects have a ``tzinfo`` attribute that can be used to store time zone information, represented as an instance of a subclass of :class:`datetime.tzinfo`. When this attribute is set and describes an offset, a datetime object is **aware**. Otherwise, it's **naive**.
ru: Объекты класса :class:`datetime.datetime` обладают атрибутом ``tzinfo``, который может быть использован для хранения информации о часовом поясе и представлен потомком класса :class:`datetime.tzinfo`. Если этот атрибут установлен и описывает смещение, то объект описывает **абсолютное** время. Иначе речь идёт об **относительном** времени.

source: You can use :func:`~django.utils.timezone.is_aware` and :func:`~django.utils.timezone.is_naive` to determine whether datetimes are aware or naive.
ru: Вы можете использовать функции :func:`~django.utils.timezone.is_aware` и :func:`~django.utils.timezone.is_naive` для определения типа объекта.

source: When time zone support is enabled (:setting:`USE_TZ=True <USE_TZ>`), Django uses time-zone-aware datetime objects. If your code creates datetime objects, they should be aware too. In this mode, the example above becomes::
ru: При включенной поддержке часовых поясов (:setting:`USE_TZ=True <USE_TZ>`), Django использует время с указанным часовым поясом. Если ваш код создаёт объекты даты-времени, они тоже должны быть представлены с указанным часовым поясом. В этом режиме, предыдущий пример будет выглядеть так::

source: Dealing with aware datetime objects isn't always intuitive. For instance, the ``tzinfo`` argument of the standard datetime constructor doesn't work reliably for time zones with DST. Using UTC is generally safe; if you're using other time zones, you should review the `pytz`_ documentation carefully.
ru: Работа с объектами абсолютного времени не всегда интуитивно понятна. Например, аргумент ``tzinfo`` не надёжно работает с часовыми поясами в летнем времени. Использование UTC обычно безопаснее. Если вы работаете с несколькими часовыми поясами, то тщательно изучите документацию на `pytz`_.

source: Python's :class:`datetime.time` objects also feature a ``tzinfo`` attribute, and PostgreSQL has a matching ``time with time zone`` type. However, as PostgreSQL's docs put it, this type "exhibits properties which lead to questionable usefulness".
ru: Объекты класса :class:`datetime.time` также обладают атрибутом ``tzinfo``, а PostgreSQL имеет соответствующий тип ``time with time zone``. Тем не менее, как написано в документации на PostgreSQL, этот тип "обладает свойствами, которые имеют сомнительную полезность".

source: Django only supports naive time objects and will raise an exception if you attempt to save an aware time object, as a timezone for a time with no associated date does not make sense.
ru: Django поддерживает только объекты времени без часового пояса и вызывает исключение, если вы попытаетесь сохранить объект с часовым поясом, так как часовой пояс без даты не имеет смысла.

source: Interpretation of naive datetime objects
ru: Интерпретация объектов относительного времени

source: When :setting:`USE_TZ` is ``True``, Django still accepts naive datetime objects, in order to preserve backwards-compatibility. When the database layer receives one, it attempts to make it aware by interpreting it in the :ref:`default time zone <default-current-time-zone>` and raises a warning.
ru: Если параметр конфигурации :setting:`USE_TZ` установлен в ``True``, Django продолжает принимать объекты относительного времени, чтобы обеспечить обратную совместимость. Когда слой базы данных получает такой объект, он пытается преобразовать его в объект абсолютного времени, интерпретируя его в :ref:`часовом поясе по умолчанию <default-current-time-zone>` и выбрасывает предупреждение.

source: In practice, this is rarely an issue. Django gives you aware datetime objects in the models and forms, and most often, new datetime objects are created from existing ones through :class:`~datetime.timedelta` arithmetic. The only datetime that's often created in application code is the current time, and :func:`timezone.now() <django.utils.timezone.now>` automatically does the right thing.
ru: На практике это редко является проблемой. Django предоставляет вам объекты абсолютного времени в моделях и формах и чаще всего, новые объекты даты создаются из уже имеющихся с помощью :class:`~datetime.timedelta` арифметики. Чаще всего в коде используется текущая дата и функция :func:`timezone.now () <django.utils.timezone.now>` создаёт объект правильного типа.

source: Default time zone and current time zone
ru: Стандартный часовой пояс и текущий часовой пояс

source: The **default time zone** is the time zone defined by the :setting:`TIME_ZONE` setting.
ru: **Стандартный часовой пояс** — это часовой пояс, определённый параметром конфигурации :setting:`TIME_ZONE`.

source: The **current time zone** is the time zone that's used for rendering.
ru: **Текущая часовой пояс** — часовой пояс для которого отображается страница сайта.

source: You should set the current time zone to the end user's actual time zone with :func:`~django.utils.timezone.activate`. Otherwise, the default time zone is used.
ru: Вы должны настраивать текущий часовой пояс на пояс пользователя с помощью :func:`~django.utils.timezone.activate`. В противном случае будет использоваться стандартный часовой пояс.

source: As explained in the documentation of :setting:`TIME_ZONE`, Django sets environment variables so that its process runs in the default time zone. This happens regardless of the value of :setting:`USE_TZ` and of the current time zone.
ru: Как указано в документации на параметр :setting:`TIME_ZONE`, Django устанавливает переменные окружения так, что она работает в стандартном часовом поясе. Это происходит вне зависимости от значения переменой :setting:`USE_TZ` и текущего часового пояса.

source: Selecting the current time zone
ru: Выбор текущего часового пояса

source: The current time zone is the equivalent of the current :term:`locale <locale name>` for translations. However, there's no equivalent of the ``Accept-Language`` HTTP header that Django could use to determine the user's time zone automatically. Instead, Django provides :ref:`time zone selection functions <time-zone-selection-functions>`. Use them to build the time zone selection logic that makes sense for you.
ru: Текущий часовой пояс соответствует текущей :term:`локали <locale name>` для переводов. Тем не менее, не существует аналога для HTTP заголовка ``Accept-Language``, который Django может использовать для автоматического определения часового пояса пользователя. Вместо этого, Django предоставляет :ref:`функции выбора часового пояса <time-zone-selection-functions>`. Используйте их при построении логики выбора часового пояса.

source: Here's an example that stores the current timezone in the session. (It skips error handling entirely for the sake of simplicity.)
ru: Ниже приведён пример сохранения текущего часового пояса в сессии. (Пример не использует обработку ошибок для простоты.)

source: Create a view that can set the current timezone::
ru: Создайте представление, которое может установить текущий часовой пояс::

source: Include a form in ``template.html`` that will ``POST`` to this view:
ru: Добавьте форму в ``template.html``, которая будет выполнять ``POST`` запрос к этому предоставлению:

source: Time zone aware input in forms
ru: Ввод значений абсолютного времени в формы

source: When you enable time zone support, Django interprets datetimes entered in forms in the :ref:`current time zone <default-current-time-zone>` and returns aware datetime objects in ``cleaned_data``.
ru: После активации поддержки часовых поясов, Django интерпретирует значения времени, вводимые в формы относительно :ref:`текущего часового пояса <default-current-time-zone>`, и возвращает объекты абсолютного времени в ``cleaned_data``.

source: If the current time zone raises an exception for datetimes that don't exist or are ambiguous because they fall in a DST transition (the timezones provided by pytz_ do this), such datetimes will be reported as invalid values.
ru: Если текущий часовой пояс выбрасывает исключение для значений времени, которые не существуют или не могут быть преобразованы из-за перехода на летнее время (часовые пояса, предоставляемые через pytz_, так делают), то такие значения времени будут интерпретированы как неправильные.

source: Time zone aware output in templates
ru: Вывод объектов абсолютного времени в шаблонах

source: When you enable time zone support, Django converts aware datetime objects to the :ref:`current time zone <default-current-time-zone>` when they're rendered in templates. This behaves very much like :doc:`format localization </topics/i18n/formatting>`.
ru: После активации поддержки временных зон, Django преобразует объекты абсолютного времени в :ref:`текущий часовой пояс <default-current-time-zone>` при отображении в шаблоне. Процесс идёт аналогично :doc:`локализации форматирования </topics/i18n/formatting>`.

source: Django doesn't convert naive datetime objects, because they could be ambiguous, and because your code should never produce naive datetimes when time zone support is enabled. However, you can force conversion with the template filters described below.
ru: Django не преобразует объекты относительного времени, так как они могут иметь двусмысленное значение. Ваш код не должен создавать объекты относительного времени при включенной поддержке часовых поясов. Тем не менее, вы можете включить принудительную конвертацию с помощью шаблонных фильтров, описанных далее.

source: Conversion to local time isn't always appropriate -- you may be generating output for computers rather than for humans. The following filters and tags, provided by the ``tz`` template tag library, allow you to control the time zone conversions.
ru: Преобразование к локальному времени не всегда полезно, так как данные могут генерироваться для компьютеров, а не для людей. Следующие фильтры и теги, предоставляемые шаблонной библиотекой тегов ``tz``, позволяют вам управлять преобразованиями объектов времени.

source: Template tags
ru: Шаблонные теги

source: Enables or disables conversion of aware datetime objects to the current time zone in the contained block.
ru: Включает и отключает преобразование объектов абсолютного времени в текущий часовой пояс в блоке.

source: This tag has exactly the same effects as the :setting:`USE_TZ` setting as far as the template engine is concerned. It allows a more fine grained control of conversion.
ru: Этот тег имеет точно такой же эффект, как и параметр :setting:`USE_TZ`, только для шаблонного движка. Он позволяет обеспечить более тонкий контроль над преобразованиями.

source: To activate or deactivate conversion for a template block, use::
ru: Для активации или деактивации преобразований для шаблонного блока, используйте::

source: The value of :setting:`USE_TZ` isn't respected inside of a ``{% localtime %}`` block.
ru: Значение параметра :setting:`USE_TZ` не влияет на содержимое блока ``{% localtime %}``.

source: Sets or unsets the current time zone in the contained block. When the current time zone is unset, the default time zone applies.
ru: Устанавливает или снимает текущий часовой пояс в блоке. Если текущий часовой пояс снят, то применяется стандартный часовой пояс.

source: You can get the name of the current time zone using the ``get_current_timezone`` tag::
ru: Вы можете получить название текущего часового пояса с помощью тега ``get_current_timezone``::

source: Template filters
ru: Шаблонные фильтры

source: These filters accept both aware and naive datetimes. For conversion purposes, they assume that naive datetimes are in the default time zone. They always return aware datetimes.
ru: Эти фильтры работают с обоими типами объектов времени. Для обеспечения конвертации, они предполагают, что значения относительного времени представлены в текущем часовом поясе. Эти фильтры всегда возвращают значения абсолютного времени.

source: Forces conversion of a single value to the current time zone.
ru: Обеспечивает конвертацию единственного значения в текущий часовой пояс.

source: For example::
ru: Например::

source: Forces conversion of a single value to UTC.
ru: Преобразовывает единственное значение к UTC.

source: Forces conversion of a single value to an arbitrary timezone.
ru: Преобразовывает единственное значение к указанному часовому поясу.

source: Migration guide
ru: Руководство по миграции

source: Here's how to migrate a project that was started before Django supported time zones.
ru: Здесь описано как провести миграцию старого проекта для поддержки часовых поясов.

source: Database
ru: База данных

source: The PostgreSQL backend stores datetimes as ``timestamp with time zone``. In practice, this means it converts datetimes from the connection's time zone to UTC on storage, and from UTC to the connection's time zone on retrieval.
ru: Бэкенд PostgreSQL сохраняет значения времени как ``timestamp with time zone``. Это означает, что он преобразовывает значение в UTC при сохранении и обратно при чтении.

source: As a consequence, if you're using PostgreSQL, you can switch between ``USE_TZ = False`` and ``USE_TZ = True`` freely. The database connection's time zone will be set to :setting:`TIME_ZONE` or ``UTC`` respectively, so that Django obtains correct datetimes in all cases. You don't need to perform any data conversions.
ru: Как следствие, при использовании PostgreSQL, вы можете свободно переключаться между ``USE_TZ = False`` и ``USE_TZ = True``. Часовой пояс базы данных будет установлен соответственно в :setting:`TIME_ZONE` или ``UTC``, т.е. Django получает корректные значения времени в любом случае. Вам не требуется выполнять дополнительные преобразования.

source: Other databases
ru: Другие базы данных

source: Other backends store datetimes without time zone information. If you switch from ``USE_TZ = False`` to ``USE_TZ = True``, you must convert your data from local time to UTC -- which isn't deterministic if your local time has DST.
ru: Остальные бэкенды сохраняют значения времени без информации о часовом поясе. Если вы переключите с ``USE_TZ = False`` на ``USE_TZ = True``, вам придётся преобразовать значения из локального времени в UTC, что не слишком радует, если у вас используется летнее время.

source: Code
ru: Код

source: However, these conversions may fail around DST transitions, which means you aren't getting the full benefits of time zone support yet. Also, you're likely to run into a few problems because it's impossible to compare a naive datetime with an aware datetime. Since Django now gives you aware datetimes, you'll get exceptions wherever you compare a datetime that comes from a model or a form with a naive datetime that you've created in your code.
ru: Тем не менее, эти преобразования могут ошибаться при использовании летнего времени (DST), а значит, вы не получаете все преимущества поддержки часовых поясов. Кроме того, вы, вероятно, столкнётесь с некоторыми проблемами при сравнении абсолютных и относительных дат. Так как Django теперь предоставляет вам значения абсолютного времени, вы получите исключения везде, где вы сравниваете значения из моделей или форм со значениями относительного времени, которые вы создаёте в своем коде.

source: So the second step is to refactor your code wherever you instantiate datetime objects to make them aware. This can be done incrementally. :mod:`django.utils.timezone` defines some handy helpers for compatibility code: :func:`~django.utils.timezone.now`, :func:`~django.utils.timezone.is_aware`, :func:`~django.utils.timezone.is_naive`, :func:`~django.utils.timezone.make_aware`, and :func:`~django.utils.timezone.make_naive`.
ru: Вторым шагом будет рефакторинг вашего кода в местах, где вы создаёте значения времени, теперь они должны быть абсолютными. Это может быть сделано постепенно. В модуле :mod:`django.utils.timezone` определены несколько вспомогательных функций: :func:`~django.utils.timezone.now`, :func:`~django.utils.timezone.is_aware`, :func:`~django.utils.timezone.is_naive`, :func:`~django.utils.timezone.make_aware` и :func:`~django.utils.timezone.make_naive`.

source: Finally, in order to help you locate code that needs upgrading, Django raises a warning when you attempt to save a naive datetime to the database::
ru: Наконец, для того, чтобы помочь вам найти код, который нуждается в модернизации, Django выдаёт предупреждение при попытке сохранить значение относительного времени в базу данных::

source: During development, you can turn such warnings into exceptions and get a traceback by adding the following to your settings file::
ru: На время разработки, вы можете превратить такие предупреждения в исключения и получить трассировки, добавив следующие строки в ваш файл настроек::

source: Fixtures
ru: Фикстуры

source: When serializing an aware datetime, the UTC offset is included, like this::
ru: При сериализации значений абсолютного времени добавляется смещение относительно UTC, подобно этому::

source: For models with :class:`~django.db.models.DateTimeField`\ s, this difference makes it impossible to write a fixture that works both with and without time zone support.
ru: Для моделей с полями :class:`~django.db.models.DateTimeField` такая разница в поведении делает невозможным создание фикстуры, которая может применяться в обоих режимах поддержки часовых поясов.

source: Fixtures generated with ``USE_TZ = False``, or before Django 1.4, use the "naive" format. If your project contains such fixtures, after you enable time zone support, you'll see :exc:`RuntimeWarning`\ s when you load them. To get rid of the warnings, you must convert your fixtures to the "aware" format.
ru: Фикстуры, созданные с ``USE_TZ = False`` или до Django 1.4, используют относительный формат. Если у вашего проекта есть такие фикстуры, то после включения поддержки часовых поясов, вы увидите исключения :exc:`RuntimeWarning` при попытке загрузить такие фикстуры. Чтобы избавиться от таких сообщений, вам надо преобразовать ваши фикстуры в абсолютный формат.

source: FAQ
ru: ЧаВО

source: Setup
ru: Настройка

source: **I don't need multiple time zones. Should I enable time zone support?**
ru: **Мне не нужна поддержка часовых поясов. Должен ли я активировать их поддержку?**

source: Yes. When time zone support is enabled, Django uses a more accurate model of local time. This shields you from subtle and unreproducible bugs around Daylight Saving Time (DST) transitions.
ru: Да. Если поддержка часовых поясов активирована, то Django использует более точную модель локального времени. Это ограждает вас от коварных и невоспроизводимых ошибок, связанных летним временем (DST).

source: On the other hand, bugs caused by the lack of time zone support are much harder to prevent, diagnose and fix. Anything that involves scheduled tasks or datetime arithmetic is a candidate for subtle bugs that will bite you only once or twice a year.
ru: С другой стороны, ошибки, вызванные отсутствием наличия поддержки часовых поясов, намного сложнее предотвращать, диагностировать и исправлять. Любые задачи, включающие в себя планирование или действия с датами -- явные кандидаты на подобные ошибки, которые будут портить вам жизнь дважды в год.

source: For these reasons, time zone support is enabled by default in new projects, and you should keep it unless you have a very good reason not to.
ru: Пр этим причинам поддержка часовых поясов активирована по умолчанию в новых проектах и вам не следует отключать её, если у вас нет серьёзных причин для этого.

source: **I've enabled time zone support. Am I safe?**
ru: **Я включил поддержку часовых поясов. Счастье наступило?**

source: Maybe. You're better protected from DST-related bugs, but you can still shoot yourself in the foot by carelessly turning naive datetimes into aware datetimes, and vice-versa.
ru: Может быть. Вы лучше защищены от ошибок, связанных с летним временем, но всё ещё можете "выстрелить себе в ногу", небрежно превращая относительное время в абсолютно и наоборот.
