Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/topics/i18n/timezones.po
Languages: ru

source: If your application connects to other systems -- for instance, if it queries a Web service -- make sure datetimes are properly specified. To transmit datetimes safely, their representation should include the UTC offset, or their values should be in UTC (or both!).
ru: Если ваше приложение соединяется с другими системами, например, если оно запрашивает данные у веб-сервиса, следует проверить, что значения времени определены должным образом. Для безопасной передачи значений времени, их представление должно содержать смещение относительно UTC или их значения должны быть в UTC (или оба варианта!).

source: Finally, our calendar system contains interesting traps for computers::
ru: Наконец, наша календарная система содержит интересные ловушки для компьютеров::

source: (To implement this function, you must decide whether 2012-02-29 minus one year is 2011-02-28 or 2011-03-01, which depends on your business requirements.)
ru: (Чтобы реализовать эту функцию, вы должны решить, какой из ответов 28.02.2011 или 01.03.2011 является результатом операции 29.02.2012 минус один год, что зависит от ваших бизнес-требований.)

source: **How do I interact with a database that stores datetimes in local time?**
ru: **Как работать с базами данных, которые хранят время без часового пояса?**

source: Set the :setting:`TIME_ZONE <DATABASE-TIME_ZONE>` option to the appropriate time zone for this database in the :setting:`DATABASES` setting.
ru: Укажите в опции :setting:`TIME_ZONE <DATABASE-TIME_ZONE>` настройки :setting:`DATABASES` правильный часовой пояс для базы данных.

source: This is useful for connecting to a database that doesn't support time zones and that isn't managed by Django when :setting:`USE_TZ` is ``True``.
ru: Эти данные используются при подключении к базе данных, которая не поддерживает часовые зоны, при :setting:`USE_TZ` равном ``True``.

source: Troubleshooting
ru: Решение проблем

source: **My application crashes with** ``TypeError: can't compare offset-naive`` ``and offset-aware datetimes`` **-- what's wrong?**
ru: **Моё приложение падает с** ``TypeError: can't compare offset-naive`` ``and offset-aware datetimes`` **-- в чём проблема?**

source: Let's reproduce this error by comparing a naive and an aware datetime::
ru: Давайте воспроизведём данную ошибку с помощью сравнения значений относительного и абсолютного времени::

source: If you encounter this error, most likely your code is comparing these two things:
ru: Если встречаетесь с этой ошибкой, наиболее вероятно, что ваш код сравнивает эти две вещи:

source: a datetime provided by Django -- for instance, a value read from a form or a model field. Since you enabled time zone support, it's aware.
ru: значение времени, предоставленное Django, например, значение из формы или модели. Раз вы активировали поддержку часовых поясов, значит оно абсолютное.

source: a datetime generated by your code, which is naive (or you wouldn't be reading this).
ru: относительное значение времени, созданное вашим кодом (иначе бы вы это не читали).

source: Generally, the correct solution is to change your code to use an aware datetime instead.
ru: В общем, правильным решением будет изменить ваш код так, чтобы он использовал значения абсолютного времени.

source: If you're writing a pluggable application that's expected to work independently of the value of :setting:`USE_TZ`, you may find :func:`django.utils.timezone.now` useful. This function returns the current date and time as a naive datetime when ``USE_TZ = False`` and as an aware datetime when ``USE_TZ = True``. You can add or subtract :class:`datetime.timedelta` as needed.
ru: Если вы пишете независимое приложение, которое должно работать независимо от значения :setting:`USE_TZ`, вы можете найти функцию :func:`django.utils.timezone.now` полезной. Эта функция возвращает текущую дату и время в виде объекта относительного времени при ``USE_TZ = False`` и в виде объекта абсолютного времени при ``USE_TZ = True``. Вы можете применять к её значению :class:`datetime.timedelta` когда потребуется.

source: **I see lots of** ``RuntimeWarning: DateTimeField received a naive datetime`` ``(YYYY-MM-DD HH:MM:SS)`` ``while time zone support is active`` **-- is that bad?**
ru: **Я вижу множество** ``RuntimeWarning: DateTimeField received a naive datetime`` ``(YYYY-MM-DD HH:MM:SS)`` **при включенной поддержке часовых поясов -- это плохо?**

source: When time zone support is enabled, the database layer expects to receive only aware datetimes from your code. This warning occurs when it receives a naive datetime. This indicates that you haven't finished porting your code for time zone support. Please refer to the :ref:`migration guide <time-zones-migration-guide>` for tips on this process.
ru: При включенной поддержке часовых поясов, модуль для работы с базой данных ожидает получать только значения абсолютного времени от вашего кода. Это предупреждение показывает, что модуль получил значение относительного времени. То есть, вы не завершили портирование своего кода для поддержки часовых поясов. См. :ref:`руководство по миграции <time-zones-migration-guide>` для подсказок относительно этого процесса.

source: In the meantime, for backwards compatibility, the datetime is considered to be in the default time zone, which is generally what you expect.
ru: Тем временем, для обратной совместимости, предполагается, что по умолчанию значение времени создано в локальном часовом поясе. Это логично.

source: ``now.date()`` **is yesterday! (or tomorrow)**
ru: ``now.date()`` **это вчера! (или завтра)**

source: If you've always used naive datetimes, you probably believe that you can convert a datetime to a date by calling its :meth:`~datetime.datetime.date` method. You also consider that a :class:`~datetime.date` is a lot like a :class:`~datetime.datetime`, except that it's less accurate.
ru: Если вы всегда использовали относительное время, возможно вы уверены, что можете преобразовать значение даты/времени в дату с помощью его метода :meth:`~datetime.datetime.date`. Вы также можете считать, что :class:`~datetime.date` очень похож на :class:`~datetime.datetime`, за исключением его точности.

source: None of this is true in a time zone aware environment::
ru: Ничего из этого не является правдой в среде абсолютного времени::

source: As this example shows, the same datetime has a different date, depending on the time zone in which it is represented. But the real problem is more fundamental.
ru: Как показывает данный пример, одинаковые значения даты/времени имеют различные даты в зависимости от часового пояса, в котором они представлены. Но настоящая проблема глубже.

source: A datetime represents a **point in time**. It's absolute: it doesn't depend on anything. On the contrary, a date is a **calendaring concept**. It's a period of time whose bounds depend on the time zone in which the date is considered. As you can see, these two concepts are fundamentally different, and converting a datetime to a date isn't a deterministic operation.
ru: Значение даты/времени представляет **момент времени**. Оно абсолютное и не зависит ни от чего. С другой стороны, дата является **концепцией календарного исчисления**. Это период времени, границы которого зависят от часового пояса, в котором эта дата рассматривается. Как вы можете видеть, эти две концепции имеют разную основу и преобразование даты/времени в дату не является детерминистичной операцией.

source: What does this mean in practice?
ru: К чему это приводит на практике?

source: Generally, you should avoid converting a :class:`~datetime.datetime` to :class:`~datetime.date`. For instance, you can use the :tfilter:`date` template filter to only show the date part of a datetime. This filter will convert the datetime into the current time zone before formatting it, ensuring the results appear correctly.
ru: В общем, вы должны избегать преобразований :class:`~datetime.datetime` в :class:`~datetime.date`. Например, вы можете использовать шаблонный фильтр :tfilter:`date` для отображения только даты. Этот фильтр учтёт текущий часовой пояс при преобразовании значения даты/времени и обеспечит правильное отображение результата.

source: If you really need to do the conversion yourself, you must ensure the datetime is converted to the appropriate time zone first. Usually, this will be the current timezone::
ru: Если вам действительно требуется выполнить такое преобразование самостоятельно, вы должны сначала преобразовать значение, учтя нужный часовой пояс. Обычно, им будет текущий часовой пояс::

source: If you are using MySQL, see the :ref:`mysql-time-zone-definitions` section of the MySQL notes for instructions on loading time zone definitions.
ru: Если вы используете MySQL, смотрите раздел :ref:`mysql-time-zone-definitions` о MySQL, там описан процесс установки поддержки часовых поясов для MySQL.

source: Usage
ru: Использование

source: **I have a string** ``"2012-02-21 10:28:45"`` **and I know it's in the** ``"Europe/Helsinki"`` **time zone. How do I turn that into an aware datetime?**
ru: **У меня есть строка** ``"2012-02-21 10:28:45"`` **и я знаю, что она в часовом поясе** ``"Europe/Helsinki"`` **. Как мне преобразовать её в значение абсолютного времени?**

source: This is exactly what pytz_ is for.
ru: Именно для этого и нужна библиотека pytz_.

source: Note that ``localize`` is a pytz extension to the :class:`~datetime.tzinfo` API. Also, you may want to catch ``pytz.InvalidTimeError``. The documentation of pytz contains `more examples`_. You should review it before attempting to manipulate aware datetimes.
ru: Следует отметить, что ``localize`` является расширением pytz_ для :class:`~datetime.tzinfo` API. Также, вы можете пожелать перехватывать исключение :exc:`~pytz.InvalidTimeError`. Документация pytz_ содержит `больше примеров <more examples>`_. Вы должны ознакомиться с ней перед работой со значениями абсолютного времени.

source: **How can I obtain the local time in the current time zone?**
ru: **Как я могу получить текущее время в текущем часовом поясе?**

source: Well, the first question is, do you really need to?
ru: Хорошо, первым вопросом будет: вам действительно это надо?

source: You should only use local time when you're interacting with humans, and the template layer provides :ref:`filters and tags <time-zones-in-templates>` to convert datetimes to the time zone of your choice.
ru: Вы должны использовать только локальное время при взаимодействии с людьми, для этого модуль шаблонов предоставляет :ref:`фильтры и теги <time-zones-in-templates>` для преобразования значений времени в нужный часовой пояс.

source: Furthermore, Python knows how to compare aware datetimes, taking into account UTC offsets when necessary. It's much easier (and possibly faster) to write all your model and view code in UTC. So, in most circumstances, the datetime in UTC returned by :func:`django.utils.timezone.now` will be sufficient.
ru: Более того, Python знает, как сравнивать значения абсолютного времени, принимая во внимание смещение UTC когда это требуется. Так гораздо проще (и значительно быстрее) создавать код для всех ваших моделей и представлений. Таким образом, в большинстве случаев времени в UTC, возвращённое функцией :func:`django.utils.timezone.now`, будет достаточно.

source: For the sake of completeness, though, if you really want the local time in the current time zone, here's how you can obtain it::
ru: Ради полноты изложения, если бы вы действительно хотели получить текущее время в местном часовом поясе, это можно было бы сделать так::

source: **How can I see all available time zones?**
ru: **Как я могу получить список всех доступных часовых поясов?**

source: pytz_ provides helpers_, including a list of current time zones and a list of all available time zones -- some of which are only of historical interest.
ru: Библиотека pytz_ предоставляет `шпаргалки <helpers>`_, которые содержат список текущих часовых поясов и список всех доступных часовых поясов. Некоторые из них представляют лишь исторический интерес.
