Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/topics/i18n/translation.po
Languages: ru

source: Translation
ru: Перевод

source: Overview
ru: Введение

source: In order to make a Django project translatable, you have to add a minimal number of hooks to your Python code and templates. These hooks are called :term:`translation strings <translation string>`. They tell Django: "This text should be translated into the end user's language, if a translation for this text is available in that language." It's your responsibility to mark translatable strings; the system can only translate strings it knows about.
ru: Для наделения вашего Django проекта возможностью представлять контент на разных языках потребуется немного доработать код и шаблоны. Под доработкой имеется в виду добавление :term:`переводимых строк <translation string>`. Они говорят Django: "Этот текст должен быть переведён на язык конечного пользователя, если для этого языка предоставлен перевод." Вашей задачей является маркировка соответствующих строк, как подлежащих переводу. Система может обеспечивать перевод только тех строк, на которые вы ей указали.

source: Django then provides utilities to extract the translation strings into a :term:`message file`. This file is a convenient way for translators to provide the equivalent of the translation strings in the target language. Once the translators have filled in the message file, it must be compiled. This process relies on the GNU gettext toolset.
ru: Django предоставляет утилиты для извлечения переводимых строк в :term:`файл сообщений`. Этот файл является удобным средством, которое позволяет переводчикам делать свою работу. После того, как перевод строк этого файла завершён, файл должен быть скомпилирован. Этот процесс обеспечивает набор средств GNU gettext.

source: Once this is done, Django takes care of translating Web apps on the fly in each available language, according to users' language preferences.
ru: При наличии скомпилированного ресурса с переводом строк, Django обеспечивает автоматический перевод веб приложений для каждого доступного языка, в соответствии с языковыми настройками пользователя.

source: Django's internationalization hooks are on by default, and that means there's a bit of i18n-related overhead in certain places of the framework. If you don't use internationalization, you should take the two seconds to set :setting:`USE_I18N = False <USE_I18N>` in your settings file. Then Django will make some optimizations so as not to load the internationalization machinery.
ru: Механизм интернационализации Django включен по умолчанию, т.е. в определённых местах фреймворка всегда присутствует небольшая трата ресурсов на его работу. Если вы не используете интернационализацию, то вам следует потратить пару секунд на установку :setting:`USE_I18N = False <USE_I18N>` в файле конфигурации. Это позволит Django выполнять некоторую оптимизацию, не подгружая библиотеки интернационализации.

source: There is also an independent but related :setting:`USE_L10N` setting that controls if Django should implement format localization. See :doc:`/topics/i18n/formatting` for more details.
ru: Есть также независимый, но связанный параметр :setting:`USE_L10N`, который управляет применением локального форматирования для данных. Обратитесь к :doc:`/topics/i18n/formatting` для получения подробностей.

source: Internationalization: in Python code
ru: Интернационализация в коде

source: Standard translation
ru: Обычный перевод

source: Specify a translation string by using the function :func:`~django.utils.translation.ugettext`. It's convention to import this as a shorter alias, ``_``, to save typing.
ru: Укажите переводимую строку с помощью функции :func:`~django.utils.translation.ugettext`. Удобно импортировать её с помощью краткого псевдонима, ``_`` (символ подчеркивания), чтобы сократить затраты на ввод.

source: Python's standard library ``gettext`` module installs ``_()`` into the global namespace, as an alias for ``gettext()``. In Django, we have chosen not to follow this practice, for a couple of reasons:
ru: Модуль ``gettext`` стандартной библиотеки языка Python определяет ``_()`` в качестве псевдонима для ``gettext()`` в глобальном пространстве имён. В Django мы решили не следовать этой практике по следующим причинам:

source: For international character set (Unicode) support, :func:`~django.utils.translation.ugettext` is more useful than ``gettext()``. Sometimes, you should be using :func:`~django.utils.translation.ugettext_lazy` as the default translation method for a particular file. Without ``_()`` in the global namespace, the developer has to think about which is the most appropriate translation function.
ru: Для поддержки интернационального набора символов (Unicode), функция :func:`~django.utils.translation.ugettext` гораздо более полезна, чем ``gettext()``. Иногда вам потребуется использовать функцию :func:`~django.utils.translation.ugettext_lazy` в качестве стандартного метода выделения переводимой строки в определённом файле. При отсутствии ``_()`` в глобальном пространстве имён разработчик сам решает какая функция будет ему наиболее полезна в каждом конкретном случае.

source: The underscore character (``_``) is used to represent "the previous result" in Python's interactive shell and doctest tests. Installing a global ``_()`` function causes interference. Explicitly importing ``ugettext()`` as ``_()`` avoids this problem.
ru: Символ подчёркивания (``_``) используется в интерактивном интерпретаторе Python и в доктестах в качестве "результата предыдущей операции". Определение глобальной функции ``_()`` приведёт к путанице. Явное импортирование ``ugettext()`` в виде ``_()`` решает эту проблему.

source: In this example, the text ``"Welcome to my site."`` is marked as a translation string::
ru: В данном примере, текст ``"Welcome to my site."`` помечается как переводимая строка::

source: Obviously, you could code this without using the alias. This example is identical to the previous one::
ru: Очевидно, что вы можете делать тоже самое без использования псевдонима. Этот пример идентичен предыдущему::

source: Translation works on computed values. This example is identical to the previous two::
ru: Перевод работает с вычисляемыми значениями. Этот пример идентичен предыдущим двум::

source: Translation works on variables. Again, here's an identical example::
ru: Перевод работает с переменными. И снова, аналогичный пример::

source: (The caveat with using variables or computed values, as in the previous two examples, is that Django's translation-string-detecting utility, :djadmin:`django-admin makemessages <makemessages>`, won't be able to find these strings. More on :djadmin:`makemessages` later.)
ru: (Проблема при использовании переменных или вычисляемых значений, как в предыдущих двух примерах, в том, что утилита для поиска переводимых строк, :djadmin:`django-admin makemessages <makemessages>`, не сможет найти эти строки. Далее мы подробно рассмотрим :djadmin:`makemessages`.)

source: The strings you pass to ``_()`` or ``ugettext()`` can take placeholders, specified with Python's standard named-string interpolation syntax. Example::
ru: Строка, передаваемая в ``_()`` или ``ugettext()``, может принимать заполнители (placeholders), определённые стандартом языка Python для строк. Пример::

source: This technique lets language-specific translations reorder the placeholder text. For example, an English translation may be ``"Today is November 26."``, while a Spanish translation may be ``"Hoy es 26 de Noviembre."`` -- with the month and the day placeholders swapped.
ru: Такой подход позволяет при необходимости менять порядок слов при переводе. Например, английский текст ``"Today is November 26."`` может быть переведён на испанский как ``"Hoy es 26 de Noviembre."``. Как видно, заполнители для месяца и дня поменялись местами.

source: For this reason, you should use named-string interpolation (e.g., ``%(day)s``) instead of positional interpolation (e.g., ``%s`` or ``%d``) whenever you have more than a single parameter. If you used positional interpolation, translations wouldn't be able to reorder placeholder text.
ru: По этой причине, вы должны использовать именованные заполнители (т.е., ``%(day)s``) вместо позиционных (т.е., ``%s`` или ``%d``), в случае, если в строку подставляется больше одного параметра. При использовании позиционных заполнителей переводчики не будут иметь возможность изменять оригинальный порядок слов.

source: Comments for translators
ru: Комментарии для переводчиков

source: If you would like to give translators hints about a translatable string, you can add a comment prefixed with the ``Translators`` keyword on the line preceding the string, e.g.::
ru: Если необходимо дать переводчикам подсказку по переводимой строке, вы можете добавить комментарий с префиксом ``Translators`` в строке предшествующей переводимой, например::

source: The comment will then appear in the resulting ``.po`` file associated with the translatable construct located below it and should also be displayed by most translation tools.
ru: Комментарий появится в результирующем ``.po`` файле, который связан с переводимой конструкцией расположенной далее, и должен быть отображён большинством средств перевода.

source: Just for completeness, this is the corresponding fragment of the resulting ``.po`` file:
ru: Для полноты изложения приведём соответствующий фрагмент ``.po`` файла:

source: This also works in templates. See :ref:`translator-comments-in-templates` for more details.
ru: Этот подход также работает в шаблонах. Обратитесь к :ref:`translator-comments-in-templates` для подробностей.

source: Marking strings as no-op
ru: Пометка строк как no-op

source: Use the function :func:`django.utils.translation.ugettext_noop()` to mark a string as a translation string without translating it. The string is later translated from a variable.
ru: Используйте функцию :func:`django.utils.translation.ugettext_noop()` для пометки строки как переводимой, но не переводя её. Такая строка будет переведена позже с помощью переменной.

source: Use this if you have constant strings that should be stored in the source language because they are exchanged over systems or users -- such as strings in a database -- but should be translated at the last possible point in time, such as when the string is presented to the user.
ru: Используйте этот подход в случае, когда у вас есть строковые константы, которые должны быть сохранены в исходном коде по причине того, что они изменяются системой или пользователями Примером могут служить строки из базы данных, которые следует переводить в самый последний момент, перед непосредственным их отображением пользователю.

source: Pluralization
ru: Множественное число

source: Use the function :func:`django.utils.translation.ungettext()` to specify pluralized messages.
ru: Используйте функцию :func:`django.utils.translation.ungettext()` для указания сообщений во множественном числе.

source: ``ungettext`` takes three arguments: the singular translation string, the plural translation string and the number of objects.
ru: Функция ``ungettext`` принимает три аргумента: строка в единственном числе, строка во множественном числе и количество объектов.

source: This function is useful when you need your Django application to be localizable to languages where the number and complexity of `plural forms <https://www.gnu.org/software/gettext/manual/gettext.html#Plural-forms>`_ is greater than the two forms used in English ('object' for the singular and 'objects' for all the cases where ``count`` is different from one, irrespective of its value.)
ru: Эта функция очень полезна, когда требуется локализовать Django приложение на языки, в которых количество и сложность `множественных форм <https://www.gnu.org/software/gettext/manual/gettext.html#Plural-forms>`_ превышает два варианта как в английском языке ('object' для единственного числа и 'objects' для всех остальных случаем, когда ``count`` отличается от единицы, независимо от своего значения.)

source: For example::
ru: Например::

source: In this example the number of objects is passed to the translation languages as the ``count`` variable.
ru: В этом примере количество объектов передаётся в перевод в переменной ``count``.

source: Note that pluralization is complicated and works differently in each language. Comparing ``count`` to 1 isn't always the correct rule. This code looks sophisticated, but will produce incorrect results for some languages::
ru: Следует отметить, что приведение существительного к множественному числу является непростой задачей и работает по-разному в каждом языке. Сравнение ``count`` с 1 не всегда будет корректным правилом. Следующий код выглядит разумно, но будет выдавать неверный результат для некоторых языков::

source: Don't try to implement your own singular-or-plural logic, it won't be correct. In a case like this, consider something like the following::
ru: Не стоит пытаться реализовать собственную логику для создания множественного числа, она не будет работать корректно. В этом случае, рассмотрите использование следующего подхода::

source: When using ``ungettext()``, make sure you use a single name for every extrapolated variable included in the literal. In the examples above, note how we used the ``name`` Python variable in both translation strings. This example, besides being incorrect in some languages as noted above, would fail::
ru: При использовании ``ungettext()``, проверьте, что вы используете уникальное имя для каждой переменной, указанной в строке. В вышеприведённом примере, обратите внимание на то, как мы используем переменную ``name`` в обоих строках. Следующий пример, будучи неверным для некоторых языков, выдаст ошибку::

source: You would get an error when running :djadmin:`django-admin compilemessages <compilemessages>`::
ru: Вы получите ошибку при запуске :djadmin:`django-admin compilemessages <compilemessages>`::

source: Plural form and po files
ru: Множественная форма и файлы перевода

source: Django does not support custom plural equations in po files. As all translation catalogs are merged, only the plural form for the main Django po file (in ``django/conf/locale/<lang_code>/LC_MESSAGES/django.po``) is considered. Plural forms in all other po files are ignored. Therefore, you should not use different plural equations in your project or application po files.
ru: Django не поддерживает собственные правила множественного числа в файлах перевода. Так как все файлы перевода объединяются вместе, будет использоваться только правило главного файла перевода Django (из ``django/conf/locale/<lang_code>/LC_MESSAGES/django.po``). Правила множественной формы всех остальных *.po файлов будут проигнорированы. Поэтому вам не следует использовать их в вашем проекте и приложении.

source: Contextual markers
ru: Контекстные маркеры

source: Sometimes words have several meanings, such as ``"May"`` in English, which refers to a month name and to a verb. To enable translators to translate these words correctly in different contexts, you can use the :func:`django.utils.translation.pgettext()` function, or the :func:`django.utils.translation.npgettext()` function if the string needs pluralization. Both take a context string as the first variable.
ru: Некоторые слова имеют множество значений, такие как ``"May"`` в английском языке, которое может означать название месяца или глагол. Для упрощения жизни переводчиков вы можете использовать функцию :func:`django.utils.translation.pgettext()` или функцию :func:`django.utils.translation.npgettext()`, для множественного числа. Обе функции принимают описание контекста в качестве первого аргумента.

source: In the resulting ``.po`` file, the string will then appear as often as there are different contextual markers for the same string (the context will appear on the ``msgctxt`` line), allowing the translator to give a different translation for each of them.
ru: В результате, в файле ``.po``, переводимая строка появится столько раз, сколько есть различных контекстов для неё (контекстная информация будет указана в строке ``msgctxt``), позволяя перевести каждую из них в соответствии со смыслом.

source: or::
ru: или::

source: will appear in the ``.po`` file as:
ru: появится в файле ``.po`` в виде:

source: Contextual markers are also supported by the :ttag:`trans` and :ttag:`blocktrans` template tags.
ru: Контекстные маркеры также поддерживаются шаблонными тегами :ttag:`trans` и :ttag:`blocktrans`.

source: Lazy translation
ru: Ленивый перевод

source: Use the lazy versions of translation functions in :mod:`django.utils.translation` (easily recognizable by the ``lazy`` suffix in their names) to translate strings lazily -- when the value is accessed rather than when they're called.
ru: Используйте ленивые версии функций перевода из :mod:`django.utils.translation` (их легко опознать по суффиксу ``lazy`` в их именах) для отложенного перевода строк -- перевод производится во время обращения к строке, а не когда вызывается функция.

source: These functions store a lazy reference to the string -- not the actual translation. The translation itself will be done when the string is used in a string context, such as in template rendering.
ru: Эти функции хранят ленивую ссылку на строку, не на её перевод. Сам перевод будет выполнен во время использования строки в строковом контексте, например, во время обработки шаблона.

source: This is essential when calls to these functions are located in code paths that are executed at module load time.
ru: Это полезно, когда функция перевода вызывается при загрузке модуля.

source: This is something that can easily happen when defining models, forms and model forms, because Django implements these such that their fields are actually class-level attributes. For that reason, make sure to use lazy translations in the following cases:
ru: Такое может легко произойти во время определения моделей, форм или модельных форм, так как в Django их поля реализованы в виде атрибутов класса. По этой причине, надо использовать ленивый перевод в следующих случаях:

source: Model fields and relationships ``verbose_name`` and ``help_text`` option values
ru: Поля модели и связанные с ними значения атрибутов ``verbose_name`` и ``help_text``

source: For example, to translate the help text of the *name* field in the following model, do the following::
ru: Например, для перевода подсказки для поля *name* в следующей модели, действуйте так::

source: You can mark names of :class:`~django.db.models.ForeignKey`, :class:`~django.db.models.ManyToManyField` or :class:`~django.db.models.OneToOneField` relationship as translatable by using their :attr:`~django.db.models.Options.verbose_name` options::
ru: Вы можете перевести имена связей :class:`~django.db.models.ForeignKey`, :class:`~django.db.models.ManyToManyField` или :class:`~django.db.models.OneToOneField` с помощью их атрибута :attr:`~django.db.models.Options.verbose_name`::

source: Just like you would do in :attr:`~django.db.models.Options.verbose_name` you should provide a lowercase verbose name text for the relation as Django will automatically titlecase it when required.
ru: Подобно тому, как вы делаете для :attr:`~django.db.models.Options.verbose_name`, вы должны предоставить текст метки (строчными буквами) для связи, а Django автоматически преобразует первую букву в прописную когда это необходимо.

source: Model verbose names values
ru: Значения для подписи модели

source: It is recommended to always provide explicit :attr:`~django.db.models.Options.verbose_name` and :attr:`~django.db.models.Options.verbose_name_plural` options rather than relying on the fallback English-centric and somewhat naïve determination of verbose names Django performs by looking at the model's class name::
ru: Рекомендуется всегда предоставлять явные значения для :attr:`~django.db.models.Options.verbose_name` и :attr:`~django.db.models.Options.verbose_name_plural`, а не надеяться на механизм их автоматического определения через имя класса::

source: Model methods ``short_description`` attribute values
ru: Значения атрибута ``short_description`` у методов модели

source: For model methods, you can provide translations to Django and the admin site with the ``short_description`` attribute::
ru: Для методов модели вы можете с помощью атрибута ``short_description`` предоставить перевод для Django и интерфейса администратора::

source: Working with lazy translation objects
ru: Работа с ленивыми объектами перевода

source: If you ever see output that looks like ``"hello <django.utils.functional...>"``, you have tried to insert the result of ``ugettext_lazy()`` into a bytestring. That's a bug in your code.
ru: Если вы встретили нечто подобное ``"hello <django.utils.functional...>"``, значит вы попытались вставить результат ``ugettext_lazy()`` в обычную строку. Это ошибка в вашем коде.

source: If you don't like the long ``ugettext_lazy`` name, you can just alias it as ``_`` (underscore), like so::
ru: Если вам не нравится писать такое длинное имя, как ``ugettext_lazy``, в можете создать для него псевдоним ``_`` (символ подчеркивания), вот так::

source: Using ``ugettext_lazy()`` and ``ungettext_lazy()`` to mark strings in models and utility functions is a common operation. When you're working with these objects elsewhere in your code, you should ensure that you don't accidentally convert them to strings, because they should be converted as late as possible (so that the correct locale is in effect). This necessitates the use of the helper function described next.
ru: Использование ``ugettext_lazy()`` и ``ungettext_lazy()`` для пометки строк в моделях и в прикладных функциях является обычной операцией. Работая с этими объектами в вашем коде, вы должны быть уверены, что вы не преобразовываете их случайно в строки, так как это преобразование должно происходить как можно позже (и будет приниматься во внимание правильная локаль). Это потребует использования вспомогательной функции, описанной далее.

source: Lazy translations and plural
ru: Ленивый перевод и перевод множественного числа

source: When using lazy translation for a plural string (``[u]n[p]gettext_lazy``), you generally don't know the ``number`` argument at the time of the string definition. Therefore, you are authorized to pass a key name instead of an integer as the ``number`` argument. Then ``number`` will be looked up in the dictionary under that key during string interpolation. Here's example::
ru: Используя ленивый перевод для срок с множественным числом (``[u]n[p]gettext_lazy``), вы не знаете значение аргумента ``number`` при определении строки. Однако, вы можете использовать аргумент ``number`` вместо числа. При определении перевода ``number`` будет определяться из переданных аргументов. Например::

source: If the string contains exactly one unnamed placeholder, you can interpolate directly with the ``number`` argument::
ru: Если строка принимает только один аргумент, вы можете передать непосредственно ``number``::

source: In this case, the lazy translations in ``result`` will only be converted to strings when ``result`` itself is used in a string (usually at template rendering time).
ru: В данном случае, отложенный перевод в ``result`` будет преобразован в строку только когда сам ``result`` будет использован в строке (обычно это происходит во время обработки шаблона).

source: Other uses of lazy in delayed translations
ru: Другое использование ленивости в отложенных переводах

source: For any other case where you would like to delay the translation, but have to pass the translatable string as argument to another function, you can wrap this function inside a lazy call yourself. For example::
ru: Для остальных случаев, когда вам надо отсрочить перевод, но приходится передавать переводимую строку в качестве аргумента другой функции, вы можете обернуть эту функцию в ленивый вызов. Например::
