Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/topics/i18n/translation.po
Languages: ru

source: The ``interpolate`` function supports dynamically populating a format string. The interpolation syntax is borrowed from Python, so the ``interpolate`` function supports both positional and named interpolation:
ru: Функция ``interpolate`` поддерживает динамическое форматирование строк. Синтаксис интерполяции заимствован из Python, т.е. функция ``interpolate`` поддерживает как позиционные, так и именованные интерполяции:

source: Positional interpolation: ``obj`` contains a JavaScript Array object whose elements values are then sequentially interpolated in their corresponding ``fmt`` placeholders in the same order they appear. For example::
ru: Позиционная интерполяция: ``obj`` содержит объект Array, чьи значения элементов затем последовательно интерполируются в соответствующие подстановки ``fmt``, в порядке их определения. Например::

source: Named interpolation: This mode is selected by passing the optional boolean ``named`` parameter as ``true``. ``obj`` contains a JavaScript object or associative array. For example::
ru: Именованная интерполяция: Этот режим выбирается при передаче необязательного параметра ``named`` со значением ``true``. Параметр ``obj`` содержит JavaScript объект или ассоциативный массив. Например::

source: You shouldn't go over the top with string interpolation, though: this is still JavaScript, so the code has to make repeated regular-expression substitutions. This isn't as fast as string interpolation in Python, so keep it to those cases where you really need it (for example, in conjunction with ``ngettext`` to produce proper pluralizations).
ru: Не злоупотребляйте интерполяцией строк, помните: это всё JavaScript, и для проверки используются регулярные выражения. Интерполяция в JavaScript выполняется не так быстро, как на Python, так что используйте её только при реальной необходимости.

source: The ``get_format`` function has access to the configured i18n formatting settings and can retrieve the format string for a given setting name::
ru: Функция ``get_format`` предоставляет доступ к настройкам форматирования интернационализации::

source: It has access to the following settings:
ru: Предоставляет доступ к следующим настройкам:

source: This is useful for maintaining formatting consistency with the Python-rendered values.
ru: Важно использовать форматирование аналогичное форматированию значений в Python.

source: This emulates the ``gettext`` function but does nothing, returning whatever is passed to it::
ru: Эмулирует функцию ``gettext``, но ничего не делает, возвращая переданное значение::

source: This is useful for stubbing out portions of the code that will need translation in the future.
ru: Полезно при написании кода, который будет использовать перевод в будущем.

source: The ``pgettext`` function behaves like the Python variant (:func:`~django.utils.translation.pgettext()`), providing a contextually translated word::
ru: Функция ``pgettext`` работает как и аналогичная функция Python (:func:`~django.utils.translation.pgettext()`), позволяя указать контекст для переводимых строк::

source: The ``npgettext`` function also behaves like the Python variant (:func:`~django.utils.translation.npgettext()`), providing a **pluralized** contextually translated word::
ru: Функция ``npgettext`` работает как и аналогичная функция Python (:func:`~django.utils.translation.npgettext()`), позволяя указать контекст при переводе строк в **множественном числе**::

source: The ``pluralidx`` function works in a similar way to the :tfilter:`pluralize` template filter, determining if a given ``count`` should use a plural form of a word or not::
ru: Функция ``pluralidx`` аналогично шаблонному фильтру :tfilter:`pluralize`, определяя нужно ли использоваться множественную форму для переданного ``count``::

source: In the simplest case, if no custom pluralization is needed, this returns ``false`` for the integer ``1`` and ``true`` for all other numbers.
ru: В самом простом варианте возвращает ``false`` для ``1`` и ``true`` для остальных значений.

source: However, pluralization is not this simple in all languages. If the language does not support pluralization, an empty value is provided.
ru: Однако, множественная форма не такая простая для всех языков. Если язык не поддерживает множественные формы, будет возвращено пустое значение.

source: Additionally, if there are complex rules around pluralization, the catalog view will render a conditional expression. This will evaluate to either a ``true`` (should pluralize) or ``false`` (should **not** pluralize) value.
ru: Также, если правила множественного числа сложные, каталог будет содержать выражение для их определения. В этом случае будет возвращено ``true`` (множественное число) или ``false`` (**не** множественное).

source: The response format is as follows:
ru: Формат ответа следующий:

source: The ``json_catalog`` view
ru: Представление ``json_catalog``

source: In order to use another client-side library to handle translations, you may want to take advantage of the ``json_catalog()`` view. It's similar to :meth:`~django.views.i18n.javascript_catalog` but returns a JSON response.
ru: Если вы используете другие клиентские библиотеки для перевода, вам может пригодится представление ``json_catalog()``. Оно работает аналогично :meth:`~django.views.i18n.javascript_catalog`, но возвращает JSON.

source: The JSON object contains i18n formatting settings (those available for `get_format`_), a plural rule (as a ``plural`` part of a GNU gettext ``Plural-Forms`` expression), and translation strings. The translation strings are taken from applications or Django's own translations, according to what is specified either via ``urlpatterns`` arguments or as request parameters. Paths listed in :setting:`LOCALE_PATHS` are also included.
ru: Объект JSON содержит настройки форматирования интернационализации (те, которые можно получить через `get_format`_), правила определения множественного числа (часть ``plural`` выражения ``Plural-Forms`` для GNU gettext), и строки с переводом. Переведённые строки собираются из приложений или Django, в зависимости от того, что вы указали в ``urlpatterns``, или аргументов запроса. Пути, указанные в параметре конфигурации :setting:`LOCALE_PATHS`, также принимаются во внимание.

source: The view is hooked up to your application and configured in the same fashion as :meth:`~django.views.i18n.javascript_catalog` (namely, the ``domain`` and ``packages`` arguments behave identically)::
ru: Представление подключается и настраивается как и :meth:`~django.views.i18n.javascript_catalog` (аргументы ``domain`` и ``packages``работают аналогично)::

source: Note on performance
ru: Комментарий о производительности

source: You can even pre-generate the JavaScript catalog as part of your deployment procedure and serve it as a static file. This radical technique is implemented in django-statici18n_.
ru: Также вы можете заранее создавать javascript-каталог во время процесса выкладывания кода на сервер и использовать его как статичный файл. Такой подход используется в django-statici18n_.

source: Internationalization: in URL patterns
ru: Интернационализация: в шаблонах URL

source: Django provides two mechanisms to internationalize URL patterns:
ru: Django предоставляет два способа интернационализации шаблонов URL:

source: Adding the language prefix to the root of the URL patterns to make it possible for :class:`~django.middleware.locale.LocaleMiddleware` to detect the language to activate from the requested URL.
ru: Добавление языкового префикса в начало шаблонов URL, чтобы класс :class:`~django.middleware.locale.LocaleMiddleware` мог определить требуемый язык по запрошенному ресурсу.

source: Making URL patterns themselves translatable via the :func:`django.utils.translation.ugettext_lazy()` function.
ru: Перевод самих шаблонов URL с помощью функции :func:`django.utils.translation.ugettext_lazy()`.

source: Language prefix in URL patterns
ru: Языковой префикс в шаблонах URL

source: After defining these URL patterns, Django will automatically add the language prefix to the URL patterns that were added by the ``i18n_patterns`` function. Example::
ru: После определения этих шаблонов URL, Django автоматически подставит префикс языка к шаблонам, которые были добавлены через функцию ``i18n_patterns``. Например::

source: Ensure that you don't have non-prefixed URL patterns that might collide with an automatically-added language prefix.
ru: Удостоверьтесь, что у вас нет таких шаблонов URL, которые могут конфликтовать с автоматически добавленным префиксом.

source: Translating URL patterns
ru: Перевод шаблонов URL

source: URL patterns can also be marked translatable using the :func:`~django.utils.translation.ugettext_lazy` function. Example::
ru: Шаблоны URL могут быть помечены как подлежащие переводу с помощью функции :func:`~django.utils.translation.ugettext_lazy`. Например::

source: In most cases, it's best to use translated URLs only within a language-code-prefixed block of patterns (using :func:`~django.conf.urls.i18n.i18n_patterns`), to avoid the possibility that a carelessly translated URL causes a collision with a non-translated URL pattern.
ru: В большинстве случаев, лучше применять переведенные URL только внутри блока, который добавляет языковой префикс для шаблонов (using :func:`~django.conf.urls.i18n.i18n_patterns`), это поможет избежать конфликта небрежно переведенных URL с непереведёнными шаблонами.

source: Reversing in templates
ru: Генерация URL в шаблонах

source: If localized URLs get reversed in templates they always use the current language. To link to a URL in another language use the :ttag:`language` template tag. It enables the given language in the enclosed template section:
ru: Если локализованные URL генерируются в шаблонах, они всегда используют текущий язык. Для получения URL для другого языка следует использовать шаблонный тег :ttag:`language`. Этот тег включает выбранный язык внутри своего блока:

source: The :ttag:`language` tag expects the language code as the only argument.
ru: Шаблонный тег :ttag:`language` принимает в качестве аргумента код языка.

source: Localization: how to create language files
ru: Локализация: как создать языковые файлы

source: Once the string literals of an application have been tagged for later translation, the translation themselves need to be written (or obtained). Here's how that works.
ru: После того, как текстовые ресурсы приложения были помечены для перевода, следует выполнить (или получить) сам перевод. Вот как это работает.

source: Message files
ru: Файлы сообщений

source: The first step is to create a :term:`message file` for a new language. A message file is a plain-text file, representing a single language, that contains all available translation strings and how they should be represented in the given language. Message files have a ``.po`` file extension.
ru: Первым шагом будет создание :term:`файла сообщений` для нового языка. Файл сообщений является простым текстовым файлом, предоставляющим один язык, который содержит все переводимые строки и правила их представления на этом языке. Файлы сообщений имеют расширение ``.po``.

source: Django comes with a tool, :djadmin:`django-admin makemessages <makemessages>`, that automates the creation and upkeep of these files.
ru: Django поставляется с утилитой, :djadmin:`django-admin makemessages <makemessages>`, которая автоматизирует создание и обновление этих файлов.

source: Gettext utilities
ru: Утилиты Gettext

source: The ``makemessages`` command (and ``compilemessages`` discussed later) use commands from the GNU gettext toolset: ``xgettext``, ``msgfmt``, ``msgmerge`` and ``msguniq``.
ru: Команда ``makemessages`` (и описанная далее ``compilemessages``) использует команды из утилит набора GNU gettext: ``xgettext``, ``msgfmt``, ``msgmerge`` и ``msguniq``.

source: The minimum version of the ``gettext`` utilities supported is 0.15.
ru: Минимальной поддерживаемой версией утилит ``gettext`` является 0.15.

source: To create or update a message file, run this command::
ru: Для создания или обновления файла сообщений запустите эту команду::

source: ...where ``de`` is the :term:`locale name` for the message file you want to create. For example, ``pt_BR`` for Brazilian Portuguese, ``de_AT`` for Austrian German or ``id`` for Indonesian.
ru: ... где ``de`` является :term:`названием локали<locale name>` для создаваемого файла сообщений. Например, это ``pt_BR`` для бразильского варианта португальского языка и ``de_AT`` для австрийского варианта немецкого языка или ``id`` для индонезийского.

source: The script should be run from one of two places:
ru: Этот скрипт должен быть запущен из одного из двух мест:

source: The root directory of your Django project (the one that contains ``manage.py``).
ru: Корневой каталог вашего Django проекта (который содержит ``manage.py``)

source: The root directory of one of your Django apps.
ru: Корневой каталог одного из приложений Django.

source: The script runs over your project source tree or your application source tree and pulls out all strings marked for translation (see :ref:`how-django-discovers-translations` and be sure :setting:`LOCALE_PATHS` is configured correctly). It creates (or updates) a message file in the directory ``locale/LANG/LC_MESSAGES``. In the ``de`` example, the file will be ``locale/de/LC_MESSAGES/django.po``.
ru: Скрипт просматривает дерево исходного кода вашего проекта или приложения и извлекает все строки, помеченные для перевода(смотрите :ref:`how-django-discovers-translations` и убедитесь что :setting:`LOCALE_PATHS` настроен правильно). Затем скрипт создаёт (или обновляет) файл сообщений в каталоге ``locale/LANG/LC_MESSAGES``. В случае примера с ``de``, файл будет создан в ``locale/de/LC_MESSAGES/django.po``.

source: When you run ``makemessages`` from the root directory of your project, the extracted strings will be automatically distributed to the proper message files. That is, a string extracted from a file of an app containing a ``locale`` directory will go in a message file under that directory. A string extracted from a file of an app without any ``locale`` directory will either go in a message file under the directory listed first in :setting:`LOCALE_PATHS` or will generate an error if :setting:`LOCALE_PATHS` is empty.
ru: При запуске ``makemessages`` из корневого каталога вашего проекта, извлечённые строки будут автоматически размещены в соответствующих файлах сообщений. Таким образом, строка, полученная из файла приложения, которое обладает каталогом ``locale``, будет размещена в файле сообщений в этом каталоге. А строка, полученная из файла приложения, у которого нет каталога ``locale``, будет размещена в файле сообщений в каталоге, который первым упомянут в :setting:`LOCALE_PATHS` или будет выведена ошибка если :setting:`LOCALE_PATHS` пуст.

source: By default :djadmin:`django-admin makemessages <makemessages>` examines every file that has the ``.html`` or ``.txt`` file extension. In case you want to override that default, use the ``--extension`` or ``-e`` option to specify the file extensions to examine::
ru: По умолчанию, :djadmin:`django-admin makemessages <makemessages>` просматривает каждый файл с расширениями ``.html`` или ``.txt``. Если вам надо изменить это поведение, используйте опцию ``--extension`` или ``-e`` для указания нужного расширения для просматриваемых файлов::

source: Separate multiple extensions with commas and/or use ``-e`` or ``--extension`` multiple times::
ru: Разделяйте множество расширений с помощью запятой и/или используйте опцию многократно::

source: When :ref:`creating message files from JavaScript source code <creating-message-files-from-js-code>` you need to use the special 'djangojs' domain, **not** ``-e js``.
ru: При :ref:`создании файлов сообщений на основе Javascript <creating-message-files-from-js-code>` вам потребуется использовать специальный домен 'djangojs', а **не** опцию ``-e js``.

source: Using Jinja2 templates?
ru: Использование шаблонов Jinja2?

source: :djadmin:`makemessages` doesn't understand the syntax of Jinja2 templates. To extract strings from a project containing Jinja2 templates, use `Message Extracting`_ from Babel_ instead.
ru: :djadmin:`makemessages` не понимает синтаксис шаблонов Jinja2. Чтобы получить строки для перевода из шаблонов Jinja2, используйте из Babel_.

source: Here's an example ``babel.cfg`` configuration file::
ru: Пример файла настроек ``babel.cfg``::

source: Make sure you list all extensions you're using! Otherwise Babel won't recognize the tags defined by these extensions and will ignore Jinja2 templates containing them entirely.
ru: Не забудьте указать все расширения, которые вы используете! Иначе Babel не сможет определить теги из этих расширений и полностью проигнорирует шаблоны Jinja2, которые их содержат.

source: Babel provides similar features to :djadmin:`makemessages`, can replace it in general, and doesn't depend on ``gettext``. For more information, read its documentation about `working with message catalogs`_.
ru: Babel предоставляет функционал аналогичный :djadmin:`makemessages`, и может полностью его заменить, и не зависит от ``gettext``. Подробности читайте в документации библиотеки.

source: No gettext?
ru: Нет gettext?

source: If you don't have the ``gettext`` utilities installed, :djadmin:`makemessages` will create empty files. If that's the case, either install the ``gettext`` utilities or just copy the English message file (``locale/en/LC_MESSAGES/django.po``) if available and use it as a starting point; it's just an empty translation file.
ru: Если у вас не установлены утилиты ``gettext``, тогда :djadmin:`makemessages` создаст пустые файлы. Если вы столкнулись с такой проблемой, тогда либо установите утилиты ``gettext``, либо скопируйте файл сообщений для английского языка (``locale/en/LC_MESSAGES/django.po``), если он доступен, и используйте его как стартовую точку; это просто пустой файл переводов.

source: Working on Windows?
ru: Работаете на Windows?

source: If you're using Windows and need to install the GNU gettext utilities so :djadmin:`makemessages` works, see :ref:`gettext_on_windows` for more information.
ru: Если вы используете Windows и вам надо установить утилиты GNU ``gettext`` для работы :djadmin:`makemessages`, обратитесь к :ref:`gettext_on_windows` за дополнительной информацией.

source: The format of ``.po`` files is straightforward. Each ``.po`` file contains a small bit of metadata, such as the translation maintainer's contact information, but the bulk of the file is a list of **messages** -- simple mappings between translation strings and the actual translated text for the particular language.
ru: Формат ``.po`` файлов несложен. Каждый ``.po`` файл содержит небольшой заголовок, например, контактную информацию ответственного. Но основная часть файла является списком **сообщений** -- простое сопоставление переводимых строк с переводами на конкретный язык.

source: For example, if your Django app contained a translation string for the text ``"Welcome to my site."``, like so::
ru: Например, если ваше Django приложение содержит переводимую строку ``"Welcome to my site."``, так::

source: ...then :djadmin:`django-admin makemessages <makemessages>` will have created a ``.po`` file containing the following snippet -- a message:
ru: ...тогда :djadmin:`django-admin makemessages <makemessages>` создаст ``.po`` файл, содержащий следующие данные -- сообщение:

source: A quick explanation:
ru: Краткое объяснение:

source: ``msgid`` is the translation string, which appears in the source. Don't change it.
ru: ``msgid`` является переводимой строкой, которая определена в исходном коде. Не изменяйте её.

source: ``msgstr`` is where you put the language-specific translation. It starts out empty, so it's your responsibility to change it. Make sure you keep the quotes around your translation.
ru: ``msgstr`` является местом, где вы пишите свой перевод. Обычно оно пустое, именно вы отвечаете за его наполнение. Удостоверьтесь, что вы сохранили кавычки вокруг перевода.

source: As a convenience, each message includes, in the form of a comment line prefixed with ``#`` and located above the ``msgid`` line, the filename and line number from which the translation string was gleaned.
ru: Для удобства, каждое сообщение включает, в виде закомментированной строки, размещенной выше строки ``msgid``, имя файла и номер строки из которой была получена переводимая строка.

source: Long messages are a special case. There, the first string directly after the ``msgstr`` (or ``msgid``) is an empty string. Then the content itself will be written over the next few lines as one string per line. Those strings are directly concatenated. Don't forget trailing spaces within the strings; otherwise, they'll be tacked together without whitespace!
ru: Длинные сообщения являются особым случаем. Так, первая строка сразу после ``msgstr`` (или ``msgid``) всегда пустая. Затем идёт длинный перевод, разбитый на несколько строк. Эти строки будут собраны в одну. Не забывайте вставлять завершающие пробелы, иначе итоговая строка будет собрана без них!

source: Mind your charset
ru: Укажите свою кодировку

source: Due to the way the ``gettext`` tools work internally and because we want to allow non-ASCII source strings in Django's core and your applications, you **must** use UTF-8 as the encoding for your PO files (the default when PO files are created). This means that everybody will be using the same encoding, which is important when Django processes the PO files.
ru: Из-за особенностей внутренней работы утилит пакета ``gettext`` и нашего желания позволить использование не-ASCII символов в строках кода Django и ваших приложений, вы **должны** использовать UTF-8 в качестве кодировки ваших PO файлов (по умолчанию при их создании). Это означает, что все будут использовать одинаковую кодировку, что очень важно в момент, когда Django обрабатывает PO файлы.

source: To reexamine all source code and templates for new translation strings and update all message files for **all** languages, run this::
ru: Для повторного прохода по всему исходному коду и шаблонам в поисках новых переводимых строк и для обновления всех файлов с сообщениями для **всех** языков, выполните это::

source: Compiling message files
ru: Компиляция файлов с сообщениями

source: After you create your message file -- and each time you make changes to it -- you'll need to compile it into a more efficient form, for use by ``gettext``. Do this with the :djadmin:`django-admin compilemessages <compilemessages>` utility.
ru: После того, как вы создали файл с сообщениями, а также после каждого его обновления, вам следует скомпилировать этот файл, чтобы позволить ``gettext`` его использовать. Сделайте это с помощью утилиты :djadmin:`django-admin compilemessages <compilemessages>`.

source: This tool runs over all available ``.po`` files and creates ``.mo`` files, which are binary files optimized for use by ``gettext``. In the same directory from which you ran :djadmin:`django-admin makemessages <makemessages>`, run :djadmin:`django-admin compilemessages <compilemessages>` like this::
ru: Эта команда обрабатывает все имеющиеся ``.po`` файлы и создаёт на их основе ``.mo`` файлы, которые являются бинарными файлами, оптимизированными для использования ``gettext``. Запускать :djadmin:`django-admin compilemessages <compilemessages>` надо в том же каталоге, что и :djadmin:`django-admin makemessages <makemessages>`, вот так::

source: That's it. Your translations are ready for use.
ru: Вот и всё. Ваш перевод готов к использованию.
