Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/topics/i18n/translation.po
Languages: ru

source: This way, you can write applications that include their own translations, and you can override base translations in your project. Or, you can just build a big project out of several apps and put all translations into one big common message file specific to the project you are composing. The choice is yours.
ru: Таким образом, вы можете создавать приложения, которые содержат свои собственные переводы и вы можете изменять базовые переводы в вашем проекте. Или вы можете создать большой проект из нескольких приложений, объединив всё их переводы в единый ресурс. Выбор за вами.

source: All message file repositories are structured the same way. They are:
ru: Все репозитории с файлами сообщений имеют одинаковую структуру:

source: All paths listed in :setting:`LOCALE_PATHS` in your settings file are searched for ``<language>/LC_MESSAGES/django.(po|mo)``
ru: Во всех указанных путях в параметре конфигурации :setting:`LOCALE_PATHS` происходит поиск ``<language>/LC_MESSAGES/django.(po|mo)``

source: To create message files, you use the :djadmin:`django-admin makemessages <makemessages>` tool. And you use :djadmin:`django-admin compilemessages <compilemessages>` to produce the binary ``.mo`` files that are used by ``gettext``.
ru: Для создания файлов сообщений надо использовать :djadmin:`django-admin makemessages <makemessages>`. Для компиляции файлов перевода надо использовать :djadmin:`django-admin compilemessages <compilemessages>`, это приведёт к созданию бинарных ``.mo`` файлов, которые нужны для работы ``gettext``.

source: You can also run :djadmin:`django-admin compilemessages --settings=path.to.settings <compilemessages>` to make the compiler process all the directories in your :setting:`LOCALE_PATHS` setting.
ru: Перечислив в параметре конфигурации :setting:`LOCALE_PATHS` список обрабатываемых каталогов, его можно передать компилятору: :djadmin:`django-admin compilemessages --settings=path.to.settings <compilemessages>`.
