Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/topics/i18n/translation.po
Languages: ru

source: And then later::
ru: А затем::

source: Localized names of languages
ru: Локализованные названия языков

source: The ``get_language_info()`` function provides detailed information about languages::
ru: Функция ``get_language_info()`` предоставляет детальную информацию о языках::

source: The source of the language information is the ``django.conf.locale`` module. Similar access to this information is available for template code. See below.
ru: Источником информации о языках является модуль ``django.conf.locale``. Аналогичный доступ к информации о языках есть и на уровне шаблонов. См. далее.

source: Internationalization: in template code
ru: Интернационализация: в коде шаблонов

source: Translations in :doc:`Django templates </ref/templates/language>` uses two template tags and a slightly different syntax than in Python code. To give your template access to these tags, put ``{% load i18n %}`` toward the top of your template. As with all template tags, this tag needs to be loaded in all templates which use translations, even those templates that extend from other templates which have already loaded the ``i18n`` tag.
ru: Для перевода текста в :doc:`шаблонах Django </ref/templates/language>` используют два шаблонных тега и немного отличающийся от Python синтаксис. Чтобы воспользоваться этими тегами, поместите ``{% load i18n %}`` в начало шаблона. Аналогично остальным шаблонным тегам, данный тег должен быть указан во всех шаблонах, которые применяют механизм переводов, даже в тех, которые расширяются из других шаблонов, имеющих в себе тег ``i18n``.

source: ``trans`` template tag
ru: Шаблонный тег ``trans``

source: The ``{% trans %}`` template tag translates either a constant string (enclosed in single or double quotes) or variable content::
ru: Шаблонный тег ``{% trans %}`` может переводить как обычную строку, заключенную в одинарные или двойные кавычки, так и содержимое переменой::

source: If the ``noop`` option is present, variable lookup still takes place but the translation is skipped. This is useful when "stubbing out" content that will require translation in the future::
ru: При использовании опции ``noop``, обращение к переменной происходит, но перевод не выполняется. Это удобно, когда надо пометить контент для перевода в будущем::

source: Internally, inline translations use an :func:`~django.utils.translation.ugettext` call.
ru: Перевод подстроки выполняется с помощью функции :func:`~django.utils.translation.ugettext`.

source: In case a template var (``myvar`` above) is passed to the tag, the tag will first resolve such variable to a string at run-time and then look up that string in the message catalogs.
ru: В случае передачи шаблонной переменой (см. выше ``myvar``) в тег, тег сначала преобразовывает её в строку, а затем ищет для неё перевод в каталогах сообщений.

source: It's not possible to mix a template variable inside a string within ``{% trans %}``. If your translations require strings with variables (placeholders), use :ttag:`{% blocktrans %}<blocktrans>` instead.
ru: Невозможно использовать шаблонные переменные внутри строки для тега ``{% trans %}``. Если же ваш перевод требует наличия переменой в строке, используйте шаблонный тег :ttag:`{% blocktrans %}<blocktrans>`.

source: If you'd like to retrieve a translated string without displaying it, you can use the following syntax::
ru: Если требуется получать переведённые строки без их отображения, то вы можете использовать следующий синтаксис::

source: In practice you'll use this to get a string you can use in multiple places in a template or so you can use the output as an argument for other template tags or filters::
ru: На практике вы будете применять это для получения строк, которые используются во множестве мест шаблона или должны быть использованы в качестве аргументов для других шаблонных тегов или фильтров::

source: ``{% trans %}`` also supports :ref:`contextual markers<contextual-markers>` using the ``context`` keyword:
ru: Тег ``{% trans %}`` также поддерживает :ref:`контекстные маркеры<contextual-markers>` с помощью атрибута ``context``:

source: ``blocktrans`` template tag
ru: Шаблонный тег ``blocktrans``

source: Contrarily to the :ttag:`trans` tag, the ``blocktrans`` tag allows you to mark complex sentences consisting of literals and variable content for translation by making use of placeholders::
ru: В отличии от тега :ttag:`trans`, тег ``blocktrans`` позволяет отмечать сложные предложения, состоящие из строк и переменных, обеспечивая перевод с помощью подстановок::

source: To translate a template expression -- say, accessing object attributes or using template filters -- you need to bind the expression to a local variable for use within the translation block. Examples::
ru: Для перевода шаблонных выражений, скажем, с доступом к атрибутам объекта или с использованием шаблонных фильтров, потребуется связать выражение с локальной переменной для использования внутри переводимого блока. Примеры::

source: You can use multiple expressions inside a single ``blocktrans`` tag::
ru: Вы можете использовать несколько выражений внутри одного тега ``blocktrans``::

source: The previous more verbose format is still supported: ``{% blocktrans with book|title as book_t and author|title as author_t %}``
ru: Как и прежде, тег поддерживает старое форматирование: ``{% blocktrans with book|title as book_t and author|title as author_t %}``

source: Other block tags (for example ``{% for %}`` or ``{% if %}``) are not allowed inside a ``blocktrans`` tag.
ru: Внутри тега ``blocktrans`` запрещается использовать другие блочные теги (например ``{% for %}`` или ``{% if %}``).

source: If resolving one of the block arguments fails, blocktrans will fall back to the default language by deactivating the currently active language temporarily with the :func:`~django.utils.translation.deactivate_all` function.
ru: Если невозможно вычисление хотя бы одного из аргументов блока, тогда тег переключается на язык по умолчанию с помощью функции :func:`~django.utils.translation.deactivate_all`.

source: This tag also provides for pluralization. To use it:
ru: Этот тег также поддерживает склонение, например:

source: Designate and bind a counter value with the name ``count``. This value will be the one used to select the right plural form.
ru: Определите переменную ``count`` и свяжите с ней значение счётчика. По этому значению будет выбираться форма склонения.

source: Specify both the singular and plural forms separating them with the ``{% plural %}`` tag within the ``{% blocktrans %}`` and ``{% endblocktrans %}`` tags.
ru: Укажите единственную и множественную формы, разделив их с помощью тега ``{% plural %}`` внутри тегов ``{% blocktrans %}`` и ``{% endblocktrans %}``.

source: An example::
ru: Пример::

source: A more complex example::
ru: Более сложный пример::

source: When you use both the pluralization feature and bind values to local variables in addition to the counter value, keep in mind that the ``blocktrans`` construct is internally converted to an ``ungettext`` call. This means the same :ref:`notes regarding ungettext variables <pluralization-var-notes>` apply.
ru: Когда используете и возможности склонения, и присвоение значения локальным переменным в дополнение к значению счетчика, помните, что конструкция ``blocktrans`` на низком уровне преобразовывается в вызов ``ungettext``. Это означает, что к ней применяются :ref:`замечания для переменных ungettext <pluralization-var-notes>`.

source: Reverse URL lookups cannot be carried out within the ``blocktrans`` and should be retrieved (and stored) beforehand::
ru: Обратное разрешение URL не можно быть выполнено внутри ``blocktrans`` и должно выполняться заранее::

source: In practice you'll use this to get a string you can use in multiple places in a template or so you can use the output as an argument for other template tags or filters.
ru: На практике вы будете применять это для получения строк, которые используются во множестве мест шаблона или должны быть использованы в качестве аргументов для других шаблонных тегов или фильтров::

source: ``{% blocktrans %}`` also supports :ref:`contextual markers<contextual-markers>` using the ``context`` keyword:
ru: Тег ``{% blocktrans %}`` также поддерживает :ref:`контекстные маркеры<contextual-markers>` с помощью атрибута ``context``:

source: Another feature ``{% blocktrans %}`` supports is the ``trimmed`` option. This option will remove newline characters from the beginning and the end of the content of the ``{% blocktrans %}`` tag, replace any whitespace at the beginning and end of a line and merge all lines into one using a space character to separate them. This is quite useful for indenting the content of a ``{% blocktrans %}`` tag without having the indentation characters end up in the corresponding entry in the PO file, which makes the translation process easier.
ru: Другой особенностью ``{% blocktrans %}`` является поддержка опции ``trimmed``. Эта опция удаляет символы завершения строки из начала и конца содержимого данного тега, убирая пробелы в начале и конце строк и объединяя все строки в одну, разделяя их пробелами. Это очень удобно при форматировании контента тега с помощью отступов, так как эти пробелы не попадают в содержимое PO файлов, упрощая процесс перевода.

source: For instance, the following ``{% blocktrans %}`` tag::
ru: Например, следующий тег ``{% blocktrans %}``::

source: will result in the entry ``"First sentence. Second paragraph."`` in the PO file, compared to ``"\n First sentence.\n Second sentence.\n"``, if the ``trimmed`` option had not been specified.
ru: выразится в записи``"First sentence. Second paragraph."`` внутри PO файла, что несравнимо с ``"\n First sentence.\n Second sentence.\n"``, в случае когда опция ``trimmed`` не используется.

source: String literals passed to tags and filters
ru: Строки передаваемые в шаблонные теги и фильтры

source: You can translate string literals passed as arguments to tags and filters by using the familiar ``_()`` syntax::
ru: Для перевода строк, передаваемых в теги и фильтры, можно использовать ``_()``::

source: In this case, both the tag and the filter will see the translated string, so they don't need to be aware of translations.
ru: В этом случае, и тег, и фильтр увидят заранее переведённую строку, т.е. им не надо будет беспокоиться о переводе.

source: In this example, the translation infrastructure will be passed the string ``"yes,no"``, not the individual strings ``"yes"`` and ``"no"``. The translated string will need to contain the comma so that the filter parsing code knows how to split up the arguments. For example, a German translator might translate the string ``"yes,no"`` as ``"ja,nein"`` (keeping the comma intact).
ru: В этом примере в модуль перевода будет передана строка ``"yes,no"``, а не отдельные строки ``"yes"`` и ``"no"``. Перевод этой строки должен содержать запятую так, чтобы код парсера фильтра знал как разбить эту строку. Например, немецкий переводчик может переводить строку ``"yes,no"`` как ``"ja, nein"``, сохраняя нетронутой запятую.

source: Comments for translators in templates
ru: Комментарии для переводчиков шаблонов

source: Just like with :ref:`Python code <translator-comments>`, these notes for translators can be specified using comments, either with the :ttag:`comment` tag:
ru: Аналогично случаю с :ref:`кодом на языке Python <translator-comments>`, такие пометки для переводчиков могут быть сделаны с помощью комментариев, например с помощью тега :ttag:`comment`:

source: or with the ``{#`` ... ``#}`` :ref:`one-line comment constructs <template-comments>`:
ru: или с помощью ``{#`` ... ``#}`` :ref:`однострочного комментария <template-comments>`:

source: Just for completeness, these are the corresponding fragments of the resulting ``.po`` file:
ru: Для полноты изложения приведём соответствующий фрагмент ``.po`` файла:

source: Switching language in templates
ru: Переключения языка в шаблоне

source: If you want to select a language within a template, you can use the ``language`` template tag:
ru: Если вы хотите выбрать язык в шаблоне, используйте тег ``language``:

source: While the first occurrence of "Welcome to our page" uses the current language, the second will always be in English.
ru: Первая фраза "Welcome to our page" будет использовать текущий язык, в то время как вторая будет на Английском.

source: Other tags
ru: Другие теги

source: These tags also require a ``{% load i18n %}``.
ru: Эти теги также требуют наличия ``{% load i18n %}`` в шаблоне.

source: ``{% get_available_languages as LANGUAGES %}`` returns a list of tuples in which the first element is the :term:`language code` and the second is the language name (translated into the currently active locale).
ru: Шаблонная конструкция ``{% get_available_languages as LANGUAGES %}`` возвращает список кортежей в которых, первый элемент является :term:`кодом языка`, а второй - его названием (переведённым в язык текущей локали).

source: ``{% get_current_language as LANGUAGE_CODE %}`` returns the current user's preferred language as a string. Example: ``en-us``. See :ref:`how-django-discovers-language-preference`.
ru: Шаблонная конструкция ``{% get_current_language as LANGUAGE_CODE %}`` возвращает предпочитаемый язык текущего пользователя в виде строки. Например: ``en-us``. Подробности смотрите в :ref:`how-django-discovers-language-preference`.

source: ``{% get_current_language_bidi as LANGUAGE_BIDI %}`` returns the current locale's direction. If ``True``, it's a right-to-left language, e.g. Hebrew, Arabic. If ``False`` it's a left-to-right language, e.g. English, French, German, etc.
ru: Шаблонная конструкция ``{% get_current_language_bidi as LANGUAGE_BIDI %}`` возвращает направление текста текущей локали. Если ``True``, то имеем дело с "right-to-left" языком, т.е.: еврейский, арабский. Если ``False``, то это "left-to-right" язык, т.е.: английский, французский, немецкий и так далее.

source: If you enable the ``django.template.context_processors.i18n`` context processor then each ``RequestContext`` will have access to ``LANGUAGES``, ``LANGUAGE_CODE``, and ``LANGUAGE_BIDI`` as defined above.
ru: Если вы активировали контекстный процессор ``django.template.context_processors.i18n``, то каждый экземпляр ``RequestContext`` будет обладать доступом к переменным ``LANGUAGES``, ``LANGUAGE_CODE`` и ``LANGUAGE_BIDI``, описанным выше.

source: You can also retrieve information about any of the available languages using provided template tags and filters. To get information about a single language, use the ``{% get_language_info %}`` tag::
ru: Вы также можете получить информацию о любом доступном языке, используя предоставленные шаблонные теги и фильтры. Для получения информации об одном языке используйте тег ``{% get_language_info %}``::

source: You can then access the information::
ru: Затем вы можете узнать следующее::

source: You can also use the ``{% get_language_info_list %}`` template tag to retrieve information for a list of languages (e.g. active languages as specified in :setting:`LANGUAGES`). See :ref:`the section about the set_language redirect view <set_language-redirect-view>` for an example of how to display a language selector using ``{% get_language_info_list %}``.
ru: Также вы можете использовать шаблонный тег ``{% get_language_info_list %}`` для получения информации о списке языков (т.е. об активных языках, которые указаны в параметре конфигурации :setting:`LANGUAGES`). Обратитесь к :ref:`разделу, описывающему представление для переключения языков <set_language-redirect-view>` для получения примера тог, как показать элемент для выбора языка с помощью ``{% get_language_info_list %}``.

source: In addition to :setting:`LANGUAGES` style list of tuples, ``{% get_language_info_list %}`` supports simple lists of language codes. If you do this in your view:
ru: В дополнение к стилю списка кортежей из параметра конфигурации :setting:`LANGUAGES`, шаблонный тег ``{% get_language_info_list %}`` поддерживает простой список кодов языка. Если вы сделаете следующее в своём представлении:

source: you can iterate over those languages in the template::
ru: вы можете по очереди пройтись по этим языкам в шаблоне::

source: Template filters
ru: Шаблонные фильтры

source: There are also simple filters available for convenience:
ru: Также для удобства есть простые фильтры:

source: ``{{ LANGUAGE_CODE|language_name }}`` ("German")
ru: ``{{ LANGUAGE_CODE|language_name }}`` ("Немецкий")

source: ``{{ LANGUAGE_CODE|language_name_translated }}`` ("německy", when active language is Czech)
ru: ``{{ LANGUAGE_CODE|language_name_translated }}`` ("německy", для чешского языка)

source: Internationalization: in JavaScript code
ru: Интернационализация на уровне кода JavaScript

source: Adding translations to JavaScript poses some problems:
ru: Добавление переводов в JavaScript вызывает ряд проблем:

source: JavaScript code doesn't have access to a ``gettext`` implementation.
ru: JavaScript код не имеет доступа к механизму ``gettext``.

source: JavaScript code doesn't have access to ``.po`` or ``.mo`` files; they need to be delivered by the server.
ru: JavaScript код не имеет доступа к файлам ``.po`` или ``.mo``, их надо передавать с сервера.

source: The translation catalogs for JavaScript should be kept as small as possible.
ru: Каталог с переводами для JavaScript должен иметь минимально возможный размер.

source: Django provides an integrated solution for these problems: It passes the translations into JavaScript, so you can call ``gettext``, etc., from within JavaScript.
ru: Django предоставляет интегрированное решение для этих проблем. Перевод внедряется в JavaScript, т.е. вы можете использовать ``gettext`` и остальные функции в JavaScript коде.

source: The ``javascript_catalog`` view
ru: Представление ``javascript_catalog``

source: The main solution to these problems is the :meth:`django.views.i18n.javascript_catalog` view, which sends out a JavaScript code library with functions that mimic the ``gettext`` interface, plus an array of translation strings. Those translation strings are taken from applications or Django core, according to what you specify in either the ``info_dict`` or the URL. Paths listed in :setting:`LOCALE_PATHS` are also included.
ru: Основным решением описанных проблем является представление :meth:`django.views.i18n.javascript_catalog`, которое выдаёт библиотеку с кодом JavaScript, функции которой реализуют интерфейс ``gettext``, а также массив переведённых строк. Переведённые строки собираются из приложений или Django, в зависимости от того, что вы указали ``info_dict`` или URL. Пути, указанные в параметре конфигурации :setting:`LOCALE_PATHS`, также принимаются во внимание.

source: You hook it up like this::
ru: Вы можете использовать это так::

source: Each string in ``packages`` should be in Python dotted-package syntax (the same format as the strings in :setting:`INSTALLED_APPS`) and should refer to a package that contains a ``locale`` directory. If you specify multiple packages, all those catalogs are merged into one catalog. This is useful if you have JavaScript that uses strings from different applications.
ru: Каждая строка в ``packages`` должна быть представлена в точечном формате Python (формат аналогичен формату параметра конфигурации :setting:`INSTALLED_APPS`) и должна ссылаться на пакет, у которого есть каталог ``locale``. Если вы указываете несколько пакетов, все их каталоги сообщений будут собраны в единый каталог. Это полезно, если ваш JavaScript код использует строки из нескольких приложений.

source: The precedence of translations is such that the packages appearing later in the ``packages`` argument have higher precedence than the ones appearing at the beginning, this is important in the case of clashing translations for the same literal.
ru: Приоритет переводов таков, что пакеты, определённые позже, имеют более высокий приоритет, чем определённые ранее. Это важно, если переводы совпадают в разных приложениях.

source: By default, the view uses the ``djangojs`` gettext domain. This can be changed by altering the ``domain`` argument.
ru: По умолчанию, представление использует домен ``djangojs`` (речь идёт о домене gettext). Это поведение может быть изменено с помощью аргумента ``domain``.

source: You can make the view dynamic by putting the packages into the URL pattern::
ru: Вы можете сделать представление динамическим, поместив пакеты в шаблон URL::

source: With this, you specify the packages as a list of package names delimited by '+' signs in the URL. This is especially useful if your pages use code from different apps and this changes often and you don't want to pull in one big catalog file. As a security measure, these values can only be either ``django.conf`` or any package from the :setting:`INSTALLED_APPS` setting.
ru: Используя это, вы определяете пакеты в виде списка их имён, разделённых с помощью знака плюс в URL. Это особенно полезно, если ваши страницы используют код из разных приложений, всегда из разных, и вам не хочется собирать весь перевод в один большой каталог. Для безопасности, все эти значения могут быть взяты либо из ``django.conf``, либо из любого пакета, определённого в параметре конфигурации :setting:`INSTALLED_APPS`.

source: You can also split the catalogs in multiple URLs and load them as you need in your sites::
ru: Вы также можете разделить каталоги на несколько URL-ов и загружать их отдельно при необходимости::

source: If you use more than one ``javascript_catalog`` on a site and some of them define the same strings, the strings in the catalog that was loaded last take precedence.
ru: Если вы используете несколько ``javascript_catalog``, и они содержат одинаковые строки, будет использоваться перевод из последнего каталога.

source: The JavaScript translations found in the paths listed in the :setting:`LOCALE_PATHS` setting are also always included. To keep consistency with the translations lookup order algorithm used for Python and templates, the directories listed in :setting:`LOCALE_PATHS` have the highest precedence with the ones appearing first having higher precedence than the ones appearing later.
ru: Переводы JavaScript, найденные по путям, перечисленным в параметре конфигурации :setting:`LOCALE_PATHS` всегда используются. Для сохранения целостности в работе алгоритма поиска переводов, используемом для Python и шаблонов, каталоги, указанные в параметре конфигурации :setting:`LOCALE_PATHS` имеют убывающий приоритет от начала к концу.

source: Using the JavaScript translation catalog
ru: Использование каталога переводов JavaScript

source: To use the catalog, just pull in the dynamically generated script like this:
ru: Для использования этого каталога, просто запросите динамически генерируемый скрипт, как показано ниже:

source: This uses reverse URL lookup to find the URL of the JavaScript catalog view. When the catalog is loaded, your JavaScript code can use the following methods:
ru: Здесь используется запрос на поиск URL для представления, генерирующего JavaScript-каталог. После загрузки каталога, ваш JavaScript код может использовать следующие методы::

source: The ``gettext`` function behaves similarly to the standard ``gettext`` interface within your Python code::
ru: Функция ``gettext`` работает аналогично стандартной функции ``gettext`` Python::

source: The ``ngettext`` function provides an interface to pluralize words and phrases::
ru: Функция ``ngettext`` позволяет получать слова и предложения в множественной формеы::
