Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/topics/i18n/translation.po
Languages: ru

source: If you're using Windows and need to install the GNU gettext utilities so :djadmin:`django-admin compilemessages <compilemessages>` works see :ref:`gettext_on_windows` for more information.
ru: Если вы используете Windows и желаете установить утилиты GNU ``gettext`` для работы :djadmin:`django-admin compilemessages <compilemessages>`, обратитесь к :ref:`gettext_on_windows` для подробностей.

source: .po files: Encoding and BOM usage.
ru: .po файлы: Кодировка и использование BOM

source: Django only supports ``.po`` files encoded in UTF-8 and without any BOM (Byte Order Mark) so if your text editor adds such marks to the beginning of files by default then you will need to reconfigure it.
ru: Django поддерживает ``.po`` файлы только в кодировке UTF-8 и без меток BOM (Byte Order Mark). Если ваш редактор по умолчанию добавляет такие метки в начало файла, вам следует изменить это поведение.

source: Creating message files from JavaScript source code
ru: Создание файлов сообщений из JavaScript кода

source: You create and update the message files the same way as the other Django message files -- with the :djadmin:`django-admin makemessages <makemessages>` tool. The only difference is you need to explicitly specify what in gettext parlance is known as a domain in this case the ``djangojs`` domain, by providing a ``-d djangojs`` parameter, like this::
ru: Вы создаёте и обновляете файлы сообщений аналогично обычным файлам, т.е. с помощью команды :djadmin:`django-admin makemessages <makemessages>`. С единственной разницей в том, что надо указать домен ``djangojs``, добавив параметр ``-d djangojs``, вот так::

source: This would create or update the message file for JavaScript for German. After updating message files, just run :djadmin:`django-admin compilemessages <compilemessages>` the same way as you do with normal Django message files.
ru: Этот пример создаёт или обновляет файл сообщений для JavaScript для немецкого языка. После обновления файлов сообщений просто выполните :djadmin:`django-admin compilemessages <compilemessages>`, как вы это делаете для обычных файлов сообщений.

source: ``gettext`` on Windows
ru: ``gettext`` на Windows

source: You may also use ``gettext`` binaries you have obtained elsewhere, so long as the ``xgettext --version`` command works properly. Do not attempt to use Django translation utilities with a ``gettext`` package if the command ``xgettext --version`` entered at a Windows command prompt causes a popup window saying "xgettext.exe has generated errors and will be closed by Windows".
ru: Вы также можете использовать бинарники ``gettext``, взятые где-то, если команда ``xgettext --version`` работает правильно. Не пытайтесь выполнять команды Django, использующие пакет ``gettext``, если команда ``xgettext --version``, введённая в консоли Windows, выбрасывает окно с текстом "xgettext.exe has generated errors and will be closed by Windows".

source: Customizing the ``makemessages`` command
ru: Настройка команды ``makemessages``

source: If you want to pass additional parameters to ``xgettext``, you need to create a custom :djadmin:`makemessages` command and override its ``xgettext_options`` attribute::
ru: Если вам требуется передать дополнительные параметры в ``xgettext``, вам следует создать свою команду :djadmin:`makemessages` и переопределить её атрибут ``xgettext_options``::

source: If you need more flexibility, you could also add a new argument to your custom :djadmin:`makemessages` command::
ru: Если вам необходим больший контроль, вы также можете добавить новый аргумент в вашу реализацию команды :djadmin:`makemessages`::

source: Miscellaneous
ru: Разное

source: The ``set_language`` redirect view
ru: Перенаправляющее представление ``set_language``

source: As a convenience, Django comes with a view, :func:`django.views.i18n.set_language`, that sets a user's language preference and redirects to a given URL or, by default, back to the previous page.
ru: Для удобства Django поставляется с представлением :func:`django.views.i18n.set_language`, которое устанавливает язык для пользователя и перенаправляет его на указанный URL или, по умолчанию, обратно на ту же страницу.

source: Activate this view by adding the following line to your URLconf::
ru: Активируйте это представление, добавив следующую строку в конфигурацию URL::

source: (Note that this example makes the view available at ``/i18n/setlang/``.)
ru: (Следует отметить, что данный пример привязывает представление к ``/i18n/setlang/``.)

source: Make sure that you don't include the above URL within :func:`~django.conf.urls.i18n.i18n_patterns` - it needs to be language-independent itself to work correctly.
ru: Удостоверьтесь, что вы не подключили вышеприведённый URL внутрь :func:`~django.conf.urls.i18n.i18n_patterns`, это представление не должно зависеть от текущего языка.

source: The view expects to be called via the ``POST`` method, with a ``language`` parameter set in request. If session support is enabled, the view saves the language choice in the user's session. Otherwise, it saves the language choice in a cookie that is by default named ``django_language``. (The name can be changed through the :setting:`LANGUAGE_COOKIE_NAME` setting.)
ru: Представление должно вызываться через метод ``POST``, в запросе должен быть установлен параметр ``language``. При активированной поддержке сессий, представление сохраняет выбор пользователя в его сессии. Иначе выбранный язык сохраняется в cookie с именем по умолчанию ``django_language``. (Имя может быть изменено через параметр конфигурации :setting:`LANGUAGE_COOKIE_NAME`.)

source: Here's example HTML template code:
ru: Приведём пример HTML кода шаблона:

source: In this example, Django looks up the URL of the page to which the user will be redirected in the ``redirect_to`` context variable.
ru: В этом примере Django ищет URL страницы, на которую будет перенаправлен пользователь, в контекстной переменной ``redirect_to``.

source: Explicitly setting the active language
ru: Явное указание активного языка

source: You may want to set the active language for the current session explicitly. Perhaps a user's language preference is retrieved from another system, for example. You've already been introduced to :func:`django.utils.translation.activate()`. That applies to the current thread only. To persist the language for the entire session, also modify :data:`~django.utils.translation.LANGUAGE_SESSION_KEY` in the session::
ru: Вам может потребоваться явно указать активный язык для текущей сессии. Например, возможно, что информация об языке, предпочитаемым пользователем, будет извлекаться из другой системы. Вы уже встречались с функцией :func:`django.utils.translation.activate()`. Она влияет только на текущий поток. Для указания языка для всей сессии надо модифицировать :data:`~django.utils.translation.LANGUAGE_SESSION_KEY`::

source: You would typically want to use both: :func:`django.utils.translation.activate()` will change the language for this thread, and modifying the session makes this preference persist in future requests.
ru: Вам обычно потребуется использовать оба подхода: вызывать :func:`django.utils.translation.activate()` для изменения языка внутри потока и изменять сессию для влияния на последующие запросы.

source: If you are not using sessions, the language will persist in a cookie, whose name is configured in :setting:`LANGUAGE_COOKIE_NAME`. For example::
ru: Если вы не используете сессии, то активный язык будет сохранён в куке, имя которой определяется с помощью :setting:`LANGUAGE_COOKIE_NAME`. Например::

source: Using translations outside views and templates
ru: Использование перевода вне представлений и шаблонов

source: While Django provides a rich set of i18n tools for use in views and templates, it does not restrict the usage to Django-specific code. The Django translation mechanisms can be used to translate arbitrary texts to any language that is supported by Django (as long as an appropriate translation catalog exists, of course). You can load a translation catalog, activate it and translate text to language of your choice, but remember to switch back to original language, as activating a translation catalog is done on per-thread basis and such change will affect code running in the same thread.
ru: Несмотря на то, что Django предоставляет богатый набор инструментов интернационализации представлений и шаблонов, она не ограничивает их использование в другом коде. Механизмы перевода Django могут быть использованы для перевода отдельных текстов на любой из языков, поддерживаемых Django (т.е. соответствующий каталог с переводами есть в наличии). Вы можете загрузить каталог переводов, активировать его и переводить текст на нужный язык, но не забудьте вернуться на оригинальный язык, так как активация каталога переводов выполняется на уровне потока и такое изменение будет влиять на код, работающий в том же потоке.

source: Calling this function with the value 'de' will give you ``"Willkommen"``, regardless of :setting:`LANGUAGE_CODE` and language set by middleware.
ru: Вызов этой функции с параметром 'de' вернёт ``"Willkommen"``, независимо от значения параметра конфигурации :setting:`LANGUAGE_CODE` и языка, установленного через мидлварь.

source: Functions of particular interest are :func:`django.utils.translation.get_language()` which returns the language used in the current thread, :func:`django.utils.translation.activate()` which activates a translation catalog for the current thread, and :func:`django.utils.translation.check_for_language()` which checks if the given language is supported by Django.
ru: Вас могут заинтересовать функции :func:`django.utils.translation.get_language()`, которая возвращает язык, используемый в текущем потоке, :func:`django.utils.translation.activate()`, которая активирует каталог переводов для текущего потока, и :func:`django.utils.translation.check_for_language()`, которая проверяет, поддерживается ли данный язык Django.

source: To help write more concise code, there is also a context manager :func:`django.utils.translation.override()` that stores the current language on enter and restores it on exit. With it, the above example becomes::
ru: Для удобства вы можете также использовать контекстный менеджер :func:`django.utils.translation.override()`, который сохраняет текущий язык при входе и восстанавливает его при выходе из блока. Код выше будет выглядеть следующим образом::

source: Language cookie
ru: Кука для языка

source: A number of settings can be used to adjust language cookie options:
ru: Ряд настроек может быть использован для управления опциями куки языка:

source: Implementation notes
ru: Замечания по реализации

source: Specialties of Django translation
ru: Особенности перевода Django

source: Django's translation machinery uses the standard ``gettext`` module that comes with Python. If you know ``gettext``, you might note these specialties in the way Django does translation:
ru: Механизм перевода Django использует стандартный модуль ``gettext``, идущей в поставке Python. Если вы знакомы с ``gettext``, вам может быть интересен подход Django к его использованию:

source: The string domain is ``django`` or ``djangojs``. This string domain is used to differentiate between different programs that store their data in a common message-file library (usually ``/usr/share/locale/``). The ``django`` domain is used for Python and template translation strings and is loaded into the global translation catalogs. The ``djangojs`` domain is only used for JavaScript translation catalogs to make sure that those are as small as possible.
ru: Строковый домен может быть ``django`` или ``djangojs``. Он используется для идентификации ресурсов множества приложений, которые хранятся в общей библиотеке(обычно ``/usr/share/locale/``). Домен ``django`` используется для перевода текстовых ресурсов Python кода и шаблонов, загружается в общие каталоги перевода. Домен ``djangojs`` используется только для каталогов с текстовыми ресурсами для JavaScript, чтобы сделать их мелкими, насколько это возможно.

source: Django doesn't use ``xgettext`` alone. It uses Python wrappers around ``xgettext`` and ``msgfmt``. This is mostly for convenience.
ru: Django не использует только ``xgettext``. Она использует Python-обёртки для ``xgettext`` и ``msgfmt``. Так сделано для удобства.

source: How Django discovers language preference
ru: Как Django определяет языковую настройку

source: Once you've prepared your translations -- or, if you just want to use the translations that come with Django -- you'll just need to activate translation for your app.
ru: После подготовки своего перевода, или если вы желаете использовать перевод, поставляемый с Django, надо просто активировать перевод для своего приложения.

source: Behind the scenes, Django has a very flexible model of deciding which language should be used -- installation-wide, for a particular user, or both.
ru: Django обладает очень гибкой моделью принятия решения о том, какой язык следует использовать: на уровне проекта, для отдельного пользователя или в обоих случаях.

source: To set an installation-wide language preference, set :setting:`LANGUAGE_CODE`. Django uses this language as the default translation -- the final attempt if no better matching translation is found through one of the methods employed by the locale middleware (see below).
ru: Глобально язык определяется через параметр конфигурации :setting:`LANGUAGE_CODE`. Django использует указанный язык в качестве основного и обращается к нему, если больше никакой не найден мидлваром локализации(смотрите ниже).

source: If all you want is to run Django with your native language all you need to do is set :setting:`LANGUAGE_CODE` and make sure the corresponding :term:`message files <message file>` and their compiled versions (``.mo``) exist.
ru: Если вам просто нужно запустить проект на определенном языке, укажите его в :setting:`LANGUAGE_CODE` и убедитесь, что существует необходимый :term:`файл перевода <message file>` и его скомпилированная версия (``.mo``).

source: If you want to let each individual user specify which language they prefer, then you also need to use the ``LocaleMiddleware``. ``LocaleMiddleware`` enables language selection based on data from the request. It customizes content for each user.
ru: Если вам надо позволить отдельным пользователям указывать предпочитаемый язык, используйте ``LocaleMiddleware``. ``LocaleMiddleware`` обеспечивает выбор языка по данным из запроса. Эта мидлварь настраивает контент под каждого пользователя.

source: Make sure it's one of the first middlewares installed.
ru: Удостоверьтесь, что она указана одной из первых мидлварей.

source: It should come after ``SessionMiddleware``, because ``LocaleMiddleware`` makes use of session data. And it should come before ``CommonMiddleware`` because ``CommonMiddleware`` needs an activated language in order to resolve the requested URL.
ru: Она должна идти после ``SessionMiddleware``, так как ``LocaleMiddleware`` использует сессию. И она должна идти до ``CommonMiddleware``, так как ``CommonMiddleware`` нуждается в активном языке для определения запрошенного URL.

source: If you use ``CacheMiddleware``, put ``LocaleMiddleware`` after it.
ru: Если вы используете ``CacheMiddleware``, поместите ``LocaleMiddleware`` после неё.

source: (For more on middleware, see the :doc:`middleware documentation </topics/http/middleware>`.)
ru: (Для получения подробностей по мидлварям обратитесь к :doc:`соответствующей документации </topics/http/middleware>`.)

source: ``LocaleMiddleware`` tries to determine the user's language preference by following this algorithm:
ru: ``LocaleMiddleware`` пытается определить язык пользователя, используя следующий алгоритм:

source: First, it looks for the language prefix in the requested URL. This is only performed when you are using the ``i18n_patterns`` function in your root URLconf. See :ref:`url-internationalization` for more information about the language prefix and how to internationalize URL patterns.
ru: Сначала, проверяется наличие префикса в запрошенном URL. Эта проверка выполняется только если вы используете функцию ``i18n_patterns`` в корневом URLconf. Обратитесь к :ref:`url-internationalization` для получения подробностей по языковым префиксам и интернационализации шаблонов URL.

source: Failing that, it looks for the :data:`~django.utils.translation.LANGUAGE_SESSION_KEY` key in the current user's session.
ru: Если с префиксом не получилось, то проверяется ключ :data:`~django.utils.translation.LANGUAGE_SESSION_KEY` сессии текущего пользователя.

source: Failing that, it looks for a cookie.
ru: Если и с сессией не сложилось, то принимается за cookie.

source: The name of the cookie used is set by the :setting:`LANGUAGE_COOKIE_NAME` setting. (The default name is ``django_language``.)
ru: Имя cookie определяется параметром конфигурации :setting:`LANGUAGE_COOKIE_NAME`. (Название про умолчанию ``django_language``.)

source: Failing that, it looks at the ``Accept-Language`` HTTP header. This header is sent by your browser and tells the server which language(s) you prefer, in order by priority. Django tries each language in the header until it finds one with available translations.
ru: Если опять не повезло, то заглядывает в HTTP заголовок ``Accept-Language``. Этот заголовок отправляется браузером, чтобы указать серверу, какой язык вы предпочитаете, в порядке приоритета. Django проверяет наличие поддержки каждого языка из заголовка.

source: Failing that, it uses the global :setting:`LANGUAGE_CODE` setting.
ru: Если совсем всё плохо, тогда используется значение параметра конфигурации :setting:`LANGUAGE_CODE`.

source: Notes:
ru: Замечания:

source: In each of these places, the language preference is expected to be in the standard :term:`language format<language code>`, as a string. For example, Brazilian Portuguese is ``pt-br``.
ru: Везде подразумевается, что значение языка указано в стандартном :term:`формате <language code>`, в виде строки. Например, для бразильского варианта португальского языка это будет ``pt-br``.

source: If a base language is available but the sublanguage specified is not, Django uses the base language. For example, if a user specifies ``de-at`` (Austrian German) but Django only has ``de`` available, Django uses ``de``.
ru: Если базовый язык доступен, а вариант нет, то Django будет использовать базовый язык. Например, если пользователь указал ``de-at`` (австрийский вариант немецкого), но у Django есть только ``de``, то именно он и будет использоваться.

source: Only languages listed in the :setting:`LANGUAGES` setting can be selected. If you want to restrict the language selection to a subset of provided languages (because your application doesn't provide all those languages), set :setting:`LANGUAGES` to a list of languages. For example::
ru: Выбор может производиться только из списка, определенного параметром конфигурации :setting:`LANGUAGES`. Если вам надо ограничить диапазон имеющихся языков (потому что ваше приложение не имеет столько переводов), укажите в :setting:`LANGUAGES` список поддерживаемых языков. Например::

source: This example restricts languages that are available for automatic selection to German and English (and any sublanguage, like de-ch or en-us).
ru: Данный пример ограничивает число доступных для автоматического выбора языков немецким и английским языками (и любыми диалектами, например, de-ch или en-us).

source: If you define a custom :setting:`LANGUAGES` setting, as explained in the previous bullet, you can mark the language names as translation strings -- but use :func:`~django.utils.translation.ugettext_lazy` instead of :func:`~django.utils.translation.ugettext` to avoid a circular import.
ru: Если вы определяете параметр конфигурации :setting:`LANGUAGES`, как было показано выше, вы можете помечать имена языков как переводимые. Но следует использовать :func:`~django.utils.translation.ugettext_lazy` вместо :func:`~django.utils.translation.ugettext`, чтобы исключить циклический импорт.

source: Here's a sample settings file::
ru: Приведёт пример файла настроек::

source: Once ``LocaleMiddleware`` determines the user's preference, it makes this preference available as ``request.LANGUAGE_CODE`` for each :class:`~django.http.HttpRequest`. Feel free to read this value in your view code. Here's a simple example::
ru: После того, как ``LocaleMiddleware`` определяет предпочитаемый язык, она делает его доступным через ``request.LANGUAGE_CODE`` для каждого запроса :class:`~django.http.HttpRequest`. Вы можете спокойно его использовать в коде своих представлений. Вот простой пример::

source: Note that, with static (middleware-less) translation, the language is in ``settings.LANGUAGE_CODE``, while with dynamic (middleware) translation, it's in ``request.LANGUAGE_CODE``.
ru: Следует отметить, что для статичного перевода (без мидлвари) язык надо брать из ``settings.LANGUAGE_CODE``, а для динамичного перевода (с мидлварью) — из ``request.LANGUAGE_CODE``.

source: How Django discovers translations
ru: Как Django находит переводы

source: At runtime, Django builds an in-memory unified catalog of literals-translations. To achieve this it looks for translations by following this algorithm regarding the order in which it examines the different file paths to load the compiled :term:`message files <message file>` (``.mo``) and the precedence of multiple translations for the same literal:
ru: Во время своей работы Django создаёт в памяти унифицированный каталог с переводами. Для этого он использует следующий алгоритм, учитывая порядок нахождения путей для загрузки :term:`файлов сообщений <message file>` (``.mo``) и приоритет множества перевода для одного слова:

source: The directories listed in :setting:`LOCALE_PATHS` have the highest precedence, with the ones appearing first having higher precedence than the ones appearing later.
ru: Каталоги, указанные в :setting:`LOCALE_PATHS`, имеют повышенный приоритет, список представлен по убыванию приоритета.

source: Then, it looks for and uses if it exists a ``locale`` directory in each of the installed apps listed in :setting:`INSTALLED_APPS`. The ones appearing first have higher precedence than the ones appearing later.
ru: Затем происходит поиск каталога ``locale`` в каждом установленном приложении, указанном в :setting:`INSTALLED_APPS`. Тут тоже приоритет идёт по убыванию.

source: Finally, the Django-provided base translation in ``django/conf/locale`` is used as a fallback.
ru: Наконец, используется базовый перевод Django из ``django/conf/locale``.

source: The translations for literals included in JavaScript assets are looked up following a similar but not identical algorithm. See the :ref:`javascript_catalog view documentation <javascript_catalog-view>` for more details.
ru: Поиск переводов для JavaScript строк происходит аналогично, но с небольшими отличиями. Обратитесь к :ref:`документации на представление javascript_catalog <javascript_catalog-view>` для подробностей.

source: In all cases the name of the directory containing the translation is expected to be named using :term:`locale name` notation. E.g. ``de``, ``pt_BR``, ``es_AR``, etc.
ru: Имя каталога, содержащего перевод, должно быть названо в соответствии соглашению :term:`по наименованию локалей`. Т.е. ``de``, ``pt_BR``, ``es_AR`` и так далее.
