Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/topics/auth/customizing.po
Languages: ru

source: Customizing authentication in Django
ru: Расширяем модуль аутентификации Django

source: The authentication that comes with Django is good enough for most common cases, but you may have needs not met by the out-of-the-box defaults. To customize authentication to your projects needs involves understanding what points of the provided system are extensible or replaceable. This document provides details about how the auth system can be customized.
ru: Система аутентификации, входящая в состав Django, отлично подойдёт для решения многих типичных задач, однако вам может не хватить функциональности, предоставляемой "из коробки". Для того, чтобы настроить аутентификацию под требования своего проекта сначала необходимо разобраться какие части этой системы могут быть расширены или заменены. В этом документе мы детально рассмотрим возможности настройки системы аутентификации.

source: :ref:`Authentication backends <authentication-backends>` provide an extensible system for when a username and password stored with the User model need to be authenticated against a different service than Django's default.
ru: :ref:`Бэкенды аутентификации <authentication-backends>` обеспечивают расширяемую систему для аутентификации в разных сервисах, в дополнение к стандартной для Django системе аутентификации через модель User.

source: You can give your models :ref:`custom permissions <custom-permissions>` that can be checked through Django's authorization system.
ru: Вы можете назначить вашим моделям собственные :ref:`права доступа <custom-permissions>`, которые могут быть проверены системой аутентификации Django.

source: You can :ref:`extend <extending-user>` the default User model, or :ref:`substitute <auth-custom-user>` a completely customized model.
ru: Вы можете :ref:`расширить <extending-user>` стандартную модель User или полностью :ref:`заменить <auth-custom-user>` эту модель.

source: Other authentication sources
ru: Другие сервисы аутентификации

source: There may be times you have the need to hook into another authentication source -- that is, another source of usernames and passwords or authentication methods.
ru: Бывают случаи когда вам необходимо подключиться к сторонним сервисам аутентификации, использующим альтернативные источники имён пользователей, паролей или иные методы аутентификации.

source: For example, your company may already have an LDAP setup that stores a username and password for every employee. It'd be a hassle for both the network administrator and the users themselves if users had separate accounts in LDAP and the Django-based applications.
ru: Например, в вашей компании используется система LDAP для хранения логинов и паролей для каждого сотрудника. Иметь разные аккаунты для LDAP и Django приложений не очень удобно, как для пользователей, так и для администраторов сети.

source: So, to handle situations like this, the Django authentication system lets you plug in other authentication sources. You can override Django's default database-based scheme, or you can use the default system in tandem with other systems.
ru: В такой ситуации возможно интегрировать систему аутентификации Django с другой системой аутентификации. Вы можете переопределить стандартную систему аутентификации Django или объединить её с другими системами.

source: See the :ref:`authentication backend reference <authentication-backends-reference>` for information on the authentication backends included with Django.
ru: Обратитесь к :ref:`справочнику по бренду аутентификации <authentication-backends-reference>` для информации по бэкендам аутентификации, поставляемым с Django.

source: Specifying authentication backends
ru: Бэкенды аутентификации

source: Behind the scenes, Django maintains a list of "authentication backends" that it checks for authentication. When somebody calls :func:`django.contrib.auth.authenticate()` -- as described in :ref:`How to log a user in <how-to-log-a-user-in>` -- Django tries authenticating across all of its authentication backends. If the first authentication method fails, Django tries the second one, and so on, until all backends have been attempted.
ru: Система аутентификации Django поддерживает список бэкендов, которые она применяет в свой работе. Когда кто-то вызывает :func:`django.contrib.auth.authenticate()` -- в соответствии с документом :ref:`Как авторизовать пользователя <how-to-log-a-user-in>` -- Django пробует авторизовать пользователя с помощью бекэндов из списка. Если первый бэкенд не подошёл, Django пробует использовать второй и так далее пока не кончится список.

source: By default, :setting:`AUTHENTICATION_BACKENDS` is set to::
ru: По умолчанию, :setting:`AUTHENTICATION_BACKENDS` устанавливается как:

source: That's the basic authentication backend that checks the Django users database and queries the built-in permissions. It does not provide protection against brute force attacks via any rate limiting mechanism. You may either implement your own rate limiting mechanism in a custom auth backend, or use the mechanisms provided by most Web servers.
ru: Это стандартный бэкенд аутентификации Django, который ищет пользователей в базе данных и определяет их базовые права доступа .Этот модуль не поддерживает защиту от перебора паролей путём какого-либо ограничивающего механизма. Вы можете либо реализовать свой собственный механизм ограничения или использовать механизм предоставляемый многими веб серверами.

source: The order of :setting:`AUTHENTICATION_BACKENDS` matters, so if the same username and password is valid in multiple backends, Django will stop processing at the first positive match.
ru: Также имеет значение порядок перечисления бэкендов в параметре конфигурации :setting:`AUTHENTICATION_BACKENDS`. Таким образом, если один логин и пароль совпадает в нескольких бэкендах аутентификации, то Django прекратит проверку на первом из них.

source: If a backend raises a :class:`~django.core.exceptions.PermissionDenied` exception, authentication will immediately fail. Django won't check the backends that follow.
ru: Если какой-либо бэкенд вызовет исключение :class:`~django.core.exceptions.PermissionDenied`, процесс аутентификации немедленно остановится. В этом случае Django не будет пытаться проверить бэкенды, следующие по списку далее.

source: Once a user has authenticated, Django stores which backend was used to authenticate the user in the user's session, and re-uses the same backend for the duration of that session whenever access to the currently authenticated user is needed. This effectively means that authentication sources are cached on a per-session basis, so if you change :setting:`AUTHENTICATION_BACKENDS`, you'll need to clear out session data if you need to force users to re-authenticate using different methods. A simple way to do that is simply to execute ``Session.objects.all().delete()``.
ru: После успешной аутентификации пользователя Django сохраняет в сессии указание на соответствующий бэкенд и повторно использует его всё время жизни сессии при обращении к текущему пользователю. Это показывает, что источники аутентификации кэшируются на уровне сессий, следовательно, при изменении параметра конфигурации :setting:`AUTHENTICATION_BACKENDS` вам потребуется очистить сессию при необходимости заставить пользователей выполнить аутентификацию другими методами. Проще всего это сделать с помощью ``Session.objects.all().delete()``.

source: Writing an authentication backend
ru: Создание бэкенда аутентификации

source: An authentication backend is a class that implements two required methods: ``get_user(user_id)`` and ``authenticate(**credentials)``, as well as a set of optional permission related :ref:`authorization methods <authorization_methods>`.
ru: Бэкенд аутентификации - это класс, реализующий два обязательных метода: ``get_user(user_id)`` и ``authenticate(**credentials)``, а так же ряд необязательных прав, относящихся к :ref:`методам аутентификации <authorization_methods>`.

source: The ``get_user`` method takes a ``user_id`` -- which could be a username, database ID or whatever, but has to be the primary key of your ``User`` object -- and returns a ``User`` object.
ru: Метод ``get_user`` принимает параметр ``user_id``, который может быть как именем пользователя, так и ID базы данных или чем-либо ещё, но передаваемое значение обязательно должно быть первичным ключом модели ``User``, и возвращает объект ``User``.

source: The ``authenticate`` method takes credentials as keyword arguments. Most of the time, it'll just look like this::
ru: Метод ``authenticate`` принимает учётные данные в виде именованных аргументов. В основном, это будет выглядеть так::

source: But it could also authenticate a token, like so::
ru: Также метод может принимать токен, вот так::

source: Either way, ``authenticate`` should check the credentials it gets, and it should return a ``User`` object that matches those credentials, if the credentials are valid. If they're not valid, it should return ``None``.
ru: В любом случае, метод ``authenticate`` должен проверить переданные ему учётные данные и вернуть объект ``User``, соответствующий этим данным в случае их корректности. В другом случае он должен вернуть ``None``.

source: Here's an example backend that authenticates against a username and password variable defined in your ``settings.py`` file and creates a Django ``User`` object the first time a user authenticates::
ru: Ниже представлен пример бэкенда, который выполняет аутентификацию относительно переменных имени и пароля пользователя, определённых в файле ``settings.py`` и создаёт объект ``User`` при первой аутентификации пользователя::

source: Handling authorization in custom backends
ru: Управление методами авторизации в своих бэкендах

source: Custom auth backends can provide their own permissions.
ru: Бэкенды аутентификации могут представлять дополнительные права доступа.

source: The user model will delegate permission lookup functions (:meth:`~django.contrib.auth.models.User.get_group_permissions()`, :meth:`~django.contrib.auth.models.User.get_all_permissions()`, :meth:`~django.contrib.auth.models.User.has_perm()`, and :meth:`~django.contrib.auth.models.User.has_module_perms()`) to any authentication backend that implements these functions.
ru: Модель пользователя передаст функции по проверке прав (:meth:`~django.contrib.auth.models.User.get_group_permissions()`, :meth:`~django.contrib.auth.models.User.get_all_permissions()`, :meth:`~django.contrib.auth.models.User.has_perm()` и :meth:`~django.contrib.auth.models.User.has_module_perms()`) любому бэкенду аутентификации, который их реализует.

source: The permissions given to the user will be the superset of all permissions returned by all backends. That is, Django grants a permission to a user that any one backend grants.
ru: Предоставленные пользователю права являются набором прав, представленных пользователю всеми бэкендами. Следовательно, Django представляет пользователю права, которые выдал хотя бы один бэкенд.

source: If a backend raises a :class:`~django.core.exceptions.PermissionDenied` exception in :meth:`~django.contrib.auth.models.User.has_perm()` or :meth:`~django.contrib.auth.models.User.has_module_perms()`, the authorization will immediately fail and Django won't check the backends that follow.
ru: Если бэкенд вызовет исключение :class:`~django.core.exceptions.PermissionDenied` в методах :meth:`~django.contrib.auth.models.User.has_perm()` или :meth:`~django.contrib.auth.models.User.has_module_perms()`, процесс авторизации будет немедленно остановлен и остальные бэкенды вызваны не будут.

source: The simple backend above could implement permissions for the magic admin fairly simply::
ru: Организовать проверку прав для простого бэкенда из примера выше довольно просто::

source: This gives full permissions to the user granted access in the above example. Notice that in addition to the same arguments given to the associated :class:`django.contrib.auth.models.User` functions, the backend auth functions all take the user object, which may be an anonymous user, as an argument.
ru: В примере, показанном выше, пользователю выдаётся полный набор прав доступа. Следует отметить, что в дополнение к передачи аргументов стандартных для функций :class:`django.contrib.auth.models.User`, для всех функций аутентификации необходимо передавать объект пользователя, который может быть и анонимным.

source: A full authorization implementation can be found in the ``ModelBackend`` class in `django/contrib/auth/backends.py`_, which is the default backend and queries the ``auth_permission`` table most of the time. If you wish to provide custom behavior for only part of the backend API, you can take advantage of Python inheritance and subclass ``ModelBackend`` instead of implementing the complete API in a custom backend.
ru: Полная реализация бэкенда аутентификации может быть найдена в классе ``ModelBackend``, определённом в файле `django/contrib/auth/backends.py`_, который является стандартным бэкендом и в основном работает с таблицей ``auth_permission``. Если вам потребуется реализовать нестандартное поведение для определённой части API бэкендов, воспользуйтесь возможностями наследования в Python и унаследуйте ``ModelBackend``, вместо реализации полного API в своём бэкенде.

source: Authorization for anonymous users
ru: Авторизация анонимных пользователей

source: Django's permission framework does not have a place to store permissions for anonymous users. However, the user object passed to an authentication backend may be an :class:`django.contrib.auth.models.AnonymousUser` object, allowing the backend to specify custom authorization behavior for anonymous users. This is especially useful for the authors of re-usable apps, who can delegate all questions of authorization to the auth backend, rather than needing settings, for example, to control anonymous access.
ru: Компонент Django, обеспечивающий работу с правами доступа, не выделяет место под хранение данных о правах анонимных пользователей. Тем не менее, объект пользователя, передаваемый в бэкенд аутентификации может являться экземпляром класса :class:`django.contrib.auth.models.AnonymousUser`, что позволяет определять определённое поведение для анонимных пользователей. Это очень полезно для авторов повторно используемых приложений, которые могут делегировать задачу авторизации соответствующему бэкенду, а не изменят определённые настройки для контроля за доступом анонимных пользователей.

source: Authorization for inactive users
ru: Авторизация неактивных пользователей

source: The support for anonymous users in the permission system allows for a scenario where anonymous users have permissions to do something while inactive authenticated users do not.
ru: Поддержка анонимных пользователей в системе прав доступа позволяет реализовать сценарий, когда анонимные пользователи могут выполнять какие-либо действия в то время как неактивные авторизованные пользователи не могут этого делать.

source: Do not forget to test for the ``is_active`` attribute of the user in your own backend permission methods.
ru: Не забывайте проверять атрибут ``is_active`` в методах проверки правпользователей вашего бекэнда.

source: Handling object permissions
ru: Обработка разрешений для объектов

source: Django's permission framework has a foundation for object permissions, though there is no implementation for it in the core. That means that checking for object permissions will always return ``False`` or an empty list (depending on the check performed). An authentication backend will receive the keyword parameters ``obj`` and ``user_obj`` for each object related authorization method and can return the object level permission as appropriate.
ru: В Django механизм управления правами подготовлен для работы с правамиобъектов, хотя и ещё не реализован в ядре фреймворка. Это означает, что проверкаправ объекта всегда будет возвращать False или пустой список (в зависимости от видавыполняемой проверки). Бэкенд аутентификации получает именованные параметры``obj`` и ``user_obj`` для каждого объекта использованного в методе авторизации и соответственноможет вернуть информацию о правах этого объекта.

source: Custom permissions
ru: Создаем пользовательские права доступа

source: To create custom permissions for a given model object, use the ``permissions`` :ref:`model Meta attribute <meta-options>`.
ru: Что бы создать пользовательские права доступа для вашей моделинеобходимо определить их в переменной ``permissions`` :ref:`атрибуте Meta<meta-options>`вашей модели.

source: This example Task model creates three custom permissions, i.e., actions users can or cannot do with Task instances, specific to your application::
ru: В примере ниже описывается как создать пользовательсике права доступадля модели Task, другими словами вы определяеете что пользователь можетделать в вашем приложении, а что нет:

source: There are two ways to extend the default :class:`~django.contrib.auth.models.User` model without substituting your own model. If the changes you need are purely behavioral, and don't require any change to what is stored in the database, you can create a :ref:`proxy model <proxy-models>` based on :class:`~django.contrib.auth.models.User`. This allows for any of the features offered by proxy models including default ordering, custom managers, or custom model methods.
ru: Существуюет два способа расширения стандартной моделиclass:`~django.contrib.auth.models.User` без замены модели на вашусобственную. Если вам нужно изменить только поведение моделибез измения данных вы можете создать :ref:`proxy модель <proxy-models>`на основе модели :class:`~django.contrib.auth.models.User`. С помощью модели proxyвы можете,добавить, добавить пользовательские менеджеры или методы сохранив стандартныефункции.

source: Assuming an existing Employee Fred Smith who has both a User and Employee model, you can access the related information using Django's standard related model conventions::
ru: Если предположить что сотрудник Fred Smith имеет записи как моделиUser так и в модели Employee, вы можете получить связанную информацию используя стандартные соглашения Django для использования моделей:

source: To add a profile model's fields to the user page in the admin, define an :class:`~django.contrib.admin.InlineModelAdmin` (for this example, we'll use a :class:`~django.contrib.admin.StackedInline`) in your app's ``admin.py`` and add it to a ``UserAdmin`` class which is registered with the :class:`~django.contrib.auth.models.User` class::
ru: Что бы добавить поля из модели профайла в интерфейс администраторанужно определить :class:`~django.contrib.admin.InlineModelAdmin` в файле``admin.py`` вашего приложения (для этого примера используется:class:`~django.contrib.admin.StackedInline`), добавить его к классу ``UserAdmin``и заново зарегистрировать вместе с классом :class:`~django.contrib.auth.models.User`

source: These profile models are not special in any way - they are just Django models that happen to have a one-to-one link with a User model. As such, they do not get auto created when a user is created, but a :attr:`django.db.models.signals.post_save` could be used to create or update related models as appropriate.
ru: Модель профайл это обычная модель Django. От других моделей ее отличаеттолько наличие свзяи один к одному с моделью User. Как правило записив этой модели не создаются автоматичски вместе с созданием пользователя,но вы можете воспользоваться методом :attr:`django.db.models.signals.post_save`для создания или обновления записей в профайле по мере необходимости.

source: Note that using related models results in additional queries or joins to retrieve the related data, and depending on your needs substituting the User model and adding the related fields may be your better option. However existing links to the default User model within your project's apps may justify the extra database load.
ru: Заметим, что использование связаных моделей приводит к увеличениюзапросов к базе данных и дополнительной нагрузке на нее, и, в зависиомтисот ваших потребностей, замена модели User на вашу собственную модельс нужными вам полями может быть лучшим выбором.

source: Some kinds of projects may have authentication requirements for which Django's built-in :class:`~django.contrib.auth.models.User` model is not always appropriate. For instance, on some sites it makes more sense to use an email address as your identification token instead of a username.
ru: Для некоторых проектов возможностей встроенной в Django модели:class:`~django.contrib.auth.models.User` будет недостаточно. Например,вам необходимо использовать в качестве идентификатора пользоавтеляemail адрес вместо имени пользователя.

source: Django allows you to override the default User model by providing a value for the :setting:`AUTH_USER_MODEL` setting that references a custom model::
ru: Вы можете переписать стандартную модель User указав в настройках приложения :setting:`AUTH_USER_MODEL` ссылка на вашу модель:

source: This dotted pair describes the name of the Django app (which must be in your :setting:`INSTALLED_APPS`), and the name of the Django model that you wish to use as your User model.
ru: Эта ностройка определят что для этого приложения (myapp, которое должно бытьпрописано в :setting:`INSTALLED_APPS`) необходимо использовать другую модель(MyUser) вместо стандартной.

source: Changing :setting:`AUTH_USER_MODEL` has a big effect on your database structure. It changes the tables that are available, and it will affect the construction of foreign keys and many-to-many relationships. If you intend to set :setting:`AUTH_USER_MODEL`, you should set it before creating any migrations or running ``manage.py migrate`` for the first time.
ru: Изменение :setting:`AUTH_USER_MODEL` может сильно отразиться на структуревашей базы данных. Так же это изменит доступность таблиц и отразится наконструкции внешних ключей и отношение многие ко многим. Если вы собираетесьиспользовать альтернативную модель вы должны указать ее в :setting:`AUTH_USER_MODEL`до того как выполните какие либо миграции или первого запуска ``manage.py migrate``.

source: Changing this setting after you have tables created is not supported by :djadmin:`makemigrations` and will result in you having to manually fix your schema, port your data from the old user table, and possibly manually reapply some migrations.
ru: Изменение этой настройки после того как вы уже создали ваши таблицыне отразится в :djadmin:`makemigrations` и вам нужно будет вручную правитьсхему вашей БД, переносить данные из старой таблицы пользователей и,возможно, вручную применять некторые миграции.

source: Due to limitations of Django's dynamic dependency feature for swappable models, you must ensure that the model referenced by :setting:`AUTH_USER_MODEL` is created in the first migration of its app (usually called ``0001_initial``); otherwise, you will have dependency issues.
ru: Из-за ограничей в динамических зависимостях Django вам необходимоубедиться что заменяемая модель указанная в :setting:`AUTH_USER_MODEL`была создано в вашей первой миграции (обчно она называется 0001_initial).В противном случае у вас будут проблемы с зависимотями.
