Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/topics/auth/customizing.po
Languages: ru

source: In addition, you may run into a CircularDependencyError when running your migrations as Django won't be able to automatically break the dependency loop due to the dynamic dependency. If you see this error, you should break the loop by moving the models depended on by your User model into a second migration (you can try making two normal models that have a ForeignKey to each other and seeing how ``makemigrations`` resolves that circular dependency if you want to see how it's usually done)
ru: Кроме того вы можете столкнуться с CircularDependencyError когда запуститемиграцию, Django не сможет самостоятельно выйти из бесконечного цикла вызванногоавтоматическими зависимостями. Если вы видите эту ошибку вам необходимо определитьмодель ссылающуюся на старую модель User и исправить это в следующей миграции.Вы можете создать две обычные модели с внешними ключами ссылающимися друг на другаи, запустив ``makemigrations``, увидеть что происходит когда появляются циклические зависимости.

source: If you reference :class:`~django.contrib.auth.models.User` directly (for example, by referring to it in a foreign key), your code will not work in projects where the :setting:`AUTH_USER_MODEL` setting has been changed to a different User model.
ru: Если вы ссылаетесь на модель на модель :class:`~django.contrib.auth.models.User`напрямую (например испльзую внешние ключи), ваш код не будет работать впроектах где стандартная модель заменена на другую в настройке:setting:`AUTH_USER_MODEL`.

source: Instead of referring to :class:`~django.contrib.auth.models.User` directly, you should reference the user model using ``django.contrib.auth.get_user_model()``. This method will return the currently active User model -- the custom User model if one is specified, or :class:`~django.contrib.auth.models.User` otherwise.
ru: Вместо того что бы ссылаться на модель :class:`~django.contrib.auth.models.User`напрямую, вы должны делать это использу метод ``django.contrib.auth.get_user_model()``.Этот метод возвращает действующею модель -- указаную в настройках приложенииили стандартную модель :class:`~django.contrib.auth.models.User`, в случае если не изменялась.

source: When you define a foreign key or many-to-many relations to the User model, you should specify the custom model using the :setting:`AUTH_USER_MODEL` setting. For example::
ru: Когда вы определяете в вашей модели пользователей внешние ключи илиотношения многие ко многим вы должны указывать параметр:setting:`AUTH_USER_MODEL`. Например:

source: Generally speaking, you should reference the User model with the :setting:`AUTH_USER_MODEL` setting in code that is executed at import time. ``get_user_model()`` only works once Django has imported all models.
ru: Другими словами вы всегда должны ссылаться на пользовательскуюмодель используя настройку :setting:`AUTH_USER_MODEL` в вашем кодекоторая будет проверться во время импорта. ``get_user_model()` работаеттолько один раз, когда Django импортирует модели.

source: Model design considerations
ru: Разработка пользовательской модели

source: Think carefully before handling information not directly related to authentication in your custom User Model.
ru: Тщательно подумайте прежде чем хранить в пользовательской моделиинформацию не относящуюся к аутентификации пользователя.

source: It may be better to store app-specific user information in a model that has a relation with the User model. That allows each app to specify its own user data requirements without risking conflicts with other apps. On the other hand, queries to retrieve this related information will involve a database join, which may have an effect on performance.
ru: Может буть лучше хранить дополнительную информацию о пользователяхнеобходимые вашему приложениею в другой модели с указанием связи намодель User. Это позволит каждому приложению определять специфичнуютолько для него информацию без риска возникновения конфликтов с другимиприложениями. Но с другой стороны такой подход приведе к увеличению запросовк базе данных а слдеовательно и нагрузки на нее.

source: Django expects your custom User model to meet some minimum requirements.
ru: Django ожидает что ваше модель User будет отвечать некоторым минимальнымрекомендациям.

source: Your model must provide a way to address the user in a "short" and "long" form. The most common interpretation of this would be to use the user's given name as the "short" identifier, and the user's full name as the "long" identifier. However, there are no constraints on what these two methods return - if you want, they can return exactly the same value.
ru: Ваша модель должна поддерживать короткую "short" и длинную "long"форму обращения к пользователю. В наиболее общей интерпритацииэтого можно использовать имя пользователя как "короткий" идентификатор,а его полное имя как "длинный" идентификатор. Однако ни кто не мешает вамсдлеать так что бы этих методоа возвращали одно и тоже значение.

source: The easiest way to construct a compliant custom User model is to inherit from :class:`~django.contrib.auth.models.AbstractBaseUser`. :class:`~django.contrib.auth.models.AbstractBaseUser` provides the core implementation of a ``User`` model, including hashed passwords and tokenized password resets. You must then provide some key implementation details:
ru: Простейший способ построить модель совместимую с моделью User этонаследовать модель :class:`~django.contrib.auth.models.AbstractBaseUser`.:class:`~django.contrib.auth.models.AbstractBaseUser` обеспечивает базовуюреализацию модели User, в том числе хэширование паролей и сброс пароляпосредством токенов.

source: In the following example, the field ``identifier`` is used as the identifying field::
ru: В примере ниже поле ``identifier`` используется в качествеуникального идентификатора:

source: :attr:`USERNAME_FIELD` now supports :class:`~django.db.models.ForeignKey`\s. Since there is no way to pass model instances during the :djadmin:`createsuperuser` prompt, expect the user to enter the value of :attr:`~django.db.models.ForeignKey.to_field` value (the :attr:`~django.db.models.Field.primary_key` by default) of an existing instance.
ru: Атрибут :attr:`USERNAME_FIELD` теперь поддеоживает внешние ключи.В связи с этим возникает проблема. При выполнении команды из:djadmin:`createsuperuser` из командной строки вы неможете передатьобъект связанного объекта, по этому вы можете просто указать простоID записи в БД (:attr:`~django.db.models.ForeignKey.to_field` указываетна ID по умолчанию).

source: A list of the field names that will be prompted for when creating a user via the :djadmin:`createsuperuser` management command. The user will be prompted to supply a value for each of these fields. It must include any field for which :attr:`~django.db.models.Field.blank` is ``False`` or undefined and may include additional fields you want prompted for when a user is created interactively. ``REQUIRED_FIELDS`` has no effect in other parts of Django, like creating a user in the admin.
ru: Список имен полей, которые будут запрашиваться при создании пользователяс использованием команды :djadmin:`createsuperuser`. Пользователю будетпредложено задать значение для каждого из этих полей. Этот список долженсодержать имена всех полей для которых атрибут blank уставновлен False и полядля которых этот атрибут не определен, а так же любые другие поля какие вы захотите.Изменение параметра ``REQUIRED_FIELDS`` ни как не отразится на остальных частяхфреймворка Django, таких как создание пользователя через панель администратора.

source: For example, here is the partial definition for a ``User`` model that defines two required fields - a date of birth and height::
ru: Пример ниже показывает как можно задать два обязательных поля --дата рождения и рост:

source: ``REQUIRED_FIELDS`` must contain all required fields on your ``User`` model, but should *not* contain the ``USERNAME_FIELD`` or ``password`` as these fields will always be prompted for.
ru: В атрибуте ``REQUIRED_FIELDS`` вы можете задать любые обязательные полявашей модели ``User`` кроме ``USERNAME_FIELD`` и ``password``. Эти поляявляются обязательными по умолчанию.

source: :attr:`REQUIRED_FIELDS` now supports :class:`~django.db.models.ForeignKey`\s. Since there is no way to pass model instances during the :djadmin:`createsuperuser` prompt, expect the user to enter the value of :attr:`~django.db.models.ForeignKey.to_field` value (the :attr:`~django.db.models.Field.primary_key` by default) of an existing instance.
ru: Атрибут ``REQUIRED_FIELDS`` теперь поддеоживает внешние ключи.В связи с этим возникает проблема. При выполнении команды из:djadmin:`createsuperuser` из командной строки вы неможете передатьобъект связанного объекта, по этому вы можете просто указать простоID записи в БД (:attr:`~django.db.models.ForeignKey.to_field` указываетна ID по умолчанию).

source: A boolean attribute that indicates whether the user is considered "active". This attribute is provided as an attribute on ``AbstractBaseUser`` defaulting to ``True``. How you choose to implement it will depend on the details of your chosen auth backends. See the documentation of the :attr:`is_active attribute on the built-in user model <django.contrib.auth.models.User.is_active>` for details.
ru: Логические атрибут указывающий является ли пользователь "активным".По умолчанию класс ``AbstractBaseUser`` устанавливает его в ``True``. Выможете изменить это в вашем бекэнде аутентификации. Для подробностейсмотри документ :attr:`атрибут is_active во встроеное модели ``User``<django.contrib.auth.models.User.is_active>`

source: A longer formal identifier for the user. A common interpretation would be the full name of the user, but it can be any string that identifies the user.
ru: "Длинная" форма формально идентификатора пользователя. В общем случаедолжна возвращать полное имя пользователя, но может так жевозвращать любую строку однозначно идентифицирующая пользователя.

source: A short, informal identifier for the user. A common interpretation would be the first name of the user, but it can be any string that identifies the user in an informal way. It may also return the same value as :meth:`django.contrib.auth.models.User.get_full_name()`.
ru: "Короткая" форма, не формальная, идентификации пользователя. В общемслучае должна возращать имя пользователя. Но так же может возвращатьлюбую строку однозначно идентифицирующую пользователя. Может возвращатьтакое же значение что и :meth:`django.contrib.auth.models.User.get_full_name()`.

source: Returns the value of the field nominated by ``USERNAME_FIELD``.
ru: Возвращает значение из поля указанного в качестве ``USERNAME_FIELD``.

source: Sets the user's password to the given raw string, taking care of the password hashing. Doesn't save the :class:`~django.contrib.auth.models.AbstractBaseUser` object.
ru: Меняет пароль пользователя на переданный в параметре педварительнохэшировав его. Объект :class:`~django.contrib.auth.models.AbstractBaseUser` не сохраняется.

source: When the raw_password is ``None``, the password will be set to an unusable password, as if :meth:`~django.contrib.auth.models.AbstractBaseUser.set_unusable_password()` were used.
ru: Если используется метод:meth:`~django.contrib.auth.models.AbstractBaseUser.set_unusable_password()` и ``raw_password`` равен ``None`` пользователь будетпомечен как не использующий пароль.

source: Returns ``True`` if the given raw string is the correct password for the user. (This takes care of the password hashing in making the comparison.)
ru: Возвращает ``True`` если пароль указан верно (вычисляет хэш исравнивает его с хэшем хранимым в базе данных).

source: Marks the user as having no password set. This isn't the same as having a blank string for a password. :meth:`~django.contrib.auth.models.AbstractBaseUser.check_password()` for this user will never return ``True``. Doesn't save the :class:`~django.contrib.auth.models.AbstractBaseUser` object.
ru: Помечает пользователя как не использующего пароля. Но это не тожесамое что указывать пустую строку в качестве пароля. Если уставнолено тометод :meth:`~django.contrib.auth.models.AbstractBaseUser.check_password()`никогда не вернет ``True``. Объект :class:`~django.contrib.auth.models.AbstractBaseUser`не сохраняется.

source: You may need this if authentication for your application takes place against an existing external source such as an LDAP directory.
ru: Вам может это понадобиться если вы используете внешний источникданных для аутентифифкации, например, директорю LDAP.

source: Returns ``False`` if :meth:`~django.contrib.auth.models.AbstractBaseUser.set_unusable_password()` has been called for this user.
ru: Вернет ``False`` если для пользователя бул вызван метод:meth:`~django.contrib.auth.models.AbstractBaseUser.set_unusable_password()`.

source: Returns an HMAC of the password field. Used for :ref:`session-invalidation-on-password-change`.
ru: Вернет HMAC (хэш) пароля. Используется для :ref:`переопределения сессиипосле смены пароля <session-invalidation-on-password-change>`.

source: You should also define a custom manager for your ``User`` model. If your ``User`` model defines ``username``, ``email``, ``is_staff``, ``is_active``, ``is_superuser``, ``last_login``, and ``date_joined`` fields the same as Django's default ``User``, you can just install Django's :class:`~django.contrib.auth.models.UserManager`; however, if your ``User`` model defines different fields, you will need to define a custom manager that extends :class:`~django.contrib.auth.models.BaseUserManager` providing two additional methods:
ru: Вам так же необходимо определить собственный менеджер пользователейвашей модели ``User``. Если ваше модель ``User`` определяет поля ``username``,``email``, ``is_staff``, ``is_active``, ``is_superuser``, ``last_login`` и ``date_joined`` так жеи в стандартной модели ``User`` вы можете использовать стандартный :class:`~django.contrib.auth.models.UserManager` Django. Однако, если вы определили другиеполя в вашей модели вам необходим ваш собственный менеджер пользователйкоторый будет унаследован от :class:`~django.contrib.auth.models.BaseUserManager`и определять два обязательных метода:

source: The prototype of ``create_user()`` should accept the username field, plus all required fields as arguments. For example, if your user model uses ``email`` as the username field, and has ``date_of_birth`` as a required field, then ``create_user`` should be defined as::
ru: Метод ``create_user()`` должен принимать вкачестве параметровимя пользователя плюс другие обязательные поля. Например,если ваша модель пользователей использует ``email`` в качествелогина с обязательным указанием даты рождения то ваш метод``create_user`` должен быть определен как:

source: The prototype of ``create_superuser()`` should accept the username field, plus all required fields as arguments. For example, if your user model uses ``email`` as the username field, and has ``date_of_birth`` as a required field, then ``create_superuser`` should be defined as::
ru: Метод ``create_superuser()`` должен принимать вкачестве параметровимя пользователя плюс другие обязательные поля. Например,если ваша модель пользователей использует ``email`` в качествелогина с обязательным указанием даты рождения то ваш метод``create_superuser()`` должен быть определен как:

source: Unlike ``create_user()``, ``create_superuser()`` *must* require the caller to provide a password.
ru: В отличие от ``create_user()``, ``create_superuser()`` должен обязатльнотребовать пароль.

source: :class:`~django.contrib.auth.models.BaseUserManager` provides the following utility methods:
ru: :class:`~django.contrib.auth.models.BaseUserManager` предоставляет следующие методы:

source: Retrieves a user instance using the contents of the field nominated by ``USERNAME_FIELD``.
ru: Получает экземпляр пользователя, использую содержимое поля,указаного в ``USERNAME_FIELD``.

source: Returns a random password with the given length and given string of allowed characters. Note that the default value of ``allowed_chars`` doesn't contain letters that can cause user confusion, including:
ru: Возвращает случайно сгенерированый пароль указанной длины и наборасимволов. Обратите внимание, что стандартная строка ``allowed_chars``не содержит символов которые могут ввести пользователя в заблуждение,включая:

source: ``i``, ``l``, ``I``, and ``1`` (lowercase letter i, lowercase letter L, uppercase letter i, and the number one)
ru: ``i``, ``l``, ``I``, и ``1`` (строчная буква i, строчная буква L,прописная буква i и цифра один)

source: ``o``, ``O``, and ``0`` (lowercase letter o, uppercase letter o, and zero)
ru: ``o``, ``O``, и ``0`` (строчная бука о, прописаня буква о и ноль)

source: If you're entirely happy with Django's :class:`~django.contrib.auth.models.User` model and you just want to add some additional profile information, you could simply subclass ``django.contrib.auth.models.AbstractUser`` and add your custom profile fields, although we'd recommend a separate model as described in the "Model design considerations" note of :ref:`specifying-custom-user-model`. ``AbstractUser`` provides the full implementation of the default :class:`~django.contrib.auth.models.User` as an :ref:`abstract model <abstract-base-classes>`.
ru: Если вас польностью удовлетворяет встроенная модель :class:`~django.contrib.auth.models.User` и нужно только добавить хранение дополнительнойифнормации о пользователе, вы можете просто расширить модель``django.contrib.auth.models.AbstractUser`` и добавить дополнительные поля,хотя мы рекомендуем создать отдельную модель в соотвествии с заметкой"Разработка пользовательской модели". ``AbstractUser`` полностью реализуетстандартную модель :class:`~django.contrib.auth.models.User`.

source: Custom users and the built-in auth forms
ru: Встроенные формы авторизации

source: Custom users and :mod:`django.contrib.admin`
ru: Пользовательская модель и :mod:`django.contrib.admin`

source: If you want your custom User model to also work with Admin, your User model must define some additional attributes and methods. These methods allow the admin to control access of the User to admin content:
ru: Если вы хотите что бы ваша пользовательская модель так же работала садминистративным интерфейсом она должна определять некторыеобязательные атрибуты и методы. Эти методы позволяют админ модулюконтролировать доступ пользователй к админской части приложения:

source: Returns ``True`` if the user is allowed to have access to the admin site.
ru: Возвращает ``True`` если пользователю разрешен доступ к админ сайту.

source: Returns ``True`` if the user account is currently active.
ru: Возвращает ``True`` если пользователь активен.

source: Returns ``True`` if the user has the named permission. If ``obj`` is provided, the permission needs to be checked against a specific object instance.
ru: Возвращает ``True`` если пользователь имеет указанное разрашение.Если ``obj`` поддерживается, разрешение должно быть проверено в отношениконктретного экземпляра объекта.

source: Returns ``True`` if the user has permission to access models in the given app.
ru: Возвращает ``True`` если пользователь имеет доступ к модели указанного приложения.

source: You will also need to register your custom User model with the admin. If your custom User model extends ``django.contrib.auth.models.AbstractUser``, you can use Django's existing ``django.contrib.auth.admin.UserAdmin`` class. However, if your User model extends :class:`~django.contrib.auth.models.AbstractBaseUser`, you'll need to define a custom ``ModelAdmin`` class. It may be possible to subclass the default ``django.contrib.auth.admin.UserAdmin``; however, you'll need to override any of the definitions that refer to fields on ``django.contrib.auth.models.AbstractUser`` that aren't on your custom User class.
ru: Вам так же надо зарегстрировать вашу пользовательскую модель дляадмин модуля. Если ваша модель наследует ``django.contrib.auth.models.AbstractUser``модель вы можете использовать ``django.contrib.auth.admin.UserAdmin`` класс Django.Однако, если вы наследуеете :class:`~django.contrib.auth.models.AbstractBaseUser` классвам необходимо определить пользовательский класс ``ModelAdmin``. Для этого выможете наследовать стандартный класс ``django.contrib.auth.admin.UserAdmin`` ипереопределить все ссылки на поля в ``django.contrib.auth.models.AbstractUser`` всоответсвии со структурой вашей модели.

source: Custom users and permissions
ru: Пользовательские права доступа

source: To make it easy to include Django's permission framework into your own User class, Django provides :class:`~django.contrib.auth.models.PermissionsMixin`. This is an abstract model you can include in the class hierarchy for your User model, giving you all the methods and database fields necessary to support Django's permission model.
ru: Что бы упростить подключения системы прав доступа фреймворка в вашпользовательский класс Django имеет класс :class:`~django.contrib.auth.models.PermissionsMixin`. Это абстрактная модель которую вы можете включить в иерархиюклассов вашей пользовательской модели, предоставляющий вам доступ ко всемметодам и полям базы данных необходиых для работы модуля прав доступа.

source: :class:`~django.contrib.auth.models.PermissionsMixin` provides the following methods and attributes:
ru: :class:`~django.contrib.auth.models.PermissionsMixin` предоставляют следуюющиеметоды и атрибуты:

source: Boolean. Designates that this user has all permissions without explicitly assigning them.
ru: Булев тип. Указывает что пользователь имеет все права без их явногоназначения.

source: Returns a set of permission strings that the user has, through their groups.
ru: Возвращает набор прав доступа групп в которых состоит пользователь.

source: If ``obj`` is passed in, only returns the group permissions for this specific object.
ru: Если передается ``obj`` возвращает групповые права доступа толькодля указанного объекта.

source: Returns a set of permission strings that the user has, both through group and user permissions.
ru: Возвращает набор как групповых так и индивидуальных прав доступа.

source: If ``obj`` is passed in, only returns the permissions for this specific object.
ru: Если передается ``obj`` возвращает персональные права доступа толькодля указанного объекта.

source: Returns ``True`` if the user has the specified permission, where ``perm`` is in the format ``"<app label>.<permission codename>"`` (see :ref:`permissions <topic-authorization>`). If the user is inactive, this method will always return ``False``.
ru: Возвращает ``True`` если пользователь имеет указанные права доступа.``perm`` указываются в формате ``"<app label>.<permission codename>"`` (дляподробностей смотри документ -- :ref:`права доступа <topic-authorization>`).Если пользователь не активен будет всегда возвращать ``False``.

source: If ``obj`` is passed in, this method won't check for a permission for the model, but for this specific object.
ru: Если передан ``obj``, этот метод проверит права доступа толькодля указанного объекта.

source: Returns ``True`` if the user has each of the specified permissions, where each perm is in the format ``"<app label>.<permission codename>"``. If the user is inactive, this method will always return ``False``.
ru: Возвращает ``True`` если пользователь имеет все перечисленные пара доступапереданные в формате ``"<app label>.<permission codename>"``. Если пользователь не активен метод вернет ``False``.

source: If ``obj`` is passed in, this method won't check for permissions for the model, but for the specific object.
ru: Если передан ``obj``, этот метод проверит права доступа толькодля указанного объекта.
