Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/topics/auth/customizing.po
Languages: ru

source: Returns ``True`` if the user has any permissions in the given package (the Django app label). If the user is inactive, this method will always return ``False``.
ru: Вернет ``True`` если пользователь имеет какие либо права доступа дляуказанного пакета (приложения Django). Вернет ``False`` еслипользователь не активен.

source: One limitation of custom User models is that installing a custom User model will break any proxy model extending :class:`~django.contrib.auth.models.User`. Proxy models must be based on a concrete base class; by defining a custom User model, you remove the ability of Django to reliably identify the base class.
ru: Одним из ограничений пользовательской модели :class:`~django.contrib.auth.models.User` является то, что она сломает любые Proxy модели расширяющиеестандартную модель. Proxy модели должны основываться на конкретомбазовом классе. Определяя пользовательскую модель ``User`` вы лишаеетеDjango возможности конкрентно определить базовый класс.

source: If your project uses proxy models, you must either modify the proxy to extend the User model that is currently in use in your project, or merge your proxy's behavior into your User subclass.
ru: Если в своем проекте вы используете Proxy модели вы должны либомодифицировать ее что бы она расширяла модель ``User``, котораяиспользуется в ваше проекте, либо определить функции выполняемыеProxy моделями непосредственно вашей пользовательской модели.

source: A full example
ru: Полный пример

source: Here is an example of an admin-compliant custom user app. This user model uses an email address as the username, and has a required date of birth; it provides no permission checking, beyond a simple ``admin`` flag on the user account. This model would be compatible with all the built-in auth forms and views, except for the User creation forms. This example illustrates how most of the components work together, but is not intended to be copied directly into projects for production use.
ru: Здесь вы можете посмотреть пример админ-совместимого приложенияуправления пользователями. Пользовательская модельиспользует, в качествеимени пользователя, поле ``admin`` и обязательное поле даты рождения. Такжеона не предоставлет никаких пользовательских прав, за исключением простого флага``admin``. Эта модель будет совместима со всеми встроенными формами и представлениями,за исключением формы создания пользователя. Этот пример показывает, как можноиспользовать много компонентов вместе не копируя их исходный код в ваше приложение.

source: This code would all live in a ``models.py`` file for a custom authentication app::
ru: Этот код будет полностью находится в файле ``models.py`` вашегоприлодения аутентификации::

source: Then, to register this custom User model with Django's admin, the following code would be required in the app's ``admin.py`` file::
ru: Затем, что бы зарегистрировать вашу пользовательскую модель для панели администратора Django, нужно добавить следующий в файл``admin.py`` вашего приложения::

source: Finally, specify the custom model as the default user model for your project using the :setting:`AUTH_USER_MODEL` setting in your ``settings.py``::
ru: И, на конец, указать вашу пользотельскую модель в качестве моделипо умолчанию в файле ``settings.py`` (:setting:`AUTH_USER_MODEL`)::
