Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/topics/auth/default.po
Languages: ru

source: Lets you specify the URL that users who don't pass the test will be redirected to. It may be a login page and defaults to :setting:`settings.LOGIN_URL <LOGIN_URL>` if you don't specify one.
ru: Позволяет определеть URL на который будут перенаправляться пользователя, которые нее смогут пройти проверку. Это может быть страница авторизации или по умолчанию это будет значение параметра конфигурации :setting:`settings.LOGIN_URL <LOGIN_URL>`, если вы не указали никакого значения.

source: Same as for :func:`~django.contrib.auth.decorators.login_required`. Setting it to ``None`` removes it from the URL, which you may want to do if you are redirecting users that don't pass the test to a non-login page where there's no "next page".
ru: Аналогично декоратору :func:`~django.contrib.auth.decorators.login_required`. Присвоение значения ``None`` удаляет соответствующее поле из URL, что может вам потребоваться при перенаправлении пользователей, которые не прошли проверку, на страницу отличную от страницы авторизации.

source: For example::
ru: Например::

source: When using :doc:`class-based views </topics/class-based-views/index>`, you can use the ``UserPassesTestMixin`` to do this.
ru: При использовании :doc:`CBV представлений </topics/class-based-views/index>`, вы можете для этой цели применять ``UserPassesTestMixin``.

source: You have to override the ``test_func()`` method of the class to provide the test that is performed. Furthermore, you can set any of the parameters of :class:`~django.contrib.auth.mixins.AccessMixin` to customize the handling of unauthorized users::
ru: Вы можете переопределить метод ``test_func()`` класса для того, чтобы указать тест, который будет выполнен. Далее, вы можете указать любой параметр :class:`~django.contrib.auth.mixins.AccessMixin` для настройки обработки неаутентифицированных пользователей::

source: You can also override the ``get_test_func()`` method to have the mixin use a differently named function for its checks (instead of :meth:`test_func`).
ru: Вы также можете переопределить метод ``get_test_func()``, чтобы заставить примесь использовать по-другому именованную функцию для выполнения проверки (вместо :meth:`test_func`).

source: Stacking ``UserPassesTestMixin``
ru: Цепочка из ``UserPassesTestMixin``

source: Due to the way ``UserPassesTestMixin`` is implemented, you cannot stack them in your inheritance list. The following does NOT work::
ru: Из-за особенностей реализации ``UserPassesTestMixin``, вы не можете выстроить цепочку наследования. Следующий пример *не работает*::

source: If ``TestMixin1`` would call ``super()`` and take that result into account, ``TestMixin1`` wouldn't work standalone anymore.
ru: Если ``TestMixin1`` вызовет ``super()`` и примет результат в работу, то ``TestMixin1`` не будет больше работать в одиночку.

source: The ``permission_required`` decorator
ru: Декоратор permission_required

source: It's a relatively common task to check whether a user has a particular permission. For that reason, Django provides a shortcut for that case: the :func:`~django.contrib.auth.decorators.permission_required()` decorator.::
ru: Довольно частой задачей является проверка наличия определённого права у пользователя. Для решения этой задачи Django предоставляет удобный декоратор :func:`~django.contrib.auth.decorators.permission_required()`::

source: Just like the :meth:`~django.contrib.auth.models.User.has_perm` method, permission names take the form ``"<app label>.<permission codename>"`` (i.e. ``polls.can_vote`` for a permission on a model in the ``polls`` application).
ru: Аналогично методу :meth:`~django.contrib.auth.models.User.has_perm`, названия прав указываются в формате ``"<app label>.<permission codename>"`` (т.е., ``polls.can_vote`` для права на модель в приложении ``polls``).

source: The decorator may also take an iterable of permissions, in which case the user must have all of the permissions in order to access the view.
ru: Декоратор также может принимать перечисление прав, в этом случае пользователь должен обладать всеми правами для того, чтобы получить доступ к представлению.

source: Note that :func:`~django.contrib.auth.decorators.permission_required()` also takes an optional ``login_url`` parameter::
ru: Следует отметить, что декоратор :func:`~django.contrib.auth.decorators.permission_required()` также принимает необязательный аргумент ``login_url``::

source: As in the :func:`~django.contrib.auth.decorators.login_required` decorator, ``login_url`` defaults to :setting:`settings.LOGIN_URL <LOGIN_URL>`.
ru: Аналогично декоратору :func:`~django.contrib.auth.decorators.login_required` , по умолчанию значение для аргумента ``login_url`` соответствует значению параметра конфигурации :setting:`settings.LOGIN_URL <LOGIN_URL>`.

source: If the ``raise_exception`` parameter is given, the decorator will raise :exc:`~django.core.exceptions.PermissionDenied`, prompting :ref:`the 403 (HTTP Forbidden) view<http_forbidden_view>` instead of redirecting to the login page.
ru: Если определён аргумент ``raise_exception``, то декоратор будет выбрасывать исключение :exc:`~django.core.exceptions.PermissionDenied` с описанием :ref:`403 (HTTP Forbidden) представление <http_forbidden_view>` вместо перенаправления на страницу авторизации.

source: If you want to use ``raise_exception`` but also give your users a chance to login first, you can add the :func:`~django.contrib.auth.decorators.login_required` decorator::
ru: Если вам надо использовать ``raise_exception``, но также предоставить пользователям шанс сначала аутентифицироваться, вы можете использовать декоратор :func:`~django.contrib.auth.decorators.login_required`::

source: The ``PermissionRequiredMixin`` mixin
ru: Примесь ``PermissionRequiredMixin``

source: To apply permission checks to :doc:`class-based views </ref/class-based-views/index>`, you can use the ``PermissionRequiredMixin``:
ru: Для того, чтобы выполнить проверки для :doc:`CBV представлений </ref/class-based-views/index>`, вы можете использовать ``PermissionRequiredMixin``:

source: You can set any of the parameters of :class:`~django.contrib.auth.mixins.AccessMixin` to customize the handling of unauthorized users.
ru: Вы можете установить любые параметры :class:`~django.contrib.auth.mixins.AccessMixin` для изменения обработки неаутентифированных пользователей.

source: You may also override these methods:
ru: Вы также можете переопределить эти методы:

source: Returns an iterable of permission names used by the mixin. Defaults to the ``permission_required`` attribute, converted to a tuple if necessary.
ru: Возвращает перечисления имён прав, используемых примесью. По умолчанию, это содержимое атрибута ``permission_required``, при необходимости преобразованное в кортеж.

source: Returns a boolean denoting whether the current user has permission to execute the decorated view. By default, this returns the result of calling :meth:`~django.contrib.auth.models.User.has_perms()` with the list of permissions returned by :meth:`get_permission_required()`.
ru: Возвращает булево значение, есть ли у текущего пользователя право выполнить декорированное представление. По умолчанию, возвращается результат вызова метода :meth:`~django.contrib.auth.models.User.has_perms()` со списком прав, полученных от метода :meth:`get_permission_required()`.

source: Redirecting unauthorized requests in class-based views
ru: Перенаправление неаутентифицированных запросов в CBV представлениях

source: Default return value for :meth:`get_login_url`. Defaults to ``None`` in which case :meth:`get_login_url` falls back to :setting:`settings.LOGIN_URL <LOGIN_URL>`.
ru: Стандартное значение для :meth:`get_login_url`. По умолчанию, ``None``, в этом случае метод :meth:`get_login_url` возвратит :setting:`settings.LOGIN_URL <LOGIN_URL>`.

source: Default return value for :meth:`get_permission_denied_message`. Defaults to an empty string.
ru: Стандартное значение для :meth:`get_permission_denied_message`. По умолчанию, пустая строка.

source: Default return value for :meth:`get_redirect_field_name`. Defaults to ``"next"``.
ru: Стандартное значение для :meth:`get_redirect_field_name`. По умолчанию, ``"next"``.

source: Returns the URL that users who don't pass the test will be redirected to. Returns :attr:`login_url` if set, or :setting:`settings.LOGIN_URL <LOGIN_URL>` otherwise.
ru: Возвращает URL, на который будут перенаправляться пользователи не прошедшие тест. Возвращает значение атрибута :attr:`login_url`, если оно определено, или :setting:`settings.LOGIN_URL <LOGIN_URL>`.

source: When :attr:`raise_exception` is ``True``, this method can be used to control the error message passed to the error handler for display to the user. Returns the :attr:`permission_denied_message` attribute by default.
ru: При :attr:`raise_exception` равном ``True``, этот метод может быть использован для управления сообщением об ошибке, которое будет передано в обработчик для отображения пользователю. По умолчанию, возврашает значение атрибута :attr:`permission_denied_message`.

source: Returns the name of the query parameter that will contain the URL the user should be redirected to after a successful login. If you set this to ``None``, a query parameter won't be added. Returns the :attr:`redirect_field_name` attribute by default.
ru: Возвращает имя параметра запроса, содержащий URL, на который должен быть перенаправлен пользователь в случае успешной авторизации. Если вы установите его в ``None``, то параметр запроса не будет добавлен. По умолчанию, возвращает значение атрибута :attr:`redirect_field_name`.

source: Depending on the value of ``raise_exception``, the method either raises a :exc:`~django.core.exceptions.PermissionDenied` exception or redirects the user to the ``login_url``, optionally including the ``redirect_field_name`` if it is set.
ru: В зависимости от значения ``raise_exception``, метод либо выбрасывает исключение :exc:`~django.core.exceptions.PermissionDenied` или перенаправляет пользователя на ``login_url``, необязательно используя ``redirect_field_name``, если оно установлено.

source: Session invalidation on password change
ru: Сброс сессии при изменении пароля

source: Since :meth:`~django.contrib.auth.models.AbstractBaseUser.get_session_auth_hash()` is based on :setting:`SECRET_KEY`, updating your site to use a new secret will invalidate all existing sessions.
ru: Так как метод :meth:`~django.contrib.auth.models.AbstractBaseUser.get_session_auth_hash()` использует параметр конфигурации :setting:`SECRET_KEY`, то обновление этого параметра приведёт к отмене всех существующих сессий на сайте.

source: Authentication Views
ru: Представления аутентификации

source: Django provides several views that you can use for handling login, logout, and password management. These make use of the :ref:`stock auth forms <built-in-auth-forms>` but you can pass in your own forms as well.
ru: Django предоставляет несколько представлений, с помощью которых вы можете осуществлять управление авторизацией пользователей и их паролями. Представления используют :ref:`ряд соответствующих форм <built-in-auth-forms>`, но вы можете передавать и свои формы.

source: Django provides no default template for the authentication views. You should create your own templates for the views you want to use. The template context is documented in each view, see :ref:`all-authentication-views`.
ru: Django не предоставляет стандартного шаблона для представлений аутентификации. Вы должны создать свой собственный шаблон для представлений, которые планируете использовать. Шаблонный контекст описан в каждом представлении, обратитесь к :ref:`all-authentication-views`.

source: Using the views
ru: Использование представлений

source: There are different methods to implement these views in your project. The easiest way is to include the provided URLconf in ``django.contrib.auth.urls`` in your own URLconf, for example::
ru: Существует несколько разных методов для реализации данных представлений в вашем проекте. Самым простым способом будет подключение схемы URL из ``django.contrib.auth.urls`` в вашу схему, например::

source: This will include the following URL patterns::
ru: Это действие добавить следующие шаблоны URL::

source: The views provide a URL name for easier reference. See :doc:`the URL documentation </topics/http/urls>` for details on using named URL patterns.
ru: Представления добавляют имя для URL для упрощения ссылок на них. Обратитесь к :doc:`документации на URL </topics/http/urls>` для получения детальной информации по использованию именованных шаблонов URL.

source: If you want more control over your URLs, you can reference a specific view in your URLconf::
ru: Если вам требуется больше контроля над вашими URL, вы можете указывать специальное представление в вашей схеме URL::

source: The views have optional arguments you can use to alter the behavior of the view. For example, if you want to change the template name a view uses, you can provide the ``template_name`` argument. A way to do this is to provide keyword arguments in the URLconf, these will be passed on to the view. For example::
ru: Представления принимают необязательные аргументы, которые вы можете использовать для изменения их поведения. Например, если требуется изменить имя шаблона, который будет использоваться представлением, вы можете указать аргумент ``template_name``. Для этого надо указать именованные аргументы в схеме URL и они будут переданы в представление. Например::

source: All authentication views
ru: Все представления для аутентификации

source: This is a list with all the views ``django.contrib.auth`` provides. For implementation details see :ref:`using-the-views`.
ru: Ниже приведён список со всеми представлениями пакета ``django.contrib.auth``. Для получения информации о деталях реализации обратитесь к :ref:`using-the-views`.

source: **URL name:** ``login``
ru: **Имя URL:** ``login``

source: See :doc:`the URL documentation </topics/http/urls>` for details on using named URL patterns.
ru: Обратитесь к :doc:`документации на URL </topics/http/urls>` для получения информации по использованию именованных шаблонов URL.

source: ``template_name``: The name of a template to display for the view used to log the user in. Defaults to :file:`registration/login.html`.
ru: ``template_name``: Путь до шаблона, который будет использовать представление при авторизации пользователя. По умолчанию, :file:`registration/login.html`.

source: ``redirect_field_name``: The name of a ``GET`` field containing the URL to redirect to after login. Defaults to ``next``.
ru: ``redirect_field_name``: Имя ``GET`` поля, содержащего URL на который будет произведёно перенаправление после успешной авторизации. По умолчанию, ``next``.

source: ``extra_context``: A dictionary of context data that will be added to the default context data passed to the template.
ru: ``extra_context``: Словарь с контекстными данными, которые будут добавлены в текущий контекст, перед его передачей в шаблон.

source: If called via ``GET``, it displays a login form that POSTs to the same URL. More on this in a bit.
ru: При вызове через ``GET``, оно отображает форму для аутентификации, которая отправляет введённые данные через POST на тот же URL. Подробности далее.

source: If called via ``POST`` with user submitted credentials, it tries to log the user in. If login is successful, the view redirects to the URL specified in ``next``. If ``next`` isn't provided, it redirects to :setting:`settings.LOGIN_REDIRECT_URL <LOGIN_REDIRECT_URL>` (which defaults to ``/accounts/profile/``). If login isn't successful, it redisplays the login form.
ru: При вызове через ``POST`` с аутентификационными данными пользователя, оно пытается авторизовать пользователя. При успешной авторизации, представление перенаправляет на URL, указанный в ``next``. Если параметр ``next`` не был предоставлен, происходит перенаправление на URL, содержащийся в параметре конфигурации :setting:`settings.LOGIN_REDIRECT_URL <LOGIN_REDIRECT_URL>` (по умолчанию, ``/accounts/profile/``). При невозможности авторизации, представление снова показывает форму.

source: It's your responsibility to provide the html for the login template , called ``registration/login.html`` by default. This template gets passed four template context variables:
ru: Вашей обязанностью является предоставление HTML кода для шаблона, который по умолчанию называется ``registration/login.html``. Данный шаблон принимает через контекст четыре переменных:

source: ``form``: A :class:`~django.forms.Form` object representing the :class:`~django.contrib.auth.forms.AuthenticationForm`.
ru: ``form``: Объект :class:`~django.forms.Form`, который представляет :class:`~django.contrib.auth.forms.AuthenticationForm`.

source: ``next``: The URL to redirect to after successful login. This may contain a query string, too.
ru: ``next``: URL, на который будет осуществлено перенаправление после успешной авторизации. Можно также передавать строку запроса.

source: ``site``: The current :class:`~django.contrib.sites.models.Site`, according to the :setting:`SITE_ID` setting. If you don't have the site framework installed, this will be set to an instance of :class:`~django.contrib.sites.requests.RequestSite`, which derives the site name and domain from the current :class:`~django.http.HttpRequest`.
ru: ``site``: Текущий :class:`~django.contrib.sites.models.Site`, соответствующий параметру конфигурации :setting:`SITE_ID`. Если вы не активировали соответствующее приложение, переменной будет присвоен экземпляр :class:`~django.contrib.sites.requests.RequestSite`, который получает имя сайта и домен из текущего :class:`~django.http.HttpRequest`.

source: ``site_name``: An alias for ``site.name``. If you don't have the site framework installed, this will be set to the value of :attr:`request.META['SERVER_NAME'] <django.http.HttpRequest.META>`. For more on sites, see :doc:`/ref/contrib/sites`.
ru: ``site_name``: Псевдоним для ``site.name``. Если вы не активировали соответствующее приложение, переменной будет присвоено значение :attr:`request.META['SERVER_NAME'] <django.http.HttpRequest.META>`. Для подробностей о работе с сайтами обратитесь к :doc:`/ref/contrib/sites`.

source: Here's a sample :file:`registration/login.html` template you can use as a starting point. It assumes you have a :file:`base.html` template that defines a ``content`` block:
ru: Здесь показан пример содержимого шаблона :file:`registration/login.html`, который вы можете использовать в качестве отправной точки. Он предполагает, что у вас есть шаблон :file:`base.html`, который определяет блок ``content``:

source: Logs a user out.
ru: Отмена авторизации пользователя.

source: **URL name:** ``logout``
ru: **Имя URL:** ``logout``

source: ``redirect_field_name``: The name of a ``GET`` field containing the URL to redirect to after log out. Defaults to ``next``. Overrides the ``next_page`` URL if the given ``GET`` parameter is passed.
ru: ``redirect_field_name``: Имя ``GET`` поля, содержащего URL на который будет произведёно перенаправление после отмены авторизации. По умолчанию, ``next``. Переопределяет ``next_page``, если данный параметр был передан в ``GET``.

source: **Template context:**
ru: **Контекст шаблона:**

source: ``title``: The string "Logged out", localized.
ru: ``title``: Локализованная строка "Logged out".

source: Logs a user out, then redirects to the login page.
ru: Отменяет авторизацию пользователя, затем перенаправляет на страницу авторизации.

source: **URL name:** No default URL provided
ru: **Имя URL:** Значения по умолчанию нет

source: **Optional arguments:**
ru: **Необязательные аргументы:**

source: ``login_url``: The URL of the login page to redirect to. Defaults to :setting:`settings.LOGIN_URL <LOGIN_URL>` if not supplied.
ru: ``login_url``: URL страницы авторизации, на которую будет выполнено перенаправление. По умолчанию, :setting:`settings.LOGIN_URL <LOGIN_URL>`.

source: **URL name:** ``password_change``
ru: **Имя URL:** ``password_change``

source: Allows a user to change their password.
ru: Позволяет пользователю изменить его пароль.

source: ``template_name``: The full name of a template to use for displaying the password change form. Defaults to :file:`registration/password_change_form.html` if not supplied.
ru: ``template_name``: Путь до шаблона, который будет использовать представление при изменении пароля. По умолчанию, :file:`registration/password_change_form.html`.

source: **URL name:** ``password_change_done``
ru: **Имя URL:** ``password_change_done``

source: The page shown after a user has changed their password.
ru: Страница, отображаемая после того, как пользователь изменил свой пароль.

source: ``template_name``: The full name of a template to use. Defaults to :file:`registration/password_change_done.html` if not supplied.
ru: ``template_name``: Путь до шаблона. По умолчанию, :file:`registration/password_change_done.html`.

source: **URL name:** ``password_reset``
ru: **Имя URL:** ``password_reset``

source: Allows a user to reset their password by generating a one-time use link that can be used to reset the password, and sending that link to the user's registered email address.
ru: Позволяет пользователю сбросить свой пароль, генерируя одноразовую ссылку, которая может быть использована для сброса пароля, и отправляя её на зарегистрированную электронную почто пользователя.

source: Users flagged with an unusable password (see :meth:`~django.contrib.auth.models.User.set_unusable_password()` aren't allowed to request a password reset to prevent misuse when using an external authentication source like LDAP. Note that they won't receive any error message since this would expose their account's existence but no mail will be sent either.
ru: Пользователь, отмеченный флагом отменённого пароля (см. :meth:`~django.contrib.auth.models.User.set_unusable_password()`), не может запросить сброс пароля. Так сделано, чтобы предотвратить неправильное использование при работе с внешними источниками аутентификации, например, с LDAP. Следует отметить, что они не получат никаких сообщений об ошибках, так как это вскрыло бы наличие аккаунта, и никакого сообщения на почту не будет отправлено.

source: ``template_name``: The full name of a template to use for displaying the password reset form. Defaults to :file:`registration/password_reset_form.html` if not supplied.
ru: ``template_name``: Путь до шаблона, который будет использоваться для отображения формы сброса пароля. По умолчанию, :file:`registration/password_reset_form.html`.

source: ``email_template_name``: The full name of a template to use for generating the email with the reset password link. Defaults to :file:`registration/password_reset_email.html` if not supplied.
ru: ``email_template_name``: Путь до шаблона, который используется при генерации сообщения со ссылкой для сброса пароля, отправляемого на адрес электронной почты. По умолчанию, :file:`registration/password_reset_email.html`.

source: ``subject_template_name``: The full name of a template to use for the subject of the email with the reset password link. Defaults to :file:`registration/password_reset_subject.txt` if not supplied.
ru: ``subject_template_name``: Путь до шаблона, который используется при генерации заголовка сообщения со ссылкой для сброса пароля, отправляемого на адрес электронной почты. По умолчанию :file:`registration/password_reset_subject.txt`.

source: ``token_generator``: Instance of the class to check the one time link. This will default to ``default_token_generator``, it's an instance of ``django.contrib.auth.tokens.PasswordResetTokenGenerator``.
ru: ``token_generator``: Экземпляр класса для проверки одноразовой ссылки. По умолчанию, ``default_token_generator``, который является экземпляром ``django.contrib.auth.tokens.PasswordResetTokenGenerator``.
