Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/topics/auth/default.po
Languages: ru

source: ``from_email``: A valid email address. By default Django uses the :setting:`DEFAULT_FROM_EMAIL`.
ru: ``from_email``: Корректный адрес электронной почты. По умолчанию Django использует :setting:`DEFAULT_FROM_EMAIL`.

source: ``html_email_template_name``: The full name of a template to use for generating a ``text/html`` multipart email with the password reset link. By default, HTML email is not sent.
ru: ``html_email_template_name``: Путь до шаблона, который будет использоваться при генерации ``text/html`` блока электронного сообщения с ссылкой для сброса пароля. По умолчанию, сообщение в формате HTML не отправляется.

source: **Email template context:**
ru: **Контекст шаблона электронной почты:**

source: ``email``: An alias for ``user.email``
ru: ``email``: Псевдоним для ``user.email``

source: ``user``: The current :class:`~django.contrib.auth.models.User`, according to the ``email`` form field. Only active users are able to reset their passwords (``User.is_active is True``).
ru: ``user``: Текущий :class:`~django.contrib.auth.models.User`, соответствующий полю ``email`` формы. Толька активные пользователи имеют возможность сбрасывать свои пароли passwords (``User.is_active is True``).

source: ``domain``: An alias for ``site.domain``. If you don't have the site framework installed, this will be set to the value of ``request.get_host()``.
ru: ``domain``: Псевдоним для ``site.domain``. Если вы не используете приложение для работы с сайтами, то значением будет ``request.get_host()``.

source: ``protocol``: http or https
ru: ``protocol``: http или https

source: ``uid``: The user's primary key encoded in base 64.
ru: ``uid``: Первичный ключ пользователя, закодированный в base 64.

source: ``token``: Token to check that the reset link is valid.
ru: ``token``: Токен для проверки корректности ссылки для сброса пароля.

source: Sample ``registration/password_reset_email.html`` (email body template):
ru: Пример ``registration/password_reset_email.html`` (шаблон тела письма):

source: The same template context is used for subject template. Subject must be single line plain text string.
ru: Такой же контекст используется для шаблона заголовка сообщения. Заголовок должен быть представлен одной строкой простого текста.

source: **URL name:** ``password_reset_done``
ru: **Имя URL:** ``password_reset_done``

source: If the email address provided does not exist in the system, the user is inactive, or has an unusable password, the user will still be redirected to this view but no email will be sent.
ru: Если предоставленный адрес электронной почты не существует в системе, пользователь не активирован или имеет деактивированный пароль, то пользователь будет перенаправляться на это представление, но никаких писем ему отправляться не будет.

source: ``template_name``: The full name of a template to use. Defaults to :file:`registration/password_reset_done.html` if not supplied.
ru: ``template_name``: Путь до шаблона. По умолчанию, :file:`registration/password_reset_done.html`.

source: **URL name:** ``password_reset_confirm``
ru: **Имя URL:** ``password_reset_confirm``

source: Presents a form for entering a new password.
ru: Представляет форму для ввода нового пароля.

source: ``template_name``: The full name of a template to display the confirm password view. Default value is :file:`registration/password_reset_confirm.html`.
ru: ``template_name``: Путь до шаблона, который использует представление для подтверждения пароля. По умолчанию, :file:`registration/password_reset_confirm.html`.

source: ``token_generator``: Instance of the class to check the password. This will default to ``default_token_generator``, it's an instance of ``django.contrib.auth.tokens.PasswordResetTokenGenerator``.
ru: ``token_generator``: Эеземпляр класса для проверки пароля. По умолчанию, ``default_token_generator``, это экземпляр ``django.contrib.auth.tokens.PasswordResetTokenGenerator``.

source: ``validlink``: Boolean, True if the link (combination of ``uidb64`` and ``token``) is valid or unused yet.
ru: ``validlink``: Булево значение. True, если ссылка (комбинация ``uidb64`` и ``token``) корректна и не была ещё использована.

source: **URL name:** ``password_reset_complete``
ru: **Имя URL:** ``password_reset_complete``

source: Presents a view which informs the user that the password has been successfully changed.
ru: Представление, которое информирует пользователя об успешном изменении пароля.

source: ``template_name``: The full name of a template to display the view. Defaults to :file:`registration/password_reset_complete.html`.
ru: ``template_name``: Путь до шаблона. По умолчанию, :file:`registration/password_reset_complete.html`.

source: Helper functions
ru: Вспомогательные функции

source: Redirects to the login page, and then back to another URL after a successful login.
ru: Перенаправляет на страницу аутентификации и, в случае её успешного прохождения, затем перебрасывает на другой URL.

source: **Required arguments:**
ru: **Обязательные аргументы:**

source: ``next``: The URL to redirect to after a successful login.
ru: ``next``: URL на который происходит перенаправление после успешной авторизации.

source: ``redirect_field_name``: The name of a ``GET`` field containing the URL to redirect to after log out. Overrides ``next`` if the given ``GET`` parameter is passed.
ru: ``redirect_field_name``: Имя ``GET`` поля, содержащего URL на который будет произведёно перенаправление после отмены авторизации. Переопределяет ``next``. если данный параметр был передан в ``GET``.

source: Built-in forms
ru: Встроенные формы

source: If you don't want to use the built-in views, but want the convenience of not having to write forms for this functionality, the authentication system provides several built-in forms located in :mod:`django.contrib.auth.forms`:
ru: Если вы не желаете использовать встроенные представления, но и формы переписывать не хотите, то система аутентификации предоставляет несколько встроенных форм, расположенных в :mod:`django.contrib.auth.forms`:

source: A form used in the admin interface to change a user's password.
ru: Форма, используемая в интерфейса администратора, для изменения пароля пользователя.

source: Takes the ``user`` as the first positional argument.
ru: Принимает ``user`` в качестве первого неименованного параметра.

source: A form for logging a user in.
ru: Форма для аутентификации пользователя.

source: Takes ``request`` as its first positional argument, which is stored on the form instance for use by sub-classes.
ru: Принимает ``request`` в качестве первого неименованного аргумента, который сохраняется в экземпляре формы для использования подклассами.

source: By default, ``AuthenticationForm`` rejects users whose ``is_active`` flag is set to ``False``. You may override this behavior with a custom policy to determine which users can log in. Do this with a custom form that subclasses ``AuthenticationForm`` and overrides the ``confirm_login_allowed()`` method. This method should raise a :exc:`~django.core.exceptions.ValidationError` if the given user may not log in.
ru: По умолчанию, форма ``AuthenticationForm`` игнорирует пользователей у которых флаг ``is_active`` установлен в ``False``. Вы можете изменить это поведение на проверку некого права пройти аутентификацию для пользователей. Выполните это с помощью своей формы, которая унаследована от ``AuthenticationForm`` и переопределяет метод ``confirm_login_allowed()``. Этот метод должен выбрасывать исключение :exc:`~django.core.exceptions.ValidationError` в случае, если указанный пользователь не может проходить аутентификацию.

source: For example, to allow all users to log in regardless of "active" status::
ru: Например, позволяем всем пользователям проходить аутентификацию, невзирая на их статус активности::

source: Or to allow only some active users to log in::
ru: Или позволяем только некоторым активным пользователям проходить аутентификацию::

source: A form for allowing a user to change their password.
ru: Форма, через которую пользователь может менять свой пароль.

source: A form for generating and emailing a one-time use link to reset a user's password.
ru: Форма для генерации и отправки одноразовой ссылки для сброса пользовательского пароля.

source: Uses the arguments to send an ``EmailMultiAlternatives``. Can be overridden to customize how the email is sent to the user.
ru: Использует аргументы для отправки ``EmailMultiAlternatives``. Может быть переопределена для изменения способа отправки сообщения пользователю.

source: the template for the subject.
ru: шаблон для заголовка.

source: the template for the email body.
ru: шаблон для тела письма.

source: context passed to the ``subject_template``, ``email_template``, and ``html_email_template`` (if it is not ``None``).
ru: контекст передаётся в ``subject_template``, ``email_template`` и ``html_email_template`` (если он не ``None``).

source: the sender's email.
ru: адрес электронной почты отправителя.

source: the email of the requester.
ru: адрес электронной почты пользователя.

source: the template for the HTML body; defaults to ``None``, in which case a plain text email is sent.
ru: шаблон для HTML тела письма, по умолчанию, ``None``, в этом случае отсылается обычный текст.

source: A form that lets a user change their password without entering the old password.
ru: Форма, которая позволяет пользователю изменять свой пароль без ввода старого пароля.

source: A form used in the admin interface to change a user's information and permissions.
ru: Форма, используемая в интерфейсе администратора для изменения информации о пользователе и его списка прав.

source: Authentication data in templates
ru: Аутентификационные данные в шаблонах

source: The currently logged-in user and their permissions are made available in the :doc:`template context </ref/templates/api>` when you use :class:`~django.template.RequestContext`.
ru: Авторизованный пользователь и его права доступны в :doc:`шаблонном контексте </ref/templates/api>` при использовании :class:`~django.template.RequestContext`.

source: Technicality
ru: Техническая особенность

source: Technically, these variables are only made available in the template context if you use :class:`~django.template.RequestContext` and the ``'django.contrib.auth.context_processors.auth'`` context processor is enabled. It is in the default generated settings file. For more, see the :ref:`RequestContext docs <subclassing-context-requestcontext>`.
ru: Технически, эти переменные становятся доступными в шаблонном контексте, только если вы используете :class:`~django.template.RequestContext` и активирован контекстный процессор ``'django.contrib.auth.context_processors.auth'``. По умолчанию проект так и настроен. Больше информации можно найти в :ref:`документации на RequestContext <subclassing-context-requestcontext>`.

source: Users
ru: Пользователи

source: When rendering a template :class:`~django.template.RequestContext`, the currently logged-in user, either a :class:`~django.contrib.auth.models.User` instance or an :class:`~django.contrib.auth.models.AnonymousUser` instance, is stored in the template variable ``{{ user }}``:
ru: При рендеринге :class:`~django.template.RequestContext`, авторизованный пользователь, неважно будет это экземпляр :class:`~django.contrib.auth.models.User` или :class:`~django.contrib.auth.models.AnonymousUser`, сохраняется в шаблонной переменной ``{{ user }}``:

source: This template context variable is not available if a ``RequestContext`` is not being used.
ru: Эта шаблонная переменная не доступна, если не используется ``RequestContext``.

source: Permissions
ru: Права

source: The currently logged-in user's permissions are stored in the template variable ``{{ perms }}``. This is an instance of ``django.contrib.auth.context_processors.PermWrapper``, which is a template-friendly proxy of permissions.
ru: Права авторизованного пользователя хранятся в шаблонной переменной ``{{ perms }}``. Она связана с экземпляром ``django.contrib.auth.context_processors.PermWrapper``, который реализует доступ к правам.

source: It is possible to also look permissions up by ``{% if in %}`` statements. For example:
ru: Также позможен поиск прав с помощью выражения ``{% if in %}``. Например:

source: Managing users in the admin
ru: Управление пользователями в интерфейсе администратора

source: When you have both ``django.contrib.admin`` and ``django.contrib.auth`` installed, the admin provides a convenient way to view and manage users, groups, and permissions. Users can be created and deleted like any Django model. Groups can be created, and permissions can be assigned to users or groups. A log of user edits to models made within the admin is also stored and displayed.
ru: Если вы подключили к проекту ``django.contrib.admin`` и ``django.contrib.auth``, интерфейс администратора предоставляет удобный способ для просмотра и управления пользователями, группами и правами. Пользователи могут быть созданы и удалены как любая другая модель Django. Группы могут быть созданы и права могут быть назначены на пользователей и группы. Журнал изменений, выполненных через интерфейс администратора, сохраняется и доступен.

source: You should see a link to "Users" in the "Auth" section of the main admin index page. The "Add user" admin page is different than standard admin pages in that it requires you to choose a username and password before allowing you to edit the rest of the user's fields.
ru: Вы должны видеть сылку на "Пользователи" в разделе "Auth" на главной странице интерфейса администратора. Страница "Добавить пользователя" отличается от других страниц интерфейса, так как она требует, чтобы вы ввели имя пользователя и пароль перед тем как дать вам возможность редактировать остальные поля модели.

source: Also note: if you want a user account to be able to create users using the Django admin site, you'll need to give them permission to add users *and* change users (i.e., the "Add user" and "Change user" permissions). If an account has permission to add users but not to change them, that account won't be able to add users. Why? Because if you have permission to add users, you have the power to create superusers, which can then, in turn, change other users. So Django requires add *and* change permissions as a slight security measure.
ru: Также следует отметить, что если вам нужен пользоватедль, который бы позволил создавать пользователей с помощью интерфейса администратора, вам следует дать ему право на добавление пользователей *и* право на изменение пользователей (т.е., права "Добавить пользователя" и "Изменить пользователя"). Если пользователь обладает правом создания пользователей, но не имеет права на их редактирование, тогда он не сможет создавать пользователей. Почему? Потому что, если у вас есть право на создание пользователей, у вас есть возможность создать суперпользователей, которые могут в свою очередь, изменять других пользователей. Таким образом, Django требует наличие прав на добавление *и* изменение пользователей в целях безопасности.

source: Be thoughtful about how you allow users to manage permissions. If you give a non-superuser the ability to edit users, this is ultimately the same as giving them superuser status because they will be able to elevate permissions of users including themselves!
ru: Продумайте как вы позволяете управлять правами. Если вы предоставите обычному пользователю право на редактирование пользователей, это будет означать то же самое, что и предоставление ему прав суперпользователя, так как он сможет повысить права пользователей, включая себя!

source: User passwords are not displayed in the admin (nor stored in the database), but the :doc:`password storage details </topics/auth/passwords>` are displayed. Included in the display of this information is a link to a password change form that allows admins to change user passwords.
ru: Пароли пользователей не отображаются на интерфейсе администратора (и не сохраняются в базе данных), но отображаются :doc:`детали хранилища пароля </topics/auth/passwords>`. Рядом с этой информацией находится ссылка на форму изменения пароля, которая позволяет администраторам изменять пароли пользователей.
