Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/topics/auth/default.po
Languages: ru

source: Using the Django authentication system
ru: Использование системы аутентификации пользователя

source: This document explains the usage of Django's authentication system in its default configuration. This configuration has evolved to serve the most common project needs, handling a reasonably wide range of tasks, and has a careful implementation of passwords and permissions. For projects where authentication needs differ from the default, Django supports extensive :doc:`extension and customization </topics/auth/customizing>` of authentication.
ru: Этот раздел описывает использование аутентификации пользователя в Django с конфигурацией по умолчанию. Эта конфигурация покрывает требования большинства проектов, предоставляет надежный механизм работы с паролями и правами. Для проектов, которые требуют другой механизм авторизации, Django предоставляет возможность :doc:`настроить механизм авторизации </topics/auth/customizing>`.

source: Django authentication provides both authentication and authorization together and is generally referred to as the authentication system, as these features are somewhat coupled.
ru: Django предоставляет возможности аутентификации и авторизации пользователей, обычно этот механизм называют системой аутентификации, т.к. эти функции связаны.

source: :class:`~django.contrib.auth.models.User` objects are the core of the authentication system. They typically represent the people interacting with your site and are used to enable things like restricting access, registering user profiles, associating content with creators etc. Only one class of user exists in Django's authentication framework, i.e., :attr:`'superusers' <django.contrib.auth.models.User.is_superuser>` or admin :attr:`'staff' <django.contrib.auth.models.User.is_staff>` users are just user objects with special attributes set, not different classes of user objects.
ru: Объекты :class:`~django.contrib.auth.models.User` - основа системы аутентификации. Они представляют пользователей сайта и используются для проверки прав доступа, регистрации пользователей, ассоциации данных с пользователями. Для представления пользователей в системе аутентификации используется только один класс, таким образом :attr:`'суперпользователи' <django.contrib.auth.models.User.is_superuser>` или :attr:`'персонал' <django.contrib.auth.models.User.is_staff>` - это такие же объекты пользователей, просто с определёнными атрибутами.

source: The primary attributes of the default user are:
ru: Основные атрибуты пользователя:

source: See the :class:`full API documentation <django.contrib.auth.models.User>` for full reference, the documentation that follows is more task oriented.
ru: Подробности смотрите в :class:`полном описании API <django.contrib.auth.models.User>`, текущий раздел больше ориентирован на использование аутентификации.

source: Creating users
ru: Создание пользователей

source: The most direct way to create users is to use the included :meth:`~django.contrib.auth.models.UserManager.create_user` helper function::
ru: Самый простой способ создать пользователя -- использовать метод :meth:`~django.contrib.auth.models.UserManager.create_user`::

source: If you have the Django admin installed, you can also :ref:`create users interactively <auth-admin>`.
ru: Если вы используете интерфейс администратора Django, вы можете :ref:`создать пользователя через UI <auth-admin>`.

source: Creating superusers
ru: Создание суперпользователя

source: Create superusers using the :djadmin:`createsuperuser` command::
ru: Суперпользователя можно создать с помощью команды :djadmin:`createsuperuser`::

source: Changing passwords
ru: Смена пароля

source: Django does not store raw (clear text) passwords on the user model, but only a hash (see :doc:`documentation of how passwords are managed </topics/auth/passwords>` for full details). Because of this, do not attempt to manipulate the password attribute of the user directly. This is why a helper function is used when creating a user.
ru: Django не хранит пароль в открытом виде, хранится только хеш (смотрите :doc:`раздел о работе с паролями </topics/auth/passwords>`). Поэтому не советуем менять пароль напрямую. Именно по этой причине пользователь создается через специальную функцию.

source: To change a user's password, you have several options:
ru: Пароль можно сменить несколькими способами:

source: You can also change a password programmatically, using :meth:`~django.contrib.auth.models.User.set_password()`:
ru: Вы можете изменить пароль программно, используя метод :meth:`~django.contrib.auth.models.User.set_password()`:

source: If you have the Django admin installed, you can also change user's passwords on the :ref:`authentication system's admin pages <auth-admin>`.
ru: Если вы используете интерфейс администратора Django, вы можете изменить пароль, :ref:`используя админку<auth-admin>`.

source: Django also provides :ref:`views <built-in-auth-views>` and :ref:`forms <built-in-auth-forms>` that may be used to allow users to change their own passwords.
ru: Django также предоставляет :ref:`представления <built-in-auth-views>` и :ref:`формы <built-in-auth-forms>`, которые можно использовать при создании страниц для смены пароля пользователем.

source: Permissions and Authorization
ru: Права доступа и авторизация

source: It's used by the Django admin site, but you're welcome to use it in your own code.
ru: Эта система используется админкой Django, но вы можете использовать её и в своем коде.

source: The Django admin site uses permissions as follows:
ru: Админка использует проверку прав следующим образом:

source: Access to view the "add" form and add an object is limited to users with the "add" permission for that type of object.
ru: При доступе к странице добавления объекта проверяется наличие права "add" для объектов этого типа.

source: Access to view the change list, view the "change" form and change an object is limited to users with the "change" permission for that type of object.
ru: При доступе к страницам просмотра списка объектов и изменения объекта проверяется наличие права "change" для объектов этого типа.

source: Access to delete an object is limited to users with the "delete" permission for that type of object.
ru: При удалении объекта проверяется наличие права "delete" для объектов этого типа.

source: :class:`~django.contrib.auth.models.User` objects have two many-to-many fields: ``groups`` and ``user_permissions``. :class:`~django.contrib.auth.models.User` objects can access their related objects in the same way as any other :doc:`Django model </topics/db/models>`::
ru: Модель :class:`~django.contrib.auth.models.User` содержит связи многое ко многим с таблицами ``groups`` и ``user_permissions``. Объект модели :class:`~django.contrib.auth.models.User` работает со связанными моделями, как и другие :doc:`модели Django </topics/db/models>`::

source: Default permissions
ru: Права доступа по умолчанию

source: These permissions will be created when you run :djadmin:`manage.py migrate <migrate>`; the first time you run ``migrate`` after adding ``django.contrib.auth`` to :setting:`INSTALLED_APPS`, the default permissions will be created for all previously-installed models, as well as for any new models being installed at that time. Afterward, it will create default permissions for new models each time you run :djadmin:`manage.py migrate <migrate>` (the function that creates permissions is connected to the :data:`~django.db.models.signals.post_migrate` signal).
ru: Эти права доступа создаются при выполнении команды :djadmin:`manage.py migrate <migrate>`. При первом выполнении ``migrate``, после добавления ``django.contrib.auth`` в :setting:`INSTALLED_APPS`, права доступа по умолчанию создаются для всех старых и новых моделей. Впоследствии команда назначает стандартные права на новые модели при каждом запуске :djadmin:`manage.py migrate <migrate>` (функция, которая создаёт права, подключена к сигналу :data:`~django.db.models.signals.post_migrate`).

source: Assuming you have an application with an :attr:`~django.db.models.Options.app_label` ``foo`` and a model named ``Bar``, to test for basic permissions you should use:
ru: Предположим у вас есть приложение с :attr:`~django.db.models.Options.app_label` ``foo`` и модель ``Bar``. Чтобы проверить права доступа, используйте:

source: The :class:`~django.contrib.auth.models.Permission` model is rarely accessed directly.
ru: Модель :class:`~django.contrib.auth.models.Permission` редко используется напрямую.

source: Groups
ru: Группы

source: :class:`django.contrib.auth.models.Group` models are a generic way of categorizing users so you can apply permissions, or some other label, to those users. A user can belong to any number of groups.
ru: Модель :class:`django.contrib.auth.models.Group` предоставляет возможность группировать пользователей, добавляя им набор прав доступа. Пользователь может принадлежать нескольким группам.

source: A user in a group automatically has the permissions granted to that group. For example, if the group ``Site editors`` has the permission ``can_edit_home_page``, any user in that group will have that permission.
ru: Пользователь, добавленный в группу, автоматически получает все права доступа этой группы. Например, если группа ``Site editors`` содержит права доступа ``can_edit_home_page``, любой пользователь в этой группе получить это право доступа.

source: Beyond permissions, groups are a convenient way to categorize users to give them some label, or extended functionality. For example, you could create a group ``'Special users'``, and you could write code that could, say, give them access to a members-only portion of your site, or send them members-only email messages.
ru: Также группы позволяют группировать пользователей, добавляя метки или дополнительные возможности. Например, вы можете создать группу ``'Special users'``, и написать код, который предоставляет доступ к дополнительному функционалу сайта, или отправлять сообщения только пользователям этой группы.

source: Programmatically creating permissions
ru: Программное создание прав доступа

source: While :ref:`custom permissions <custom-permissions>` can be defined within a model's ``Meta`` class, you can also create permissions directly. For example, you can create the ``can_publish`` permission for a ``BlogPost`` model in ``myapp``::
ru: Кроме добавления :ref:`своих прав доступа <custom-permissions>` через класс ``Meta`` модели, вы также можете создать их напрямую. Например, создадим право доступа ``can_publish`` для модели ``BlogPost`` в приложении ``myapp``::

source: The permission can then be assigned to a :class:`~django.contrib.auth.models.User` via its ``user_permissions`` attribute or to a :class:`~django.contrib.auth.models.Group` via its ``permissions`` attribute.
ru: Теперь его можно добавить объекту :class:`~django.contrib.auth.models.User` через атрибут ``user_permissions`` или к объекту :class:`~django.contrib.auth.models.Group` через атрибут ``permissions``.

source: Permission caching
ru: Кеширование прав доступа

source: Authentication in Web requests
ru: Аутентификация в запросах

source: Django uses :doc:`sessions </topics/http/sessions>` and middleware to hook the authentication system into :class:`request objects <django.http.HttpRequest>`.
ru: Django использует :doc:`сессию </topics/http/sessions>` и промежуточный слой для работы системы аутентификации в :class:`объекте запроса <django.http.HttpRequest>`.

source: These provide a :attr:`request.user <django.http.HttpRequest.user>` attribute on every request which represents the current user. If the current user has not logged in, this attribute will be set to an instance of :class:`~django.contrib.auth.models.AnonymousUser`, otherwise it will be an instance of :class:`~django.contrib.auth.models.User`.
ru: Этот механизм предоставляет атрибут :attr:`request.user <django.http.HttpRequest.user>` для каждого запроса, который возвращает текущего пользователя. Если текущий пользователь не авторизован, атрибут содержит экземпляр :class:`~django.contrib.auth.models.AnonymousUser`, иначе экземпляр :class:`~django.contrib.auth.models.User`.

source: How to log a user in
ru: Как авторизовать пользователя

source: If you have an authenticated user you want to attach to the current session - this is done with a :func:`~django.contrib.auth.login` function.
ru: Если вы ходите привязать к сессии авторизованного пользователя, используйте функцию :func:`~django.contrib.auth.login`.

source: To log a user in, from a view, use :func:`~django.contrib.auth.login()`. It takes an :class:`~django.http.HttpRequest` object and a :class:`~django.contrib.auth.models.User` object. :func:`~django.contrib.auth.login()` saves the user's ID in the session, using Django's session framework.
ru: Чтобы авторизовать пользователя в представлении, используйте функцию :func:`~django.contrib.auth.login()`. Она принимает объект :class:`~django.http.HttpRequest` и объект :class:`~django.contrib.auth.models.User`. Функция :func:`~django.contrib.auth.login()` сохраняет идентификатор пользователя в сессии, используя Django приложение для работы с сессиями.

source: Note that any data set during the anonymous session is retained in the session after a user logs in.
ru: Следует отметить, что любые данные установленные в анонимной сессии будут сохранены в сессии пользователя после его авторизации.

source: This example shows how you might use both :func:`~django.contrib.auth.authenticate()` and :func:`~django.contrib.auth.login()`::
ru: Данные пример показывает как вы можете использовать обе функции :func:`~django.contrib.auth.authenticate()` и :func:`~django.contrib.auth.login()`::

source: How to log a user out
ru: Как отменить авторизацию пользователя

source: To log out a user who has been logged in via :func:`django.contrib.auth.login()`, use :func:`django.contrib.auth.logout()` within your view. It takes an :class:`~django.http.HttpRequest` object and has no return value. Example::
ru: Для отмены авторизации пользователя, который был авторизован с помощью функции :func:`django.contrib.auth.login()`, следует использовать функцию :func:`django.contrib.auth.logout()` в коде вашего представления. Функция принимает объект :class:`~django.http.HttpRequest` и не возвращает никаких значений. Например::

source: Note that :func:`~django.contrib.auth.logout()` doesn't throw any errors if the user wasn't logged in.
ru: Следует отметить, что функция :func:`~django.contrib.auth.logout()` не выбрасывает никаких ошибок, если пользователь не был ранее авторизован.

source: When you call :func:`~django.contrib.auth.logout()`, the session data for the current request is completely cleaned out. All existing data is removed. This is to prevent another person from using the same Web browser to log in and have access to the previous user's session data. If you want to put anything into the session that will be available to the user immediately after logging out, do that *after* calling :func:`django.contrib.auth.logout()`.
ru: При вызове функции :func:`~django.contrib.auth.logout()` в рамках текущего запроса будут очищены все данные сессии. Все существующие данные будут стёрты. Это происходит для того, чтобы предотвратить возможность доступа к этим данным для другого пользователя, который будет использовать тот же браузер для своей авторизации. Если потребуется поместить некие данные в сессию, которые должны быть доступны пользователя сразу после отмены его авторизации, выполняйте это *после* вызова функции :func:`django.contrib.auth.logout()`.

source: Limiting access to logged-in users
ru: Ограничение доступа для неавторизованных пользователей

source: The raw way
ru: Прямой путь

source: ...or display an error message::
ru: ... или отображение сообщения об ошибке::

source: The ``login_required`` decorator
ru: Декоратор login_required

source: As a shortcut, you can use the convenient :func:`~django.contrib.auth.decorators.login_required` decorator::
ru: Для краткости кода вы можете использовать декоратор :func:`~django.contrib.auth.decorators.login_required`::

source: :func:`~django.contrib.auth.decorators.login_required` does the following:
ru: Функция :func:`~django.contrib.auth.decorators.login_required` делает следующее:

source: If the user isn't logged in, redirect to :setting:`settings.LOGIN_URL <LOGIN_URL>`, passing the current absolute path in the query string. Example: ``/accounts/login/?next=/polls/3/``.
ru: Если пользователь не авторизован, то перенаправляет его на URL, указанный в параметре конфигурации :setting:`settings.LOGIN_URL <LOGIN_URL>`, передавая текущий абсолютный путь в запросе. Например: ``/accounts/login/?next=/polls/3/``.

source: If the user is logged in, execute the view normally. The view code is free to assume the user is logged in.
ru: Если пользователь авторизован, то выполняет код представления. В коде представления не требуется выполнять проверку авторизован ли пользователь или нет.

source: By default, the path that the user should be redirected to upon successful authentication is stored in a query string parameter called ``"next"``. If you would prefer to use a different name for this parameter, :func:`~django.contrib.auth.decorators.login_required` takes an optional ``redirect_field_name`` parameter::
ru: По умолчанию, в параметре ``"next"`` строки запроса хранится путь, по которому должен быть перенаправлен пользователь в результате успешной аутентификации. Если вам потребуется использовать другое имя для этого параметра, то воспользуйтесь необязательным аргументом ``redirect_field_name`` декоратора :func:`~django.contrib.auth.decorators.login_required`::

source: Note that if you provide a value to ``redirect_field_name``, you will most likely need to customize your login template as well, since the template context variable which stores the redirect path will use the value of ``redirect_field_name`` as its key rather than ``"next"`` (the default).
ru: Следует отметить, что если вы воспользуетесь аргументом ``redirect_field_name``, то вам скорее всего потребуется внести изменения в ваш шаблон авторизации, так как переменная контекста шаблона, которая содержит путь перенаправления, будет использовать значение аргумента ``redirect_field_name`` в качестве своего ключа, а не стандартное значение ``"next"``.

source: :func:`~django.contrib.auth.decorators.login_required` also takes an optional ``login_url`` parameter. Example::
ru: Декоратор :func:`~django.contrib.auth.decorators.login_required` также принимает необязательный аргумент ``login_url``. Например::

source: Note that if you don't specify the ``login_url`` parameter, you'll need to ensure that the :setting:`settings.LOGIN_URL <LOGIN_URL>` and your login view are properly associated. For example, using the defaults, add the following lines to your URLconf::
ru: Следует отметить, что если вы не укажите аргумент ``login_url``, то вам потребуется проверить параметр конфигурации :setting:`settings.LOGIN_URL <LOGIN_URL>` и ваше представление для авторизации соответственно настроены. Например, пользуясь стандартным поведением, добавьте следующие строки к вашей схеме URL::

source: The :setting:`settings.LOGIN_URL <LOGIN_URL>` also accepts view function names and :ref:`named URL patterns <naming-url-patterns>`. This allows you to freely remap your login view within your URLconf without having to update the setting.
ru: Параметр конфигурации :setting:`settings.LOGIN_URL <LOGIN_URL>` также принимает имена представлений и :ref:`именованные шаблоны URL <naming-url-patterns>`. Это позволяет вам свободно переносить ваше представление для авторизации пользователя внутри схемы URL без необходимости изменения настроек.

source: If you are writing custom views for Django's admin (or need the same authorization check that the built-in views use), you may find the :func:`django.contrib.admin.views.decorators.staff_member_required` decorator a useful alternative to ``login_required()``.
ru: Если вы создаёте собственные представления для интерфейса администратора (или вам нужна та же аутентификация, что используются встроенными представлениями), то вам может пригодиться декоратор :func:`django.contrib.admin.views.decorators.staff_member_required` в качестве полезной альтернативы ``login_required()``.

source: The ``LoginRequired`` mixin
ru: Примесь ``LoginRequired``

source: When using :doc:`class-based views </topics/class-based-views/index>`, you can achieve the same behavior as with ``login_required`` by using the ``LoginRequiredMixin``. This mixin should be at the leftmost position in the inheritance list.
ru: При использовании :doc:`CBV представлений </topics/class-based-views/index>`, вы можете получить поведение аналогичное ``login_required``, используя примесь ``LoginRequiredMixin``. Эта примесь должна быть указана в самом начале списка наследования.

source: If a view is using this mixin, all requests by non-authenticated users will be redirected to the login page or shown an HTTP 403 Forbidden error, depending on the :attr:`~django.contrib.auth.mixins.AccessMixin.raise_exception` parameter.
ru: Если представление использует эту примесь, все запросы от неаутентифицированных пользователей будут перенаправлены на страницу аутентификации или будет показана ошибка HTTP 403 Forbidden, это зависит от параметра :attr:`~django.contrib.auth.mixins.AccessMixin.raise_exception`.

source: You can set any of the parameters of :class:`~django.contrib.auth.mixins.AccessMixin` to customize the handling of unauthorized users::
ru: Вы можете установить любой из параметров :class:`~django.contrib.auth.mixins.AccessMixin` для управления обработкой неаутентифицированных пользователей::

source: Limiting access to logged-in users that pass a test
ru: Ограничение доступа для авторизованных пользователей с помощью дополнительной проверки

source: To limit access based on certain permissions or some other test, you'd do essentially the same thing as described in the previous section.
ru: Для ограничения доступа пользователям на основе определённых прав или какой-либо другой проверке, вам следует выполнять те же действия, что описаны выше.

source: As a shortcut, you can use the convenient ``user_passes_test`` decorator which performs a redirect when the callable returns ``False``::
ru: Для удобства вы можете использовать декоратор ``user_passes_test``, который выполняет перенаправление в случае, если проверяющая функция возвращает ``False``::

source: :func:`~django.contrib.auth.decorators.user_passes_test` takes a required argument: a callable that takes a :class:`~django.contrib.auth.models.User` object and returns ``True`` if the user is allowed to view the page. Note that :func:`~django.contrib.auth.decorators.user_passes_test` does not automatically check that the :class:`~django.contrib.auth.models.User` is not anonymous.
ru: Декоратор :func:`~django.contrib.auth.decorators.user_passes_test` принимает обязательный аргумент: функцию, которая принимает объект :class:`~django.contrib.auth.models.User` и возвращает ``True``, если пользователю разрешён доступ к просмотру страницы. Следует отметить, что декоратор :func:`~django.contrib.auth.decorators.user_passes_test` не выполняет автоматически проверку, что :class:`~django.contrib.auth.models.User` прошёл авторизацию.

source: :func:`~django.contrib.auth.decorators.user_passes_test` takes two optional arguments:
ru: Декоратор :func:`~django.contrib.auth.decorators.user_passes_test` принимает для необязательных аргумента:
