Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/topics/auth/index.po
Languages: ru

source: User authentication in Django
ru: Аутентификация пользователей в Django

source: Django comes with a user authentication system. It handles user accounts, groups, permissions and cookie-based user sessions. This section of the documentation explains how the default implementation works out of the box, as well as how to :doc:`extend and customize </topics/auth/customizing>` it to suit your project's needs.
ru: Django поставляется с системой аутентификации пользователей. Она обеспечивает пользовательские аккаунты, группы, права и сессии на основе куки. Этот раздел документации объясняет как работает стандартная реализация и как можно :doc:`расширить и настроить </topics/auth/customizing>` её под нужды своего проекта.

source: Overview
ru: Введение

source: The Django authentication system handles both authentication and authorization. Briefly, authentication verifies a user is who they claim to be, and authorization determines what an authenticated user is allowed to do. Here the term authentication is used to refer to both tasks.
ru: Система аутентификации Django отвечает за оба аспекта: аутентификацию и авторизацию. Если коротко, то аутентификация проверяет пользователя, а авторизация определяет, что аутентифицированный пользователь может делать. Далее термин "аутентификация" будет использоваться для обозначения обоих аспектов.

source: The auth system consists of:
ru: Система аутентификации состоит из:

source: Users
ru: Пользователей

source: Permissions: Binary (yes/no) flags designating whether a user may perform a certain task.
ru: Прав: Бинарные (да/нет) флаги, определяющие наличие у пользователя права выполнять определённые действия.

source: Groups: A generic way of applying labels and permissions to more than one user.
ru: Групп: Общий способ назначения меток и прав на множество пользователей.

source: A configurable password hashing system
ru: Настраиваемой системы хеширования паролей

source: Forms and view tools for logging in users, or restricting content
ru: Инструментов для форм и представлений для аутентификации пользователей или для ограничения доступа к контенту

source: A pluggable backend system
ru: Системы плагинов

source: The authentication system in Django aims to be very generic and doesn't provide some features commonly found in web authentication systems. Solutions for some of these common problems have been implemented in third-party packages:
ru: Аутентификационная система Django старается быть очень простой и не предоставляет некоторые фичи, распространённые в других системах веб аутентификации. Такие фичи реализованы в сторонних пакетах:

source: Password strength checking
ru: Проверка сложности пароля

source: Throttling of login attempts
ru: Ограничение попыток входа

source: Authentication against third-parties (OAuth, for example)
ru: Аутентификация через сторонние сервисы (OAuth, например)

source: Installation
ru: Установка

source: Authentication support is bundled as a Django contrib module in ``django.contrib.auth``. By default, the required configuration is already included in the :file:`settings.py` generated by :djadmin:`django-admin startproject <startproject>`, these consist of two items listed in your :setting:`INSTALLED_APPS` setting:
ru: Поддержка аутентификации скомпонована в виде модуля в ``django.contrib.auth``. По умолчанию, требуемые настройки уже включены в :file:`settings.py`, создаваемый с помощью команды :djadmin:`django-admin startproject <startproject>`, и представляют собой две записи в параметре конфигурации :setting:`INSTALLED_APPS`:

source: ``'django.contrib.auth'`` contains the core of the authentication framework, and its default models.
ru: ``'django.contrib.auth'`` содержит ядро системы аутентификации и её стандартные модели.

source: ``'django.contrib.contenttypes'`` is the Django :doc:`content type system </ref/contrib/contenttypes>`, which allows permissions to be associated with models you create.
ru: ``'django.contrib.contenttypes'`` является :doc:`фреймворком типов </ref/contrib/contenttypes>`, который позволяет правам быть назначенными на создаваемые вами модели.

source: and these items in your :setting:`MIDDLEWARE` setting:
ru: и записи в параметре конфигурации :setting:`MIDDLEWARE`:

source: :class:`~django.contrib.sessions.middleware.SessionMiddleware` manages :doc:`sessions </topics/http/sessions>` across requests.
ru: :class:`~django.contrib.sessions.middleware.SessionMiddleware` управляет :doc:`сессиями </topics/http/sessions>` во время запросов.

source: :class:`~django.contrib.auth.middleware.AuthenticationMiddleware` associates users with requests using sessions.
ru: :class:`~django.contrib.auth.middleware.AuthenticationMiddleware` ассоциирует пользователей с запросами с помощью сессий.

source: With these settings in place, running the command ``manage.py migrate`` creates the necessary database tables for auth related models and permissions for any models defined in your installed apps.
ru: При наличии этих настроек, применение команды ``manage.py migrate`` создаёт в базе данных необходимые для системы аутентификации таблицы, создаёт права для любых моделей всех зарегистрированных приложений.

source: Usage
ru: Использование

source: :doc:`Using Django's default implementation <default>`
ru: :doc:`Использование стандартной системы аутентификации Django <default>`

source: :ref:`Working with User objects <user-objects>`
ru: :ref:`Работа с объектами User <user-objects>`

source: :ref:`Permissions and authorization <topic-authorization>`
ru: :ref:`Права и авторизация <topic-authorization>`

source: :ref:`Authentication in web requests <auth-web-requests>`
ru: :ref:`Аутентификация в веб запросах <auth-web-requests>`

source: :ref:`Managing users in the admin <auth-admin>`
ru: :ref:`Управление пользователями в интерфейсе администратора <auth-admin>`

source: :doc:`API reference for the default implementation </ref/contrib/auth>`
ru: :doc:`Справочник API для стандартной реализации </ref/contrib/auth>`

source: :doc:`Customizing Users and authentication <customizing>`
ru: :doc:`Настройка пользователей и аутентификации <customizing>`

source: :doc:`Password management in Django <passwords>`
ru: :doc:`Управление паролями в Django <passwords>`
