Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/ref/applications.po
Languages: ru

source: Applications
ru: Приложения

source: Django contains a registry of installed applications that stores configuration and provides introspection. It also maintains a list of available :doc:`models </topics/db/models>`.
ru: Django содержит реестр установленных приложений, который содержит текущие настройки и предоставляет интроспекцию. Также предоставляет список доступных :doc:`моделей </topics/db/models>`.

source: This registry is simply called :attr:`~django.apps.apps` and it's available in :mod:`django.apps`::
ru: Этот реестр называется просто :attr:`~django.apps.apps` и находится в модуле :mod:`django.apps`::

source: Projects and applications
ru: Проекты и приложения

source: It is important to understand that a Django application is just a set of code that interacts with various parts of the framework. There's no such thing as an ``Application`` object. However, there's a few places where Django needs to interact with installed applications, mainly for configuration and also for introspection. That's why the application registry maintains metadata in an :class:`~django.apps.AppConfig` instance for each installed application.
ru: Важно помнить, что приложение Django - это просто код, который работает с различными частями фреймверка. Не существует такой вещи, как объект ``Application``. Однако, существуют ситуации, когда Django необходимо работать с установленными приложениями, в основном для конфигурации и интроспекции. Для этого реестр приложений содержит метаданные в объекте :class:`~django.apps.AppConfig` для каждого экземпляра приложения.

source: Configuring applications
ru: Настройка приложений

source: To configure an application, subclass :class:`~django.apps.AppConfig` and put the dotted path to that subclass in :setting:`INSTALLED_APPS`.
ru: Для настройки приложения создайте класс наследник :class:`~django.apps.AppConfig` и укажите путь для его импорта в :setting:`INSTALLED_APPS`.

source: When :setting:`INSTALLED_APPS` simply contains the dotted path to an application module, Django checks for a ``default_app_config`` variable in that module.
ru: Если :setting:`INSTALLED_APPS` содержит путь просто к модулю приложения, Django проверяет переменную ``default_app_config`` в модуле.

source: If it's defined, it's the dotted path to the :class:`~django.apps.AppConfig` subclass for that application.
ru: Если она определена, она должна содержать путь для импорта класса наследника :class:`~django.apps.AppConfig` для этого приложения.

source: If there is no ``default_app_config``, Django uses the base :class:`~django.apps.AppConfig` class.
ru: Если ``default_app_config`` не существует, Django будет использовать базовый класс :class:`~django.apps.AppConfig`.

source: ``default_app_config`` allows applications that predate Django 1.7 such as ``django.contrib.admin`` to opt-in to :class:`~django.apps.AppConfig` features without requiring users to update their :setting:`INSTALLED_APPS`.
ru: ``default_app_config`` позволяет использовать :class:`~django.apps.AppConfig` для приложений, которые были созданы до Django 1.7, например ``django.contrib.admin``, без изменения :setting:`INSTALLED_APPS`.

source: New applications should avoid ``default_app_config``. Instead they should require the dotted path to the appropriate :class:`~django.apps.AppConfig` subclass to be configured explicitly in :setting:`INSTALLED_APPS`.
ru: Новые приложения не должны использовать ``default_app_config``. Вместо этого они должны требовать указать путь к классу-наследнику :class:`~django.apps.AppConfig` в :setting:`INSTALLED_APPS`.

source: For application authors
ru: Для разработчика приложений

source: If you're creating a pluggable app called "Rock ’n’ roll", here's how you would provide a proper name for the admin::
ru: Если вы разрабатываете приложение, которое называется "Rock ’n’ roll", вот как вы можете указать правильное название для админки::

source: You can make your application load this :class:`~django.apps.AppConfig` subclass by default as follows::
ru: Вы можете указать Django использовать этот класс по умолчанию следующим образом::

source: That will cause ``RockNRollConfig`` to be used when :setting:`INSTALLED_APPS` just contains ``'rock_n_roll'``. This allows you to make use of :class:`~django.apps.AppConfig` features without requiring your users to update their :setting:`INSTALLED_APPS` setting. Besides this use case, it's best to avoid using ``default_app_config`` and instead specify the app config class in :setting:`INSTALLED_APPS` as described next.
ru: Теперь ``RockNRollConfig`` будет использоваться, если в :setting:`INSTALLED_APPS` просто указать ``'rock_n_roll'``. Теперь пользователи приложения могут использовать настройки из :class:`~django.apps.AppConfig` без изменения настройки :setting:`INSTALLED_APPS`. В большинстве случаев рекомендуется не использовать ``default_app_config`` и явно указывать класс настроек в :setting:`INSTALLED_APPS`.

source: Of course, you can also tell your users to put ``'rock_n_roll.apps.RockNRollConfig'`` in their :setting:`INSTALLED_APPS` setting. You can even provide several different :class:`~django.apps.AppConfig` subclasses with different behaviors and allow your users to choose one via their :setting:`INSTALLED_APPS` setting.
ru: Конечно вы можете попросить пользователей использовать ``'rock_n_roll.apps.RockNRollConfig'`` в :setting:`INSTALLED_APPS`. Вы даже можете предоставить несколько классов наследников :class:`~django.apps.AppConfig` с различными настройками и позволить пользователям добавить необходимый в :setting:`INSTALLED_APPS`.

source: The recommended convention is to put the configuration class in a submodule of the application called ``apps``. However, this isn't enforced by Django.
ru: Принято все классы настроек добавлять в под-модуль ``apps`` приложения. Но Django не заставляет соблюдать это правило.

source: You must include the :attr:`~django.apps.AppConfig.name` attribute for Django to determine which application this configuration applies to. You can define any attributes documented in the :class:`~django.apps.AppConfig` API reference.
ru: Необходимо указывать атрибут :attr:`~django.apps.AppConfig.name`, чтобы Django мог определить к какому приложению относится класс конфигурации. Полный список параметров можно найти в описании API :class:`~django.apps.AppConfig`.

source: If your code imports the application registry in an application's ``__init__.py``, the name ``apps`` will clash with the ``apps`` submodule. The best practice is to move that code to a submodule and import it. A workaround is to import the registry under a different name::
ru: Если ваш код импортирует реестр приложений в ``__init__.py`` приложения, название ``apps`` будет пересекаться с под-модулем ``apps``. Можно вынести этот код в под-модуль приложения и импортировать его в ``__init__.py``. Другой вариант - импортировать реестр под другим названием::

source: For application users
ru: Для пользователей приложений

source: Again, defining project-specific configuration classes in a submodule called ``apps`` is a convention, not a requirement.
ru: Опять же, определять классы настроек в под-модуле ``apps`` - это просто неписанное соглашение, а не правило.

source: Application configuration
ru: Конфигурация приложения

source: Application configuration objects store metadata for an application. Some attributes can be configured in :class:`~django.apps.AppConfig` subclasses. Others are set by Django and read-only.
ru: Объект конфигурации приложения содержит метаданные о приложении. Некоторые атрибуты можно указать в классе наследнике :class:`~django.apps.AppConfig`. Некоторые определены Django и доступны только для чтения.

source: Configurable attributes
ru: Настраиваемые атрибуты

source: Full Python path to the application, e.g. ``'django.contrib.admin'``.
ru: Полный Python путь для импорта приложения, например ``'django.contrib.admin'``.

source: This attribute defines which application the configuration applies to. It must be set in all :class:`~django.apps.AppConfig` subclasses.
ru: Этот атрибут указывает к какому приложению относится класс настроек. Должен указываться во всех классах наследниках :class:`~django.apps.AppConfig`.

source: It must be unique across a Django project.
ru: Должен быть уникальным для проекта.

source: Short name for the application, e.g. ``'admin'``
ru: Короткое название(метка) приложения, например ``'admin'``

source: This attribute allows relabeling an application when two applications have conflicting labels. It defaults to the last component of ``name``. It should be a valid Python identifier.
ru: Этот атрибут позволяет поменять метку приложения, если два приложения используют по умолчанию одинаковые метки. По умолчанию метка равна последней части значения ``name``. Метка должна быть правильным идентификатором Python.

source: Human-readable name for the application, e.g. "Administration".
ru: Читабельное название приложения, например "Administration".

source: This attribute defaults to ``label.title()``.
ru: По умолчанию равен ``label.title()``.

source: Filesystem path to the application directory, e.g. ``'/usr/lib/python3.4/dist-packages/django/contrib/admin'``.
ru: Путь в файловой системе к каталогу с приложением, например ``'/usr/lib/python3.4/dist-packages/django/contrib/admin'``.

source: In most cases, Django can automatically detect and set this, but you can also provide an explicit override as a class attribute on your :class:`~django.apps.AppConfig` subclass. In a few situations this is required; for instance if the app package is a `namespace package`_ with multiple paths.
ru: В большинстве случае Django может автоматически определить и установить это значение, но вы можете переопределить его в классе наследнике :class:`~django.apps.AppConfig`. Это может понадобиться в некоторых случаях, например, если пакет приложения является :ref:`namespace-пакетом <namespace package>` и расположен в нескольких каталогах.

source: Read-only attributes
ru: Неизменяемые атрибуты

source: Root module for the application, e.g. ``<module 'django.contrib.admin' from 'django/contrib/admin/__init__.pyc'>``.
ru: Корневой модуль приложения, например ``<module 'django.contrib.admin' from 'django/contrib/admin/__init__.pyc'>``.

source: Module containing the models, e.g. ``<module 'django.contrib.admin.models' from 'django/contrib/admin/models.pyc'>``.
ru: Модуль, который содержит модели, например ``<module 'django.contrib.admin.models' from 'django/contrib/admin/models.pyc'>``.

source: It may be ``None`` if the application doesn't contain a ``models`` module. Note that the database related signals such as :data:`~django.db.models.signals.pre_migrate` and :data:`~django.db.models.signals.post_migrate` are only emitted for applications that have a ``models`` module.
ru: Может быть ``None``, если приложение не содержит модуль ``models``. Обратите внимание, сигналы, связанные с базой данных, такие как :data:`~django.db.models.signals.pre_migrate` и :data:`~django.db.models.signals.post_migrate`, вызываются только для приложений, которые содержат модуль ``models``.

source: Methods
ru: Методы

source: Returns an iterable of :class:`~django.db.models.Model` classes for this application.
ru: Возвращает итератор по классам :class:`~django.db.models.Model` для текущего приложения.

source: Returns the :class:`~django.db.models.Model` with the given ``model_name``. Raises :exc:`LookupError` if no such model exists in this application. ``model_name`` is case-insensitive.
ru: Возвращает :class:`~django.db.models.Model` для переданного ``model_name``. Вызывает :exc:`LookupError`, если модель не существует. ``model_name`` регистро-независимое значение.

source: Subclasses can override this method to perform initialization tasks such as registering signals. It is called as soon as the registry is fully populated.
ru: Класс наследник может переопределить этот метод, чтобы выполнить инициализацию приложения, например зарегистрировать сигналы. Вызывает, когда реестр приложений будет полностью инициализирован и все приложения будут добавлены.

source: Although you can access model classes as described above, avoid interacting with the database in your :meth:`ready()` implementation. This includes model methods that execute queries (:meth:`~django.db.models.Model.save()`, :meth:`~django.db.models.Model.delete()`, manager methods etc.), and also raw SQL queries via ``django.db.connection``. Your :meth:`ready()` method will run during startup of every management command. For example, even though the test database configuration is separate from the production settings, ``manage.py test`` would still execute some queries against your **production** database!
ru: Хотя вы и можете получить доступ к моделям, как в примере выше, избегайте работы с базой данных в методе :meth:`ready()`. Это включает методы, которые выполняют запросы к базе данных (:meth:`~django.db.models.Model.save()`, :meth:`~django.db.models.Model.delete()`, методы менеджера и т.д.) и SQL запросы через ``django.db.connection``. Метод :meth:`ready()` будет вызываться при каждом запуске команды Django. Например, хотя настройка тестовой базы данных отделена от рабочих настроек проекта, ``manage.py test`` выполнила бы запросы на **рабочей** базе данных!

source: In the usual initialization process, the ``ready`` method is only called once by Django. But in some corner cases, particularly in tests which are fiddling with installed applications, ``ready`` might be called more than once. In that case, either write idempotent methods, or put a flag on your ``AppConfig`` classes to prevent re-running code which should be executed exactly one time.
ru: При обычном процессе инициализации метод ``ready`` вызывается Django только один раз. Но в некоторых случаях, в частности при выполнении тестов, ``ready`` может вызываться несколько раз. Вам следует писать идемпотентный код(который можно безопасно вызывать несколько раз), или добавить флаг в класс ``AppConfig`` и проверять его, чтобы код выполнялся только один раз.

source: Namespace packages as apps (Python 3.3+)
ru: Namespace-пакеты приложений (Python 3.3+)

source: Python versions 3.3 and later support Python packages without an ``__init__.py`` file. These packages are known as "namespace packages" and may be spread across multiple directories at different locations on ``sys.path`` (see :pep:`420`).
ru: Python версии 3.3 и выше поддерживает Python пакеты без файла ``__init__.py``. Эти пакеты называют "namespace-пакетами" и могут находится в нескольких каталогах в ``sys.path`` (смотрите :pep:`420`).

source: Django applications require a single base filesystem path where Django (depending on configuration) will search for templates, static assets, etc. Thus, namespace packages may only be Django applications if one of the following is true:
ru: Django приложениям необходим один основной путь в файловой системе, где Django (в зависимости от настроек) будет искать шаблоны, статические файлы, и прочее. Таким образом, namespace-пакеты могут быть приложениями Django только при следующих условиях:

source: The namespace package actually has only a single location (i.e. is not spread across more than one directory.)
ru: Namespace-пакет содержит один каталог (то есть не разделен на несколько каталогов)

source: The :class:`~django.apps.AppConfig` class used to configure the application has a :attr:`~django.apps.AppConfig.path` class attribute, which is the absolute directory path Django will use as the single base path for the application.
ru: Используется класс :class:`~django.apps.AppConfig`, указывающий в :attr:`~django.apps.AppConfig.path` один абсолютный путь к каталогу, который Django будет использовать как каталог приложения.

source: If neither of these conditions is met, Django will raise :exc:`~django.core.exceptions.ImproperlyConfigured`.
ru: Если ни одно из этих условий не соблюдено, Django вызовет исключение :exc:`~django.core.exceptions.ImproperlyConfigured`.

source: Application registry
ru: Реестр приложений

source: The application registry provides the following public API. Methods that aren't listed below are considered private and may change without notice.
ru: Реестр приложений предоставляет следующий публичный API. Методы, которые не описаны здесь, являются приватными и могут изменяться в будущем без предупреждений.

source: Returns an iterable of :class:`~django.apps.AppConfig` instances.
ru: Возвращает итератор по объектам :class:`~django.apps.AppConfig`.

source: Returns an :class:`~django.apps.AppConfig` for the application with the given ``app_label``. Raises :exc:`LookupError` if no such application exists.
ru: Возвращает :class:`~django.apps.AppConfig` приложения для ``app_label``. Вызывает :exc:`LookupError`, если приложение не найдено.

source: Checks whether an application with the given name exists in the registry. ``app_name`` is the full name of the app, e.g. ``'django.contrib.admin'``.
ru: Проверяет добавлено ли приложение с таким названием в реестр. ``app_name`` - полное название приложения, например ``'django.contrib.admin'``.

source: Returns the :class:`~django.db.models.Model` with the given ``app_label`` and ``model_name``. As a shortcut, this method also accepts a single argument in the form ``app_label.model_name``. ``model_name`` is case- insensitive.
ru: Возвращает :class:`~django.db.models.Model` для ``app_label`` и ``model_name``. Для удобства принимает аргумент вида ``app_label.model_name``. ``model_name`` - регистро-независимое значение.

source: Raises :exc:`LookupError` if no such application or model exists. Raises :exc:`ValueError` when called with a single argument that doesn't contain exactly one dot.
ru: Вызывает :exc:`LookupError`, если приложение или модель не найдена. Вызывает :exc:`ValueError`, если передан один аргумент неправильного формата.

source: Initialization process
ru: Процесс инициализации

source: How applications are loaded
ru: Как загружаются приложения

source: When Django starts, :func:`django.setup()` is responsible for populating the application registry.
ru: Функция :func:`django.setup()` отвечает за заполнение реестра приложений при запуске Django.

source: Configures Django by:
ru: Настраивает Django, выполняя следующие действия:

source: Loading the settings.
ru: Загрузка настроек.

source: Setting up logging.
ru: Настройка логирования.

source: Initializing the application registry.
ru: Инициализация реестра приложений.

source: This function is called automatically:
ru: Эта функция вызывается автоматически:

source: When running an HTTP server via Django's WSGI support.
ru: При запуске HTTP сервера с Django через WSGI.

source: When invoking a management command.
ru: При выполнении команды Django.

source: It must be called explicitly in other cases, for instance in plain Python scripts.
ru: Этот метод необходимо вызывать явно в некоторых случаях, например в Python скрипте.

source: The application registry is initialized in three stages. At each stage, Django processes all applications in the order of :setting:`INSTALLED_APPS`.
ru: Реестр приложений инициализируется в три этапа. На каждом этапе Django обрабатывает приложения в порядке, указанном в :setting:`INSTALLED_APPS`.

source: First Django imports each item in :setting:`INSTALLED_APPS`.
ru: Первым делом Django импортирует каждый элемент :setting:`INSTALLED_APPS`.

source: If it's an application configuration class, Django imports the root package of the application, defined by its :attr:`~AppConfig.name` attribute. If it's a Python package, Django creates a default application configuration.
ru: Если это класс настроек приложения, Django импортирует главный пакет приложения, указанный в атрибуте :attr:`~AppConfig.name`. Если это пакет Python, Django создает настройки по умолчанию для приложения.

source: *At this stage, your code shouldn't import any models!*
ru: *На этом этапе ваш код не должен импортировать модели!*

source: In other words, your applications' root packages and the modules that define your application configuration classes shouldn't import any models, even indirectly.
ru: Другими словами, ваш главный пакет и модули, которые содержат классы настроек, не должны импортировать модели, в том числе и неявно.

source: Strictly speaking, Django allows importing models once their application configuration is loaded. However, in order to avoid needless constraints on the order of :setting:`INSTALLED_APPS`, it's strongly recommended not import any models at this stage.
ru: По правде говоря, Django позволяет импортировать модели, когда настройки приложения уже загружены. Однако, чтобы избежать проблем и ограничений с порядком приложений в :setting:`INSTALLED_APPS`, мы настоятельно рекомендуем не делать этого на этом этапе.

source: Once this stage completes, APIs that operate on application configurations such as :meth:`~apps.get_app_config()` become usable.
ru: После выполнения этого этапа, можно использовать API, который работает с настройками приложения, например :meth:`~apps.get_app_config()`.

source: Then Django attempts to import the ``models`` submodule of each application, if there is one.
ru: Затем Django пытается импортировать модуль ``models`` каждого приложения, если такой существует.

source: You must define or import all models in your application's ``models.py`` or ``models/__init__.py``. Otherwise, the application registry may not be fully populated at this point, which could cause the ORM to malfunction.
ru: Вы должны определить или импортировать все модели в ``models.py`` или ``models/__init__.py`` приложения. Иначе, реестр приложений будет не полностью заполнен, что может привести к неправильной работе ORM.

source: Once this stage completes, APIs that operate on models such as :meth:`~apps.get_model()` become usable.
ru: После выполнения этого этапа, можно использовать API, который работает с моделями, например :meth:`~apps.get_model()`.

source: Finally Django runs the :meth:`~AppConfig.ready()` method of each application configuration.
ru: В конце Django вызывает метод :meth:`~AppConfig.ready()` для каждого приложения.

source: Troubleshooting
ru: Решение проблем

source: Here are some common problems that you may encounter during initialization:
ru: Вот список некоторых проблем, которые могут возникнуть при инициализации:

source: ``AppRegistryNotReady`` This happens when importing an application configuration or a models module triggers code that depends on the app registry.
ru: ``AppRegistryNotReady``. Вызывается при импорте настроек приложения или модуля моделей, код которых использует реестр приложений.

source: For example, :func:`~django.utils.translation.ugettext()` uses the app registry to look up translation catalogs in applications. To translate at import time, you need :func:`~django.utils.translation.ugettext_lazy()` instead. (Using :func:`~django.utils.translation.ugettext()` would be a bug, because the translation would happen at import time, rather than at each request depending on the active language.)
ru: Например, :func:`~django.utils.translation.ugettext()` использует реестр приложений для поиска каталогов с файлами локализации. Для локализации на этапе импорта используйте :func:`~django.utils.translation.ugettext_lazy()`. (Использование :func:`~django.utils.translation.ugettext()` приведет к багу, т.к. перевод будет выполнен на момент импорта, а не для каждого запрос с учетом активной локалид.)

source: Executing database queries with the ORM at import time in models modules will also trigger this exception. The ORM cannot function properly until all models are available.
ru: Выполнение запросов к базе данных с помощью ORM в процессе импорта модуля моделей вызовет исключение. ORM не может работать, пока все модели не будут загружены.
