Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/ref/applications.po
Languages: ru

source: Another common culprit is :func:`django.contrib.auth.get_user_model()`. Use the :setting:`AUTH_USER_MODEL` setting to reference the User model at import time.
ru: Еще одна причина ошибок - :func:`django.contrib.auth.get_user_model()`. Используйте настройку :setting:`AUTH_USER_MODEL` для указания ссылки на модель пользователя на этапе импорта.

source: This exception also happens if you forget to call :func:`django.setup()` in a standalone Python script.
ru: Эта ошибка также вызывается, если :func:`django.setup()` не был вызван в Python скрипте.

source: ``ImportError: cannot import name ...`` This happens if the import sequence ends up in a loop.
ru: ``ImportError: cannot import name ...``. Ошибка вызывается при циклических импортах.

source: To eliminate such problems, you should minimize dependencies between your models modules and do as little work as possible at import time. To avoid executing code at import time, you can move it into a function and cache its results. The code will be executed when you first need its results. This concept is known as "lazy evaluation".
ru: Для устранения таких проблем необходимо минимизировать зависимости между модулями моделей и в процессе импорта выполнять минимум действий. Чтобы избежать выполнения кода на этапе импорта, вынесите его в функцию, которая умеет кэшировать результат. Затем вызовите функции при необходимости. Такая концепция называется "ленивое выполнение".

source: ``django.contrib.admin`` automatically performs autodiscovery of ``admin`` modules in installed applications. To prevent it, change your :setting:`INSTALLED_APPS` to contain ``'django.contrib.admin.apps.SimpleAdminConfig'`` instead of ``'django.contrib.admin'``.
ru: ``django.contrib.admin`` автоматически выполняет регистрацию модулей ``admin`` установленных приложений. Чтобы отключить это, укажите в :setting:`INSTALLED_APPS` ``'django.contrib.admin.apps.SimpleAdminConfig'`` вместо ``'django.contrib.admin'``.
