Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/ref/csrf.po
Languages: ru

source: Cross Site Request Forgery protection
ru: Подделка межсайтового запроса (CSRF)

source: The CSRF middleware and template tag provides easy-to-use protection against `Cross Site Request Forgeries`_. This type of attack occurs when a malicious website contains a link, a form button or some JavaScript that is intended to perform some action on your website, using the credentials of a logged-in user who visits the malicious site in their browser. A related type of attack, 'login CSRF', where an attacking site tricks a user's browser into logging into a site with someone else's credentials, is also covered.
ru: Промежуточный слой CSRF и шаблонный тег предоставляют легкую-в-использовании защиту против `Межсайтовой подделки запроса <https://www.squarefree.com/securitytips/web-developers.html#CSRF>`_. Этот тип атак случается, когда злонамеренный Web сайт содержит ссылку, кнопку формы или некоторый javascript, который предназначен для выполнения некоторых действий на вашем Web сайте, используя учетные данные авторизованного пользователя, который посещал злонамеренный сайт в своем браузере. Сюда также входит связанный тип атак, 'login CSRF', где атакуемый сайт обманывает браузер пользователя, авторизируясь на сайте с чужими учетными данными.

source: How to use it
ru: Как это использовать

source: To take advantage of CSRF protection in your views, follow these steps:
ru: Для того чтобы включить CSRF защиту для ваших представлений, выполните следующие шаги:

source: If you disabled it, which is not recommended, you can use :func:`~django.views.decorators.csrf.csrf_protect` on particular views you want to protect (see below).
ru: Если вы отключили защиту, что не рекомендуется, вы можете использовать декоратор :func:`~django.views.decorators.csrf.csrf_protect` в части представлений, которые вы хотите защитить (смотри ниже).

source: This should not be done for POST forms that target external URLs, since that would cause the CSRF token to be leaked, leading to a vulnerability.
ru: Это не должно делаться для POST форм, которые ссылаются на внешние URL'ы, поскольку это может вызвать утечку CSRF токена, что приводит к уязвимости.

source: While the above method can be used for AJAX POST requests, it has some inconveniences: you have to remember to pass the CSRF token in as POST data with every POST request. For this reason, there is an alternative method: on each XMLHttpRequest, set a custom ``X-CSRFToken`` header to the value of the CSRF token. This is often easier, because many JavaScript frameworks provide hooks that allow headers to be set on every request.
ru: Хотя вышеописанный метод может быть использован для AJAX POST запросов, он имеет некоторые неудобства: вы должны не забывать передавать CSRF токен в POST данных с каждым POST запросом. По этой причине есть альтернативный метод: для каждого XMLHttpRequest можно устанавливать кастомный заголовок ``X-CSRFToken`` в значение CSRF токена. Это проще, потому что многие JavaScript фреймворки предоставляют хуки, которые позволяют устанавливать заголовки для каждого запроса.

source: As a first step, you must get the CSRF token itself. The recommended source for the token is the ``csrftoken`` cookie, which will be set if you've enabled CSRF protection for your views as outlined above.
ru: В качестве первого шага, вы должны получить CSRF токен самостоятельно. Рекомендованный источник для токен - это кука ``csrftoken`` , которая будет установлена, если вы включили CSRF защиту для ваших представлений как описано выше.

source: The CSRF token cookie is named ``csrftoken`` by default, but you can control the cookie name via the :setting:`CSRF_COOKIE_NAME` setting.
ru: Кука CSRF токена называется ``csrftoken`` по умолчанию, но вы можете управлять именем куки при помощи параметра :setting:`CSRF_COOKIE_NAME`.

source: The CSRF header name is ``HTTP_X_CSRFTOKEN`` by default, but you can customize it using the :setting:`CSRF_HEADER_NAME` setting.
ru: CSRF заголовок называется ``HTTP_X_CSRFTOKEN`` по умолчанию, но вы можете управлять именем при помощи настройки :setting:`CSRF_HEADER_NAME`.

source: Acquiring the token is straightforward:
ru: Получение токена является простым:

source: The above code could be simplified by using the `JavaScript Cookie library <https://github.com/js-cookie/js-cookie/>`_ to replace ``getCookie``:
ru: Вышеприведенный код может быть упрощен при помощи `библиотеки JavaScript Cookie <http://plugins.jquery.com/cookie/>`_ для замены ``getCookie``:

source: The CSRF token is also present in the DOM, but only if explicitly included using :ttag:`csrf_token` in a template. The cookie contains the canonical token; the ``CsrfViewMiddleware`` will prefer the cookie to the token in the DOM. Regardless, you're guaranteed to have the cookie if the token is present in the DOM, so you should use the cookie!
ru: CSRF токен также представлен в DOM, но только если он явно включен, используя :ttag:`csrf_token` в шаблоне. Кука содержит канонический токен; ``CsrfViewMiddleware`` будет предпочитать этот куки куке из DOM. Не смотря на это, вы гарантировано имеете куки, если токен представлен в DOM, так что вы должны использовать куки.

source: If your view is not rendering a template containing the :ttag:`csrf_token` template tag, Django might not set the CSRF token cookie. This is common in cases where forms are dynamically added to the page. To address this case, Django provides a view decorator which forces setting of the cookie: :func:`~django.views.decorators.csrf.ensure_csrf_cookie`.
ru: Если ваше представление не рендерит шаблон, содержащий шаблонный тег :ttag:`csrf_token`, Django может не установить куки с CSRF токеном.

source: Finally, you'll have to actually set the header on your AJAX request, while protecting the CSRF token from being sent to other domains using `settings.crossDomain <https://api.jquery.com/jQuery.ajax>`_ in jQuery 1.5.1 and newer:
ru: В конце концов, вы будете должны фактически установить заголовок в вашем AJAX запросе, одновременно защищая CSRF токен от отправки на другие домены, используя `settings.crossDomain <https://api.jquery.com/jQuery.ajax>`_ в jQuery 1.5.1 и выше:

source: The decorator method
ru: Подход с декоратором

source: Rather than adding ``CsrfViewMiddleware`` as a blanket protection, you can use the ``csrf_protect`` decorator, which has exactly the same functionality, on particular views that need the protection. It must be used **both** on views that insert the CSRF token in the output, and on those that accept the POST form data. (These are often the same view function, but not always).
ru: Вместо добавления ``CsrfViewMiddleware`` как общей защиты, вы можете использовать декоратор ``csrf_protect``, который обладает точно такой же функциональностью, для конкретных представлений, которые нужно защитить. Это должно быть использовано и в представлениях, которые вставляют CSRF токен в output, и в той части, что принимает POST данные форм. (Часто это будет тоже представление, но не всегда).

source: Use of the decorator by itself is **not recommended**, since if you forget to use it, you will have a security hole. The 'belt and braces' strategy of using both is fine, and will incur minimal overhead.
ru: Использование только декоратора **не рекомендуется**, поскольку если вы забудете использовать его, вы получите дыру в безопасности. Стратегия 'ремня и подтяжек' в смысле использования обоих методов выглядит лучше, и приводит к минимальным накладным расходам.

source: Decorator that provides the protection of ``CsrfViewMiddleware`` to a view.
ru: Декоратор, который обеспечивает защиту ``CsrfViewMiddleware`` для представления.

source: Usage::
ru: Использование::

source: If you are using class-based views, you can refer to :ref:`Decorating class-based views<decorating-class-based-views>`.
ru: Если вы использует представления-классы, можете прочитать раздел о :ref:`декорировании представлений-классов<decorating-class-based-views>`.

source: Rejected requests
ru: Отклоненные запросы

source: By default, a '403 Forbidden' response is sent to the user if an incoming request fails the checks performed by ``CsrfViewMiddleware``. This should usually only be seen when there is a genuine Cross Site Request Forgery, or when, due to a programming error, the CSRF token has not been included with a POST form.
ru: По умолчанию, ответ '403 Forbidden' отправляется пользователю, если входящий запрос не прошел проверок, выполняемых ``CsrfViewMiddleware``. Обычно это будет происходить, если это действительно CSRF, или из-за ошибки в коде, CSRF токен не был включен в POST форму.

source: The error page, however, is not very friendly, so you may want to provide your own view for handling this condition. To do this, simply set the :setting:`CSRF_FAILURE_VIEW` setting.
ru: Страница ошибки, не очень дружелюбна, поэтому вы можете предоставлять собственное представление для обработки этого состояния. Чтобы сделать это, просто установите параметр :setting:`CSRF_FAILURE_VIEW`.

source: How it works
ru: Как это работает

source: The CSRF protection is based on the following things:
ru: CSRF базируется на следующих вещах:

source: This part is done by the template tag.
ru: Эта часть выполняет шаблонным тегом.

source: For all incoming requests that are not using HTTP GET, HEAD, OPTIONS or TRACE, a CSRF cookie must be present, and the 'csrfmiddlewaretoken' field must be present and correct. If it isn't, the user will get a 403 error.
ru: Все HTTP запросы, которые не GET, HEAD, OPTIONS или TRACE, должны содержать CSRF куку, и поле 'csrfmiddlewaretoken' с правильным значением. Иначе пользователь получит 403 ошибку.

source: This check is done by ``CsrfViewMiddleware``.
ru: Эта проверка выполняется в ``CsrfViewMiddleware``.

source: If the :setting:`CSRF_COOKIE_DOMAIN` setting is set, the referer is compared against it. This setting supports subdomains. For example, ``CSRF_COOKIE_DOMAIN = '.example.com'`` will allow POST requests from ``www.example.com`` and ``api.example.com``. If the setting is not set, then the referer must match the HTTP ``Host`` header.
ru: Если указана настройка :setting:`CSRF_COOKIE_DOMAIN`, значение "referer" будет сравниваться с этим значением. Значение поддерживает под-домены. Например, ``CSRF_COOKIE_DOMAIN = '.example.com'`` позволить отправлять POST запросы с ``www.example.com`` и ``api.example.com``. Если настройка не указана, "referer" должен быть равен HTTP заголовку ``Host``.

source: Expanding the accepted referers beyond the current host or cookie domain can be done with the :setting:`CSRF_TRUSTED_ORIGINS` setting.
ru: Чтобы расширить список доступных доменов, кроме текущего хоста и домена кук, используйте :setting:`CSRF_TRUSTED_ORIGINS`.

source: This ensures that only forms that have originated from trusted domains can be used to POST data back.
ru: Такой подход гарантирует, что только формы, отправленные с доверенных доменов, могут передавать POST данные.

source: Checking against the :setting:`CSRF_COOKIE_DOMAIN` setting was added.
ru: Была добавлена проверка настройки :setting:`CSRF_COOKIE_DOMAIN`.

source: Caching
ru: Кеширование

source: If the :ttag:`csrf_token` template tag is used by a template (or the ``get_token`` function is called some other way), ``CsrfViewMiddleware`` will add a cookie and a ``Vary: Cookie`` header to the response. This means that the middleware will play well with the cache middleware if it is used as instructed (``UpdateCacheMiddleware`` goes before all other middleware).
ru: При использовании шаблонного тега :ttag:`csrf_token` (или вызове функции ``get_token``) ``CsrfViewMiddleware`` добавит куку и заголовок ``Vary: Cookie`` в ответ. Это значит, что ``CsrfViewMiddleware`` правильно работает с кеширующим промежуточным слоем, если все делать по инструкции (``UpdateCacheMiddleware`` следует перед всеми остальными промежуточными слоями).

source: However, if you use cache decorators on individual views, the CSRF middleware will not yet have been able to set the Vary header or the CSRF cookie, and the response will be cached without either one. In this case, on any views that will require a CSRF token to be inserted you should use the :func:`django.views.decorators.csrf.csrf_protect` decorator first::
ru: Однако, если вы использует кеширующий декоратор для конкретного представления, CSRF промежуточный слой еще не установил "Vary" заголовок или CSRF куку, и ответ будет закеширован без них. В таком случае для всех таких представлений, которые требуют CSRF токен, используйте сначала декоратор :func:`django.views.decorators.csrf.csrf_protect`::

source: Testing
ru: Тестирование

source: The ``CsrfViewMiddleware`` will usually be a big hindrance to testing view functions, due to the need for the CSRF token which must be sent with every POST request. For this reason, Django's HTTP client for tests has been modified to set a flag on requests which relaxes the middleware and the ``csrf_protect`` decorator so that they no longer rejects requests. In every other respect (e.g. sending cookies etc.), they behave the same.
ru: ``CsrfViewMiddleware`` -- обычно большая помеха при тестировании представлений, т.к. каждый POST запрос должен содержать CSRF токен. По этому тестовый клиент Django для каждого запроса устанавливает специальный флаг, который учитывается декоратором ``csrf_protect`` и не возвращает ошибку. Во всем остальном (например, установка кук) запросы работают как обычно.

source: If, for some reason, you *want* the test client to perform CSRF checks, you can create an instance of the test client that enforces CSRF checks::
ru: Если, по какой-то причине, вы *хотите*, чтобы тестовый клиент выполнял проверку CSRF, вы можете создать специальный экземпляр тестового клиента::

source: Limitations
ru: Ограничения

source: Subdomains within a site will be able to set cookies on the client for the whole domain. By setting the cookie and using a corresponding token, subdomains will be able to circumvent the CSRF protection. The only way to avoid this is to ensure that subdomains are controlled by trusted users (or, are at least unable to set cookies). Note that even without CSRF, there are other vulnerabilities, such as session fixation, that make giving subdomains to untrusted parties a bad idea, and these vulnerabilities cannot easily be fixed with current browsers.
ru: Поддомены сайта могут устанавливать куки на клиенте для всего домена. Установив соответствующий токен в куку, поддомены могут обойти CSRF защиту. Единственный способ обезопаситься -- быть уверенным, что поддомены контролируются доверенными пользователями (или хотя бы не могут устанавливать куки). Обратите внимание, даже не учитывая CSRF, есть много других уязвимостей, например фиксация сессии(session fixation), от которых нельзя легко обезопаситься с современными браузерами. По этому предоставлять контроль над поддоменом непроверенным людям -- плохая идея.

source: Edge cases
ru: Особые случаи

source: Certain views can have unusual requirements that mean they don't fit the normal pattern envisaged here. A number of utilities can be useful in these situations. The scenarios they might be needed in are described in the following section.
ru: Некоторые представления могут потребовать особого процесса обработки запроса, который не вписывается в описанный выше шаблон. Ниже приведен ряд функций, которые могут пригодиться в таком случае.

source: Utilities
ru: Утилиты

source: The examples below assume you are using function-based views. If you are working with class-based views, you can refer to :ref:`Decorating class-based views<decorating-class-based-views>`.
ru: Примеры ниже предполагают, чтобы используете представления-функции. Если вы используете представления-классы, обратитесь к :ref:`этому разделу<decorating-class-based-views>`.

source: This decorator marks a view as being exempt from the protection ensured by the middleware. Example::
ru: Этот декоратор позволяет исключить представление из процесса проверки CSRF. Например::

source: Normally the :ttag:`csrf_token` template tag will not work if ``CsrfViewMiddleware.process_view`` or an equivalent like ``csrf_protect`` has not run. The view decorator ``requires_csrf_token`` can be used to ensure the template tag does work. This decorator works similarly to ``csrf_protect``, but never rejects an incoming request.
ru: Обычно шаблонный тег :ttag:`csrf_token` ничего не делает, если ``CsrfViewMiddleware.process_view``, или его аналог ``csrf_protect``, не был выполнен. Декоратор ``requires_csrf_token`` можно использовать, чтобы удостовериться, что шаблонный тег сработал. Этот декоратор работает как и ``csrf_protect``, но не возвращает ответ с ошибкой.

source: Example::
ru: Примеры::

source: This decorator forces a view to send the CSRF cookie.
ru: Этот декоратор заставляет представление послать CSRF куку.

source: Scenarios
ru: Сценарии

source: CSRF protection should be disabled for just a few views
ru: Необходимо отключить CSRF защиту для некоторых представлений

source: Most views requires CSRF protection, but a few do not.
ru: Для большинства представлений необходима CSRF защита, но для некоторых необходимо отключить.

source: Solution: rather than disabling the middleware and applying ``csrf_protect`` to all the views that need it, enable the middleware and use :func:`~django.views.decorators.csrf.csrf_exempt`.
ru: Вместо того, чтобы отключить промежуточный слой защиты и добавлять декоратор ``csrf_protect`` ко всем представлениям, которым необходима проверка CRSF, включите промежуточный слой и используйте :func:`~django.views.decorators.csrf.csrf_exempt`.

source: CsrfViewMiddleware.process_view not used
ru: CsrfViewMiddleware.process_view не выполняется

source: There are cases when ``CsrfViewMiddleware.process_view`` may not have run before your view is run - 404 and 500 handlers, for example - but you still need the CSRF token in a form.
ru: В некоторых случаях ``CsrfViewMiddleware.process_view`` может не выполняться перед вашим представлением, например для обработчиков 404 и 500 ответов. Но вам все еще необходим CSRF токен для формы.

source: Solution: use :func:`~django.views.decorators.csrf.requires_csrf_token`
ru: Решение: используйте :func:`~django.views.decorators.csrf.requires_csrf_token`

source: Unprotected view needs the CSRF token
ru: Для незащищенного представления необходим CSRF токен

source: There may be some views that are unprotected and have been exempted by ``csrf_exempt``, but still need to include the CSRF token.
ru: Некоторые представления могут быть исключены из процесса проверки CRSF с помощью декоратора ``csrf_exempt``, но им необходим CSRF токен.

source: Solution: use :func:`~django.views.decorators.csrf.csrf_exempt` followed by :func:`~django.views.decorators.csrf.requires_csrf_token`. (i.e. ``requires_csrf_token`` should be the innermost decorator).
ru: Решение: используйте :func:`~django.views.decorators.csrf.requires_csrf_token` после :func:`~django.views.decorators.csrf.csrf_exempt`. (То есть ``requires_csrf_token`` должен быть самым "внутренним" декоратором).

source: View needs protection for one path
ru: Представлению необходима проверка CSRF только для определенного пути

source: A view needs CSRF protection under one set of conditions only, and mustn't have it for the rest of the time.
ru: Представлению необходима проверка CSRF только при определенных условиях, и не нужна для всех остальных случаев.

source: Solution: use :func:`~django.views.decorators.csrf.csrf_exempt` for the whole view function, and :func:`~django.views.decorators.csrf.csrf_protect` for the path within it that needs protection. Example::
ru: Решение: используйте :func:`~django.views.decorators.csrf.csrf_exempt` для всей функции представления, и :func:`~django.views.decorators.csrf.csrf_protect` при определенном условии внутри функции. Например::

source: Page uses AJAX without any HTML form
ru: Страница использует AJAX, не имея ни одной HTML формы

source: A page makes a POST request via AJAX, and the page does not have an HTML form with a :ttag:`csrf_token` that would cause the required CSRF cookie to be sent.
ru: Страница выполняет POST запрос через AJAX, на странице нет HTML формы с тегом :ttag:`csrf_token`, который вызывает отправку CSRF куки.

source: Solution: use :func:`~django.views.decorators.csrf.ensure_csrf_cookie` on the view that sends the page.
ru: Решение: используйте :func:`~django.views.decorators.csrf.ensure_csrf_cookie` в представлении, которое отсылает страницу.

source: Contrib and reusable apps
ru: Встроенные и распространяемые приложения

source: Because it is possible for the developer to turn off the ``CsrfViewMiddleware``, all relevant views in contrib apps use the ``csrf_protect`` decorator to ensure the security of these applications against CSRF. It is recommended that the developers of other reusable apps that want the same guarantees also use the ``csrf_protect`` decorator on their views.
ru: Т.к. разработчик может отключить ``CsrfViewMiddleware``, все соответствующие представления во встроенных приложениях используют декоратор ``csrf_protect``, чтобы убедиться, что эти представления защищены от CSRF. Рекомендуется, чтобы разработчики распространяемых приложений также использовали ``csrf_protect``, если представлениям необходима защита от CSRF атак.

source: Settings
ru: Параметры

source: A number of settings can be used to control Django's CSRF behavior:
ru: Параметры, которые могут быть использованы для управления поведением CSRF в Django:
