Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/ref/middleware.po
Languages: ru

source: After any middleware that modifies the ``Vary`` header: that header is used to pick a value for the cache hash-key.
ru: После любого промежуточного слоя, который может изменить заголовок ``Vary``: его значение используется для генерации ключа в кэше.

source: Should be near the bottom as it's a last-resort type of middleware.
ru: Должен быть в низу.
