Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/ref/middleware.po
Languages: ru

source: Middleware
ru: Промежуточный слой (Middleware)

source: This document explains all middleware components that come with Django. For information on how to use them and how to write your own middleware, see the :doc:`middleware usage guide </topics/http/middleware>`.
ru: Этот раздел описывает промежуточные слои, которые предоставляет Django. Как использовать и создавать свои промежуточные слои, смотрите :doc:`соответствующий раздел </topics/http/middleware>`.

source: Available middleware
ru: Доступные промежуточные слои

source: Cache middleware
ru: Кэширующий промежуточный слой

source: Enable the site-wide cache. If these are enabled, each Django-powered page will be cached for as long as the :setting:`CACHE_MIDDLEWARE_SECONDS` setting defines. See the :doc:`cache documentation </topics/cache>`.
ru: Активирует кэширование для всего сайта. При этом все страницы, которые генерируются Django, будут закэшированы на время, указанное в настройке :setting:`CACHE_MIDDLEWARE_SECONDS`. Смотрите :doc:`раздел о кэшировании</topics/cache>`.

source: "Common" middleware
ru: "Common" промежуточный слой

source: Adds a few conveniences for perfectionists:
ru: Добавляет несколько полезностей для перфекционистов:

source: Forbids access to user agents in the :setting:`DISALLOWED_USER_AGENTS` setting, which should be a list of compiled regular expression objects.
ru: Ограничивает доступ для клиентов, которые указанны в настройке :setting:`DISALLOWED_USER_AGENTS`. Настройка должна содержать список скомпилированных регулярных выражений.

source: Performs URL rewriting based on the :setting:`APPEND_SLASH` and :setting:`PREPEND_WWW` settings.
ru: Меняет URL в соответствии с настройками :setting:`APPEND_SLASH` и :setting:`PREPEND_WWW`.

source: If :setting:`APPEND_SLASH` is ``True`` and the initial URL doesn't end with a slash, and it is not found in the URLconf, then a new URL is formed by appending a slash at the end. If this new URL is found in the URLconf, then Django redirects the request to this new URL. Otherwise, the initial URL is processed as usual.
ru: Если :setting:`APPEND_SLASH` равна ``True`` и вызванный URL не оканчивается на слеш, и он не найден в URLconf, создается новый URL путем добавления слеша в конец. Если новый URL найден в URLconf, Django отправляет перенаправление на этот URL. Иначе начальный URL обрабатывается как обычно.

source: For example, ``foo.com/bar`` will be redirected to ``foo.com/bar/`` if you don't have a valid URL pattern for ``foo.com/bar`` but *do* have a valid pattern for ``foo.com/bar/``.
ru: Например, ``foo.com/bar`` будет перенаправлен на ``foo.com/bar/``, если нет URL-шаблона для ``foo.com/bar``, но *есть* для ``foo.com/bar/``.

source: If :setting:`PREPEND_WWW` is ``True``, URLs that lack a leading "www." will be redirected to the same URL with a leading "www."
ru: Если :setting:`PREPEND_WWW` равна ``True``, URL-ы без "www." будут перенаправлены на URL с добавлением "www."

source: Both of these options are meant to normalize URLs. The philosophy is that each URL should exist in one, and only one, place. Technically a URL ``foo.com/bar`` is distinct from ``foo.com/bar/`` -- a search-engine indexer would treat them as separate URLs -- so it's best practice to normalize URLs.
ru: Обе эти настройки предназначены для нормализации URL-ов. Философия такая -- URL должен быть уникальным и единым. Технически URL ``foo.com/bar`` отличается от ``foo.com/bar/`` -- поисковик проиндексирует их как отдельные URL-ы -- поэтому хорошей практикой является нормализация URL-ов.

source: Handles ETags based on the :setting:`USE_ETAGS` setting. If :setting:`USE_ETAGS` is set to ``True``, Django will calculate an ETag for each request by MD5-hashing the page content, and it'll take care of sending ``Not Modified`` responses, if appropriate.
ru: Обрабатываете ETag с учетом настройки :setting:`USE_ETAGS`. Если :setting:`USE_ETAGS` равна ``True``, Django вычислит ETag для каждого запроса, используя MD5-хеш содержимого страницы, и отправит ответ ``Not Modified`` при возможности.

source: Defaults to :class:`~django.http.HttpResponsePermanentRedirect`. Subclass ``CommonMiddleware`` and override the attribute to customize the redirects issued by the middleware.
ru: По умолчанию :class:`~django.http.HttpResponsePermanentRedirect`. Можете создать класс наследник ``CommonMiddleware`` и переопределить класс ответа, который используется для перенаправления.

source: Sends broken link notification emails to :setting:`MANAGERS` (see :doc:`/howto/error-reporting`).
ru: Отсылает уведомления о сломанных ссылках на :setting:`MANAGERS` (смотрите :doc:`/howto/error-reporting`).

source: GZip middleware
ru: GZip промежуточный слой

source: Compresses content for browsers that understand GZip compression (all modern browsers).
ru: Сжимает ответ для браузеров, которые поддерживают GZip (все современные браузеры).

source: This middleware should be placed before any other middleware that need to read or write the response body so that compression happens afterward.
ru: Этот промежуточный слой должен находится перед любым другим промежуточный слоем, который читает или пишет содержимое ответа, чтобы сжатие происходило в самом конце.

source: It will NOT compress content if any of the following are true:
ru: Содержимое ответа НЕ будет сжато при следующих условиях:

source: The content body is less than 200 bytes long.
ru: Содержимое ответа меньше 200 байтов.

source: The response has already set the ``Content-Encoding`` header.
ru: Ответ уже содержит заголовок ``Content-Encoding``.

source: The request (the browser) hasn't sent an ``Accept-Encoding`` header containing ``gzip``.
ru: Браузер не отослал в запросе заголовок ``Accept-Encoding``, который содержит ``gzip``.

source: You can apply GZip compression to individual views using the :func:`~django.views.decorators.gzip.gzip_page()` decorator.
ru: Вы можете добавить GZip сжатие для определенных представлений, используя декоратор :func:`~django.views.decorators.gzip.gzip_page()`.

source: Conditional GET middleware
ru: Промежуточный слой для обработки условных GET-запросов

source: Locale middleware
ru: Промежуточный слой локализации

source: Enables language selection based on data from the request. It customizes content for each user. See the :doc:`internationalization documentation </topics/i18n/translation>`.
ru: Выполняет выбор текущего языка на основе данных из запроса. Меняет содержимое для каждого пользователя отдельно. Смотрите :doc:`раздел об интернационализации </topics/i18n/translation>`.

source: Defaults to :class:`~django.http.HttpResponseRedirect`. Subclass ``LocaleMiddleware`` and override the attribute to customize the redirects issued by the middleware.
ru: По умолчанию :class:`~django.http.HttpResponseRedirect`. Можете создать класс наследник ``LocaleMiddleware`` и переопределить класс ответа, который используется для перенаправления.

source: Message middleware
ru: Промежуточный слой сообщений

source: Enables cookie- and session-based message support. See the :doc:`messages documentation </ref/contrib/messages>`.
ru: Добавляет поддержку сообщений на основе кук или сессии. Смотрите :doc:`раздел о сообщениях </ref/contrib/messages>`.

source: Security middleware
ru: Промежуточный слой безопасности

source: If your deployment situation allows, it's usually a good idea to have your front-end Web server perform the functionality provided by the ``SecurityMiddleware``. That way, if there are requests that aren't served by Django (such as static media or user-uploaded files), they will have the same protections as requests to your Django application.
ru: Лучший вариант -- чтобы фронтенд веб-сервер выполнял действия, которые выполняет ``SecurityMiddleware``. В таком случае все запросы, даже те, которые не обрабатываются Django (запросы к статическим и загруженным файлам), будут защищены как и запросы к приложению Django.

source: The ``django.middleware.security.SecurityMiddleware`` provides several security enhancements to the request/response cycle. Each one can be independently enabled or disabled with a setting.
ru: ``django.middleware.security.SecurityMiddleware`` предоставляет ряд проверок безопасности при обработке запроса/ответа. Каждая из них может быть выключена/включена через настройки.

source: For sites that should only be accessed over HTTPS, you can instruct modern browsers to refuse to connect to your domain name via an insecure connection (for a given period of time) by setting the `"Strict-Transport-Security" header`_. This reduces your exposure to some SSL-stripping man-in-the-middle (MITM) attacks.
ru: Для сайтов, которые должны быть доступны только по HTTPS, вы можете указать современным браузерам не подключаться к вашему домену по небезопасному подключению (в течении определенного времени), установив `заголовок "Strict-Transport-Security" <http://en.wikipedia.org/wiki/Strict_Transport_Security>`_. Это уменьшает подверженность MITM атакам.

source: ``SecurityMiddleware`` will set this header for you on all HTTPS responses if you set the :setting:`SECURE_HSTS_SECONDS` setting to a non-zero integer value.
ru: ``SecurityMiddleware`` будет устанавливать этот заголовок для всех HTTPS ответов, если вы укажите в настройке :setting:`SECURE_HSTS_SECONDS` не нулевое значение.

source: When enabling HSTS, it's a good idea to first use a small value for testing, for example, :setting:`SECURE_HSTS_SECONDS = 3600<SECURE_HSTS_SECONDS>` for one hour. Each time a Web browser sees the HSTS header from your site, it will refuse to communicate non-securely (using HTTP) with your domain for the given period of time. Once you confirm that all assets are served securely on your site (i.e. HSTS didn't break anything), it's a good idea to increase this value so that infrequent visitors will be protected (31536000 seconds, i.e. 1 year, is common).
ru: При включении HSTS для начала лучше протестировать с небольшим значение, например, :setting:`SECURE_HSTS_SECONDS = 3600<SECURE_HSTS_SECONDS>`. Каждый раз, когда браузер видит заголовок HSTS в ответе вашего сайта, он отказывается подключаться по небезопасному подключению (используя HTTP) к вашему домену в течении указанного времени. После проверки, что все статические файлы работают через HTTPS (то есть HSTS ничего не ломает), можно увеличить это значение, чтобы нечастые пользователи были защищены (обычно используют 31536000 секунд, то есть 1 год).

source: The HSTS policy applies to your entire domain, not just the URL of the response that you set the header on. Therefore, you should only use it if your entire domain is served via HTTPS only.
ru: HSTS применяется ко всему домену, а не только URL, который вернул ответ с заголовком. Поэтому вам следует использовать его только, если весь домен доступен через HTTPS.

source: Browsers properly respecting the HSTS header will refuse to allow users to bypass warnings and connect to a site with an expired, self-signed, or otherwise invalid SSL certificate. If you use HSTS, make sure your certificates are in good shape and stay that way!
ru: Браузеры, которые поддерживают заголовки HSTS, не позволят пользователям игнорировать предупреждение и подключиться к сайту с устаревшим, самостоятельно подписанным, или неправильным SSL сертификатом. Если вы используете HSTS, убедитесь, что с вашими сертификатами все в порядке!

source: If you are deployed behind a load-balancer or reverse-proxy server, and the ``Strict-Transport-Security`` header is not being added to your responses, it may be because Django doesn't realize that it's on a secure connection; you may need to set the :setting:`SECURE_PROXY_SSL_HEADER` setting.
ru: Если ваш сервер находится за балансировщиком нагрузки, или прокси, и заголовок ``Strict-Transport-Security`` не добавляется к ответам, это может быть вызвано тем, что Django не определяет, что используется защищенное подключение. Возможно вам следует указать настройку :setting:`SECURE_PROXY_SSL_HEADER`.

source: Some browsers will try to guess the content types of the assets that they fetch, overriding the ``Content-Type`` header. While this can help display sites with improperly configured servers, it can also pose a security risk.
ru: Некоторые браузеры пытаются угадать тип содержимого(content type) полученных файлов, подменяя заголовок ``Content-Type``. В то время, как такой подход помогает правильно отображать сайты с неправильно настроенных серверов, он может быть и уязвимостью.

source: If your site serves user-uploaded files, a malicious user could upload a specially-crafted file that would be interpreted as HTML or JavaScript by the browser when you expected it to be something harmless.
ru: Если ваш сайт позволяет пользователям загружать файлы, взломщик может загрузить специальный файл, который будет интерпретирован браузером как HTML или Javascript.

source: To learn more about this header and how the browser treats it, you can read about it on the `IE Security Blog`_.
ru: Подробности об этом заголовке вы можете найти в `IE Security Blog`_.

source: To prevent the browser from guessing the content type and force it to always use the type provided in the ``Content-Type`` header, you can pass the ``X-Content-Type-Options: nosniff`` header. ``SecurityMiddleware`` will do this for all responses if the :setting:`SECURE_CONTENT_TYPE_NOSNIFF` setting is ``True``.
ru: Чтобы запретить браузеру угадывать тип файла и заставить всегда использовать значение из заголовка ``Content-Type``, вы можете передать заголовок ``X-Content-Type-Options: nosniff``. ``SecurityMiddleware`` добавит его ко всем ответам, если настройка :setting:`SECURE_CONTENT_TYPE_NOSNIFF` равна ``True``.

source: Note that in most deployment situations where Django isn't involved in serving user-uploaded files, this setting won't help you. For example, if your :setting:`MEDIA_URL` is served directly by your front-end Web server (nginx, Apache, etc.) then you'd want to set this header there. On the other hand, if you are using Django to do something like require authorization in order to download files and you cannot set the header using your Web server, this setting will be useful.
ru: Обратите внимание, что в большинстве случаев, когда Django не раздает файлы с сервера, эта опция вам не поможет. Например, если :setting:`MEDIA_URL` раздается напрямую сервером (nginx, Apache, и прочие), тогда вам следует добавить этот заголовок для него. Если же вы используете Django, чтобы, например, проверить авторизацию перед возвращением файла, эта настройка вам пригодится.

source: Some browsers have the ability to block content that appears to be an `XSS attack`_. They work by looking for JavaScript content in the GET or POST parameters of a page. If the JavaScript is replayed in the server's response, the page is blocked from rendering and an error page is shown instead.
ru: Некоторые браузеры умеют блокировать содержимое, которые может использоваться для `XSS атаки <http://en.wikipedia.org/wiki/Cross-site_scripting>`_. Они ищут Javascript в GET или POST параметрах на странице. Если Javascript возвращается сервером, страница блокируется и показывается предупреждение.

source: The `X-XSS-Protection header`_ is used to control the operation of the XSS filter.
ru: `Заголовок X-XSS-Protection <http://blogs.msdn.com/b/ie/archive/2008/07/02/ie8-security-part-iv-the-xss-filter.aspx>`_ позволяет управлять XSS фильтром.

source: To enable the XSS filter in the browser, and force it to always block suspected XSS attacks, you can pass the ``X-XSS-Protection: 1; mode=block`` header. ``SecurityMiddleware`` will do this for all responses if the :setting:`SECURE_BROWSER_XSS_FILTER` setting is ``True``.
ru: Чтобы включить XSS фильтр в браузере, и заставить его блокировать потенциальные XSS атаки, вы можете передать заголовок ``X-XSS-Protection: 1; mode=block``. ``SecurityMiddleware`` добавит его ко всем ответам, если настройка :setting:`SECURE_BROWSER_XSS_FILTER` равна ``True``.

source: The browser XSS filter is a useful defense measure, but must not be relied upon exclusively. It cannot detect all XSS attacks and not all browsers support the header. Ensure you are still :ref:`validating and sanitizing <cross-site-scripting>` all input to prevent XSS attacks.
ru: Фильтр XSS полезен, но вы не должны полностью полагаться на него. Браузер определяет не все XSS атаки и не все браузеры поддерживают этот фильтр. Вы все еще должны :ref:`проверять <cross-site-scripting>` весь ввод пользователя, чтобы избежать XSS атак.

source: SSL Redirect
ru: SSL редирект

source: If your site offers both HTTP and HTTPS connections, most users will end up with an unsecured connection by default. For best security, you should redirect all HTTP connections to HTTPS.
ru: Если ваш сайт доступен по HTTP и HTTPS, большинство пользователей будут заходить по незащищенному подключению по умолчанию. Вам следует перенаправлять их с HTTP на HTTPS.

source: If you set the :setting:`SECURE_SSL_REDIRECT` setting to True, ``SecurityMiddleware`` will permanently (HTTP 301) redirect all HTTP connections to HTTPS.
ru: Если установить ``True`` в :setting:`SECURE_SSL_REDIRECT`, ``SecurityMiddleware`` будет перманентно (HTTP 301) перенаправлять все HTTP запросы на HTTPS.

source: For performance reasons, it's preferable to do these redirects outside of Django, in a front-end load balancer or reverse-proxy server such as `nginx`_. :setting:`SECURE_SSL_REDIRECT` is intended for the deployment situations where this isn't an option.
ru: Для повышения производительности лучше делать эти перенаправления не в Django, а на балансере нагрузки или прокси, таком как `nginx`_. :setting:`SECURE_SSL_REDIRECT` следует использовать для разработки, чтобы не усложнять локальное окружение.

source: If the :setting:`SECURE_SSL_HOST` setting has a value, all redirects will be sent to that host instead of the originally-requested host.
ru: Если указать значение в настройке :setting:`SECURE_SSL_HOST`, все перенаправления будут выполняться на указанный хост, а не хост из запроса.

source: If there are a few pages on your site that should be available over HTTP, and not redirected to HTTPS, you can list regular expressions to match those URLs in the :setting:`SECURE_REDIRECT_EXEMPT` setting.
ru: Если на сайте есть страницы, которые должны быть доступны по HTTP без перенаправления на HTTPS, вы можете указать в настройке :setting:`SECURE_REDIRECT_EXEMPT` регулярные выражение, которым удовлетворяют необходимые URL-ы.

source: If you are deployed behind a load-balancer or reverse-proxy server and Django can't seem to tell when a request actually is already secure, you may need to set the :setting:`SECURE_PROXY_SSL_HEADER` setting.
ru: Если ваш сервер находится за балансировщиком нагрузки или прокси, Django может не определяет, что используется защищенное подключение. Возможно вам следует указать настройку :setting:`SECURE_PROXY_SSL_HEADER`.

source: Session middleware
ru: Промежуточный слой сессии

source: Enables session support. See the :doc:`session documentation </topics/http/sessions>`.
ru: Включает поддержку сессии. Смотрите :doc:`раздел о сессии </topics/http/sessions>`.

source: Site middleware
ru: Промежуточный слой определения текущего сайта

source: Adds the ``site`` attribute representing the current site to every incoming ``HttpRequest`` object. See the :ref:`sites documentation <site-middleware>`.
ru: Добавляет атрибут ``site``, который указывает текущий сайт для каждого объекта ``HttpRequest``. Смотрите :ref:`раздел о поддержке нескольких сайтов <site-middleware>`.

source: Authentication middleware
ru: Промежуточный слой авторизации

source: Adds the ``user`` attribute, representing the currently-logged-in user, to every incoming ``HttpRequest`` object. See :ref:`Authentication in Web requests <auth-web-requests>`.
ru: Добавляет атрибут ``user``, который указывает текущего авторизованного пользователя, для каждого объекта ``HttpRequest``. Смотрите :ref:`раздел об авторизации <auth-web-requests>`.

source: Middleware for utilizing Web server provided authentication. See :doc:`/howto/auth-remote-user` for usage details.
ru: Промежуточный слой для внешней авторизации. Смотрите :doc:`/howto/auth-remote-user`.

source: Middleware for utilizing Web server provided authentication when enabled only on the login page. See :ref:`persistent-remote-user-middleware-howto` for usage details.
ru: Промежуточный слой для внешней авторизации, которая используется только для страниц входа для оптимизации работы приложения. Смотрите :ref:`persistent-remote-user-middleware-howto`.

source: CSRF protection middleware
ru: Промежуточный слой для CSRF защиты

source: Adds protection against Cross Site Request Forgeries by adding hidden form fields to POST forms and checking requests for the correct value. See the :doc:`Cross Site Request Forgery protection documentation </ref/csrf>`.
ru: Включает CSRF защиту, добавляя скрытое поле в POST формы и проверяя значение при запросе. Смотрите раздел о :doc:`Cross Site Request Forgery защите </ref/csrf>`.

source: Simple :doc:`clickjacking protection via the X-Frame-Options header </ref/clickjacking/>`.
ru: Добавляет простую :doc:`защиту от "clickjacking", используя заголовок X-Frame-Options </ref/clickjacking/>`.

source: Middleware ordering
ru: Порядок промежуточных слоёв

source: Here are some hints about the ordering of various Django middleware classes:
ru: Несколько советов о порядке промежуточных слоёв Django:

source: It should go near the top of the list if you're going to turn on the SSL redirect as that avoids running through a bunch of other unnecessary middleware.
ru: Должен следовать в начале списка промежуточных слоев, если вы используете SSL перенаправление, чтобы избежать обработки небезопасного запроса другими промежуточными слоями.

source: Before those that modify the ``Vary`` header (``SessionMiddleware``, ``GZipMiddleware``, ``LocaleMiddleware``).
ru: Добавлять перед промежуточными слоями, которые могут изменить заголовок ``Vary`` (``SessionMiddleware``, ``GZipMiddleware``, ``LocaleMiddleware``).

source: Before any middleware that may change or use the response body.
ru: Добавлять перед промежуточными слоями, которые могут изменять или читать тело ответа.

source: After ``UpdateCacheMiddleware``: Modifies ``Vary`` header.
ru: После ``UpdateCacheMiddleware``: изменяет заголовок ``Vary``.

source: One of the topmost, after ``SessionMiddleware`` (uses session data) and ``UpdateCacheMiddleware`` (modifies ``Vary`` header).
ru: Следует одним из первых, после ``SessionMiddleware`` (использует сессию) и ``CacheMiddleware`` (изменяет заголовок ``Vary``).

source: Before any middleware that may change the response (it calculates ``ETags``).
ru: Перед любым промежуточным слоем, который может изменять ответ (вычисляет ``ETags``).

source: After ``GZipMiddleware`` so it won't calculate an ``ETag`` header on gzipped contents.
ru: После ``GZipMiddleware``, чтобы заголовок ``ETag`` не вычислялся для сжатого ответа.

source: Close to the top: it redirects when :setting:`APPEND_SLASH` or :setting:`PREPEND_WWW` are set to ``True``.
ru: Ближе к верху: выполняет перенаправление при :setting:`APPEND_SLASH` или :setting:`PREPEND_WWW` равном ``True``.

source: Before any view middleware that assumes that CSRF attacks have been dealt with.
ru: Перед любым промежуточным слоем, который предполагает, что CSRF защита уже выполнена.

source: After ``SessionMiddleware``: uses session storage.
ru: После ``SessionMiddleware``: использует сессию.

source: After ``SessionMiddleware``: can use session-based storage.
ru: После ``SessionMiddleware``: может использовать сессию для хранения данных.
