Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/ref/request-response.po
Languages: ru

source: Sets a cookie. The parameters are the same as in the :class:`~http.cookies.Morsel` cookie object in the Python standard library.
ru: Устанавливает cookie. Аргументы соответствуют аргументам для конструктора объекта :class:`~http.cookies.Morsel` из стандартных библиотек Python.

source: ``max_age`` should be a number of seconds, or ``None`` (default) if the cookie should last only as long as the client's browser session. If ``expires`` is not specified, it will be calculated.
ru: ``max_age`` должен содержать количество секунд или ``None`` (по-умолчанию), если cookie должна существовать до закрытия браузера. Если ``expires`` не указан, он будет вычислен.

source: ``expires`` should either be a string in the format ``"Wdy, DD-Mon-YY HH:MM:SS GMT"`` or a ``datetime.datetime`` object in UTC. If ``expires`` is a ``datetime`` object, the ``max_age`` will be calculated.
ru: ``expires`` должен быть строкой в формате ``"Wdy, DD-Mon-YY HH:MM:SS GMT"`` или объект ``datetime.datetime`` в UTC. Если ``expires`` объект ``datetime``, значение ``max_age`` будет вычислено.

source: Use ``httponly=True`` if you want to prevent client-side JavaScript from having access to the cookie.
ru: Используйте ``httponly=True``, если хотите ограничит доступ клиентского JavaScript к этим cookie.

source: HTTPOnly_ is a flag included in a Set-Cookie HTTP response header. It is not part of the :rfc:`2109` standard for cookies, and it isn't honored consistently by all browsers. However, when it is honored, it can be a useful way to mitigate the risk of a client-side script from accessing the protected cookie data.
ru: HTTPOnly_ -- это флаг добавляемый в HTTP заголовок Set-Cookie ответа. Он не является частью стандарта :rfc:`2109`, и поддерживается не всеми браузерами. Однако, если он поддерживается, это может быть полезным для уменьшения риска, что клиентский скрипт получит доступа к защищенным данным cookie.

source: Both :rfc:`2109` and :rfc:`6265` state that user agents should support cookies of at least 4096 bytes. For many browsers this is also the maximum size. Django will not raise an exception if there's an attempt to store a cookie of more than 4096 bytes, but many browsers will not set the cookie correctly.
ru: Спецификации :rfc:`2109` и :rfc:`6265` указывают, что клиент должен поддерживать куки минимального размера 4096 байт. Для большинства браузеров это максимальный размер кук. Django не вызовет исключение, если вы попытаетесь добавить куки больше 4096 байт, но многие браузеры установят их неправильно.

source: Like :meth:`~HttpResponse.set_cookie()`, but :doc:`cryptographic signing </topics/signing>` the cookie before setting it. Use in conjunction with :meth:`HttpRequest.get_signed_cookie`. You can use the optional ``salt`` argument for added key strength, but you will need to remember to pass it to the corresponding :meth:`HttpRequest.get_signed_cookie` call.
ru: Аналогичен :meth:`~HttpResponse.set_cookie()`, но использует :doc:`криптографическую подписаь </topics/signing>` перед установкой cookie. Используется вместе с методом :meth:`HttpRequest.get_signed_cookie`. Вы можете использовать не обязательный аргумент ``salt`` для дополнительной защиты, но не забывайте добавлять его при вызове :meth:`HttpRequest.get_signed_cookie`.

source: Deletes the cookie with the given key. Fails silently if the key doesn't exist.
ru: Удаляет cookie. Не вызывает исключения, если cookie не существует.

source: Due to the way cookies work, ``path`` and ``domain`` should be the same values you used in ``set_cookie()`` -- otherwise the cookie may not be deleted.
ru: Учитывая механизм работы cookie, значения ``path`` и ``domain`` должны быть такими же, какие использовались при вызове ``set_cookie()`` -- в противном случае cookie могут быть не удалены.

source: This method makes an :class:`HttpResponse` instance a file-like object.
ru: Метод для соблюдения интерфейса объекта файла.

source: Returns the value of :attr:`HttpResponse.content`. This method makes an :class:`HttpResponse` instance a stream-like object.
ru: Возвращает значение :attr:`HttpResponse.content`. Этот метод позволяет использовать :class:`HttpResponse` как объект-файл.

source: Always ``True``. This method makes an :class:`HttpResponse` instance a stream-like object.
ru: Всегда ``True``. Этот метод позволяет использовать :class:`HttpResponse` как объект-файл.

source: Writes a list of lines to the response. Line separators are not added. This method makes an :class:`HttpResponse` instance a stream-like object.
ru: Записывает список строк в ответ. Разделители строк не добавляются. Этот метод позволяет использовать :class:`HttpResponse` как объект-файл.

source: Django includes a number of ``HttpResponse`` subclasses that handle different types of HTTP responses. Like ``HttpResponse``, these subclasses live in :mod:`django.http`.
ru: Django содержит несколько подклассов ``HttpResponse``, которые представляют различные типы HTTP ответов. Как и ``HttpResponse``, эти подклассы находятся в модуле :mod:`django.http`.

source: The first argument to the constructor is required -- the path to redirect to. This can be a fully qualified URL (e.g. ``'https://www.yahoo.com/search/'``), an absolute path with no domain (e.g. ``'/search/'``), or even a relative path (e.g. ``'search/'``). In that last case, the client browser will reconstruct the full URL itself according to the current path. See :class:`HttpResponse` for other optional constructor arguments. Note that this returns an HTTP status code 302.
ru: Конструктор принимает один обязательный аргумент -- путь для перенаправления. Это может быть полный URL (например, ``'https://www.yahoo.com/search/'``) или абсолютный путь без домена (например, ``'/search/'``). Дополнительные необязательные аргументы можно найти в описании :class:`HttpResponse`. Возвращает код HTTP состояния равный 302.

source: This read-only attribute represents the URL the response will redirect to (equivalent to the ``Location`` response header).
ru: Этот атрибут, доступный только для чтения, содержит URL для редиректа (аналог заголовка ``Location``).

source: Like :class:`HttpResponseRedirect`, but it returns a permanent redirect (HTTP status code 301) instead of a "found" redirect (status code 302).
ru: Аналогичен :class:`HttpResponseRedirect`, но возвращает постоянное перенаправление (код HTTP состояния 301) вместо временного перенаправления (код состояния 302).

source: The constructor doesn't take any arguments and no content should be added to this response. Use this to designate that a page hasn't been modified since the user's last request (status code 304).
ru: Конструктор не принимает аргументы и ответ должен быть пустым. Используйте, чтобы указать, что страница не изменилась с прошлого запроса пользователя (код состояния 304).

source: Acts just like :class:`HttpResponse` but uses a 400 status code.
ru: Аналогичен :class:`HttpResponse` но использует код состояния 400.

source: Acts just like :class:`HttpResponse` but uses a 404 status code.
ru: Аналогичен :class:`HttpResponse` но использует код состояния 404.

source: Acts just like :class:`HttpResponse` but uses a 403 status code.
ru: Аналогичен :class:`HttpResponse` но использует код состояния 403.

source: Like :class:`HttpResponse`, but uses a 405 status code. The first argument to the constructor is required: a list of permitted methods (e.g. ``['GET', 'POST']``).
ru: Аналогичен :class:`HttpResponse`, но использует код состояния 405. Обязательный аргумент: список разрешенных методов (например, ``['GET', 'POST']``).

source: Acts just like :class:`HttpResponse` but uses a 410 status code.
ru: Аналогичен :class:`HttpResponse` но использует код состояния 410.

source: Acts just like :class:`HttpResponse` but uses a 500 status code.
ru: Аналогичен :class:`HttpResponse` но использует код состояния 500.

source: If a custom subclass of :class:`HttpResponse` implements a ``render`` method, Django will treat it as emulating a :class:`~django.template.response.SimpleTemplateResponse`, and the ``render`` method must itself return a valid response object.
ru: Если ваш подкласс :class:`HttpResponse` содержит метод ``render``, Django воспринимает его как аналог класса :class:`~django.template.response.SimpleTemplateResponse`. Метод ``render`` должен возвращать правильный объект ответа.

source: An :class:`HttpResponse` subclass that helps to create a JSON-encoded response. It inherits most behavior from its superclass with a couple differences:
ru: Дочерний класс :class:`HttpResponse`, который помогает вернуть ответ в JSON. Наследует большую часть поведения родительского класса с некоторыми исключениями:

source: Its default ``Content-Type`` header is set to ``application/json``.
ru: Заголовок ``Content-Type`` по умолчанию равен ``application/json``.

source: The first parameter, ``data``, should be a ``dict`` instance. If the ``safe`` parameter is set to ``False`` (see below) it can be any JSON-serializable object.
ru: Первый параметр ``data`` должен быть словарем. Если параметр ``safe`` равен ``False`` (смотрите ниже), может принимать любой объект, который можно преобразовать в JSON.

source: The ``safe`` boolean parameter defaults to ``True``. If it's set to ``False``, any object can be passed for serialization (otherwise only ``dict`` instances are allowed). If ``safe`` is ``True`` and a non-``dict`` object is passed as the first argument, a :exc:`TypeError` will be raised.
ru: Параметр ``safe`` по умолчанию равен ``True``. Если равен ``False``, можно передать любой объект для преобразования в JSON (иначе -- только ``dict``). Если ``safe`` равен ``True`` и передали не ``dict`` объект, будет вызвано исключение :exc:`TypeError`.

source: The ``json_dumps_params`` parameter is a dictionary of keyword arguments to pass to the ``json.dumps()`` call used to generate the response.
ru: Аргумент ``json_dumps_params`` содержит словарь именованных переменных, который передаются в ``json.dumps()`` при генерации ответа.

source: Typical usage could look like::
ru: Пример использования:

source: Serializing non-dictionary objects
ru: Преобразование не словарей

source: In order to serialize objects other than ``dict`` you must set the ``safe`` parameter to ``False``::
ru: Для этого передайте в ``safe`` значение ``False``::

source: Without passing ``safe=False``, a :exc:`TypeError` will be raised.
ru: При ``safe=False`` будет вызвано исключение :exc:`TypeError`.

source: Changing the default JSON encoder
ru: Переопределяем преобразователь в JSON

source: If you need to use a different JSON encoder class you can pass the ``encoder`` parameter to the constructor method::
ru: Чтобы использовать другой преобразователь в JSON, передайте его через аргумент ``encoder`` конструктора::

source: The :class:`StreamingHttpResponse` class is used to stream a response from Django to the browser. You might want to do this if generating the response takes too long or uses too much memory. For instance, it's useful for :ref:`generating large CSV files <streaming-csv-files>`.
ru: Класс :class:`StreamingHttpResponse` используется для "стриминга" ответа из Django в браузер. Это может пригодится для медленных запросов или требующих большого количества памяти. Например, можно :ref:`генерировать большие CSV файлы <streaming-csv-files>`.

source: Performance considerations
ru: Проблемы производительности

source: Django is designed for short-lived requests. Streaming responses will tie a worker process for the entire duration of the response. This may result in poor performance.
ru: Архитектура Django создавалась для обработки быстрых запросов. Потоковые запросы держат рабочий процесс и подключение к БД до окончания обработки запроса. Это может негативно повлиять на производительность.

source: Generally speaking, you should perform expensive tasks outside of the request-response cycle, rather than resorting to a streamed response.
ru: Сложные задачи следует выполнять вне цикла запрос-ответ и не злоупотреблять потоковыми ответами.

source: The :class:`StreamingHttpResponse` is not a subclass of :class:`HttpResponse`, because it features a slightly different API. However, it is almost identical, with the following notable differences:
ru: :class:`StreamingHttpResponse` не является подклассом :class:`HttpResponse` и предоставляет немного другое API. Однако, они очень похожи со следующими отличиями:

source: It should be given an iterator that yields strings as content.
ru: Принимает итератор строк.

source: You cannot access its content, except by iterating the response object itself. This should only occur when the response is returned to the client.
ru: Вы не можете обратиться к содержимому ответа кроме как проитерировав объект ответа. Это должно происходить после возвращения ответа клиенту.

source: It has no ``content`` attribute. Instead, it has a :attr:`~StreamingHttpResponse.streaming_content` attribute.
ru: Не содержит атрибут ``content``. Вместо этого содержит атрибут :attr:`~StreamingHttpResponse.streaming_content`.

source: You cannot use the file-like object ``tell()`` or ``write()`` methods. Doing so will raise an exception.
ru: Вы не можете использовать методы объекта файла ``tell()`` или ``write()``. Это вызовет исключение.

source: An iterator of strings representing the content.
ru: Итератор строк, которые являются содержимым ответа.

source: This is always ``True``.
ru: Всегда ``True``.

source: :class:`FileResponse` is a subclass of :class:`StreamingHttpResponse` optimized for binary files. It uses `wsgi.file_wrapper`_ if provided by the wsgi server, otherwise it streams the file out in small chunks.
ru: :class:`FileResponse` -- дочерний класс :class:`StreamingHttpResponse` оптимизированный для работы с бинарными файлами. Использует `wsgi.file_wrapper`_, если он предоставлен wsgi сервером, иначе стримит файл небольшими частями.
