Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/ref/request-response.po
Languages: ru

source: Request and response objects
ru: Объекты ответа и запроса

source: Quick overview
ru: Быстрый обзор

source: Django uses request and response objects to pass state through the system.
ru: Django использует объекты ответа и запроса, чтобы передавать состояние в системе.

source: When a page is requested, Django creates an :class:`HttpRequest` object that contains metadata about the request. Then Django loads the appropriate view, passing the :class:`HttpRequest` as the first argument to the view function. Each view is responsible for returning an :class:`HttpResponse` object.
ru: Когда запрашивает страница, Django создает объект :class:`HttpRequest`, который содержит различные данные о запросе. Потом Django определяет и загружает необходимое представление и вызывает его передавая объект :class:`HttpRequest` первым аргументом. Каждое представление должно вернуть объект :class:`HttpResponse`.

source: This document explains the APIs for :class:`HttpRequest` and :class:`HttpResponse` objects, which are defined in the :mod:`django.http` module.
ru: Этот раздел описывает API объектов :class:`HttpRequest` и :class:`HttpResponse`, которые определены в модуле :mod:`django.http`.

source: Attributes
ru: Атрибуты

source: All attributes should be considered read-only, unless stated otherwise.
ru: Все атрибуты должны рассматриваться как неизменяемые, пока об обратном не будет сказано явно.

source: A string representing the scheme of the request (``http`` or ``https`` usually).
ru: Строка, указывающая схему запроса (обычно ``http`` или ``https``).

source: A string representing the full path to the requested page, not including the scheme or domain.
ru: Содержит полный путь к запрашиваемой странице, не включая домен.

source: Example: ``"/music/bands/the_beatles/"``
ru: Например: ``"/music/bands/the_beatles/"``

source: Under some Web server configurations, the portion of the URL after the host name is split up into a script prefix portion and a path info portion. The ``path_info`` attribute always contains the path info portion of the path, no matter what Web server is being used. Using this instead of :attr:`~HttpRequest.path` can make your code easier to move between test and deployment servers.
ru: Для некоторых конфигурация сервера, часть URL-а после названия домена содержит префикс скрипта и "полезную" часть пути(path info portion). Атрибут ``path_info`` всегда содержит часть URL-а, которую использует Django, не зависимо от сервера . Использование этого атрибута вместо :attr:`~HttpRequest.path` сделает ваш код более надежным и независимым от настроек сервера.

source: For example, if the ``WSGIScriptAlias`` for your application is set to ``"/minfo"``, then ``path`` might be ``"/minfo/music/bands/the_beatles/"`` and ``path_info`` would be ``"/music/bands/the_beatles/"``.
ru: Например, если ``WSGIScriptAlias`` равен ``"/minfo"``, атрибут ``path`` может быть равен ``"/minfo/music/bands/the_beatles/"`` в то время как ``path_info`` будет равен ``"/music/bands/the_beatles/"``.

source: A dictionary-like object containing all given HTTP GET parameters. See the :class:`QueryDict` documentation below.
ru: Объект с интерфейсом словаря, который содержит HTTP GET параметры. Смотрите описание :class:`QueryDict` ниже.

source: A dictionary-like object containing all given HTTP POST parameters, providing that the request contains form data. See the :class:`QueryDict` documentation below. If you need to access raw or non-form data posted in the request, access this through the :attr:`HttpRequest.body` attribute instead.
ru: Объект-словарь содержащий все POST параметры, переданные формой. Смотрите описание :class:`QueryDict` ниже. Если вам необходимо получить необработанные данные или данные переданные не через форму, используйте атрибут :attr:`HttpRequest.body`.

source: See :doc:`/topics/files` for more information.
ru: Подробности в разделе :doc:`/topics/files`.

source: ``CONTENT_LENGTH`` -- The length of the request body (as a string).
ru: ``CONTENT_LENGTH`` -- размер содержимого запроса (содержимое учитывается как строка).

source: ``CONTENT_TYPE`` -- The MIME type of the request body.
ru: ``CONTENT_TYPE`` -- MIME-тип содержимого запроса.

source: ``HTTP_ACCEPT`` -- Acceptable content types for the response.
ru: ``HTTP_ACCEPT`` -- принимаемые типы ответа ответа.

source: ``HTTP_ACCEPT_ENCODING`` -- Acceptable encodings for the response.
ru: ``HTTP_ACCEPT_ENCODING`` -- принимаемые кодировки ответа.

source: ``HTTP_ACCEPT_LANGUAGE`` -- Acceptable languages for the response.
ru: ``HTTP_ACCEPT_LANGUAGE`` -- принимаемые языки ответа.

source: ``HTTP_HOST`` -- The HTTP Host header sent by the client.
ru: ``HTTP_HOST`` -- заголовок HTTP Host отсылаемый клиентом.

source: ``HTTP_REFERER`` -- The referring page, if any.
ru: ``HTTP_REFERER`` -- Ссылающаяся страница, если определена.

source: ``HTTP_USER_AGENT`` -- The client's user-agent string.
ru: ``HTTP_USER_AGENT`` -- Строка "user-agent" клиента.

source: ``QUERY_STRING`` -- The query string, as a single (unparsed) string.
ru: ``QUERY_STRING`` -- Строка запроса, не обработанная.

source: ``REMOTE_ADDR`` -- The IP address of the client.
ru: ``REMOTE_ADDR`` -- IP-адрес клиента.

source: ``REMOTE_HOST`` -- The hostname of the client.
ru: ``REMOTE_HOST`` -- имя хоста клиента.

source: ``REMOTE_USER`` -- The user authenticated by the Web server, if any.
ru: ``REMOTE_USER`` -- пользователь аутентифицированный Web-сервером, если определен.

source: ``REQUEST_METHOD`` -- A string such as ``"GET"`` or ``"POST"``.
ru: ``REQUEST_METHOD`` -- Метод запроса. Строка, например, ``"GET"`` или ``"POST"``.

source: ``SERVER_NAME`` -- The hostname of the server.
ru: ``SERVER_NAME`` -- имя хоста сервера.

source: ``SERVER_PORT`` -- The port of the server (as a string).
ru: ``SERVER_PORT`` -- Порт сервера(строка).

source: With the exception of ``CONTENT_LENGTH`` and ``CONTENT_TYPE``, as given above, any HTTP headers in the request are converted to ``META`` keys by converting all characters to uppercase, replacing any hyphens with underscores and adding an ``HTTP_`` prefix to the name. So, for example, a header called ``X-Bender`` would be mapped to the ``META`` key ``HTTP_X_BENDER``.
ru: За исключением ``CONTENT_LENGTH`` и ``CONTENT_TYPE`` из примера выше, любый HTTP заголовок запроса преобразуется в ключ атрибута ``META`` конвертированием всех символов в верхний регистр, заменой дефисов нижним подчеркиванием и добавлением префикса ``HTTP_`` к названию. Например, заголовок ``X-Bender`` будет добавлен в ``META`` с ключом ``HTTP_X_BENDER``.

source: Note that :djadmin:`runserver` strips all headers with underscores in the name, so you won't see them in ``META``. This prevents header-spoofing based on ambiguity between underscores and dashes both being normalizing to underscores in WSGI environment variables. It matches the behavior of Web servers like Nginx and Apache 2.4+.
ru: Обратите внимание, :djadmin:`runserver` обрезает все заголовки с подчеркиванием в названии, по этому вы их не увидите в ``META``. Это предотвращает подделку заголовков, которая возможна из-за преобразования дефисов в подчеркивания в названиях переменных окружения WSGI. Такое поведение совпадает с поведением Web-серверов, таких как Nginx и Apache 2.4+.

source: Attributes set by application code
ru: Атрибуты, которые могут добавляться кодом приложения

source: Django doesn't set these attributes itself but makes use of them if set by your application.
ru: Django не устанавливает эти атрибуты, но использует их, если ваше приложение установит их.

source: This will be used as the root URLconf for the current request, overriding the :setting:`ROOT_URLCONF` setting. See :ref:`how-django-processes-a-request` for details.
ru: Будет использоваться как URLconf текущего запроса вместо значения настройки :setting:`ROOT_URLCONF`. Подробности смотрите в разделе :ref:`how-django-processes-a-request`.

source: ``urlconf`` can be set to ``None`` to revert any changes made by previous middleware and return to using the :setting:`ROOT_URLCONF`.
ru: ``urlconf`` можно установить в ``None``, чтобы отменить какие-либо изменения, сделанные предыдущими промежуточными слоями, и снова использовать :setting:`ROOT_URLCONF`.

source: Attributes set by middleware
ru: Атрибуты, которые устанавливаются промежуточным слоем(middleware)

source: From the :class:`~django.contrib.sessions.middleware.SessionMiddleware`: A readable and writable, dictionary-like object that represents the current session.
ru: Добавляется :class:`~django.contrib.sessions.middleware.SessionMiddleware`: объект с интерфейсом словаря, который содержит текущую сессию.

source: From the :class:`~django.contrib.sites.middleware.CurrentSiteMiddleware`: An instance of :class:`~django.contrib.sites.models.Site` or :class:`~django.contrib.sites.requests.RequestSite` as returned by :func:`~django.contrib.sites.shortcuts.get_current_site()` representing the current site.
ru: Добавляется :class:`~django.contrib.sites.middleware.CurrentSiteMiddleware`: экземпляр :class:`~django.contrib.sites.models.Site` или :class:`~django.contrib.sites.requests.RequestSite`, который возвращается :func:`~django.contrib.sites.shortcuts.get_current_site()`, отображает текущий сайт.

source: Methods
ru: Методы

source: Returns the originating host of the request using information from the ``HTTP_X_FORWARDED_HOST`` (if :setting:`USE_X_FORWARDED_HOST` is enabled) and ``HTTP_HOST`` headers, in that order. If they don't provide a value, the method uses a combination of ``SERVER_NAME`` and ``SERVER_PORT`` as detailed in :pep:`3333`.
ru: Возвращает оригинальное имя хоста используя информацию из ``HTTP_X_FORWARDED_HOST`` (если включена настройка :setting:`USE_X_FORWARDED_HOST`) и ``HTTP_HOST`` заголовков, в соответствующем порядке. Если эти значения не определенны, метод использует комбинацию ``SERVER_NAME`` и ``SERVER_PORT`` как описано в :pep:`3333`.

source: Example: ``"127.0.0.1:8000"``
ru: Например: ``"127.0.0.1:8000"``

source: The :meth:`~HttpRequest.get_host()` method fails when the host is behind multiple proxies. One solution is to use middleware to rewrite the proxy headers, as in the following example::
ru: Метод :meth:`~HttpRequest.get_host()` вернет ошибку если сервер находится за несколькими proxy. Одно из решений -- создать функциональный слой(middleware), который переопределить заголовки proxy таким образом::

source: This middleware should be positioned before any other middleware that relies on the value of :meth:`~HttpRequest.get_host()` -- for instance, :class:`~django.middleware.common.CommonMiddleware` or :class:`~django.middleware.csrf.CsrfViewMiddleware`.
ru: Этот функциональный слой должен находиться перед любый другим, который может использовать :meth:`~HttpRequest.get_host()`, например, :class:`~django.middleware.common.CommonMiddleware` или :class:`~django.middleware.csrf.CsrfViewMiddleware`.

source: Returns the originating port of the request using information from the ``HTTP_X_FORWARDED_PORT`` (if :setting:`USE_X_FORWARDED_PORT` is enabled) and ``SERVER_PORT`` ``META`` variables, in that order.
ru: Возвращает оригинальный порт запроса, используя данные из ``HTTP_X_FORWARDED_PORT`` (если включена настройка :setting:`USE_X_FORWARDED_PORT`) и значение ``SERVER_PORT`` из ``META`` в указанном порядке.

source: Returns the ``path``, plus an appended query string, if applicable.
ru: Возвращает ``path``, со строкой запроса, если она присутствует.

source: Example: ``"/music/bands/the_beatles/?print=true"``
ru: Например: ``"/music/bands/the_beatles/?print=true"``

source: Returns the absolute URI form of ``location``. If no location is provided, the location will be set to ``request.get_full_path()``.
ru: Возвращает абсолютный URI для аргумента ``location``. Если ``location`` не указан, будет использовано значение ``request.get_full_path()``.

source: If the location is already an absolute URI, it will not be altered. Otherwise the absolute URI is built using the server variables available in this request.
ru: Если ``location`` уже является абсолютным URI, значение останется не измененным. В другом случае абсолютный URI будет создан с использованием данных запроса.

source: Example: ``"https://example.com/music/bands/the_beatles/?print=true"``
ru: Например: ``"https://example.com/music/bands/the_beatles/?print=true"``

source: Returns a cookie value for a signed cookie, or raises a ``django.core.signing.BadSignature`` exception if the signature is no longer valid. If you provide the ``default`` argument the exception will be suppressed and that default value will be returned instead.
ru: Возвращает значение подписанных(signed) cookie, или вызывает исключение ``django.core.signing.BadSignature`` если подпись не верна. При передаче аргумента ``default`` исключение не будет вызвано и функция вернет значение по-умолчанию.

source: The optional ``salt`` argument can be used to provide extra protection against brute force attacks on your secret key. If supplied, the ``max_age`` argument will be checked against the signed timestamp attached to the cookie value to ensure the cookie is not older than ``max_age`` seconds.
ru: Необязательный аргумент ``salt`` может быть использован для дополнительной защиты от " brute force" атак. Если передан аргумент ``max_age``, время подписи cookie будет проверяться, чтобы убедиться, что cookie не старше ``max_age`` секунд.

source: For example::
ru: Например::

source: See :doc:`cryptographic signing </topics/signing>` for more information.
ru: Подробности смотрите в разделе о :doc:`криптографической подписи </topics/signing>`.

source: Returns ``True`` if the request is secure; that is, if it was made with HTTPS.
ru: Возвращает ``True`` если запрос безопасный; то есть, если он был выполнен через HTTPS.

source: :class:`QueryDict` implements all the standard dictionary methods because it's a subclass of dictionary. Exceptions are outlined here:
ru: Класс :class:`QueryDict` представляет все стандартные методы словаря, так как является его подклассом. Исключения описаны здесь:

source: Instantiates a ``QueryDict`` object based on ``query_string``.
ru: Создает экземпляр ``QueryDict`` из ``query_string``.

source: If ``query_string`` is not passed in, the resulting ``QueryDict`` will be empty (it will have no keys or values).
ru: Если параметр ``query_string`` не указан, полученный ``QueryDict`` будет пустым (без ключей и значений).

source: Most ``QueryDict``\ s you encounter, and in particular those at ``request.POST`` and ``request.GET``, will be immutable. If you are instantiating one yourself, you can make it mutable by passing ``mutable=True`` to its ``__init__()``.
ru: Большинство объектов ``QueryDict``, которые используются в Django, в том числе ``request.POST`` и ``request.GET``, будут неизменяемыми. Если вы создаете экземпляр самостоятельно, можете сделать его изменяемым, передав ``mutable=True`` в ``__init__()``.

source: Returns ``True`` if the given key is set. This lets you do, e.g., ``if "foo" in request.GET``.
ru: Возвращает ``True`` если переданный ключ существует. Это позволяет вам использовать ``if "foo" in request.GET``.

source: In addition, ``QueryDict`` has the following methods:
ru: В дополнение, ``QueryDict`` содержит такие методы:

source: Appends an item to the internal list associated with key.
ru: Добавляет элемент во внутренний список значений ключа.

source: Like :meth:`items()`, except it includes all values, as a list, for each member of the dictionary. For example::
ru: Аналогичен методу :meth:`items()`, но включает все значения списком для каждого элемента словаря. Например::

source: Returns a list of values for the given key and removes them from the dictionary. Raises ``KeyError`` if the key does not exist. For example::
ru: Возвращает список значений для переданного ключа и удаляет его из словаря. Вызывает ``KeyError``, если ключ не существует. Например::

source: Removes an arbitrary member of the dictionary (since there's no concept of ordering), and returns a two value tuple containing the key and a list of all values for the key. Raises ``KeyError`` when called on an empty dictionary. For example::
ru: Удаляет произвольный элемент словаря(т.к. не сохраняется порядок ключей) и возвращает кортеж содержащий ключ и список значений. Вызывает ``KeyError``, если словарь не содержит элементов. Например::

source: The :class:`HttpResponse` class lives in the :mod:`django.http` module.
ru: Класс :class:`HttpResponse` находится в модуле :mod:`django.http`.

source: Usage
ru: Использование

source: Passing strings
ru: Передача строки

source: Typical usage is to pass the contents of the page, as a string, to the :class:`HttpResponse` constructor::
ru: Типичное использование заключается в передаче содержимого страницы в виде строки в конструктор :class:`HttpResponse`::

source: But if you want to add content incrementally, you can use ``response`` as a file-like object::
ru: Но если вам необходимо добавлять содержимое постепенно, вы можете использовать объект ``response`` как объект файла::

source: Passing iterators
ru: Передача итератора

source: If you need the response to be streamed from the iterator to the client, you must use the :class:`StreamingHttpResponse` class instead.
ru: Если необходимо отдавать данные из итератора в потоке, используйте экземпляр :class:`StreamingHttpResponse`.

source: Setting header fields
ru: Установка заголовков

source: To set or remove a header field in your response, treat it like a dictionary::
ru: При установке или удалении заголовка в объекте ответа, рассматривайте его как словарь:

source: Note that unlike a dictionary, ``del`` doesn't raise ``KeyError`` if the header field doesn't exist.
ru: Заметим, что в отличии от словаря, ``del`` не вызовет исключение ``KeyError`` если заголовок не определен.

source: For setting the ``Cache-Control`` and ``Vary`` header fields, it is recommended to use the :func:`~django.utils.cache.patch_cache_control` and :func:`~django.utils.cache.patch_vary_headers` methods from :mod:`django.utils.cache`, since these fields can have multiple, comma-separated values. The "patch" methods ensure that other values, e.g. added by a middleware, are not removed.
ru: Для установки заголовков ``Cache-Control`` и ``Vary``, лучше использовать функции :func:`~django.utils.cache.patch_cache_control` и :func:`~django.utils.cache.patch_vary_headers` из модуля :mod:`django.utils.cache`, так как эти поля могут содержать несколько значений, разделенных запятыми. Эти функции добавят новые значение не удаляя существующие.

source: HTTP header fields cannot contain newlines. An attempt to set a header field containing a newline character (CR or LF) will raise ``BadHeaderError``
ru: HTTP заголовки не могут содержать перенос строки. При попытке добавить заголовок содержащий символ переноса строки (CR или LF) будет вызвано исключение ``BadHeaderError``

source: Telling the browser to treat the response as a file attachment
ru: Указываем браузеру воспринимать ответ как вложенный файл

source: To tell the browser to treat the response as a file attachment, use the ``content_type`` argument and set the ``Content-Disposition`` header. For example, this is how you might return a Microsoft Excel spreadsheet::
ru: Для этого используйте аргумент ``content_type`` и установите заголовок ``Content-Disposition``. Например, вот так вы можете вернуть таблицу Microsoft Excel::

source: There's nothing Django-specific about the ``Content-Disposition`` header, but it's easy to forget the syntax, so we've included it here.
ru: Заголовок ``Content-Disposition`` никак не относится к Django, но очень легко забыть синтаксис, поэтому мы добавили пример.

source: A string denoting the charset in which the response will be encoded. If not given at ``HttpResponse`` instantiation time, it will be extracted from ``content_type`` and if that is unsuccessful, the :setting:`DEFAULT_CHARSET` setting will be used.
ru: Кодировка, в которую будет закодирован ответ. Если не указана во время создания объекта ``HttpResponse``, будет проверятся ``content_type``, и если не будет найдена, будет использоваться значение настройки :setting:`DEFAULT_CHARSET`.

source: Unless :attr:`reason_phrase` is explicitly set, modifying the value of ``status_code`` outside the constructor will also modify the value of ``reason_phrase``.
ru: Если :attr:`reason_phrase` не установлен явно, изменение ``status_code`` вне конструктора также изменит ``reason_phrase``.

source: This is always ``False``.
ru: Всегда ``False``.

source: This attribute exists so middleware can treat streaming responses differently from regular responses.
ru: Указывает middleware, что этот ответ потоковый и его нужно обрабатывать не так, как обычные запросы.

source: ``True`` if the response has been closed.
ru: ``True``, если ответ был закрыт.

source: Instantiates an ``HttpResponse`` object with the given page content and content type.
ru: Создает экземпляр ``HttpResponse`` с переданным содержимым и MIME-типом.

source: ``content`` should be an iterator or a string. If it's an iterator, it should return strings, and those strings will be joined together to form the content of the response. If it is not an iterator or a string, it will be converted to a string when accessed.
ru: ``content`` должен быть строкой или итератором. Если это итератор, он должен возвращать строки, которые будут объединены для формирования содержимого ответа. Если это не итератор и не строка, значение будет конвертировано в строковое представление.

source: ``content_type`` is the MIME type optionally completed by a character set encoding and is used to fill the HTTP ``Content-Type`` header. If not specified, it is formed by the :setting:`DEFAULT_CONTENT_TYPE` and :setting:`DEFAULT_CHARSET` settings, by default: "`text/html; charset=utf-8`".
ru: ``content_type`` - MIME-тип, возможно с кодировкой, используется в HTTP заголовке ``Content-Type``. Если не указан, используются настройки :setting:`DEFAULT_CONTENT_TYPE` и :setting:`DEFAULT_CHARSET`, по умолчанию: "`text/html; charset=utf-8`".

source: ``reason`` is the HTTP response phrase. If not provided, a default phrase will be used.
ru: ``reason`` -- это описание HTTP ответа. Если не указано, будет использоваться стандартное значение.

source: ``charset`` is the charset in which the response will be encoded. If not given it will be extracted from ``content_type``, and if that is unsuccessful, the :setting:`DEFAULT_CHARSET` setting will be used.
ru: ``charset`` - кодировка, в которую будет закодирован ответ. Если не указана во время создания объекта ``HttpResponse``, будет проверятся ``content_type``, и если не будет найдена, будет использоваться значение настройки :setting:`DEFAULT_CHARSET`.

source: Sets the given header name to the given value. Both ``header`` and ``value`` should be strings.
ru: Устанавливает заголовок ответа. ``header`` и ``value`` должны быть строками.

source: Deletes the header with the given name. Fails silently if the header doesn't exist. Case-insensitive.
ru: Удаляет заголовок ответа. Не вызывает исключения, если заголовок не существует. Регистронезависимый.

source: Returns the value for the given header name. Case-insensitive.
ru: Возвращает значение заголовка. Регистрозависимый.

source: Returns ``True`` or ``False`` based on a case-insensitive check for a header with the given name.
ru: Возвращает ``True`` или ``False`` в результате регистронезависимого поиска заголовка по указанному названию.

source: Sets a header unless it has already been set.
ru: Устанавливает заголовок, если он еще не был установлен.
