Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/ref/unicode.po
Languages: ru

source: You can still create a ``__str__()`` method on your models if you want, of course, but you shouldn't need to do this unless you have a good reason. Django's ``Model`` base class automatically provides a ``__str__()`` implementation that calls ``__unicode__()`` and encodes the result into UTF-8. This means you'll normally only need to implement a ``__unicode__()`` method and let Django handle the coercion to a bytestring when required.
ru: Вы можете все же создать метод ``__str__()`` в вашей модели, если хотите, конечно, но вам не нужно этого делать, пока вы не имеете достаточной причины. Базовый класс ``Model`` в Django автоматически предоставляет реализацию ``__str__()``, которая вызывает ``__unicode__()`` и кодирует результат в UTF-8. Это значит, что обычно вам достаточно реализовать метод ``__unicode__()`` и дать Django принудительно преобразовать в байтовую строку когда это потребуется.

source: Taking care in ``get_absolute_url()``
ru: Будьте осторожны с ``get_absolute_url()``

source: If you're constructing a URL manually (i.e., *not* using the ``reverse()`` function), you'll need to take care of the encoding yourself. In this case, use the ``iri_to_uri()`` and ``urlquote()`` functions that were documented above_. For example::
ru: Если вы собираете URL вручную (то есть *не* используя функцию ``reverse()`` ), вам будет нужно заботиться о кодировании самостоятельно. В этом случае, используйте функции ``iri_to_uri()`` и ``urlquote()`` которые были описаны выше_. Например::

source: This function returns a correctly encoded URL even if ``self.location`` is something like "Jack visited Paris & Orléans". (In fact, the ``iri_to_uri()`` call isn't strictly necessary in the above example, because all the non-ASCII characters would have been removed in quoting in the first line.)
ru: Функция возвращает корректный кодированный URL, даже если ``self.location`` это что то подобное "Jack visited Paris & Orléans". (По факту, вызов ``iri_to_uri()`` не строго необходим в примере выше, потому что все не-ASCII символы были бы удалены при экранировании в первой строке.)

source: The database API
ru: API базы данных

source: You can pass either Unicode strings or UTF-8 bytestrings as arguments to ``filter()`` methods and the like in the database API. The following two querysets are identical::
ru: Вы можете передавать или Unicode строку или UTF-8 байтовую строку в качестве аргументов в методы ``filter()`` и им подобные в API баз данных. Следующие два QuerySets одинаковы:

source: Templates
ru: Шаблоны

source: You can use either Unicode or bytestrings when creating templates manually::
ru: Вы можете использовать Unicode или байтовые строки когда создаете шаблон вручную.

source: But the common case is to read templates from the filesystem, and this creates a slight complication: not all filesystems store their data encoded as UTF-8. If your template files are not stored with a UTF-8 encoding, set the :setting:`FILE_CHARSET` setting to the encoding of the files on disk. When Django reads in a template file, it will convert the data from this encoding to Unicode. (:setting:`FILE_CHARSET` is set to ``'utf-8'`` by default.)
ru: Но в общем случае шаблоны читаются из файловой системы и это создает незначительную сложность: не все файловые системы хранят данные в UTF-8. Если ваши файлы с шаблонами хранятся не в UTF-8, установите параметр :setting:`FILE_CHARSET` в значение кодировки ваших файлов на диске. Когда Django читает файл шаблона, он будет конвертировать данные из указанной кодировки в Unicode.(:setting:`FILE_CHARSET` установлено в ``'utf-8'`` по умолчанию.)

source: The :setting:`DEFAULT_CHARSET` setting controls the encoding of rendered templates. This is set to UTF-8 by default.
ru: Параметр :setting:`DEFAULT_CHARSET` управляет кодировкой сгенерированных шаблонов. Он установлен в UTF-8 по умолчанию.

source: Template tags and filters
ru: Шаблонные теги и фильтры

source: A couple of tips to remember when writing your own template tags and filters:
ru: Несколько подсказок, которые следует помнить когда вы пишите свои теги и фильтры:

source: Always return Unicode strings from a template tag's ``render()`` method and from template filters.
ru: Всегда возвращайте Unicode строки из ``render()`` метода шаблонных тегов и из шаблонных фильтров.

source: Use ``force_text()`` in preference to ``smart_text()`` in these places. Tag rendering and filter calls occur as the template is being rendered, so there is no advantage to postponing the conversion of lazy translation objects into strings. It's easier to work solely with Unicode strings at that point.
ru: Использование ``force_text()`` предпочтительнее ``smart_text()`` в этих местах. Вызовы рендеринга тега и фильтра происходят так же как для отрендереннного шаблона, поэтому нет выгоды в отложенном преобразовании объектов ленивого перевода в строки. Это легче для работы исключительно с Unicode строками в этот момент.

source: Files
ru: Файлы

source: If you intend to allow users to upload files, you must ensure that the environment used to run Django is configured to work with non-ASCII file names. If your environment isn't configured correctly, you'll encounter ``UnicodeEncodeError`` exceptions when saving files with file names that contain non-ASCII characters.
ru: Если вы позволяете пользователям загружать файлы, убедитесь, что окружение настроено для работы с названиями файлов, которые содержат не ASCII символы. Иначе вы получите ошибку ``UnicodeEncodeError`` при сохранении таких файлов.

source: Filesystem support for UTF-8 file names varies and might depend on the environment. Check your current configuration in an interactive Python shell by running::
ru: Поддержка файловой системой UTF-8 в названиях файлов зависит от окружения. Проверьте текущие настройки в консоли Python, выполнив::

source: This should output "UTF-8".
ru: Должно вывести "UTF-8".

source: The ``LANG`` environment variable is responsible for setting the expected encoding on Unix platforms. Consult the documentation for your operating system and application server for the appropriate syntax and location to set this variable.
ru: Переменная окружения ``LANG`` отвечает за кодировку по умолчанию в Unix. Обратитесь к документации вашей операционной системы и сервера, чтобы узнать о настройке этого значения.

source: In your development environment, you might need to add a setting to your ``~.bashrc`` analogous to:::
ru: При разработке вы можете указать настройку в ``~.bashrc``::

source: Django's email framework (in ``django.core.mail``) supports Unicode transparently. You can use Unicode data in the message bodies and any headers. However, you're still obligated to respect the requirements of the email specifications, so, for example, email addresses should use only ASCII characters.
ru: Email фреймворк Django (в ``django.core.mail``) прозрачно поддерживает Unicode. Вы можете использовать Unicode данные в теле сообщения и в любых заголовках. Однако, вы все еще обязаны соблюдать требования email спецификаций, так, например, email адрес должен использовать только ASCII символы.

source: The following code example demonstrates that everything except email addresses can be non-ASCII::
ru: Следующий пример кода демонстрирует, что все, исключая лишь email, адрес может быть не-ASCII::

source: Form submission
ru: Отправка формы

source: HTML form submission is a tricky area. There's no guarantee that the submission will include encoding information, which means the framework might have to guess at the encoding of submitted data.
ru: Отправка HTML форм - это сложная область. Нет гарантии, что отправка будет содержать информацию о кодировке, это означает, что фреймворк может только предполагать, в какой кодировке находятся отправленные данные.

source: Django adopts a "lazy" approach to decoding form data. The data in an ``HttpRequest`` object is only decoded when you access it. In fact, most of the data is not decoded at all. Only the ``HttpRequest.GET`` and ``HttpRequest.POST`` data structures have any decoding applied to them. Those two fields will return their members as Unicode data. All other attributes and methods of ``HttpRequest`` return data exactly as it was submitted by the client.
ru: Django исполузует "ленивый" подход для декодирования данных формы. Данные в объекте ``HttpRequest`` декодируются только, когда вы обращаетесь к этому объекту. А фактически многие данные не декодируются вовсе. Только ``HttpRequest.GET`` и ``HttpRequest.POST`` структуры могут декодироваться. Эти два поля будут возвращать свои данные в Unicode. Все остальные атрибуты и методы ``HttpRequest`` возвращают данные так, как их прислал клиент.

source: By default, the :setting:`DEFAULT_CHARSET` setting is used as the assumed encoding for form data. If you need to change this for a particular form, you can set the ``encoding`` attribute on an ``HttpRequest`` instance. For example::
ru: По умолчанию параметр :setting:`DEFAULT_CHARSET` используется как предполагающаяся кодировка для данных формы. Если вам нужно изменить это для части форм, вы можете установить атрибут ``encoding`` для экземпляра ``HttpRequest``. Например:

source: You can even change the encoding after having accessed ``request.GET`` or ``request.POST``, and all subsequent accesses will use the new encoding.
ru: Вы даже можете изменить кодировку после обращения к ``request.GET`` или ``request.POST``, и все более поздние обращения будут использовать эту новую кодировку.

source: Most developers won't need to worry about changing form encoding, but this is a useful feature for applications that talk to legacy systems whose encoding you cannot control.
ru: Большинство разработчиков не захотят беспокоится об изменении кодировки, но это полезная особенность для приложений, которые работают с устаревшими системами, которые не могут управлять кодировкой.

source: Django does not decode the data of file uploads, because that data is normally treated as collections of bytes, rather than strings. Any automatic decoding there would alter the meaning of the stream of bytes.
ru: Django не декодирует данные загруженных файлов, потому что их данные обычно обрабатывают как набор байтов, а не как строки. Любое автоматическое декодирование здесь могло бы изменить значение потока байт.
