Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/ref/unicode.po
Languages: ru

source: Unicode data
ru: Данные Unicode

source: Django natively supports Unicode data everywhere. Providing your database can somehow store the data, you can safely pass around Unicode strings to templates, models and the database.
ru: Django изначально полноценно поддерживает Unicode данные. Предоставляя вашей базе данных возможность хранить данные как угодно, вы можете безопасно передавать Unicode строки в шаблоны, модели и базу данных.

source: This document tells you what you need to know if you're writing applications that use data or templates that are encoded in something other than ASCII.
ru: Этот документ расскажет вам, что вы должны знать, если вы пишете приложения, которые используют данные или шаблоны, закодированные, в что-то отличное от ASCII.

source: Creating the database
ru: Создание базы данных

source: Make sure your database is configured to be able to store arbitrary string data. Normally, this means giving it an encoding of UTF-8 or UTF-16. If you use a more restrictive encoding -- for example, latin1 (iso8859-1) -- you won't be able to store certain characters in the database, and information will be lost.
ru: Убедитесь, что ваша база данных настроена с учетом возможности хранить произвольные строковые данные. Обычно, это значит хранение в кодировке UTF-8 или UTF-16. Если вы используете более строгие кодировки -- к примеру latin1 (iso8859-1) -- вы не сможете хранить определенные символы, и информация будет утеряна.

source: MySQL users, refer to the `MySQL manual`_ for details on how to set or alter the database character set encoding.
ru: Пользователи MySQL могут обратиться к `MySQL manual`_ за подробностями, как установить или изменить кодировку базы данных.

source: PostgreSQL users, refer to the `PostgreSQL manual`_ (section 22.3.2 in PostgreSQL 9) for details on creating databases with the correct encoding.
ru: Пользователи PostgreSQL могут обратиться к `PostgreSQL manual`_ (раздел 22.3.2 in PostgreSQL 9) за подробностями по созданию баз данных с правильной кодировкой.

source: Oracle users, refer to the `Oracle manual`_ for details on how to set (`section 2`_) or alter (`section 11`_) the database character set encoding.
ru: Пользователи Oracle могут обратиться к `Oracle manual`_ за подробностями, как установить (`section 2`_) или изменить (`section 11`_) кодировку базы данных.

source: SQLite users, there is nothing you need to do. SQLite always uses UTF-8 for internal encoding.
ru: Пользователи SQLite могут ничего не делать. SQLite всегда использует UTF-8 в качестве внутренней кодировки.

source: All of Django's database backends automatically convert Unicode strings into the appropriate encoding for talking to the database. They also automatically convert strings retrieved from the database into Python Unicode strings. You don't even need to tell Django what encoding your database uses: that is handled transparently.
ru: Все бекенды баз данных в Django автоматически конвертируют Unicode строки в соответствующую кодировку для передачи в базу данных. Они также автоматически конвертируют строки, полученные из базы данных в строки Python Unicode. Вам даже не нужно говорить Django, какую кодировку использует ваша база данных: это прозрачно обрабатывается.

source: For more, see the section "The database API" below.
ru: Подробнее смотрите раздел "API базы данных" ниже.

source: General string handling
ru: Общая обработка строк

source: Whenever you use strings with Django -- e.g., in database lookups, template rendering or anywhere else -- you have two choices for encoding those strings. You can use Unicode strings, or you can use normal strings (sometimes called "bytestrings") that are encoded using UTF-8.
ru: Всякий раз когда вы используете строки в Django -- к примеру, в поиске по базе данных, рендеринге шаблонов или где-нибудь еще -- вы имеете два варианта для кодирования таких строк. Вы можете использовать строки Unicode или же вы можете использовать обыкновенные строки (иногда называющиеся "байтовыми строками"), которые кодируются с использованием UTF-8.

source: In Python 3, the logic is reversed, that is normal strings are Unicode, and when you want to specifically create a bytestring, you have to prefix the string with a 'b'. As we are doing in Django code from version 1.5, we recommend that you import ``unicode_literals`` from the __future__ library in your code. Then, when you specifically want to create a bytestring literal, prefix the string with 'b'.
ru: В Python 3 логика была изменена, теперь обыкновенные строки являются Unicode, и когда вы хотите создать байтовую строку, вы должны использовать строку начинающуюся с 'b'. Как мы сами делаем в Django, начиная с версии 1.5, мы рекомендуем и вам - импортировать ``unicode_literals`` из библиотеки __future__ в вашем коде. И тогда, когда вы захотите специально создать байтовую строку, добавьте префикс 'b'.

source: Python 2 legacy::
ru: Наследие Python 2::

source: Python 2 with unicode literals or Python 3::
ru: Python 2 с литералами Unicode или Python 3::

source: See also :doc:`Python 3 compatibility </topics/python3>`.
ru: Смотрите также :doc:`Портирование на Python 3 </topics/python3>`.

source: A bytestring does not carry any information with it about its encoding. For that reason, we have to make an assumption, and Django assumes that all bytestrings are in UTF-8.
ru: Байтовые строки не могут содержать информацию о своих кодировках. По этой причине, мы должны делать предположение, и Django предполагает, что все байтовые строки будут в кодировке UTF-8.

source: If you pass a string to Django that has been encoded in some other format, things will go wrong in interesting ways. Usually, Django will raise a ``UnicodeDecodeError`` at some point.
ru: Если передать строку в Django, которая была закодирована в каком-то другом формате, все пойдет не так. Как правило Django выбрасывает исключение ``UnicodeDecodeError`` в этом месте.

source: If your code only uses ASCII data, it's safe to use your normal strings, passing them around at will, because ASCII is a subset of UTF-8.
ru: Если ваш код использует только данные ASCII, это позволяет использовать обыкновенные строки, они будут работать корректно, так как ASCII является подмножеством UTF-8.

source: Don't be fooled into thinking that if your :setting:`DEFAULT_CHARSET` setting is set to something other than ``'utf-8'`` you can use that other encoding in your bytestrings! :setting:`DEFAULT_CHARSET` only applies to the strings generated as the result of template rendering (and email). Django will always assume UTF-8 encoding for internal bytestrings. The reason for this is that the :setting:`DEFAULT_CHARSET` setting is not actually under your control (if you are the application developer). It's under the control of the person installing and using your application -- and if that person chooses a different setting, your code must still continue to work. Ergo, it cannot rely on that setting.
ru: Не обманывайте себя, думая что если ваш параметр :setting:`DEFAULT_CHARSET` установлен в какую-то отличную от ``'utf-8'`` кодировку, то вы можете использовать другую кодировку в ваших байтовых строках. Параметр :setting:`DEFAULT_CHARSET` применяется только к строкам, сгенерированным в результате рендеринга шаблона (или email). Django всегда будет ожидать UTF-8 для внутренних байтовых строк. Причина этого в том, что параметр :setting:`DEFAULT_CHARSET` фактически находится не под вашим контролем (если вы разработчик приложения). Это будет под контролем, того, кто инсталирует и использует ваше приложение -- и даже если будет выбрана другая кодировка, то ваш код обязан продолжать работать. Следовательно это не может зависеть от такого параметра.

source: In most cases when Django is dealing with strings, it will convert them to Unicode strings before doing anything else. So, as a general rule, if you pass in a bytestring, be prepared to receive a Unicode string back in the result.
ru: Во многих случаях, когда Django работает со строками, он будет конвертировать их в строки Unicode перед тем как что-либо делать с ними. Поэтому, общее правило, если вы передаете байтовую строку, будьте готовы получить назад строку Unicode.

source: Translated strings
ru: Переведенные строки

source: Aside from Unicode strings and bytestrings, there's a third type of string-like object you may encounter when using Django. The framework's internationalization features introduce the concept of a "lazy translation" -- a string that has been marked as translated but whose actual translation result isn't determined until the object is used in a string. This feature is useful in cases where the translation locale is unknown until the string is used, even though the string might have originally been created when the code was first imported.
ru: Немного в стороне от строк Unicode и байтовых строк, есть еще третий тип строковых объектов, с которыми можно столкнуться, используя Django. Особенности интернационализации фреймворка вводят понятие "ленивого перевода" -- это строка которая отмечена как переведенная, но чей фактический перевод не определен пока объект используется в строке. Эта особенность полезна в случаях, когда перевод локали не известен пока строка не будет использована, даже при том что строка могла быть первоначально создана когда код был первый раз импортирован.

source: Normally, you won't have to worry about lazy translations. Just be aware that if you examine an object and it claims to be a ``django.utils.functional.__proxy__`` object, it is a lazy translation. Calling ``unicode()`` with the lazy translation as the argument will generate a Unicode string in the current locale.
ru: Обычно, вы не должны беспокоиться о ленивых переводах. Только знайте, что если вы проверяете объект и он утверждает, что он ``django.utils.functional.__proxy__`` - это ленивый перевод. Вызов ``unicode()`` с ленивым переводом в качестве аргумента сгенерирует строку Unicode в текущей локали.

source: For more details about lazy translation objects, refer to the :doc:`internationalization </topics/i18n/index>` documentation.
ru: Для более подробной информации об объектах ленивого перевода вы можете обратиться к документации :doc:`Интернационализация </topics/i18n/index>`.

source: Useful utility functions
ru: Полезные утилитарные функции.

source: Because some string operations come up again and again, Django ships with a few useful functions that should make working with Unicode and bytestring objects a bit easier.
ru: По причине того, что некоторые строковые операции требуются снова и снова, Django поставляется с несколькими полезными функциями, которые должны сделать работу с Unicode и байтовыми строками немного легче.

source: Conversion functions
ru: Функции преобразования

source: The ``django.utils.encoding`` module contains a few functions that are handy for converting back and forth between Unicode and bytestrings.
ru: Модуль ``django.utils.encoding`` содержит несколько функций, которые удобны для прямого и обратного преобразования между строками Unicode и байтовыми строками

source: ``smart_text(s, encoding='utf-8', strings_only=False, errors='strict')`` converts its input to a Unicode string. The ``encoding`` parameter specifies the input encoding. (For example, Django uses this internally when processing form input data, which might not be UTF-8 encoded.) The ``strings_only`` parameter, if set to True, will result in Python numbers, booleans and ``None`` not being converted to a string (they keep their original types). The ``errors`` parameter takes any of the values that are accepted by Python's ``unicode()`` function for its error handling.
ru: ``smart_text(s, encoding='utf-8', strings_only=False, errors='strict')`` преобразовывает входную строку в Unicode. Параметр ``encoding`` устанавливает входную кодировку. (Так Django использует это внутри при обработке форм входных данных, которые могут быть закодированы не в UTF-8.) Если параметр ``strings_only`` установлен в True, то результат для чисел, булевых переменных и ``None`` не будет преобразован в строку (они сохранят свои начальные типы). Параметр ``errors`` может принимать любые значение, которые передаются в Python функцию ``unicode()`` для обработки ею ошибок.

source: If you pass ``smart_text()`` an object that has a ``__unicode__`` method, it will use that method to do the conversion.
ru: Если вы передаете в ``smart_text()`` объект, который имеет метод ``__unicode__``, то этот метод будет использован для преобразования.

source: ``force_text(s, encoding='utf-8', strings_only=False, errors='strict')`` is identical to ``smart_text()`` in almost all cases. The difference is when the first argument is a :ref:`lazy translation <lazy-translations>` instance. While ``smart_text()`` preserves lazy translations, ``force_text()`` forces those objects to a Unicode string (causing the translation to occur). Normally, you'll want to use ``smart_text()``. However, ``force_text()`` is useful in template tags and filters that absolutely *must* have a string to work with, not just something that can be converted to a string.
ru: ``force_text(s, encoding='utf-8', strings_only=False, errors='strict')`` идентична ``smart_text()`` в большинстве случаев. Отличие лишь в том случае, когда первый аргумент является инстансом :ref:`ленивого перевода <lazy-translations>`. В то время как ``smart_text()`` хранит ленивые переводы, ``force_text()`` форсирует преобразование этих объектов в строки Unicode (в результате чего происходит перевод). Обычно вам будет нужно использовать ``smart_text()``. Но тем не менее ``force_text()`` полезна в шаблонных тегах и фильтрах, которые должны обязательно работать со строками, а не только с тем, что может быть преобразовано в строку.

source: ``smart_bytes(s, encoding='utf-8', strings_only=False, errors='strict')`` is essentially the opposite of ``smart_text()``. It forces the first argument to a bytestring. The ``strings_only`` parameter has the same behavior as for ``smart_text()`` and ``force_text()``. This is slightly different semantics from Python's builtin ``str()`` function, but the difference is needed in a few places within Django's internals.
ru: ``smart_bytes(s, encoding='utf-8', strings_only=False, errors='strict')`` - это по существу противоположность ``smart_text()``. Она преобразовывает первый аргумент в байтовую строку. Параметр ``strings_only`` имеет такое же поведение, как в ``smart_text()`` и ``force_text()``. Есть небольшое отличие от семантики встроенной функции Python ``str()``, но это отличие обусловлено несколькими внутренними особенностями Django.

source: Normally, you'll only need to use ``smart_text()``. Call it as early as possible on any input data that might be either Unicode or a bytestring, and from then on, you can treat the result as always being Unicode.
ru: Как правило, вам будет нужно использовать только ``smart_text()``. Вызывайте это как можно раньше для любых входных данных, которые могут быть Unicode или байтовой строкой, и после этого вы можете работать с результатом, который всегда будет Unicode.

source: URI and IRI handling
ru: Обработка URI и IRI

source: Web frameworks have to deal with URLs (which are a type of IRI_). One requirement of URLs is that they are encoded using only ASCII characters. However, in an international environment, you might need to construct a URL from an IRI_ -- very loosely speaking, a URI_ that can contain Unicode characters. Quoting and converting an IRI to URI can be a little tricky, so Django provides some assistance.
ru: Веб фреймворки должны взаимодействовать с URL'ами (которые являются разновидностью IRI_). Одно из требований URL'ов - это то, что они должны быть закодированы с использованием только ASCII символов. Тем не менее, в международном окружении, вы можете захотеть обрабатывать URL как IRI_ -- если говорить очень просто, то URI_ могут содержать Unicode символы.Экранирование и преобразование IRI в URI может быть непростым, поэтому Django представляет некоторую помощь для этого.

source: The function :func:`django.utils.encoding.iri_to_uri()` implements the conversion from IRI to URI as required by the specification (:rfc:`3987#section-3.1`).
ru: Функция :func:`django.utils.encoding.iri_to_uri()` реализует преобразование из IRI в URI, как этого требует спецификация (:rfc:`3987#section-3.1`).

source: The functions :func:`django.utils.http.urlquote()` and :func:`django.utils.http.urlquote_plus()` are versions of Python's standard ``urllib.quote()`` and ``urllib.quote_plus()`` that work with non-ASCII characters. (The data is converted to UTF-8 prior to encoding.)
ru: Функции :func:`django.utils.http.urlquote()` и :func:`django.utils.http.urlquote_plus()` - это версии Python стандартных ``urllib.quote()`` и ``urllib.quote_plus()``, которые работают с не-ASCII символами. (Данные преобразуются в UTF-8 перед кодированием.)

source: These two groups of functions have slightly different purposes, and it's important to keep them straight. Normally, you would use ``urlquote()`` on the individual portions of the IRI or URI path so that any reserved characters such as '&' or '%' are correctly encoded. Then, you apply ``iri_to_uri()`` to the full IRI and it converts any non-ASCII characters to the correct encoded values.
ru: Эти две группы функций имеют небольшие различия в назначении, и понимание этого важно для их правильного применения. Как правило вы должны использовать ``urlquote()`` для отдельных частей IRI или URI путей, в результате любые зарезервированные символы как '&' и '%' будут кодироваться корректно. Затем вы применяете ``iri_to_uri()`` для полного IRI и это преобразует любые не-ASCII символы в правильно закодированные значения.

source: Technically, it isn't correct to say that ``iri_to_uri()`` implements the full algorithm in the IRI specification. It doesn't (yet) perform the international domain name encoding portion of the algorithm.
ru: Формально, не корректно говорить, что функция ``iri_to_uri()`` реализует полный алгоритм из спецификации IRI. Она (пока) не реализует часть алгоритма для кодирования международных доменных имен.

source: The ``iri_to_uri()`` function will not change ASCII characters that are otherwise permitted in a URL. So, for example, the character '%' is not further encoded when passed to ``iri_to_uri()``. This means you can pass a full URL to this function and it will not mess up the query string or anything like that.
ru: Функция ``iri_to_uri()`` не будет изменять ASCII символы, которые в противном случае допускаются в URL. Так, например, символ '%' дополнительно не кодируется когда передается в ``iri_to_uri()``. Это значит вы можете передавать полный URL в эту функцию и это не испортит строку запроса или что-либо подобное ей.

source: An example might clarify things here::
ru: Пример поможет прояснить это::

source: If you look carefully, you can see that the portion that was generated by ``urlquote()`` in the second example was not double-quoted when passed to ``iri_to_uri()``. This is a very important and useful feature. It means that you can construct your IRI without worrying about whether it contains non-ASCII characters and then, right at the end, call ``iri_to_uri()`` on the result.
ru: Если вы посмотрите внимательно, вы сможете увидеть что часть, которая генерируется при помощи ``urlquote()`` во втором примере не обрабатывается дважды когда передается в ``iri_to_uri()``. Это очень важная и полезная особенность. Это означает, что вы можете работать с вашей IRI без беспокойства будeт ли IRI содержать не-ASCII символы и затем правильно ли все в конце, при вызове ``iri_to_uri()``.

source: Similarly, Django provides :func:`django.utils.encoding.uri_to_iri()` which implements the conversion from URI to IRI as per :rfc:`3987#section-3.2`. It decodes all percent-encodings except those that don't represent a valid UTF-8 sequence.
ru: Также Django предоставляет функцию :func:`django.utils.encoding.uri_to_iri()`, которая конвертирует URI в IRI, как этого требует спецификация :rfc:`3987#section-3.2`. Она пытается декодировать возможные UTF-8 символы.

source: An example to demonstrate::
ru: Примеры::

source: In the first example, the UTF-8 characters and reserved characters are unquoted. In the second, the percent-encoding remains unchanged because it lies outside the valid UTF-8 range.
ru: В первом примере UTF-8 символы и спецсимволы декодируются. Во втором примере '%' остался без изменений т.к. не представляет валидный код UTF-8 символа.

source: Both ``iri_to_uri()`` and ``uri_to_iri()`` functions are idempotent, which means the following is always true::
ru: Функции ``iri_to_uri()`` и ``uri_to_iri()`` также идемпотентны, это значит что следующее всегда истинно::

source: So you can safely call it multiple times on the same URI/IRI without risking double-quoting problems.
ru: Поэтому вы можете безопасно вызывать функцию множество раз для одного и того же IRI/URI без риска получить проблему двойного экранирования.

source: Models
ru: Модели

source: You can pass in bytestrings when creating a model or populating a field, and Django will convert it to Unicode when it needs to.
ru: Вы можете передавать данные в байтовых строках, когда создается модель или заполняется поле, и Django будет преобразовывать данные в Unicode когда это будет необходимо.

source: Choosing between ``__str__()`` and ``__unicode__()``
ru: Выбор между ``__str__()`` и ``__unicode__()``

source: If you are on Python 3, you can skip this section because you'll always create ``__str__()`` rather than ``__unicode__()``. If you'd like compatibility with Python 2, you can decorate your model class with :func:`~django.utils.encoding.python_2_unicode_compatible`.
ru: Если вы используете Python 3, можете пропустить эту секцию, потому что вы всегда будете создавать ``__str__()`` вместо ``__unicode__()``. Если вы хотите обеспечить совместимость с Python 2, вы можете декорировать ваш класс модели при помощи :func:`~django.utils.encoding.python_2_unicode_compatible`.

source: One consequence of using Unicode by default is that you have to take some care when printing data from the model.
ru: Одно из последствий использования Unicode по умолчанию - это то что вы должны проявлять некоторую заботу при распечатке данных из модели.

source: In particular, rather than giving your model a ``__str__()`` method, we recommended you implement a ``__unicode__()`` method. In the ``__unicode__()`` method, you can quite safely return the values of all your fields without having to worry about whether they fit into a bytestring or not. (The way Python works, the result of ``__str__()`` is *always* a bytestring, even if you accidentally try to return a Unicode object).
ru: В частности, вместо получения ``__str__()`` метода вашей модели, мы рекомендовали вам реализовать ``__unicode__()`` метод. В ``__unicode__()`` методе, вы можете довольно безопасно вернуть значения всех ваших полей без необходимости беспокойства о том будут ли они байтовыми строками или нет. (Путь Python работает, результат ``__str__()`` *всегда* байтовая строка, даже если вы нечаянно попробуете вернуть Unicode объект).
