Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/ref/urlresolvers.po
Languages: ru

source: If you need to use something similar to the :ttag:`url` template tag in your code, Django provides the following function:
ru: Если вам нужно вернуть абсолютную ссылку, соответствующую указанному представлению, как это делает :ttag:`url`, Django предоставляет следующую функцию:

source: you can use any of the following to reverse the URL::
ru: вы можете получить URL одним из следующих способов::

source: If the URL accepts arguments, you may pass them in ``args``. For example::
ru: Если URL принимает аргументы, вы можете их передать аргументом ``args``. Например::

source: You can also pass ``kwargs`` instead of ``args``. For example::
ru: Вы можете использовать ``kwargs`` (словарь) вместо ``args`` (отдельных аргументов). Например:

source: ``args`` and ``kwargs`` cannot be passed to ``reverse()`` at the same time.
ru: ``args`` и ``kwargs`` не могут быть переданы функции ``reverse()`` вместе, они используются по отдельности.

source: The ``reverse()`` function can reverse a large variety of regular expression patterns for URLs, but not every possible one. The main restriction at the moment is that the pattern cannot contain alternative choices using the vertical bar (``"|"``) character. You can quite happily use such patterns for matching against incoming URLs and sending them off to views, but you cannot reverse such patterns.
ru: Функция ``reverse()`` может предоставлять достаточно большое количество шаблонов регулярных выражений, но не все из возможных. На данный момент шаблон не предоставляет возможности использования символа вертикальной черты (``"|"``) для указания альтернативного выбора. Вы можете использовать такой шаблон для обработки входящего URL-а и получения представления, но вы не можете получить URL для такого шаблона с помощью ``reverse()``.

source: The ``current_app`` argument allows you to provide a hint to the resolver indicating the application to which the currently executing view belongs. This ``current_app`` argument is used as a hint to resolve application namespaces into URLs on specific application instances, according to the :ref:`namespaced URL resolution strategy <topics-http-reversing-url-namespaces>`.
ru: Аргумент ``current_app`` позволит вам получить полный путь к текущей странице. Он возвращает текущий экземпляр приложения из указанного :ref:`пространства имён <topics-http-reversing-url-namespaces>`.

source: The string returned by ``reverse()`` is already :ref:`urlquoted <uri-and-iri-handling>`. For example::
ru: Строка, которую возвращает ``reverse()``, уже кодирована. Чтобы узнать об этом подробнее смотрите :ref:`urlquoted <uri-and-iri-handling>`. Пример::

source: Applying further encoding (such as :meth:`~django.utils.http.urlquote` or ``urllib.quote``) to the output of ``reverse()`` may produce undesirable results.
ru: Кроме того, нужно иметь ввиду, что применение кодирования символов (такое как :meth:`~django.utils.http.urlquote` или ``urllib.quote``) при выводе с ``reverse()`` может привести к нежелательным последствиям.

source: A lazily evaluated version of `reverse()`_.
ru: lazy стоит расценивать как "ленивую" версию `reverse()`_.

source: It is useful for when you need to use a URL reversal before your project's URLConf is loaded. Some common cases where this function is necessary are:
ru: Эта функция может быть полезна в случае, если вам нужно вернуть URL-адрес прежде, чем ваши настройки URLConf будут загружены. Перечислим несколько случаев, когда эта функция бывает необходима:

source: providing a reversed URL as the ``url`` attribute of a generic class-based view.
ru: возврат URL как ``url`` атрибута для представления базовых классов.

source: providing a reversed URL to a decorator (such as the ``login_url`` argument for the :func:`django.contrib.auth.decorators.permission_required` decorator).
ru: возврат URL-а как декоратора (такого как ``login_url`` для :func:`django.contrib.auth.decorators.permission_required`).

source: providing a reversed URL as a default value for a parameter in a function's signature.
ru: возврат URL-адреса как переменной по умолчанию для параметров функции.

source: The ``resolve()`` function can be used for resolving URL paths to the corresponding view functions. It has the following signature:
ru: Функция ``resolve()`` может быть использована для получения URL-адреса из соответствующего представления. Она имеет следующий синтаксис:

source: The view function that would be used to serve the URL
ru: Функция представления, которая будет использована для передачи URL.

source: The arguments that would be passed to the view function, as parsed from the URL.
ru: Аргументы, которые будут переданы в функцию представления, as parsed from the URL.

source: The keyword arguments that would be passed to the view function, as parsed from the URL.
ru: именованные аргументы, которые будут переданы в функцию представления, as parsed from the URL.

source: The name of the URL pattern that matches the URL.
ru: Название URL-шаблона для сопоставления URL-адресов.

source: The application namespace for the URL pattern that matches the URL.
ru: Название приложения из пространства имён для сопоставления URL-адресов.

source: The list of individual namespace components in the full application namespace for the URL pattern that matches the URL. For example, if the ``app_name`` is ``'foo:bar'``, then ``app_names`` will be ``['foo', 'bar']``.
ru: Список пространств имен, из которых состоит полное пространство имен приложения для URL-шаблона, который удовлетворяет URL-у. Для ``foo:bar`` это будет ``['foo', 'bar']``.

source: The instance namespace for the URL pattern that matches the URL.
ru: Название выбранного пространства имён для сопоставления URL-адресов.

source: The list of individual namespace components in the full instance namespace for the URL pattern that matches the URL. i.e., if the namespace is ``foo:bar``, then namespaces will be ``['foo', 'bar']``.
ru: Список пространств имен. Для ``foo:bar`` это будет ``['foo', 'bar']``.

source: The name of the view that matches the URL, including the namespace if there is one.
ru: Название представления, которое обрабатывает URL, включая пространства имен, если таковы используются.

source: A :class:`ResolverMatch` object can then be interrogated to provide information about the URL pattern that matches a URL::
ru: С помощью объекта :class:`ResolverMatch` можно впоследствии запросить информацию о соответствии между URL-адресом и используемом имени представления (т.е. какому URL-адресу какой шаблон принадлежит)::

source: A :class:`ResolverMatch` object can also be assigned to a triple::
ru: Также объекту :class:`ResolverMatch` можно передать три параметра::
