Repository: Alerion/django_documentation
Catalog: locale/*/LC_MESSAGES/ref/validators.po
Languages: ru

source: Validators
ru: Валидаторы

source: Writing validators
ru: Создание валидаторов

source: A validator is a callable that takes a value and raises a :exc:`~django.core.exceptions.ValidationError` if it doesn't meet some criteria. Validators can be useful for re-using validation logic between different types of fields.
ru: Валидатор — это вызываемый объект (callable), который принимает значение и вызывает исключение :exc:`~django.core.exceptions.ValidationError`, если значение не соответствует неким критериям. Валидаторы могут быть полезны когда надо использовать одинаковую логику проверки для разных типов полей.

source: For example, here's a validator that only allows even numbers::
ru: Например, здесь показан валидатор, который принимает только чётные числа::

source: You can add this to a model field via the field's :attr:`~django.db.models.Field.validators` argument::
ru: Вы можете добавить его к полю модели с помощью аргумента :attr:`~django.db.models.Field.validators`::

source: Because values are converted to Python before validators are run, you can even use the same validator with forms::
ru: Так как значения преобразуются в типы языка Python до запуска валидатора, вы можете использовать тот же валидатор и для форм::

source: You can also use a class with a ``__call__()`` method for more complex or configurable validators. :class:`RegexValidator`, for example, uses this technique. If a class-based validator is used in the :attr:`~django.db.models.Field.validators` model field option, you should make sure it is :ref:`serializable by the migration framework <migration-serializing>` by adding :ref:`deconstruct() <custom-deconstruct-method>` and ``__eq__()`` methods.
ru: Вы можете использовать класс с методом ``__call__()`` для сложных или настраиваемых валидаторов. :class:`RegexValidator`, например, использует эту технику. Если валидатор-класс используется в параметре :attr:`~django.db.models.Field.validators` поля модели, он должен быть :ref:`сериализируемым для работы миграций <migration-serializing>`. Для этого добавьте методы :ref:`deconstruct() <custom-deconstruct-method>` и ``__eq__()``.

source: How validators are run
ru: Как валидаторы запускаются

source: See the :doc:`form validation </ref/forms/validation>` for more information on how validators are run in forms, and :ref:`Validating objects <validating-objects>` for how they're run in models. Note that validators will not be run automatically when you save a model, but if you are using a :class:`~django.forms.ModelForm`, it will run your validators on any fields that are included in your form. See the :doc:`ModelForm documentation </topics/forms/modelforms>` for information on how model validation interacts with forms.
ru: Обратитесь к документации по :doc:`проверке форм </ref/forms/validation>` для получения подробностей о работе валидаторов в формах и к документации по :ref:`проверке объектов <validating-objects>`, чтобы узнать как валидаторы запускаются для моделей. Следует отметить, что валидаторы не запускаются автоматически в случае когда вы сохраняете модель. Но если вы используете класс :class:`~django.forms.ModelForm`, то он запустит ваши валидаторы для всех полей формы. Обратитесь к документации на :doc:`модельные формы </topics/forms/modelforms>` для получения информации о том, как валидаторы модели взаимодействуют с формами.

source: Built-in validators
ru: Встроенные валидаторы

source: The :mod:`django.core.validators` module contains a collection of callable validators for use with model and form fields. They're used internally but are available for use with your own fields, too. They can be used in addition to, or in lieu of custom ``field.clean()`` methods.
ru: Модуль :mod:`django.core.validators` содержит коллекцию валидаторов, которые можно использовать как с моделями, так и с полями формы. Они используются Django, но также доступны для применения в ваших полях. Их можно использовать в дополнение к или вместо метода ``field.clean()``.

source: If not ``None``, overrides :attr:`regex`. Can be a regular expression string or a pre-compiled regular expression.
ru: Если не ``None``, переопределяет :attr:`regex`. Может быть строка с или уже скомпилированный объект регулярного выражения.

source: If not ``None``, overrides :attr:`.message`.
ru: Если не ``None``, переопределяет :attr:`.message`.

source: If not ``None``, overrides :attr:`code`.
ru: Если не ``None``, переопределяет :attr:`code`.

source: If not ``None``, overrides :attr:`inverse_match`.
ru: Если не ``None``, переопределяет :attr:`inverse_match`.

source: If not ``None``, overrides :attr:`flags`. In that case, :attr:`regex` must be a regular expression string, or :exc:`TypeError` is raised.
ru: Если не ``None``, переопределяет :attr:`flags`. В этом случае :attr:`regex` должен быть строкой с регулярным выражением, иначе будет вызвано исключение :exc:`TypeError`.

source: The error message used by :exc:`~django.core.exceptions.ValidationError` if validation fails. Defaults to ``"Enter a valid value"``.
ru: Сообщение об ошибке, используемое исключением :exc:`~django.core.exceptions.ValidationError`, если проверка не прошла. По умолчанию, ``"Enter a valid value"``.

source: The error code used by :exc:`~django.core.exceptions.ValidationError` if validation fails. Defaults to ``"invalid"``.
ru: Код ошибки, используемый исключением :exc:`~django.core.exceptions.ValidationError`, если проверка не прошла. По умолчанию ``"invalid"``.

source: The match mode for :attr:`regex`. Defaults to ``False``.
ru: Режим совпадения для :attr:`regex`. По умолчанию ``False``.

source: The flags used when compiling the regular expression string :attr:`regex`. If :attr:`regex` is a pre-compiled regular expression, and :attr:`flags` is overridden, :exc:`TypeError` is raised. Defaults to ``0``.
ru: Флаги, используемые при компиляции строки регулярного выражения :attr:`regex`. Если :attr:`regex` уже скомпилированное выражение и :attr:`flags` переопределен, будет вызвано исключение :exc:`TypeError`. По умолчанию `0`.

source: If not ``None``, overrides :attr:`whitelist`.
ru: Если не ``None``, переопределяет :attr:`whitelist`.

source: The error message used by :exc:`~django.core.exceptions.ValidationError` if validation fails. Defaults to ``"Enter a valid email address"``.
ru: Сообщение об ошибке, используемое исключением :exc:`~django.core.exceptions.ValidationError`, если проверка не прошла. По умолчанию, ``"Enter a valid email address"``.

source: Whitelist of email domains to allow. By default, a regular expression (the ``domain_regex`` attribute) is used to validate whatever appears after the @ sign. However, if that string appears in the whitelist, this validation is bypassed. If not provided, the default whitelist is ``['localhost']``. Other domains that don't contain a dot won't pass validation, so you'd need to whitelist them as necessary.
ru: Описывает белый список доменов электронной почты. По умолчанию, для проверки написанного после знака @ используется регулярное выражение (атрибут ``domain_regex``). Однако, если данная строка указана в белом списке, то такая валидация не выполняется. Если список не предоставлен, то белый список содержит ``['localhost']``. Другие домены, что не содержат точку, не пройдут проверку, таким образом вам потребуется вносить их в белый список по необходимости.

source: A :class:`RegexValidator` that ensures a value looks like a URL, and raises an error code of ``'invalid'`` if it doesn't.
ru: Экземпляр класса :class:`RegexValidator`, который проверяет, что значение выглядит как URL, иначе вызывает ошибку с кодом ``'invalid'``.

source: Loopback addresses and reserved IP spaces are considered valid. Literal IPv6 addresses (:rfc:`2732`) and unicode domains are both supported.
ru: Кольцевые адреса и зарезервированные пространства адресов IP. Поддерживаются оба варианта: адрес IPv6 в виде текста (:rfc:`2732`) и имена доменов юникоде.

source: In addition to the optional arguments of its parent :class:`RegexValidator` class, ``URLValidator`` accepts an extra optional attribute:
ru: В дополнение к необязательным аргументам родительского класса :class:`RegexValidator`, ``URLValidator`` принимает дополнительный необязательный атрибут:

source: URL/URI scheme list to validate against. If not provided, the default list is ``['http', 'https', 'ftp', 'ftps']``. As a reference, the IANA website provides a full list of `valid URI schemes`_.
ru: Список разрешенных для URL/URI протоколов. По умолчанию ``['http', 'https', 'ftp', 'ftps']``. Сайт IANA Web предоставляет полный список `валидных протоколов URI <https://www.iana.org/assignments/uri-schemes/uri-schemes.xhtml>`_.

source: An :class:`EmailValidator` instance without any customizations.
ru: Экземпляр :class:`EmailValidator` без каких-либо настроек.

source: A :class:`RegexValidator` instance that ensures a value consists of only letters, numbers, underscores or hyphens.
ru: Экземпляр класса :class:`RegexValidator`, который проверяет, что значение содержит только буквы, числа, символы подчёркивания или тире.

source: A :class:`RegexValidator` instance that ensures a value consists of only Unicode letters, numbers, underscores, or hyphens.
ru: Экземпляр класса :class:`RegexValidator`, который проверяет, что значение содержит только Unicode буквы, числа, символы подчёркивания или тире.

source: A :class:`RegexValidator` instance that ensures a value looks like an IPv4 address.
ru: Экземпляр класса :class:`RegexValidator`, который проверяет, что значение выглядит как IPv4 адрес.

source: Uses ``django.utils.ipv6`` to check the validity of an IPv6 address.
ru: Использует :mod:`django.utils.ipv6` для проверки соответствия значения IPv6 адресу.

source: Uses both ``validate_ipv4_address`` and ``validate_ipv6_address`` to ensure a value is either a valid IPv4 or IPv6 address.
ru: Использует оба валидатора (``validate_ipv4_address`` и ``validate_ipv6_address``) для проверки, что значение соответствует IPv4 или IPv6 адресу.

source: A :class:`RegexValidator` instance that ensures a value is a comma-separated list of integers.
ru: Экземпляр класса :class:`RegexValidator`, который проверяет, что значение является списком целых чисел, разделённых запятыми.

source: Raises a :exc:`~django.core.exceptions.ValidationError` with a code of ``'max_value'`` if ``value`` is greater than ``max_value``.
ru: Вызывает исключение :exc:`~django.core.exceptions.ValidationError` с кодом ``'max_value'``, если ``value`` больше, чем ``max_value``.

source: Raises a :exc:`~django.core.exceptions.ValidationError` with a code of ``'min_value'`` if ``value`` is less than ``min_value``.
ru: Вызывает исключение :exc:`~django.core.exceptions.ValidationError` с кодом ``'min_value'``, если ``value`` меньше, чем ``min_value``.

source: Raises a :exc:`~django.core.exceptions.ValidationError` with a code of ``'max_length'`` if the length of ``value`` is greater than ``max_length``.
ru: Вызывает исключение :exc:`~django.core.exceptions.ValidationError` с кодом ``'max_length'``, если длина ``value`` больше, чем ``max_length``.

source: Raises a :exc:`~django.core.exceptions.ValidationError` with a code of ``'min_length'`` if the length of ``value`` is less than ``min_length``.
ru: Вызывает исключение :exc:`~django.core.exceptions.ValidationError` с кодом ``'min_length'``, если длина ``value`` меньше, чем ``min_length``.

source: Raises :exc:`~django.core.exceptions.ValidationError` with the following codes:
ru: Вызывает исключение :exc:`~django.core.exceptions.ValidationError` со следующими кодами ошибок:

source: ``'max_digits'`` if the number of digits is larger than ``max_digits``.
ru: ``'max_digits'``, если количество цифр больше ``max_digits``.

source: ``'max_decimal_places'`` if the number of decimals is larger than ``decimal_places``.
ru: ``'max_decimal_places'``, если количество знаков после запятой больше ``decimal_places``.

source: ``'max_whole_digits'`` if the number of whole digits is larger than the difference between ``max_digits`` and ``decimal_places``.
ru: ``'max_whole_digits'``, если количество цифр в целой части больше, чем разница между ``max_digits`` и ``decimal_places``.
